[
  [
    "Convolutional Neural Networks (CNNs) explained",
    "CNNs for deep learning Included in Machine Leaning / Deep Learning for Programmers Playlist: ..."
  ],
  [
    "Convolutional Neural Networks | CNN | Kernel | Stride | Padding | Pooling | Flatten | Formula",
    "What is Convolutional Neural Networks? What is the actual building blocks like Kernel, Stride, Padding, Pooling, Flatten?"
  ],
  [
    "What are Convolutional Neural Networks (CNNs)?",
    "Learn more about CNNs → http://ibm.biz/cnn-guide Learn more about Neural Networks → http://ibm.biz/neural-networks-guide ..."
  ],
  [
    "Convolutional Neural Networks (Course 4 of the Deep Learning Specialization)",
    ""
  ],
  [
    "Simple explanation of convolutional neural network | Deep Learning Tutorial 23 (Tensorflow &amp; Python)",
    "A very simple explanation of convolutional neural network or CNN or ConvNet such that even a high school student can ..."
  ],
  [
    "HINDI VIDEO: What Is Convolutional Neural Network? Analytics India Guru Explains",
    "Widely used in techniques like signal processing and image classification techniques, CNN usually dominates computer vision ..."
  ],
  [
    "Tutorial 21- What is Convolution operation in CNN?",
    "Hello All here is a video which provides the detailed explanation about the convolution operation in the CNN You can buy my ..."
  ],
  [
    "Convolutional Neural Network",
    ""
  ],
  [
    "Neural Networks Part 8: Image Classification with Convolutional Neural Networks (CNNs)",
    "One of the coolest things that Neural Networks can do is classify images, and this is often done with a type of Neural Network ..."
  ],
  [
    "Convolutional Neural Networks Explained (CNN Visualized)",
    "This video was made possible by Brilliant. Be one of the first 200 people to sign up with this link and get 20% off your premium ..."
  ],
  [
    "MIT 6.S191 (2020): Convolutional Neural Networks",
    "MIT Introduction to Deep Learning 6.S191: Lecture 3 Convolutional Neural Networks for Computer Vision Lecturer: Alexander ..."
  ],
  [
    "CNN: Convolutional Neural Networks Explained - Computerphile",
    "Years of work down the drain, the convolutional neural network is a step change in image classification accuracy. Image Analyst ..."
  ],
  [
    "Lecture Collection | Convolutional Neural Networks for Visual Recognition (Spring 2017)",
    "Computer Vision has become ubiquitous in our society, with applications in search, image understanding, apps, mapping, ..."
  ],
  [
    "What is a convolutional neural network (CNN)?",
    "A convolutional neural network is a type of neural network that is most often applied to image processing problems - but you can ..."
  ],
  [
    "CNN - Convolution Neural Network - lecture 52/ machine learning",
    "Convolution neural network."
  ],
  [
    "But what is a convolution?",
    "Discrete convolutions, from probability, to image processing and FFTs. Help fund future projects: ..."
  ],
  [
    "Convolutional Neural Network (CNN) | Convolutional Neural Networks With TensorFlow | Edureka",
    "The code referenced in this video is from https://YouTube.com/Sentdex and ..."
  ],
  [
    "Convolution Neural Networks - EXPLAINED",
    "In this video, we talk about Convolutional Neural Networks. Give the video a thumbs up and hit that SUBSCRIBE button for more ..."
  ],
  [
    "Convolutional Neural Network Tutorial (CNN) | How CNN Works | Deep Learning Tutorial | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Lecture 5 | Convolutional Neural Networks",
    "In Lecture 5 we move from fully-connected neural networks to convolutional neural networks. We discuss some of the key ..."
  ],
  [
    "Convolutional Neural Network in Hindi | Deep Learning",
    "In this video I have discussed - What is Convolutional Neural Network CNN - convolution neural network image classification ..."
  ],
  [
    "Tutorial 22- Padding in Convolutional Neural Network",
    "Hello All here is a video which provides the detailed explanation of Padding in Convolutional Neural Network You can buy my ..."
  ],
  [
    "Convolutional Neural Network  Explained | CNN | Deep Learning",
    "Learn basics of Convolutional Neural network and what are the types of Layers in CNN. Also Learn What is a Convolutional ..."
  ],
  [
    "A friendly introduction to Convolutional Neural Networks and Image Recognition",
    "Announcement: New Book by Luis Serrano! Grokking Machine Learning. bit.ly/grokkingML 40% discount code: serranoyt A ..."
  ],
  [
    "Recurrent Neural Network (RNN) Part-1 Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "C4W1L08 Simple Convolutional Network Example",
    "Take the Deep Learning Specialization: http://bit.ly/2vyXdI6 Check out all our courses: https://www.deeplearning.ai Subscribe to ..."
  ],
  [
    "How Convolutional Neural Networks work",
    "Part of the End-to-End Machine Learning School Course 193, How Neural Networks Work at https://e2eml.school/193 A gentle ..."
  ],
  [
    "Convolutional Neural Network Project – Fashion MNIST Classification in Hindi | Deep Learning Project",
    ""
  ],
  [
    "Convolutional Neural Network",
    ""
  ],
  [
    "PyTorch Tutorial 14 - Convolutional Neural Network (CNN)",
    "New Tutorial series about Deep Learning with PyTorch! ⭐ Check out Tabnine, the FREE AI-powered code completion tool I use to ..."
  ],
  [
    "Day 15 Machine Learning + Neural Network - CNN",
    "Youtube LIVE Sessions Details https://youtu.be/BmTmsHXUlrM Get all the Live session material and much more ..."
  ],
  [
    "How convolutional neural networks work, in depth",
    "Part of the End-to-End Machine Learning School Course 193, How Neural Networks Work at https://e2eml.school/193 slides: ..."
  ],
  [
    "MIT 6.S094: Convolutional Neural Networks for End-to-End Learning of the Driving Task",
    "This is lecture 3 of course 6.S094: Deep Learning for Self-Driving Cars taught in Winter 2017. This lecture introduces computer ..."
  ],
  [
    "Convolution Neural Networks(CNN) Full Course in URDU / Hindi",
    ""
  ],
  [
    "Introducing convolutional neural networks (ML Zero to Hero - Part 3)",
    "In part three of Machine Learning Zero to Hero, AI Advocate Laurence Moroney (lmoroney@) discusses convolutional neural ..."
  ],
  [
    "Convolutional Neural Networks (CNNs) in 5 Minutes | ConvNets Explained",
    "Artificial Intelligence terms explained in a minute for everyone! This week's term is Convolutional Neural Networks, or CNNs."
  ],
  [
    "Convolutional Neural Networks: CNN Basics",
    ""
  ],
  [
    "ml5.js: What is a Convolutional Neural Network Part 1 - Filters",
    "This video covers the architecture of a Convolutional Neural Network, focusing on the concept of \"filters\". Code: ..."
  ],
  [
    "Convolutional Neural Networks (CNN / Convnets)",
    "CNN #ConvolutionalNeuralNetwork #MachineLearning #DeepLearning #DataScience We understand the working and the ..."
  ],
  [
    "A friendly introduction to Convolutional Neural Networks (CNN) &amp; Image Recognition explained| NerdML",
    "In this video, we explain the concept of Convolutional Neural Networks, how they're used, and how they work on a technical level."
  ],
  [
    "Convolutional Neural Networks - Fun and Easy Machine Learning",
    "FREE YOLO GIFT - http://augmentedstartups.info/yolofreegiftsp ▻KERAS Course ..."
  ],
  [
    "2D Convolution Neural Network Animation",
    "2DCNN #ConvolutionNeuralNetwork #Deep Learning This video shows the complete architecture of 2d cnn through animation."
  ],
  [
    "ANN vs CNN vs RNN | Difference Between ANN CNN and RNN | Types of Neural Networks Explained",
    "In this video, I'll provide you with a basic introduction to the types of neural network and explain the difference between ANN CNN ..."
  ],
  [
    "But what is a neural network? | Chapter 1, Deep learning",
    "What are the neurons, why are there layers, and what is the math underlying it? Help fund future projects: ..."
  ],
  [
    "Convolutional Neural Network from Scratch | Mathematics &amp; Python Code",
    "In this video we'll create a Convolutional Neural Network (or CNN), from scratch in Python. We'll go fully through the mathematics ..."
  ],
  [
    "Deep Learning: Understanding Convolutional Neural Networks",
    "This video is a part of a free online course that provides introduction to practical deep learning methods using MATLAB."
  ],
  [
    "Convolutional Neural Network Tutorial",
    "Learn basics of Convolutional Neural network and what are the types of Layers in CNN. Also Learn What is a Convolutional ..."
  ],
  [
    "MIT 6.S191 (2021): Convolutional Neural Networks",
    "MIT Introduction to Deep Learning 6.S191: Lecture 3 Convolutional Neural Networks for Computer Vision Lecturer: Alexander ..."
  ],
  [
    "DoMore! • Deep learning &amp; Convolutional neural networks!",
    "Development of new methods for faster and more secure prognosis is the key to a more precise treatment. We are using new tools ..."
  ],
  [
    "Introduction to Deep Learning: What Are Convolutional Neural Networks?",
    "Broadly, CNNs are a common deep learning architecture – but what exactly is a CNN? This video breaks down this sometimes ..."
  ],
  [
    "2D Convolution Neural Network Animation",
    "2DCNN #ConvolutionNeuralNetwork #Deep Learning This video shows the complete architecture of 2d cnn through animation."
  ],
  [
    "Convolutional Neural Networks (CNN) explained step by step",
    "Convolutional Neural Networks are a bit different than the standard neural networks. First of all, the layers are organized in 3 ..."
  ],
  [
    "1D Convolutional Neural Networks for Time Series Modeling - Nathan Janos, Jeff Roach",
    "PyData LA 2018 This talk describes an experimental approach to time series modeling using 1D convolution filter layers in a ..."
  ],
  [
    "Convolutional Neural Network - Introduction (  ConvNet CNN Architecture )",
    "Convolutional Neural Networks ( ConvNets / CNNs ) Convolutional Neural Networks ( ConvNets) were developed especially for ..."
  ],
  [
    "Understanding of Convolutional Neural Network (CNN) — Deep Learning",
    "Video deals with the need of CNN, How and Image undergoes through each layer of CNN and finally understanding the basic ..."
  ],
  [
    "Inside a Neural Network - Computerphile",
    "Just what is happening inside a Convolutional Neural Network? Dr Mike Pound shows us the images in between the input and the ..."
  ],
  [
    "What is Convolutional layer |Convolutional Neural Networks",
    "In this video I will talk about convolutional layer in convolutional neural networks."
  ],
  [
    "What convolutional neural networks see",
    "Short explanation of the basic properties of a convolutional neural network, and how they form representations of images."
  ],
  [
    "3D Convolutional Networks | Lecture 41 (Part 2) | Applied Deep Learning",
    "Learning Spatiotemporal Features with 3D Convolutional Networks Course Materials: ..."
  ],
  [
    "Convolutional Neural Networks - Deep Learning basics with Python, TensorFlow and Keras p.3",
    "Welcome to a tutorial where we'll be discussing Convolutional Neural Networks (Convnets and CNNs), using one to classify dogs ..."
  ],
  [
    "Convolutional Neural Network Visualization by Otavio Good",
    "Cropped and edited video-only excerpt of a great talk given by Otavio Good. Full talk titled \"A visual and intuitive understanding of ..."
  ],
  [
    "Image Processing Using Python | Convolutional Neural Network For Image Processing | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "EfficientNet Explained: Rethinking Model Scaling for Convolutional Neural Networks",
    "EfficientNet: Rethinking Model Scaling for Convolutional Neural Networks EfficientNet is a convolutional neural network ..."
  ],
  [
    "Convolutional Neural Networks | CNN | Kernel | Stride | Padding | Pooling | Explained by Python Code",
    "Explained all important building block of Convolutional Neural Networks through Keras Python code. What is the actual building ..."
  ],
  [
    "What is RGB image |Convolutional Neural Networks",
    "In this video I will talk about RGB image in convolutional neural networks."
  ],
  [
    "Lecture 1 | Introduction to Convolutional Neural Networks for Visual Recognition",
    "Lecture 1 gives an introduction to the field of computer vision, discussing its history and key challenges. We emphasize that ..."
  ],
  [
    "What are Convolutional Neural Networks? #Cnn #shorts",
    ""
  ],
  [
    "CNN and RNN in Deep Learning | Deep Learning Tutorial | Deep Learning Algorithms | Simplilearn",
    "This video on CNN and RNN in Deep Learning will help you learn two of the most popular deep learning algorithms i.e., ..."
  ],
  [
    "Demo Video &quot;CNN Explainer: Learning Convolutional Neural Networks with Interactive Visualization&quot;",
    "This is a demo video for the manuscript: \"CNN Explainer: Learning Convolutional Neural Networks with Interactive Visualization\" ..."
  ],
  [
    "Convolutional Neural Networks And Unconventional Data - Predicting The Stock Market Using Images",
    "This video is about taking numerical data, transforming it into images and modeling it with convolutional neural networks. In other ..."
  ],
  [
    "Deep Learning: Convolutional Neural Networks by Andrew Ng",
    ""
  ],
  [
    "You Only Look Once - YOLO: Object Detection using Convolutional Neural Networks",
    "This video present one of the fastest object detection algorithms for videos that can be used for real time applications."
  ],
  [
    "TensorFlow Tutorial 05 - Convolutional Neural Network (CNN)",
    "New Tutorial series about TensorFlow 2! Learn all the basics you need to get started with this deep learning framework! Part 05: ..."
  ],
  [
    "Convolutional Neural Network for non-image data",
    "Topics: Artificial Intelligence, Deep Learning and a New Perspective of using CNN! AI method DeepInsight (Matlab Pkg) ..."
  ],
  [
    "MIT 6.S191: Convolutional Neural Networks",
    "MIT Introduction to Deep Learning 6.S191: Lecture 3 Convolutional Neural Networks for Computer Vision Lecturer: Alexander ..."
  ],
  [
    "Convolutional Neural Network(CNN), Basic Understanding of Filter, Stride, Convolution| Deep Learning",
    "In this Tutorial we are going to learn the basic theory of convolution , use of kernel, feature extraction through kernel. We are also ..."
  ],
  [
    "A friendly introduction to Convolutional Neural Networks (CNN) &amp; Image Recognition explained| NerdML",
    "In this video, we explain the concept of Convolutional Neural Networks, how they're used, and how they work on a technical level."
  ],
  [
    "Filter Count - Convolutional Neural Networks",
    "Learn about filter count and the realistic methods of finding the best values My Udemy course on High-resolution GANs: ..."
  ],
  [
    "Convolutional Neural Networks (CNN) in Keras - Python",
    "In this tutorial we learn to make a convnet or Convolutional Neural Network or CNN in python using keras library with theano ..."
  ],
  [
    "Tutorial 26:Practical implementation of Convolutional Neural Networks in python using Keras in Colab",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "23. Convolutional Neural Networks",
    "Vanilla neural networks are powerful, but convolutional neural networks are truly revolutionary! Instead of constructing features by ..."
  ],
  [
    "Accelerated Computer Vision 3.6 - Region Based Convolutional Neural Networks (R-CNNs)",
    "In this video, we introduce an object detection method: Region Based Convolutional Neural Networks (R-CNNs) and explain its ..."
  ],
  [
    "Convolutional neural network | How Convolutional Neural Network (CNN) works?",
    "Blog: https://ishwargautam.blogspot.com ➥Facebook page: https://www.facebook.com/IshwarGautam239/ ➥Instagram page: ..."
  ],
  [
    "Keras with TensorFlow Course - Python Deep Learning and Neural Networks for Beginners Tutorial",
    "This course will teach you how to use Keras, a neural network API written in Python and integrated with TensorFlow. We will learn ..."
  ],
  [
    "Convolutional Neural Networks  CNNs   Complete Course",
    "Don't Forget To Subscribe, Like & Share Subscribe, Like & Share If you want me to upload some courses please tell me in the ..."
  ],
  [
    "How To Implement Image Classification Using SVM In Convolution Neural Network",
    "github: https://github.com/krishnaik06/Complete-Deep-Learning/blob/master/Image%20Classification%20Using%20SVM.ipynb ..."
  ],
  [
    "Tutorial 24: Part 2, Convolutional Neural Network in Hinidi|What is Feature Detector and Feature Map",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Session on Convolutional Neural Networks (CNN)",
    "This is the 5th session of the Deep Learning bootcamp designed for intermediate learners. In the session, the speaker talks about ..."
  ],
  [
    "CNN and RNN: In Depth Video | CNN and RNN In Deep Learning Explained | Deep Learning | Simplilearn",
    "In this CNN and RNN: In Depth video, you'll learn about what convolution neural network and recurrent neural networks are."
  ],
  [
    "2. EEG classification using deep 1D convolutional neural network",
    "In this tutorial we will learn how to use deep 1D convolutional neural network. Paper: https://www.mdpi.com/2076-3417/9/14/2870/"
  ],
  [
    "Convolutional Neural Networks",
    "Prof. Orchard describes convolution, and CNNs. 00:00 Introduction 00:47 Convolution 06:57 Joke Break 07:12 CNN Slides."
  ],
  [
    "Convolutional Neural Network Part One: Preparing the CIFAR10 Dataset",
    "In this episode, we'll examine our CIFAR 10 dataset as we start our computer vision script to classify these images using a ..."
  ],
  [
    "Convolutional Neural Network Multivariate Time Series Stock Forecast",
    "A video walking through my thought process for investigating using CNNs to make predictions of whether a stock would go up or ..."
  ],
  [
    "TensorFlow Tutorial 10-  Convolutional Neural Network | CNN | TensorFlow | Python",
    "In this video, you will learn about the convolutional neural network (CNN) in python, TensorFlow Other important playlists Python ..."
  ],
  [
    "Q2B 2019 | Quantum Convolutional Neural Networks | Iris Cong | Harvard",
    "Iris Cong, a graduate student at Harvard University, presents to attendees on Day 3 of the Practical Quantum Computing ..."
  ],
  [
    "SENets: Channel-Wise Attention in Convolutional Neural Networks",
    "This video introduces SENets, a modular approach for incorporating channel-wise attention in convolutional neural networks."
  ],
  [
    "CNN #5: Convolution over Volume | Convolutional Neural Networks",
    "Lecture 5 - Convolution over volume Complete playlist 'Convolutional Neural Networks' ..."
  ],
  [
    "Quantum Convolutional Neural Networks",
    "Speaker: Iris Cong This workshop is a part of the CMSA's program on Program on Topological Aspects of Condensed Matter, and ..."
  ],
  [
    "Introduction to Convolutional Neural Networks(CNN) With TensorFlow | Edureka | Deep Learning Live -1",
    "Edureka TensorFlow Training - https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka \"Introduction to ..."
  ],
  [
    "Facial Expression Recognition Using Convolutional Neural Networks",
    "The project aims to train a convolutional neural network model on CK+ dataset recognizing 7 emotions (6 basic emotions and ..."
  ],
  [
    "Convolutional Neural Network in Matlab",
    "In this lesson we will learn about Convolutional Neural Network (CNN), in short ConvNet. This lesson includes both theoretical ..."
  ],
  [
    "Facial Expression Recognition Using Convolutional Neural Networks",
    "The project aims to train a convolutional neural network model on CK+ dataset recognizing 7 emotions (6 basic emotions and ..."
  ],
  [
    "Quantum Convolutional Neural Networks",
    "Speaker: Iris Cong This workshop is a part of the CMSA's program on Program on Topological Aspects of Condensed Matter, and ..."
  ],
  [
    "Introduction to Convolutional Neural Networks(CNN) With TensorFlow | Edureka | Deep Learning Live -1",
    "Edureka TensorFlow Training - https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka \"Introduction to ..."
  ],
  [
    "Max Pooling in Convolutional Neural Networks",
    "This question was from the following video on Convolutional Neural Networks https://www.youtube.com/watch?v=uGYLaDp8NrQ."
  ],
  [
    "Introduction au Convolutional Neural Network CNN - FORMATION DEEP LEARNING #4",
    "Dans cette vidéo, vous allez découvrir ce qu'est un modèle de Convolutional Neural Network, réseau de neurones à convolution ..."
  ],
  [
    "[CPSC 340] Convolutional Neural Networks",
    "Slides at https://ubc-cs.github.io/cpsc340/lectures/L31.pdf?raw=1 Notebook at ..."
  ],
  [
    "Building the Network - Using Convolutional Neural Network to Identify Dogs vs Cats p. 2",
    "Here, we create a convolutional neural network using the same neural network that we used in the machine learning tutorial ..."
  ],
  [
    "Time-series analysis using convolutional neural networks",
    "A tutorial on time-series analysis using convolutional neural networks and the tensor flow framework."
  ],
  [
    "Key steps for Designing Convolutional Neural Network(CNN) for Image Classification",
    "Want to know the technology behind modern day fascinating features like face recognition, image search ❓ Learn how CNN is ..."
  ],
  [
    "Convolutional Neural Network wirh Keras &amp; TensorFlow in R | Large Scale Image Recognition",
    "Provides steps for applying Image classification & recognition using CNN with easy to follow example. CNN is considered 'gold ..."
  ],
  [
    "Convolutional Neural Network in Bangla | ConvNet in Bangla | Live Class",
    "Topic Discussed On: Convolutional Neural Network Instructor: Masrur Sobhan, Lecturer, Prime University This is a recording from ..."
  ],
  [
    "Convolutional neural network for ECG classification",
    ""
  ],
  [
    "How Convolutional Neural Networks Work | CNN&#39;s #1",
    "Convolutional Neural Networks (CNNs) use a special operation (called a convolution) to develop representations of spatially ..."
  ],
  [
    "PyTorch Tutorial: Training a Convolutional Neural Network (CNN) using PyTorch | Mahfujur Rahman",
    "In this video we implement the training procedure of a convolutional neural network (CNN) using PyTorch."
  ],
  [
    "13. Speech Recognition with Convolutional Neural Networks in Keras/TensorFlow",
    "Learn to build a Keras model for speech classification. Audio is the field that ignited industry interest in deep learning. Although ..."
  ],
  [
    "Why do Convolutional Neural Networks work so well?",
    "While deep learning has existed since the 1970s, it wasn't until 2010 that deep learning exploded in popularity, to the point that ..."
  ],
  [
    "What is Convolutional Neural Network in Data Science",
    "https://datasciencepr.com/convolutional-neural-network - A Convolutional Neural Network is a common method used with deep ..."
  ],
  [
    "Topic # 18 Convolutional Neural Network (Intro)  (Urdu | Hindi)",
    "Course: Deep Learning Hands- On Topic # 18 Convolutional Neural Network (Intro) (Urdu | Hindi) Here we begin a series of ..."
  ],
  [
    "Lecture 3.3: 2-Dimensional Convolutional Neural Networks",
    ""
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "Convolutional Neural Networks for Visual Recognition",
    "Stanford University's excellent course on Convolutional Neural Networks for Visual Recognition (CS231n) Course Website: ..."
  ],
  [
    "Lecture 3.1: Convolutional Neural Networks - Introduction",
    ""
  ],
  [
    "Limitations Shortcomings of ANNs for Image Based Tasks  - Convolutional Neural Networks ConvNets CNN",
    "CN01 Limitatinos of ANNs for Image Based Tasks and Need for Convolutional Neural Networks ( ConvNets or CNNs ) Limitations ..."
  ],
  [
    "Convolutional Neural Network  Explained with Practical Example | Deep Learning",
    "Explained in depth - Convolutional neural network (CNN) on Custom Dataset Using Tensorflow | Image Classification Using ..."
  ],
  [
    "AI Learns to Recognize Human Facial Keypoints (Convolutional Neural Networks) | Animated",
    "This is a animated video teaching AI to detect human facial key-points using machine learning model called convolutional neural ..."
  ],
  [
    "Tensorflow: Convolutional Neural Networks in Tensorflow(without Keras)",
    "This video gives a detail of dealing with CNN using Tensorflow without using keras Code: import tensorflow as tf import numpy as ..."
  ],
  [
    "Deep Convolutional Neural Networks",
    "WEBSITE: databookuw.com This lecture considers the use and implementation of deep convolutional neural networks, one of the ..."
  ],
  [
    "Lecture 10: Convolutional Neural Networks (CNN) 🔥🔥 | Deep Learning | AKTU Final Exams #deeplearning",
    "This video will talk about Convolutional Neural Networks of Deep Learning which is one of the important concept of deep learning."
  ],
  [
    "CONVOLUTIONAL NEURAL NETWORKS (CNNs) | Deep Learning with tabular data | Lecture 03",
    "Welcome to another video of the series Deep Learning with tabular data. In this video, we will explore how to use Convolutional ..."
  ],
  [
    "Convolutional Neural Networks in Deep Reinforcement Learning",
    "Gain an understanding of how convolutional neural networks can translate imagery into features making up state information for ..."
  ],
  [
    "Learn Convolutional Neural Network - CNN under 10 mins",
    "Learn Convolutional Neural Network - CNN under 10 mins Hands-On ML Book Series ..."
  ],
  [
    "Convolutional Neural Network CNN- الشبكات العصبية الملتفة",
    ""
  ],
  [
    "What is Convolutional Neural Network (CNN) | CNN Intution",
    "In this video, we will start our discussion around CNN. CNNs are one of the most popular neural network architectures. CNNs are ..."
  ],
  [
    "Understanding Parameters in CNN | Convolutional Neural Network Deep Learning | Satyajit Pattnaik",
    "Convolutional Neural Network Deep Learning | Understanding Parameters in CNN | Satyajit Pattnaik If you've been playing with ..."
  ],
  [
    "Convolutional Neural Network(CNN), Basic Understanding of Stride, Pooling, Padding| Deep Learning",
    "In this Tutorial we are going to learn the basic theory of Pooling , use of Max Pooling , Average Pooling. We are also going to learn ..."
  ],
  [
    "Understanding Convolutional Neural Networks for Text Classification",
    "Samarth Keshari presents https://arxiv.org/abs/1809.08037."
  ],
  [
    "Neural Networks 3 - Convolutional Neural Networks",
    "This video describes how Convolutional Neural Networks can be used to solve vision problems by describing their connectivity ..."
  ],
  [
    "CNN in Malayalam - Part 28 - What is Convolution?",
    "Convolution explained in Malayalam."
  ],
  [
    "Convolutional Neural Networks for processing EEG signals",
    "5-min ML Paper Challenge Presenter: https://www.linkedin.com/in/royachalaki/ On the Classification of SSVEP-Based Dry-EEG ..."
  ],
  [
    "Convolutional Neural Network",
    "Introduction to CNN by Brandon Ong, a graduate student at ECE Oklahoma State University."
  ],
  [
    "Convolutional Neural Networks | A Beginner&#39;s Guide To Convolutional Neural Networks",
    "In this video, I will explain the concept of convolution neural networks (CNN's) using many swan pictures and will make the case of ..."
  ],
  [
    "Convolutional Neural Networks in Under 10 Min",
    "Please watch: \"The Teen Innovator\" https://www.youtube.com/watch?v=//studio.yo --~-- Thanks for watching! Make sure to ..."
  ],
  [
    "[DL] Some pitfalls to avoid when designing your own convolutional neural network",
    "Deep Learning with Python - Some pitfalls to avoid when designing your own convolutional neural network."
  ],
  [
    "CNN #3: Padding | Padded Convolution | Convolutional Neural Networks",
    "Lecture 3 - Padding | Convolution Complete playlist 'Convolutional Neural Networks' ..."
  ],
  [
    "How to implement cnn convolutional neural network using keras | Keras tutorial videos",
    "Welcome to DWBIADDA's Keras tutorial for beginners, as part of this lecture we will see, How to implement cnn convolutional ..."
  ],
  [
    "[2021.05.06 Lesson11-Session2] Convolutional Neural Network",
    "Advanced MATLAB Programming for Machine Learning＞ Please find the syllabus and relevant materials on new link: ..."
  ],
  [
    "Image Compression using Convolutional Neural Networks AutoEncoders.",
    "All of the material in this playlist is mostly coming from COURSERA platform. Thank you COURSERA! I have taken numerous ..."
  ],
  [
    "Convolutional Neural Networks : TensorFlow 2022",
    "I livestream code and explain everything you could want to know about Convolutional Neural Networks using TensorFlow."
  ],
  [
    "Introduction to Convolution Neural Networks | Convolutional Neural Networks Explained | K21Academy",
    "Join our FREE CLASS On Microsoft Azure [DP-100] Data Scientist Certification Demo/QA Register here: https://bit.ly/3PxGSXl ..."
  ],
  [
    "Using Convolutional Neural Network to classify medical images from the Kvasir dataset",
    "We are using a Convolutional Neural Network using Fast.ai to classify medical images from the Kvasir dataset. This is my first step ..."
  ],
  [
    "Deep Learning with R : Introduction to Convolutional Neural Networks | packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "What is Convolutional Neural Network (CNN) | CNN Intution",
    "In this video, we will start our discussion around CNN. CNNs are one of the most popular neural network architectures. CNNs are ..."
  ],
  [
    "Introduction to Convolutional Neural Networks with Tensorflow",
    "Since 2015, convolutional neural networks (CNNs) have revolutionized the field of Deep Learning. They form the basis of multiple ..."
  ],
  [
    "Self Driving Car AI With Convolutional Neural Networks",
    "Github: https://github.com/InderPabla I trained a Convolutional Neural Network drive a simulated car in Unity3D on a road."
  ],
  [
    "Deep Learning - Number of MACs in convolutional neural networks",
    "Full course here https://vlsideepdive.com/hardware-for-deep-learning-webinar/"
  ],
  [
    "Image Compression using Convolutional Neural Networks AutoEncoders.",
    "All of the material in this playlist is mostly coming from COURSERA platform. Thank you COURSERA! I have taken numerous ..."
  ],
  [
    "How to Calculate the Parameters (Weights + Biases) in Convolutional Neural Networks|Dr Arshad Afridi",
    "In this video lecture we discussed in simple words how to calculate the number of parameters in convolutional neural networks."
  ],
  [
    "Visual Interpretability for Convolutional Neural Networks",
    "An introduction to visualization techniques in Convolutional Neural Networks. The goal of this talk will be to give the audience an ..."
  ],
  [
    "Convolutional Neural Networks for processing EEG signals",
    "5-min ML Paper Challenge Presenter: https://www.linkedin.com/in/royachalaki/ On the Classification of SSVEP-Based Dry-EEG ..."
  ],
  [
    "Lecture 13: Convolutional Neural Networks",
    "Lecture 13 provides a mini tutorial on Azure and GPUs followed by research highlight \"Character-Aware Neural Language Models ..."
  ],
  [
    "The Convolutional Neural Network (Animated Introduction)",
    "Hey, In this video, we will discuss the convolutional neural networks which are used for image datasets. Timestamp: 0:00-0:33 ..."
  ],
  [
    "What is Convolutional Neural Network in Data Science",
    "https://datasciencepr.com/convolutional-neural-network - A Convolutional Neural Network is a common method used with deep ..."
  ],
  [
    "Convolutional Neural Network (CNN--7 Layers) Image Classification in Matlab (with Complete Code)",
    "This example shows how to create and train a simple convolutional neural network for deep learning classification. Convolutional ..."
  ],
  [
    "Convolutional Neural Networks | A Beginner&#39;s Guide To Convolutional Neural Networks",
    "In this video, I will explain the concept of convolution neural networks (CNN's) using many swan pictures and will make the case of ..."
  ],
  [
    "Convolutional Neural Networks Explained | How CNN Works | CNN With Python | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Deep Learning ||Convolutional Neural Networks || Coursera All week Quiz Answers ||",
    "Deep Learning ||Convolutional Neural Networks || Coursera All week Quiz Answers || Convolutional Neural Networks by ..."
  ],
  [
    "Neural Networks 3 - Convolutional Neural Networks",
    "This video describes how Convolutional Neural Networks can be used to solve vision problems by describing their connectivity ..."
  ],
  [
    "PR-119: Active Learning For Convolutional Neural Networks: A Core-Set Approach",
    "paper : https://arxiv.org/abs/1708.00489."
  ],
  [
    "MNIST digit classification using convolutional neural networks: An example CNN",
    "This video is about MNIST digit classification using convolutional neural networks: An example CNN."
  ],
  [
    "#3 Deep Learning Project using Convolutional Neural Network | Fashion MNIST Classification in Hindi",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In the Machine ..."
  ],
  [
    "Lecture 3.1: Convolutional Neural Networks - Introduction",
    ""
  ],
  [
    "[2021.05.06 Lesson11-Session2] Convolutional Neural Network",
    "Advanced MATLAB Programming for Machine Learning＞ Please find the syllabus and relevant materials on new link: ..."
  ],
  [
    "Gesture recognition via 3D CNN convolutional neural network",
    "Gesture recognition via 3D CNN neural network using Tensorflow. Our project consists in developing a Python language solution, ..."
  ],
  [
    "Convolutional Neural Network (CNN) Deep Learning Explained",
    "Image classification involves the extraction of features from the image to observe some patterns in the dataset. Using an ANN for ..."
  ],
  [
    "Depths in Convolutional Neural Network - ConvNet / CNN Architecture - Deep Learning",
    "CN03 Depths in Convolutional Neural Network ( ConvNet / CNN Architecture ) Depths in Convolutional Neural Networks ..."
  ],
  [
    "Coursera : Convolutional Neural Networks Solutions DeepLearning.ai Answers #Courseraanswers",
    "techninjas #techninjas2.0 #nowaytohide #coursera #ibmcertificate #freecertificate #allsolutions #deeplearningai #neuralnetwork ..."
  ],
  [
    "Convolution Neural Nets in Excel - Maddison",
    "Building Neural Networks in Excel. I've reached Course 4 Week 3 of Andrew Ng's brilliant Deep Learning course on Coursera and ..."
  ],
  [
    "T-CNN: Tubelets with Convolutional Neural Networks for Object Detection from Videos",
    ""
  ],
  [
    "Convolutional Neural Networks",
    ""
  ],
  [
    "Sequence To Sequence Learning With Neural Networks| Encoder And Decoder In-depth Intuition",
    "Sequence To Sequence With Neural Network Research Paper: ..."
  ],
  [
    "C4W1 Convolutional Neural Networks",
    "This is only merged video from https://www.youtube.com/channel/UCcIXc5mJsHVYTZR1maL5l9w and I very want to share it all for ..."
  ],
  [
    "PPT(powerpoint) CNN(convolutional neural network) Architecture drawing Tutorial",
    "powerpoint cnn figure drawing tutorial 참고 자료 출처:https://towardsdatascience.com/basics-of-the-classic-cnn-a3dce1225add."
  ],
  [
    "Introduction to Convolutional Neural Networks",
    "This video is an introduction to Computer Vision, the theory of convolutions and CNNs. We also look at the feature extraction ..."
  ],
  [
    "A Convolutional Neural Network Approach Towards Self-Driving Cars",
    "Title: A Convolutional Neural Network Approach Towards Self-Driving Cars Author: Akhil Agnihotri, Prathamesh Saraf, Kriti ..."
  ],
  [
    "Region Based Convolutional Neural Networks RCNN | Best AI Course Tutorial For Beginners|Henry Harvin",
    "Henry Harvin Artificial Intelligence course (Use code “YOUTUBE20” ) https://bit.ly/3yo1OYH This Henry Harvin video on “Region ..."
  ],
  [
    "#8 Deep Learning Project using Convolutional Neural Network | Fashion MNIST Classification in Hindi",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In the Machine ..."
  ],
  [
    "Convolutional Neural Networks for Beginners Urdu| How CNN work | Machine Learning(Tutorial Part-I)",
    "Dear YouTube family!! In this tutorial, we will teach beginner-level convolutional neural networks in Urdu in a very simple way."
  ],
  [
    "NNC Tutorial : 5-minute design for Convolutional Neural Networks(CNN)",
    "In this video, we will explain how to build Convolutional Neural Networks using the Deep Learning integrated development ..."
  ],
  [
    "Convolutional neural networks with dynamic convolution for time series classification",
    "Presentation at ICCCi 2021."
  ],
  [
    "Topic # 21 Convolutional Neural Network-Image Processing (Urdu | Hindi)",
    "Course: Deep Learning Hands- On Topic # 21 Convolutional Neural Network-Image Processing (Urdu | Hindi) Convolutional ..."
  ],
  [
    "MNIST Convolutional Neural Network implementation in C++",
    "Handwritten digit recognition using the MNIST dataset. Source code: https://github.com/albertnadal/Tensar."
  ],
  [
    "Facial Expressions Detection with Convolutional Neural Networks | Venkata Sreeram | Indian Servers",
    "Hello Everyone   I'm done with my Final Project \" Facial Expressions Detection with Convolutional Neural Networks \" as a part of ..."
  ],
  [
    "Integration of Convolutional Neural Networks in Mobile Applications",
    "Roger Creus (Universitat Politècnica de Catalunya), Silverio Martínez-Fernández (UPC-BarcelonaTech), Xavier Franch ..."
  ],
  [
    "Convolutional neural networks in 10 minutes",
    "This video should be seen after \"Intro to Neural Networks\" at https://www.youtube.com/watch?v=8Fmxgig7uew I created this video ..."
  ],
  [
    "தமிழில்   Introduction to Neural Networks &amp; Convolutional Neural Networks  - In Tamil",
    "In this course we are going to learn the following topics Neurons and artificial neurons, various components of neural networks."
  ],
  [
    "Computer Vision - Convolutional Neural Networks (Arabic)",
    "Acknowledgment: I am bit beginner in the topic (just prepared it for ppt for my deep learning class). Also still novice in ML area."
  ],
  [
    "Convolutional Neural Networks in APL",
    "This paper shows how Convolutional Neural Networks (CNN) can be implemented in APL. Its first-class array support ideally fits ..."
  ],
  [
    "implementation of convolutional neural network in Python",
    ""
  ],
  [
    "Paper presentation: EfficientNet: Rethinking Model Scaling for Convolutional Neural Networks",
    "http://proceedings.mlr.press/v97/tan19a.html AI Trends Seminar, 2021 Spring, Szeged."
  ],
  [
    "UAV Vision: Convolutional Neural Nets",
    "Deegan Atha explains his use of convolutional neural nets to give human-like vision information to UAVs. Refrences: Figure 2 ..."
  ],
  [
    "[Part 7] Convolutional Neural Networks",
    "Convolutional Neural Networks are the state-of-the-art in terms of computer vision these days. Let's take a closer look at these ..."
  ],
  [
    "Convolutional Neural Networks with TF Keras",
    "In this video we learn how to create, train, and evaluate a convolutional neural network (CNN) with Keras and TensorFlow 2.0!"
  ],
  [
    "Convolutional Neural Network (CNN) Deep Learning Explained",
    "Image classification involves the extraction of features from the image to observe some patterns in the dataset. Using an ANN for ..."
  ],
  [
    "Convolutional Neural Networks",
    ""
  ],
  [
    "CNN in Malayalam - Part 28 - What is Convolution?",
    "Convolution explained in Malayalam."
  ],
  [
    "Audio Source Separation Using Convolutional Neural Networks Demo",
    "Demonstration of Audio Source Separation Using Convolutional Neural Networks. Uploaded for presentation purposes, I do not ..."
  ],
  [
    "T-CNN: Tubelets with Convolutional Neural Networks for Object Detection from Videos",
    ""
  ],
  [
    "C4W1 Convolutional Neural Networks",
    "This is only merged video from https://www.youtube.com/channel/UCcIXc5mJsHVYTZR1maL5l9w and I very want to share it all for ..."
  ],
  [
    "Introduction to Convolutional Neural Networks with Tensorflow",
    "Since 2015, convolutional neural networks (CNNs) have revolutionized the field of Deep Learning. They form the basis of multiple ..."
  ],
  [
    "Coursera : Convolutional Neural Networks Solutions DeepLearning.ai Answers #Courseraanswers",
    "techninjas #techninjas2.0 #nowaytohide #coursera #ibmcertificate #freecertificate #allsolutions #deeplearningai #neuralnetwork ..."
  ],
  [
    "MIT BCS course 9.60: Convolutional Neural Networks",
    "Basics of Convolutional Neural Networks This was originally presented to the students in MIT's course 9.60: Human Motivated ..."
  ],
  [
    "Fast Algorithms for Convolutional Neural Networks by Andrew Lavin and Scott Gray",
    "This is a reading group talk on the published paper in CVPR 2016 entitled, \"Fast Algorithms for Convolutional Neural Networks,\" ..."
  ],
  [
    "AI Car Classification with Deep Convolutional Neural Networks on Databricks",
    "AI Car Classification with Deep Convolutional Neural Networks on Databricks https://datainsights.de/ Earlier this year, a company ..."
  ],
  [
    "[part 3] Convolutional Neural Networks and NLP: In practice",
    "Recording of the slides used to present the 'Convolutional Neural Networks and NLP' talk at the Deep Learning and NLP meetup ..."
  ],
  [
    "Introduction to Convolutional Neural Networks - Transfer learning - Theory",
    ""
  ],
  [
    "RobustTAD: Robust Time Series Anomaly Detection via Decomposition and Convolutional Neural Networks",
    "Authors: Jingkun Gao, Xiaomin Song, Qingsong Wen, Pichao Wang, Liang Sun and Huan Xu."
  ],
  [
    "High-frequency Component Helps Explain the Generalization of Convolutional Neural Networks | AISC",
    "For slides and more information on the paper, visit ..."
  ],
  [
    "Orthogonal Convolutional Neural Networks (CVPR 2020)",
    "We develop an efficient approach to impose filter orthogonality on a convolutional layer. Our proposed orthogonal convolution ..."
  ],
  [
    "Formation sur les CNN : Convolutional Neural Networks",
    "Dans cette formation, Christian de Correc présente l'origine et le fonctionnement des CNN, ou convolutional neural networks."
  ],
  [
    "Implementation of Convolutional Neural Networks",
    "In this video, I implement the Convolutional Neural Networks using TensorFlow. I talk about implementing the architecture, ..."
  ],
  [
    "Introduction to Convolution Neural Networks",
    "ACCESS the FULL COURSE here: ..."
  ],
  [
    "Convolutional Neural Networks – how they learn and how to trick them | jambit CoffeeTalk",
    "Convolutional Neural Networks, or simply CNN, are often used for image analysis, such as classification and object segmentation."
  ],
  [
    "Beginner&#39;s Guide to Semantic Segmentation With Convolutional Neural Networks",
    "Learn how to Semantic Segmentation Models in Tensorflow using Convolutional Neural Networks (CNNs). In this Beginners ..."
  ],
  [
    "Arush Kakkar - Optimizing Deep Convolutional Neural Networks for Speed and Performance",
    "In this talk, I will be focusing on techniques to run the DCNNs as efficiently as possible in terms of : 1) Decrease running time on ..."
  ],
  [
    "3. CNN - Convolutional Neural Network - Zero Padding, Striding and Depth (With Example)",
    "Here, we can understand Zero Padding, Striding and Depth (With Example) clearly."
  ],
  [
    "Paper presentation: EfficientNet: Rethinking Model Scaling for Convolutional Neural Networks",
    "http://proceedings.mlr.press/v97/tan19a.html AI Trends Seminar, 2021 Spring, Szeged."
  ],
  [
    "CNN Explainer: Learning Convolutional Neural Networks with Interactive Visualization",
    "Authors: Zijie Wang, Robert Turko, Omar Shaikh, Haekyu Park, Nilaksh Das, Fred Hohman, Minsuk Kahng, Duen Horng Chau VIS ..."
  ],
  [
    "Convolutional Neural Network",
    "This video is about the explanation about convolutional neural network."
  ],
  [
    "MIT 6.S191 (2018): Convolutional Neural Networks",
    "MIT Introduction to Deep Learning 6.S191: Lecture 3 Deep Learning for Computer Vision Lecturer: Ava Soleimany January 2018 ..."
  ],
  [
    "MNIST Convolutional Neural Network implementation in C++",
    "Handwritten digit recognition using the MNIST dataset. Source code: https://github.com/albertnadal/Tensar."
  ],
  [
    "What is the Convolution in Convolutional Neural Networks? All About Neural Networks, Part 2",
    "If you wish to support us in creating fun, informative content, please consider giving at our Patreon site here: ..."
  ],
  [
    "#3 Deep Learning Project using Convolutional Neural Network | Fashion MNIST Classification in Hindi",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In the Machine ..."
  ],
  [
    "Deep Learning: Convolutional Neural Networks Explained (Part 4)",
    "Overview of how Convolutional Neural Networks (CNN) perform classification. This type of Deep Learning is especially well suited ..."
  ],
  [
    "Integration of Convolutional Neural Networks in Mobile Applications",
    "Roger Creus (Universitat Politècnica de Catalunya), Silverio Martínez-Fernández (UPC-BarcelonaTech), Xavier Franch ..."
  ],
  [
    "Convolutional Neural Networks Explained | How CNN Works | CNN With Python | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Convolutional Neural Network in action",
    "A quick demo for my project: https://github.com/koryakinp/ann."
  ],
  [
    "Convolutional Neural Networks in APL",
    "This paper shows how Convolutional Neural Networks (CNN) can be implemented in APL. Its first-class array support ideally fits ..."
  ],
  [
    "CNN  Tutorial in Telugu || Convolutional Neural Network || Part 21||TensorFlow",
    "In this video, I am explaining the CNN(Convolutional Neural Network) Basics and coding part related to Theory. Based on this ..."
  ],
  [
    "Convolutional Neural Network (CNN) | Machine Learning | Deep Learning | IIT Lecture Series",
    "In deep learning, a convolutional neural network (CNN, or ConvNet) is a class of deep neural networks, most commonly applied to ..."
  ],
  [
    "Convolutional Neural Networks (CNN) | Applications | CNN v/s ANN",
    "In this video, we will discuss Convocational Neural Networks, and compare the performance of CNNs v/s ANNs."
  ],
  [
    "Practical Convolutional Neural Networks: The Course Overview | packtpub.com",
    "This video tutorial has been taken from Practical Convolutional Neural Networks. You can learn more and buy the full video ..."
  ],
  [
    "Convolutional Neural Networks for Image Analysis",
    "The convolutional neural network (CNN) represents the current state-of-the-art for image and video analysis, and is increasingly ..."
  ],
  [
    "Convolutional Neural Networks (CNN) What &amp; How it works - Brandon Rohrer",
    "Join the channel membership: https://www.youtube.com/c/AIPursuit/join Subscribe to the channel: ..."
  ],
  [
    "NNC Tutorial : 5-minute design for Convolutional Neural Networks(CNN)",
    "In this video, we will explain how to build Convolutional Neural Networks using the Deep Learning integrated development ..."
  ],
  [
    "Convolutional Neural Networks Explained Simply in 3 Minutes | Breakthrough Junior Challenge 2021",
    "breakthroughjuniorchallenge This short video discusses convolutional neural networks with a fun application. This is my ..."
  ],
  [
    "Introduction To Convolutional Neural Networks",
    "This video provides a mathematical introduction to CNN's and the role of filters in CNN architecture."
  ],
  [
    "Introduction to Convolutional Neural Network",
    "Basic theories of CNN with intermediate layer visualization."
  ],
  [
    "Lesson 8. Convolutional Neural Networks (practice 1)",
    "Lecturer: Gregory Leleytner (ML & DL Researcher at PSAMI MIPT) Materials: http://bit.ly/2HHuanD --- About Deep Learning ..."
  ],
  [
    "Convolutional Neural Networks شرح بالعربي الشبكات العصبية التلافيفية",
    "شرح الشبكات العصبية التشريحية الشبكات العصبية التلافيفية شرح ConvNets ReLU Pooling layer Conv Layer Fully ..."
  ],
  [
    "Introduction to Convolutional Neural Network",
    "Basic theories of CNN with intermediate layer visualization."
  ],
  [
    "Lesson 8. Convolutional Neural Networks (practice 1)",
    "Lecturer: Gregory Leleytner (ML & DL Researcher at PSAMI MIPT) Materials: http://bit.ly/2HHuanD --- About Deep Learning ..."
  ],
  [
    "Convolutional Neural Networks شرح بالعربي الشبكات العصبية التلافيفية",
    "شرح الشبكات العصبية التشريحية الشبكات العصبية التلافيفية شرح ConvNets ReLU Pooling layer Conv Layer Fully ..."
  ],
  [
    "Motion Gestures Detection using Convolutional Neural Networks and Tensorflow on Android",
    "There are many different ways to interact with smartphones these days: touchscreen, hardware buttons, fingerprint sensor, and so ..."
  ],
  [
    "Flowsheet Recognition using Deep Convolutional Neural Networks",
    "This is a video of a presentation at the PSE2021+ conference in Kyoto Japan. Authors: Lukas Schulze Balhorn, Qinghe Gao, ..."
  ],
  [
    "Region Based Convolutional Neural Networks RCNN | Best AI Course Tutorial For Beginners|Henry Harvin",
    "Henry Harvin Artificial Intelligence course (Use code “YOUTUBE20” ) https://bit.ly/3yo1OYH This Henry Harvin video on “Region ..."
  ],
  [
    "Image Classification using Convolutional Neural Network (CNN)",
    "This is the video that relates to the Image classification model using Alexnet and Googlenet. By the way, I added this section on ..."
  ],
  [
    "Genetic Algorithm Optimization of Convolutional Neural Network Architecture",
    "This presentation demonstrates use of Genetic Algorithm for Optimization of CNN for Face Image Recognition problem Github link: ..."
  ],
  [
    "Python on Zynq FPGA for Convolutional Neural Networks (Xilinx XOHW17 XIL-11000)",
    "Xilinx Open Hardware 2017 competition entry \"PYNQ Classification - Python on Zynq FPGA for Convolutional Neural Networks\" ..."
  ],
  [
    "Convolutional Neural Network Made Easy Part-1",
    "For Detailed - Chapter-wise Deep learning tutorial - please visit (https://ai-leader.com/deep-learning/ )] Part-1 Contains. 1. Basics ..."
  ],
  [
    "Convolutional Neural Network using CIFAR10 dataset from scratch | Tec4Tric",
    "Using Tensorflow or Keras, it is very easy to build a Convolutional Neural Network which can classify the CIFAR10 dataset images ..."
  ],
  [
    "Convolutional Neural Networks | Computer vision playlist",
    "The advancements in Computer Vision in Deep learning are due to primarily one particular algorithm — a Convolutional Neural ..."
  ],
  [
    "Emotion Recognition Using Convolutional Neural Network",
    "Computer vision (CV) in the field of study assists PCs with concentrating on utilizing various methods and strategies so they can ..."
  ],
  [
    "Neural Networks in Machine Learning for Developers: Origin of Convolutional Neural N/W| packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "How To Train Network For Scene Recognition AlexNet Convolutional Neural Network Training In Matlab",
    "Hi Welcome To Programming Tech #SubScribeOurChannel #MatlabTutorial #RetrainAlexNet Subscribe Our ..."
  ],
  [
    "Depths in Convolutional Neural Network - ConvNet / CNN Architecture - Deep Learning",
    "CN03 Depths in Convolutional Neural Network ( ConvNet / CNN Architecture ) Depths in Convolutional Neural Networks ..."
  ],
  [
    "Convolutional Neural Network MNIST Fashion | Machine Learning 101 | Eps 32",
    "MachineLearning101 #MultiLayerPerceptron Playlist Machine Learning 101: ..."
  ],
  [
    "Fully Convolutional Neural Network | FCN Architecture",
    "Learn to code a fixed fully convolutional network architecture for semantic segmentation in Pytorch. Architecture code: ..."
  ],
  [
    "Convolutional Neural Network for Breast Cancer Diagnosis with Histology Images",
    "Description of the method A Lightweight Convolutional Neural Network for Breast Cancer Diagnosis with Histology Images (LCIP)"
  ],
  [
    "STEM image restoration using convolutional neural networks, Thomas Friedrich",
    "STEM image restoration using convolutional neural networks and its impact on the quantification of atomic structures, presented ..."
  ],
  [
    "Convolutional Neural Networks",
    ""
  ],
  [
    "Convolutional Neural Networks: convolution, padding, stride, softmax 🧠 ⚙️",
    "What are Convolutional Neural Networks? How do they work? In this video, you will learn about the fundamental basic blocks of a ..."
  ],
  [
    "Convolutional Neural Networks - Practical with Keras",
    "Udemy Course: https://www.udemy.com/course/machine-learning-and-data-science-2021/?"
  ],
  [
    "How to train Convolutional Neural Network (CNN) using Cifar-100 Dataset | CNN in Python",
    "Convolutional Neural Network (CNN) is one of the most popular deep learning algorithms for image classification problems."
  ],
  [
    "Food Detection With Image Processing Using Convolutional Neural Network CNN Method | Deep Learning",
    "Currently, the payment process at the restaurant is still manual and inefficient because it uses a cash register. To reduce difficulty ..."
  ],
  [
    "Convolutional Neural Networks: How Self Driving Cars See the Road",
    "Here's my first presentation on my projects I've been working on. Hopefully you got some value from it!"
  ],
  [
    "Practical Convolutional Neural Networks: Attention Mechanism for Image Captioning | packtpub.com",
    "This video tutorial has been taken from Practical Convolutional Neural Networks. You can learn more and buy the full video ..."
  ],
  [
    "Malaria Diagnosis with Convolutional Neural Networks - Full Stack Deep Learning,TensorFlow 2, WandB",
    "Convolutional Neural Networks have become very popular in computer vision. In this section we use TensorFlow to build a robust ..."
  ],
  [
    "Convolutional Neural Networks",
    ""
  ],
  [
    "Handwritten Text Recognition using Convolutional Neural Networks (CNN)",
    "A popular demonstration of the capability of deep learning techniques is object recognition in image data. Source Code (Github): ..."
  ],
  [
    "Lipreading Demo by Convolutional Neural Network",
    "Programming language: Python - Library: openCV, Keras - Environment: Macbook Pro - Trained by data set MIRACL - Model ..."
  ],
  [
    "Coding ResNet from scratch with TensorFlow - Convolutional Neural Network - Human Emotions Detection",
    "In this section we continue our human emotions detection project. We shall focus on Coding Residual Networks from scratch with ..."
  ],
  [
    "Pooling and Padding in Convolutional Neural Networks and Deep Learning",
    "In this Neural Networks Tutorial, we are going to talk about Pooling and Padding in Convolutional Neural Networks and Deep ..."
  ],
  [
    "Convolutional Neural Networks (CNN) - applications in image recognition in dermatology and radiology",
    "The Comeback of Convolutional Nets The eternal fight between ConvNets and Transformers continues. Well, an eternity in ..."
  ],
  [
    "CAG17 demo - Sketch based image retrieval using Convolutional Neural Network",
    "This is the demo for the journal \"Sketching out the details: Sketch-based image retrieval using convolutional neural networks with ..."
  ],
  [
    "Convolutional Neural Networks (TD Bootcamp)",
    "Taught at the TD Bootcamp on July 25, 2020 by Ankit Ramchandani."
  ],
  [
    "Convolutional neural networks in 10 minutes",
    "This video should be seen after \"Intro to Neural Networks\" at https://www.youtube.com/watch?v=8Fmxgig7uew I created this video ..."
  ],
  [
    "Deep Computer Vision Using Convolutional Neural Networks",
    "Deep Computer Vision Using Convolutional Neural Networks Discussion leader: George Zoto Convolutional Neural Networks ..."
  ],
  [
    "Introduction to Convolutional Neural Networks (CNNs)",
    "This workshop is a beginner's guide to computer vision. We will introduce one of the most popular class of models in the field: ..."
  ],
  [
    "using convolutional neural network (CNN) in matlab (MatconvNet)",
    ""
  ],
  [
    "How to Create a Convolutional Neural Network, Train It and Do Predictions with Keras and TensorFlow",
    "In this Neural Networks Tutorial, we will Create and Train a Convolutional Neural Network and Make Predictions on data that it ..."
  ],
  [
    "What are convolutional neural networks?",
    "Learn more at https://www.theaicore.com."
  ],
  [
    "Basics of Convolutional Neural Network (CNN)",
    "This video helps to enhance understanding of the convolutional neural networks."
  ],
  [
    "Convolutional Neural Networks | CNN #shorts #datasciecne",
    "Convolutional Neural Networks (CNN), one of the three popular neural networks, are currently trending in the deep learning ..."
  ],
  [
    "Graph Convolutional Neural Network  - Part B",
    "13:00 - Spectral rule."
  ],
  [
    "SROP 2013: Convolutional Neural Networks for Vehicle Detection",
    ""
  ],
  [
    "What is Padding | Convolutional Neural Networks",
    "In this video, you will learn about what is padding and how works and used in Convolutional Neural Networks In this series of ..."
  ],
  [
    "Enabling Efficient Training of Convolutional Neural Networks for Histopathology Images",
    "Presenting our research paper, which can be found in this link: https://link.springer.com/chapter/10.1007/978-3-031-13321-3_47 ..."
  ],
  [
    "8.2 Backpropagation and Gradient-Based Visualization in Convolutional Neural Networks",
    "Discusses backpropagation in convolutional neural networks. Also discusses applications to gradient-based visualization."
  ],
  [
    "Convolutional Neural Networks",
    "Let's start with convolutional neural networks. So, the task we are looking at now is image classification. So, an image can be seen ..."
  ],
  [
    "3D Visualization of a Convolutional Neural Network",
    "I take a look at Adam Harley's 3D visualization of a Convoluational Neural Network. I am not affiliated with this project, I merely ..."
  ],
  [
    "Convolutional Neural Networks: convolution, padding, stride, softmax 🧠 ⚙️",
    "What are Convolutional Neural Networks? How do they work? In this video, you will learn about the fundamental basic blocks of a ..."
  ],
  [
    "Abandoned Object Detection Method Using Convolutional Neural Network",
    "Abandoned object detection is a challenging task in video surveillance systems, a lot of research has been done to improve and ..."
  ],
  [
    "Max Pooling in Convolutional Neural Networks",
    "This question was from the following video on Convolutional Neural Networks https://www.youtube.com/watch?v=uGYLaDp8NrQ."
  ],
  [
    "Image Recognition with Convolutional Neural Networks in python",
    "Python Code available on GitHub: https://github.com/jmartinezheras/2018-MachineLearning-Lectures-ESA Watch the theory ..."
  ],
  [
    "Understanding EfficientNet - Convolutional Neural Network - Human Emotions Detection",
    "In this section we continue our human emotions detection project. We shall focus on understanding how EfficientNet Works."
  ],
  [
    "CS480/680 Lecture 16: Convolutional neural networks",
    ""
  ],
  [
    "End to End Convolutional Neural Network",
    "In this video, you will learn about what is padding and how works and is used in Convolutional Neural Networks In this series of ..."
  ],
  [
    "Convolutional Neural Networks (CNN) - applications in image recognition in dermatology and radiology",
    "The Comeback of Convolutional Nets The eternal fight between ConvNets and Transformers continues. Well, an eternity in ..."
  ],
  [
    "Introduction to Convolutional Neural Network",
    "Basic theories of CNN with intermediate layer visualization."
  ],
  [
    "7 Deep learning  1: Backpropagation for tensors, Convolutional Neural Networks (MLVU2019)",
    "slides: https://mlvu.github.io/lectures/41.DeepLearning1.annotated.pdf course materials: https://mlvu.github.io This lecture builds ..."
  ],
  [
    "Neural Networks in Machine Learning for Developers: Origin of Convolutional Neural N/W| packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "Currency Recognition Using CNN (Convolutional Neural Network) Python Project Source Code",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "Flower Recognition and Accuracy in Convolutional Neural Networks (CNN)",
    "In this video, you will understand Flower Recognition and Accuracy in Convolutional Neural Networks (CNN)."
  ],
  [
    "Seismic Facies Prediction using Convolutional Neural Networks (CNN)",
    "Mapping of seismic and lithologic facies from 3D reflection seismic data plays a key role in depositional environment analysis and ..."
  ],
  [
    "CVPR 2021: Truly shift invariant convolutional neural networks",
    "Authors: Anadi Chaman and Ivan Dokmanić. Despite the presence of convolutions, popular CNN architectures lack shift ..."
  ],
  [
    "Convolutional Neural Networks (CNN) What &amp; How it works - Brandon Rohrer",
    "Join the channel membership: https://www.youtube.com/c/AIPursuit/join Subscribe to the channel: ..."
  ],
  [
    "Convolutional Neural Network(CNN)-Kernel/Filter/Convolve",
    "A demonstration of how Filters(Kernels) work in Convolutional Neural Networks."
  ],
  [
    "Convolutional Neural Network Tutorial (CNN) Tutorial for beginners - Deep Learning",
    "According to Wikipedia- In deep learning, a convolutional neural network (CNN, or ConvNet) is a class of deep neural networks, ..."
  ],
  [
    "Practical Convolutional Neural Networks: The Course Overview | packtpub.com",
    "This video tutorial has been taken from Practical Convolutional Neural Networks. You can learn more and buy the full video ..."
  ],
  [
    "Practical Convolutional Neural Networks: Attention Mechanism for Image Captioning | packtpub.com",
    "This video tutorial has been taken from Practical Convolutional Neural Networks. You can learn more and buy the full video ..."
  ],
  [
    "What are convolutional neural networks?",
    "Learn more at https://www.theaicore.com."
  ],
  [
    "Multiclass Breast Cancer Classification Using Convolutional Neural Networks (EEE 426)",
    ""
  ],
  [
    "STEM image restoration using convolutional neural networks, Thomas Friedrich",
    "STEM image restoration using convolutional neural networks and its impact on the quantification of atomic structures, presented ..."
  ],
  [
    "Create and Visualize your first Convolutional Neural Network (CNN) in Python",
    "[For Absolute Beginners] If you are new to neural networks and always wanted to create your first Convolutional neural network ..."
  ],
  [
    "Deep Convolutional Neural Networks Using U Net for Automatic Brain Tumor Segmentation in Multimodal",
    ""
  ],
  [
    "Real-time fetal biometrics using deep convolutional neural networks",
    "Dr Matthew Sinclair is postdoctoral researcher at BioMedIA: https://biomedia.doc.ic.ac.uk/ He is talking about his work on Machine ..."
  ],
  [
    "Python on Zynq FPGA for Convolutional Neural Networks (Xilinx XOHW17 XIL-11000)",
    "Xilinx Open Hardware 2017 competition entry \"PYNQ Classification - Python on Zynq FPGA for Convolutional Neural Networks\" ..."
  ],
  [
    "Antipodal Robotic Grasping using Generative Residual Convolutional Neural Network (IROS 2020)",
    "We present a modular robotic system to tackle the problem of generating and performing antipodal robotic grasps for unknown ..."
  ],
  [
    "Graph Convolutional Neural Network  - Part B",
    "13:00 - Spectral rule."
  ],
  [
    "Use Convolutional Neural Network to Recognize My Handwriting (keras in R)",
    "This video is going to show how to construct Convolutional Neural Network (CNN) in R using Keras from Python for image ..."
  ],
  [
    "Exploring Convolutional neural networks in EEG datasets classification",
    "Exploring the potential of convolutional neural networks in EEG data classification and what this could mean for the future of EEG ..."
  ],
  [
    "CAG17 demo - Sketch based image retrieval using Convolutional Neural Network",
    "This is the demo for the journal \"Sketching out the details: Sketch-based image retrieval using convolutional neural networks with ..."
  ],
  [
    "Convolutional Neural Networks - Udacity Self-Driving Car Engineer Nanodegree Program",
    ""
  ],
  [
    "R keras convolutional neural networks on mnist data",
    "Part of the series Convolutional Neural Networks in R ..."
  ],
  [
    "Convolutional Neural Network - Deep Learning for Audio Classification p.5",
    "The convolutional neural network got around 95 % accuracy. You can probably get better results using a second of data instead of ..."
  ],
  [
    "Amazon Rainforest Satellite Image Classification using Convolutional Neural Networks",
    "Github: https://github.com/connormca12/Springboard-Projects/tree/master/capstone-2."
  ],
  [
    "CNN Explainer: Learning Convolutional Neural Networks with Interactive Visualization",
    "Authors: Zijie Wang, Robert Turko, Omar Shaikh, Haekyu Park, Nilaksh Das, Fred Hohman, Minsuk Kahng, Duen Horng Chau VIS ..."
  ],
  [
    "line follower - real time line detection using convolutional neural network",
    "running on mi Mac (cpu only, no GPU), resolution 640x480 - written in Pytorch, trained on custom dataset (arround 10k images) ..."
  ],
  [
    "Using Convolutional Neural Networks to Automatically Analyze Aerial and Satellite Imagery",
    "In this recording of our most recent Technical Staff Meeting, Lewis Fishgold walks us through the team's work on Raster Vision, ..."
  ],
  [
    "Convolutional Neural Networks (TD Bootcamp)",
    "Taught at the TD Bootcamp on July 25, 2020 by Ankit Ramchandani."
  ],
  [
    "Convolutional Neural Network (CNN) Part 3 : Google colab vs cpu (W10)",
    "Simple example of using google colab to train dog vs cat sample using pretraind VGG model. link of google colab notebook ..."
  ],
  [
    "D1- What is a Convolutional Neural Network? (AI Definitions/Concepts)",
    "A Convolutional Neural Network, CNN in short, is a deep learning neural network designed to process data in the form of arrays, ..."
  ],
  [
    "Convolutional Neural Networks",
    "Convolutional Neural Networks."
  ],
  [
    "Convolutional Neural Network Driving in GTA 5",
    "Project details: http://techtelligent.net/self-driving-and-gta5.html."
  ],
  [
    "Mobile Android App - Plant Classification Convolutional Neural Network! (10/10)",
    "Final result of this course! See the Plant CNN classify different types of plants in real time!"
  ],
  [
    "Emotion Recognition Using Convolutional Neural Network",
    "Computer vision (CV) in the field of study assists PCs with concentrating on utilizing various methods and strategies so they can ..."
  ],
  [
    "[딥러닝] Lecture 4. Convolutional Neural Networks",
    ""
  ],
  [
    "Deep Computer Vision Using Convolutional Neural Networks",
    "Deep Computer Vision Using Convolutional Neural Networks Discussion leader: George Zoto Convolutional Neural Networks ..."
  ],
  [
    "What is Padding | Convolutional Neural Networks",
    "In this video, you will learn about what is padding and how works and used in Convolutional Neural Networks In this series of ..."
  ],
  [
    "Cascading Convolutional Neural Networks, Team Data eVaders",
    "Typically, most neural network architectures are manually designed, by optimizing various hyperparameters, to model the ..."
  ],
  [
    "3DmFV: 3D Point Cloud Classification in Real-Time using Convolutional Neural Networks",
    "Presented at the IEEE International Conference on Intelligent Robots and Systems (IROS) 2018. Paper: ..."
  ],
  [
    "[DeepReader] Improved Regularization of Convolutional Neural Networks with Cutout",
    "machinelearning #deeplearning #cutout #dataaugmentation #paperoverview Code https://github.com/uoguelph-mlrg/Cutout ..."
  ],
  [
    "Multi Crop Convolutional Neural Networks for Fast Lung Nodule Segmentation - PYTHON PROJECTS 2021 22",
    "Multi Crop Convolutional Neural Networks for Fast Lung Nodule Segmentation - PYTHON PROJECTS 2021 2022 Website: ..."
  ],
  [
    "Convolutional Neural Network In Blender",
    "This is the first test of a convolutional neural network in Blender. I visualized just the red channel with just four filters and ..."
  ],
  [
    "Deep Learning with Experience Ranking Convolutional Neural Network for Robot Manipulator",
    "Supervised learning, more specifically Convolutional Neural Networks (CNN), has surpassed human ability in some visual ..."
  ],
  [
    "Convolutional Neural Networks Tutorial Part 1",
    "This tutorial explains what ConvNets are and how they work with an interesting application of classifying latex symbols. Part 2: ..."
  ],
  [
    "Deep learning (Part 2): Convolutional Neural Networks",
    "This video explains the fundamental concepts of convolutional neural networks. Contents of this video have been summarized ..."
  ],
  [
    "TileNET: Hardware accelerator for ternary Convolutional Neural Networks - Madhura Purnaprajna | AIS",
    "Convolutional Neural Networks (CNNs) are popular in Advanced Driver Assistance Systems (ADAS) for camera perception."
  ],
  [
    "Deep Convolutional Neural Networks Using U Net for Automatic Brain Tumor Segmentation in Multimodal",
    ""
  ],
  [
    "Convolutional Neural Network (CNN) processor design on VHDL/Verilog",
    "This session is on \"how to design a CNN processor on VHDL/Verilog\", this is only an overview session which will need to know ..."
  ],
  [
    "TidyTuesday: Computer Vision and NLP with Convolutional Neural Networks",
    "In this week's #TidyTuesday video, I go over the basics and usage of convolutional neural networks using #Keras. I first go over ..."
  ],
  [
    "R keras convolutional neural networks on mnist data",
    "Part of the series Convolutional Neural Networks in R ..."
  ],
  [
    "Convolutional Neural Network Driving in GTA 5",
    "Project details: http://techtelligent.net/self-driving-and-gta5.html."
  ],
  [
    "Using Convolutional Neural Networks to Automatically Analyze Aerial and Satellite Imagery",
    "In this recording of our most recent Technical Staff Meeting, Lewis Fishgold walks us through the team's work on Raster Vision, ..."
  ],
  [
    "Understanding EfficientNet - Convolutional Neural Network - Human Emotions Detection",
    "In this section we continue our human emotions detection project. We shall focus on understanding how EfficientNet Works."
  ],
  [
    "Review on course offered by Coursera : &#39;Convolutional Neural Networks&#39;",
    "For regular updates, do consider Like & SUBSCRIBE http://www.youtube.com/c/DrSriparnaSaha Already published playlists: ..."
  ],
  [
    "What are Convolutional Neural Networks?",
    "Learn more at https://www.theaicore.com."
  ],
  [
    "Convolutional Neural Networks",
    ""
  ],
  [
    "Convolutional Neural Network - Deep Learning for Audio Classification p.5",
    "The convolutional neural network got around 95 % accuracy. You can probably get better results using a second of data instead of ..."
  ],
  [
    "3D Visualization of a Convolutional Neural Network",
    "I take a look at Adam Harley's 3D visualization of a Convoluational Neural Network. I am not affiliated with this project, I merely ..."
  ],
  [
    "Convolutional Neural Networks I: The Convolution",
    ""
  ],
  [
    "Brief Announcement: On the Limits of Parallelizing Convolutional Neural Networks on GPUs",
    "Brief Announcement: On the Limits of Parallelizing Convolutional Neural Networks on GPUs Behnam Pourghassemi, Chenghao ..."
  ],
  [
    "Fast and High-Quality Singing Voice Synthesis System based on Convolutional Neural Networks",
    "Presentation and demos of our ICASSP 2020 paper. \"Fast and High-Quality Singing Voice Synthesis System based on ..."
  ],
  [
    "040 Annex - Convolutional Neural Networks - part 1",
    ""
  ],
  [
    "Building our first Convolutional Neural Networks in Keras step by step",
    "Welcome to Keras tutorial. In this tutorial we will: 1. Learn to use Keras, a high-level neural networks API (programming ..."
  ],
  [
    "Convolutional Neural Networks || Project Neurify || Lesson 3, Video 2",
    "Convolutional neural networks (CNNs) are a huge part of artificial intelligence, allowing computers to have amazing recognition ..."
  ],
  [
    "Convolutional Neural Network (CNN) Part 3 : Google colab vs cpu (W10)",
    "Simple example of using google colab to train dog vs cat sample using pretraind VGG model. link of google colab notebook ..."
  ],
  [
    "Use Convolutional Neural Network to Recognize My Handwriting (keras in R)",
    "This video is going to show how to construct Convolutional Neural Network (CNN) in R using Keras from Python for image ..."
  ],
  [
    "Create and Visualize your first Convolutional Neural Network (CNN) in Python",
    "[For Absolute Beginners] If you are new to neural networks and always wanted to create your first Convolutional neural network ..."
  ],
  [
    "DEEP LEARNING | SPPU | UNIT 2 | CONVOLUTIONAL NEURAL NETWORK (CNN)",
    ""
  ],
  [
    "Fruit Classifier Convolutional Neural Network      AI",
    "In this video we are constructing a Convolutional neural network to classify a image from webcam , whether it is an apple or ..."
  ],
  [
    "Mobile Android App - Plant Classification Convolutional Neural Network! (10/10)",
    "Final result of this course! See the Plant CNN classify different types of plants in real time!"
  ],
  [
    "Neural Network 3D Simulation",
    "Artificial Neural Networks 3D simulation. Subscribe to this YouTube channel or connect on: Web: https://www.cybercontrols.org/ ..."
  ],
  [
    "Amazon Rainforest Satellite Image Classification using Convolutional Neural Networks",
    "Github: https://github.com/connormca12/Springboard-Projects/tree/master/capstone-2."
  ],
  [
    "Recyclable Material Classification by using Convolutional Neural Network (CNN)",
    "Assalamualaikum and Hi. We are from Group 5 on the subject BEJ44103 INTELLIGENT CONTROL SYSTEM, Faculty of Electrical ..."
  ],
  [
    "Interpretability of Convolutional Neural Networks - Eva Mohedano - UPC Barcelona 2018 (DLCV D3L4)",
    "https://telecombcn-dl.github.io/2018-dlcv/ Deep learning technologies are at the core of the current revolution in artificial ..."
  ],
  [
    "Seismic Facies Prediction using Convolutional Neural Networks (CNN)",
    "Mapping of seismic and lithologic facies from 3D reflection seismic data plays a key role in depositional environment analysis and ..."
  ],
  [
    "Convolutional Neural Networks for License Plate Detection in Images",
    "Implementation of an algorithm for detecting license plates using a Convolutional Neural Network. The CNN has 9 parametric ..."
  ],
  [
    "Convolutional Neural Networks for Interpretation of Coronary Angiography  (CathNet)",
    "Using artificial intelligence to read coronary angiogram: we trained a type of AI/ Computer vision called convolutional neural ..."
  ],
  [
    "8.3 Case Studies of Convolutional Neural Networks",
    "Discusses some real-world example architectures of convolutional neural networks."
  ],
  [
    "ICSAE-8 ID #90 AlexNet Convolutional Neural Network to Classify The Types of Indonesian Coffee Beans",
    "ICSAE-8 ID #90 AlexNet Convolutional Neural Network to Classify The Types of Indonesian Coffee Beans."
  ],
  [
    "RGB images with Convolutional Neural Networks (CNNs) Video 1 of 2 - Tensorflow",
    "ITS 530 (Tech 581) - Applied Deep Learning Instructor: Ricardo A. Calix, Ph.D. RGB images with Convolutional Neural Networks ..."
  ],
  [
    "[English] Lecture 12 DL Trg - Convolutional Neural Networks (CNN) Part 1 Theory Class",
    "[English] Lecture 12 DL Trg - Convolutional Neural Networks (CNN) Part 1 Theory Class."
  ],
  [
    "Convolutional Neural Networks",
    "Hello everyone my name is saket rawal and this video is fourth part of neural networks tutorial series. In this video we have ..."
  ],
  [
    "7 Deep learning  1: Backpropagation for tensors, Convolutional Neural Networks (MLVU2019)",
    "slides: https://mlvu.github.io/lectures/41.DeepLearning1.annotated.pdf course materials: https://mlvu.github.io This lecture builds ..."
  ],
  [
    "How do machines see objects ? Easy explanation of Convolutional Neural Networks",
    "Working of CNNs: Field of Machine Learning and Artificial Intelligence is revolutionizing human capabilities like never before in ..."
  ],
  [
    "ICSE&#39;22: Decomposing Convolutional Neural Network into reusable and replaceable modules",
    ""
  ],
  [
    "Online Signature Verification Based on Convolutional Neural Network CNN -  1Crore Projects",
    "Online Signature Verification Based on Convolutional Neural Network CNN - 1Crore Projects #1croreprojects #beprojects ..."
  ],
  [
    "Demystifying Attention in Computer Vision with Convolutional Neural Networks",
    "Attention is one of the hottest topics in deep learning. It has mainly been well-known in natural language processing, ..."
  ],
  [
    "ML L33: Convolutional Neural Networks",
    "Hybride Vorlesung im Wintersemester 2021/22 (Live-Mitschnitt aus dem Hörsaal) Erich Schubert, TU Dortmund, Lehrstuhl für ..."
  ],
  [
    "Real-time gender classification using convolutional neural network",
    "This is a small project I did for a blog post. The model was built using Keras. You can read about how I did it at ..."
  ],
  [
    "Convolutional Neural Networks for Interpretation of Coronary Angiography  (CathNet)",
    "Using artificial intelligence to read coronary angiogram: we trained a type of AI/ Computer vision called convolutional neural ..."
  ],
  [
    "5 mins spotlight: Hierarchical Color Learning in Convolutional Neural Networks",
    "CVPR 2020 Workshop, June 15 Minds vs. Machines: How far are we from the common sense of a toddler?"
  ],
  [
    "Super-resolution of fluid flow using physics-informed convolutional neural networks without labels",
    "73rd Annual Meeting of the APS Division of Fluid Dynamics (Virtual). November 22-24, 2020. H. Gao*, L. Sun, J.-X. Wang, ..."
  ],
  [
    "Early Detection of Alzheimer&#39;s Disease With Convolutional Neural Networks",
    ""
  ],
  [
    "What are Convolutional Neural Networks?",
    ""
  ],
  [
    "E11: Convolutional Neural Network #MLReady #30DaysOfML",
    "Convolutional neural networks are a special neural networks architecture adapted to deal with images to do feature extraction ..."
  ],
  [
    "Convolutional neural network(CNN)- Podcast🎧🎤",
    "Hi all, Hope you all enjoy listening to my podcast Thanks for listening :) Keep subscribing :) For more reference ..."
  ],
  [
    "Relevance-Based Compression of Cataract Surgery Videos Using Convolutional Neural Networks",
    "Paper Title: Relevance-Based Compression of Cataract Surgery Videos Using Convolutional Neural Networks Published In: ACM ..."
  ],
  [
    "ICSE&#39;22: Decomposing Convolutional Neural Network into reusable and replaceable modules",
    ""
  ],
  [
    "Lec7 CNN convolutional Neural Network Neural Networks(Arabic) شرح عربي",
    "CNN convolutional Neural Network شرح عربي Shallow vs deep learning Faculty of Computers and Information Sciences Mansura ..."
  ],
  [
    "Convolutional Neural Network Coursera Courses Certification by Andrew NG - DeepLearning.AI",
    "Get Certificate and Details: https://bit.ly/37GnanY ▻Itronix Solutions Free Certified Courses: https://bit.ly/31nzuHa ▻Machine ..."
  ],
  [
    "AriNet: Using 3D Convolutional Neural Networks to Estimate Annual Radiation Intensities",
    "Artificial intelligence and data-driven modeling are becoming more prominent in the building and construction sectors."
  ],
  [
    "Online Signature Verification Based on Convolutional Neural Network CNN -  1Crore Projects",
    "Online Signature Verification Based on Convolutional Neural Network CNN - 1Crore Projects #1croreprojects #beprojects ..."
  ],
  [
    "Research on ECG Classification Method Based on Convolutional Neural Network",
    "Research on ECG Classification Method Based on Convolutional Neural Network --- Authors: Jin, Tao (Heilongjiang University of ..."
  ],
  [
    "Brain Tumor Classification using Convolutional Neural Network | Kaggle Dataset | CNN",
    "datascience #model #kaggle #machinelearning #braintumorprediction #prediction #cnn #deeplearning Code ..."
  ],
  [
    "Predicting the Genre of Music with a Convolutional Neural Network",
    "Abstract Classifying the genre of music is a necessary task for the purposes of organizing a music library and helping people ..."
  ],
  [
    "DeepTracker: Visualizing the Training Process of Convolutional Neural Networks",
    "The author's personal website: http://dongyu.tech More information please refer to the paper: ..."
  ],
  [
    "Artificial and robotic vision - lecture3_2 - convolutional neural networks",
    "Artificial and robotic vision by Eugenio Culurciello Spring 2013 ..."
  ],
  [
    "Machine Learning II: Convolutional Neural Networks",
    ""
  ],
  [
    "Fracture Detection using Convolutional Neural Networks| Python| Techneons",
    "This video presents the Python programming demonstration for fracture detection using Convolutional Neural Networks (CNN)."
  ],
  [
    "Size-free Generalization Bounds for Convolutional Neural Networks",
    "Hanie Sedghi (Google Brain) https://simons.berkeley.edu/talks/tbd-74 Frontiers of Deep Learning."
  ],
  [
    "CS839 Special Topics in Deep Learning: Overview on Convolutional Neural Networks (lecture 2)",
    ""
  ],
  [
    "[CVPR20] Compositional Convolutional Neural Networks: A Deep Net with Innat Robustness to Occlusion",
    "Compositional Convolutional Neural Networks: A Deep Architecture with Robustness to Partial Occlusion, CVPR 2020."
  ],
  [
    "Coding a U-net Convolutional Neural Network in Tensorflow",
    "In this video I walk through how to build the U-net convolutional neural network in Tensorflow. The U-net is used for semantic ..."
  ],
  [
    "BMVA DL 07 Ben Graham   Spatially Sparse Convolutional Neural Networks",
    "The aim of the workshop was to explore not just the areas of computer vision that deep learning can advance, but also how the ..."
  ],
  [
    "Speed Sign Recognition by Convolutional Neural Networks 2",
    "This video show a Speed Sign Detection and Recognition vision application that is uses a Convolutional Neural Network."
  ],
  [
    "U-net Convolutional Neural Network Explained",
    "In this video I walk through the main ideas of the U-net convolutional neural network, how it is used, and what it is used for."
  ],
  [
    "Brain Tumor Detection Using Convolutional Neural Network (CNN) | Python Project With Source Code",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "Object detection with Convolutional Neural Networks",
    "This video is a tutorial about object detection with Convolutional Neural Network. Come in and learn how to build an AI that can ..."
  ],
  [
    "Convolutional Neural Networks: An Overview and Applications",
    "This is the third seminar delivered by Foula Vagena, diiP research associate. More information and material of this seminar is ..."
  ],
  [
    "AI Machine Learning: Convolutional Neural Network (CNN) part 3 : Evaluating and testing model",
    "Artificial intelligence, Machine Learning, CNN, Model testing, model evaluating by loading pre-trained model. We can evaluate ..."
  ],
  [
    "Yash Gupta | Intro to Convolutional Neural Networks | Day 1, Seminar 1",
    "Rewatch Yash Gupta's seminar on Convolutional Neural Networks, presented at the 2020 Hack the Helyx Hackathon."
  ],
  [
    "[ICPR 2020] PROPEL: Probabilistic Parametric Regression Loss for Convolutional Neural Networks",
    "Oral presentation for the paper titled: \"PROPEL: Probabilistic Parametric Regression Loss for Convolutional Neural Networks\" ..."
  ],
  [
    "Convolutional Neural Networks and Semantic Segmentation for Cloud and Ice Detection",
    "Presenter: Prarabdha Ojwaswee Yonzon (United States Military Academy (West Point)) Recent research shows the effectiveness ..."
  ],
  [
    "Multi-channel coronal hole detection with convolutional neural networks - CHRONNOS",
    "Daily coronal hole detections by CHRONNOS from 2010 - 2020."
  ],
  [
    "SIGGRAPH 2018 Fast Forward - Point Convolutional Neural Networks by Extension Operators",
    "Fast forward video for \"Point Convolutional Neural Networks by Extension Operators\", SIGGRAPH 2018. Matan Atzmon, Haggai ..."
  ],
  [
    "Matlab code for Brain Tumor Detection using Convolutional Neural Network",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "Adaptive Distributed Convolutional Neural Network Inference at the Network Edge with ADCNN",
    ""
  ],
  [
    "[CVPR 2020 Oral] High-dimensional Convolutional Neural Networks for Geometric Pattern Recognition",
    ""
  ],
  [
    "[딥러닝] Lecture 4. Convolutional Neural Networks",
    ""
  ],
  [
    "Building a Plant Classification Convolutional Neural Network (8/10)",
    "Brief overview of the Python TensorFlow creation of Convolutional Neural Networks to classify plants Notebook: ..."
  ],
  [
    "PAR 1 : Practical Hands-On Lab with CNN (Convolutional Neural Networks)",
    "data #datascience #machinelearning #artificialintelligence #deeplearning In this tutorial, you will learn a practical hands-on ..."
  ],
  [
    "Sign Language Recognition using Convolutional Neural Networks Project",
    "Initially we will be having a live feed from the video cam and every frame that detects a hand in the ROI(region of interest). Next ..."
  ],
  [
    "Bagging of Convolutional Neural Networks for Diagnostic of Eye Diseases",
    "Mahmoud Smaida and Serhii Yaroshchak The national university of water and Environmental Engineering, Revine, Ukraine Deep ..."
  ],
  [
    "Iris Recognition Using Convolutional Neural Network",
    ""
  ],
  [
    "Deep Learning Projects with PyTorch : Understanding Convolutional Neural Network     | packtpub.com",
    "This video tutorial has been taken from Deep Learning Projects with PyTorch. You can learn more and buy the full video course ..."
  ],
  [
    "041 Annex - Convolutional Neural Networks - part 2",
    ""
  ],
  [
    "MathTalent Machine Learning Sec 9.4 Deep Learning Convolutional Neural Networks CNN",
    "Math is the true talent of life; help students get better math education. Lecture Note: ..."
  ],
  [
    "041 Annex - Convolutional Neural Networks - part 2",
    ""
  ],
  [
    "MathTalent Machine Learning Sec 9.4 Deep Learning Convolutional Neural Networks CNN",
    "Math is the true talent of life; help students get better math education. Lecture Note: ..."
  ],
  [
    "Blind Inpainting Convolutional Neural Network Matlab Code Projects",
    "Contact Best Matlab Simulation Projects Visit us: http://matlabsimulation.com/ ..."
  ],
  [
    "Road Detection using Convolutional Neural Networks",
    "http://lrm.icmc.usp.br/"
  ],
  [
    "1.1 Questions to the Convolutional Neural Networks",
    "Features of Appropriate Dataset, How to load image datasets to the Python? -1-"
  ],
  [
    "See a Convolutional Neural Network layer output with keras",
    "In this notebook you will see how to get the output of a CNN keras model. As an example I picked up the Yolov3 model ..."
  ],
  [
    "Stride in Convolutional Neural Network - CNN - Mathematical Perspective - Deep Learning - #Moein",
    "Click here for full courses and ebooks: Deep Learning: https://www.udemy.com/course/deep-learning-artificial-intelligence/?"
  ],
  [
    "Convolutional Neural Network C++ | Setting Up [1]",
    "In this video, we will set up the project in C++ and upload it to GitHub. Website - http://dprogrammer.org Patreon ..."
  ],
  [
    "Fine-Grained Classification via Deep Convolutional Neural Networks",
    "This video is about Fine-Grained Classification via Deep Convolutional Neural Networks."
  ],
  [
    "Brain Tumour segmentation using Convolutional Neural Network - Matlab|IEEE Projects|Pantechelearning",
    "Project Concept: Automatic defects detection in MR images is very important in many diagnostic and therapeutic applications."
  ],
  [
    "Malware Detection with Convolutional Neural Networks",
    "Welcome to our introductionary about malware detection with Convolutional Neural Networks. We will focus on building a binary ..."
  ],
  [
    "Introduction to Deep Learning - Convolutional Neural Networks - Tutorial 7",
    "In this tutorial, I have discussed: 1. Introduction to CNN 2. Architecture of CNN: input layer, convolutional layers, pooling layers ..."
  ],
  [
    "Machine Learning 10 - Convolutional Neural Networks (Urdu)",
    "Part of the Machine Learning course offered in Urdu. While the course is titled \"Advanced\", it starts from scratch and requires no ..."
  ],
  [
    "Python Image processing - Vehicle detection using Convolutional Neural Network -ClickMyProject",
    "This system addresses the problem of car detection from aerial images using Convolutional Neural Networks (CNNs)."
  ],
  [
    "Image to Image Translation With Convolutional Neural Networks",
    "An introductory to supervised machine learning and image-to-image translation in the field of radiology."
  ],
  [
    "Programming Assignment Solutions | Convolutional Neural Networks in TensorFlow | Coursera | Week 1",
    "Coursera course : Convolutional Neural Networks in TensorFlow. Week 1 Git hub Link ..."
  ],
  [
    "Image Classification Using Convolutional Neural Networks by Quoc-Tuan Truong and Hady W. Lauw",
    "A tutorial conducted on 9 June 2018 by Preferred.AI. The materials can be found at the following link: ..."
  ],
  [
    "Image classification using CNN in Python | CNN in Google Colab | Convolutional neural network in ML",
    "Convolutional neural network (CNN or ConvNet) is a sub-type of Neural Networks in Deep Learning that is primarily used for ..."
  ],
  [
    "Convolutional Neural Network Part 1: The Dense Layer",
    "The GitHub repository for this project: https://github.com/Artur-Galstyan/convolutional-neural-network This is the first video of the ..."
  ],
  [
    "MNIST dataset with Convolutional Neural Networks and PyTorch (with code)",
    "Solving the MNIST (handwritten numbers) dataset with CNN (Convolutional Neural Networks), using Python, OpenCV and ..."
  ],
  [
    "[논문미식회] CV323: Do Vision Transformers See Like Convolutional Neural Networks?",
    ""
  ],
  [
    "Evaluating surgical skills from kinematic data using convolutional neural networks",
    "Video illustrating the method proposed in the paper \"Evaluating surgical skills from kinematic data using convolutional neural ..."
  ],
  [
    "Region Based Convolutional Neural Networks (RCNN) | Best AI Tutorial For Beginners | Henry Harvin",
    "Region Based Convolutional Neural Networks (RCNN) | Best AI Tutorial For Beginners | Henry Harvin Henry Harvin Artificial ..."
  ],
  [
    "Leaf Recognition Using Convolutional Neural Network by Yuan Liu and Jianing Zhao",
    "Machine Learning 2017 final project: Leaf Recognition Using Convolutional Neural Network by Yuan Liu and Jianing Zhao."
  ],
  [
    "Gitta Kutyniok - Spectral Graph Convolutional Neural Networks Do Generalize",
    ""
  ],
  [
    "VGGNet - Convolutional Neural Network - Human Emotions Detection in TensorFlow 2",
    "In this section we continue our human emotions detection project. We shall focus on VGGNet. Previous (Introductory): ..."
  ],
  [
    "Breakthrough Junior Challenge 2021 || Convolutional Neural Network - CNN",
    "breakthroughjuniorchallenge Hello everyone!! My name is Alexi Vion. And I'm going to talk to you about a very important subject ..."
  ],
  [
    "Covid XRay - Prediction using Convolutional Neural Network",
    "Image Processing of Covid X-Ray using Convolution Neural Network in Python Keras and Tensorflow using Kaggle Notebook."
  ],
  [
    "IJCNN 2021 - Comprehensible Convolutional Neural Networks via Guided Concept Learning",
    "Presentation of the paper titled \"Comprehensible Convolutional Neural Networks via Guided Concept Learning\" at IJCNN 2021."
  ],
  [
    "cat vs dog classification using  Deep Convolutional neural networks",
    "Cat vs Dog classification using CNNs with very good accuracy..."
  ],
  [
    "EEG Emotion Recognition Using Dynamical Graph Convolutional Neural Networks",
    ""
  ],
  [
    "What is Stride | Convolutional Neural Networks",
    "In this video, you will learn about what is stride and how works and used in Convolutional Neural Networks In this series of video ..."
  ],
  [
    "Klasifikasi MNIST Handwritten Digit Menggunakan Convolutional Neural Networks (CNN)",
    "Tutorial Deep Learning Untuk Pemula - Convolutional Neural Networks URL Dataset MNIST : http://yann.lecun.com/exdb/mnist/ ..."
  ],
  [
    "Convolutional Neural Network Based Equalizer for Improving the Reliability Performance of OFDM SPM",
    "Convolutional Neural Network Based Equalizer for Improving the Reliability Performance of OFDM with Subcarrier Power ..."
  ],
  [
    "Predicting Dogs and Cats from Images via Convolutional Neural Networks",
    "In this tutorial, we get theoretical understanding of how convolutional neural networks work, and then we train with thousands of ..."
  ],
  [
    "Convolutional Neural Network drives in Trackmania Nations",
    "I've implemented a simple convolutional neural network by using tensorflow and tflearn, that drives on a race track in Trackmania ..."
  ],
  [
    "Visualizing hidden layers in convolutional neural networks in Keras (Python)",
    "This video shows how to visualize hidden layers in a Convolutional Neural Network (CNN) in the Keras Python library. We use the ..."
  ],
  [
    "5-minute:[T-CSVT] T-cnn:Tubelets with convolutional neural networks for object detection from videos",
    "This is the 5-minutes introduction of the following paper: Kang, Kai, et al. \"T-cnn: Tubelets with convolutional neural networks for ..."
  ],
  [
    "Yann LeCun the father of Convolutional Neural Network CNN",
    "Yann LeCun originally spelled Le Cun, born July 8, 1960, is a French-American computer scientist working primarily in the fields ..."
  ],
  [
    "5-minute:[T-CSVT] T-cnn:Tubelets with convolutional neural networks for object detection from videos",
    "This is the 5-minutes introduction of the following paper: Kang, Kai, et al. \"T-cnn: Tubelets with convolutional neural networks for ..."
  ],
  [
    "CNN Vs Visual Cortex | Convolutional Neural Network History  | The Famous Cat Experiment",
    "Artificial intelligence is the simulation of human intelligence processes by machines, especially computer systems. Specific ..."
  ],
  [
    "Beginner&#39;s Guide to Object Detection With Convolutional Neural Networks",
    "Learn how to build Object Detectors in Tensorflow using Convolutional Neural Networks (CNNs). In this Beginners Machine ..."
  ],
  [
    "Convolutional neural networks backpropagation derivation",
    "Convolutional neural networks backpropagation derivation full."
  ],
  [
    "EmguCV # 66 Convolutional Neural Network for Digit Recognition",
    "This tutorial shows how to use a pretrained Convolutional Neural Network for Digit Recognition (CNN) for digit recognition using ..."
  ],
  [
    "Prosthetic Arm Using EEG Control Signal Based On Deep Convolutional neural network",
    "The goal of our graduation project is to enable amputee people to easily interact with their environments via an AI-enabled ..."
  ],
  [
    "Skin Disease Detection Using CNN Convolutional Neural Network || Python OpenCV Project Source Code",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "Lecture 5 - Advanced Convolutional Neural Networks",
    "https://docs.google.com/presentation/d/1d6m_ZRgkXR84luDVGcDV3PsfT16uUR6rr31nDIgphIQ/edit#slide=id."
  ],
  [
    "PAR 2 : Practical Hands-On Lab with CNN (Convolutional Neural Networks)",
    "data #datascience #machinelearning #artificialintelligence #deeplearning In this tutorial, you will learn a practical hands-on ..."
  ],
  [
    "Complete CNN Project in Python Programming - Convolutional Neural Network - Deep Learning - #Moein",
    "Click here for full courses and ebooks: Deep Learning: https://www.udemy.com/course/deep-learning-artificial-intelligence/?"
  ],
  [
    "Drowsy driver detection system: convolutional neural networks in action",
    "Drowsy driver detection system based on image recognition and convolutional neural networks. Developed by Juan Pablo ..."
  ],
  [
    "19 - Deep convolutional neural networks",
    "How do neural networks become \"deep\" enough to solve state-of-the-art perception tasks? Learn more about the Duckietown ..."
  ],
  [
    "BITS-DeepLearning2022Jan-Lecture-19: Convolutional Neural Networks (CNN)",
    ""
  ],
  [
    "EmguCV # 66 Convolutional Neural Network for Digit Recognition",
    "This tutorial shows how to use a pretrained Convolutional Neural Network for Digit Recognition (CNN) for digit recognition using ..."
  ],
  [
    "CS839 Special Topics in Deep Learning: Overview on Convolutional Neural Networks (lecture 2)",
    ""
  ],
  [
    "R Tutorial 31: Convolutional Neural Network (CNN) in R using Keras from Python for Image Recognition",
    "This video is going to show how to construct Convolutional Neural Network (CNN) in R using Keras from Python for image ..."
  ],
  [
    "Pneumonia Analysis using Convolutional Neural Networks, Tensorflow, Keras and Python",
    "This video shows an instance where neural networks can be used to help COVID 19 which is a worldwide problem. In this video ..."
  ],
  [
    "Introduction to Deep Learning - Convolutional Neural Networks - Tutorial 7",
    "In this tutorial, I have discussed: 1. Introduction to CNN 2. Architecture of CNN: input layer, convolutional layers, pooling layers ..."
  ],
  [
    "Convolutional Neural Network drives in Trackmania Nations",
    "I've implemented a simple convolutional neural network by using tensorflow and tflearn, that drives on a race track in Trackmania ..."
  ],
  [
    "MathTalent Machine Learning Sec 9.4 Deep Learning Convolutional Neural Networks CNN",
    "Math is the true talent of life; help students get better math education. Lecture Note: ..."
  ],
  [
    "Classification of COVID-19 chest X-ray images using Convolutional Neural Networks (CNN)",
    "In this project, we take Chest X-ray images as the input and a CNN model is implemented on it to obtain the result as infected or ..."
  ],
  [
    "Complete CNN Project in Python Programming - Convolutional Neural Network - Deep Learning - #Moein",
    "Click here for full courses and ebooks: Deep Learning: https://www.udemy.com/course/deep-learning-artificial-intelligence/?"
  ],
  [
    "Evrişimli Sinir Ağları (Convolutional Neural Networks — CNN)  Çalışma Mantığı, Yapısı , Tarihi",
    "Videodaki yazım: ..."
  ],
  [
    "Convolutional Neural Networks and Semantic Segmentation for Cloud and Ice Detection",
    "Presenter: Prarabdha Ojwaswee Yonzon (United States Military Academy (West Point)) Recent research shows the effectiveness ..."
  ],
  [
    "Arch &amp; AI: 3D Graph Convolutional Neural Networks in Architecture Design",
    "This research started with a simple question: How can we train a machine, specifically some type of neural network, to understand ..."
  ],
  [
    "How to train Convolutional Neural Networks #CNN  Deep learning model",
    ""
  ],
  [
    "Convolutional Neural Network Based Equalizer for Improving the Reliability Performance of OFDM SPM",
    "Convolutional Neural Network Based Equalizer for Improving the Reliability Performance of OFDM with Subcarrier Power ..."
  ],
  [
    "1.1 Questions to the Convolutional Neural Networks",
    "Features of Appropriate Dataset, How to load image datasets to the Python? -1-"
  ],
  [
    "Thalamus Segmentation Using Convolutional Neural Network | SPIE 2021",
    "Shangxian Wang presenting \"Thalamus Segmentation Using Convolutional Neural Network\" at SPIE Medical Imaging (SPIE-MI ..."
  ],
  [
    "Convolutional Neural Network 4 : Max Pooling &amp; Avg Pooling",
    "In this video you will learn about different types of pooling layer in CNN and how pooling layer is able to reduce the dimensions of ..."
  ],
  [
    "Breakthrough Junior Challenge 2021 || Convolutional Neural Network - CNN",
    "breakthroughjuniorchallenge Hello everyone!! My name is Alexi Vion. And I'm going to talk to you about a very important subject ..."
  ],
  [
    "CNN Vs Visual Cortex | Convolutional Neural Network History  | The Famous Cat Experiment",
    "Artificial intelligence is the simulation of human intelligence processes by machines, especially computer systems. Specific ..."
  ],
  [
    "Image Steganalysis based on Pretrained Convolutional Neural Networks",
    "18th IEEE Colloquium on Signal Processing and its Applications (CSPA2022)"
  ],
  [
    "80 Artificial Intelligence - Convolutional Neural Networks | Datajango",
    "Artificial Intelligence - Convolutional Neural Networks Industry Driven Artificial Intelligence (AI) Course by Venkata Ramaraju ..."
  ],
  [
    "Automatic Polyp Segmentation Using Convolutional Neural Networks",
    "Sara Hosseinzadeh Kassani (University of Saskatchewan), Peyman Hosseinzadeh Kassani (University of Tulane), Michal J."
  ],
  [
    "See a Convolutional Neural Network layer output with keras",
    "In this notebook you will see how to get the output of a CNN keras model. As an example I picked up the Yolov3 model ..."
  ],
  [
    "Leaf Recognition Using Convolutional Neural Network by Yuan Liu and Jianing Zhao",
    "Machine Learning 2017 final project: Leaf Recognition Using Convolutional Neural Network by Yuan Liu and Jianing Zhao."
  ],
  [
    "041 Annex - Convolutional Neural Networks - part 2",
    ""
  ],
  [
    "Lecture 5 - Advanced Convolutional Neural Networks",
    "https://docs.google.com/presentation/d/1d6m_ZRgkXR84luDVGcDV3PsfT16uUR6rr31nDIgphIQ/edit#slide=id."
  ],
  [
    "Skin Disease Detection Using CNN Convolutional Neural Network || Python OpenCV Project Source Code",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "PR-201: Bag of Tricks for Image Classification with Convolutional Neural Networks",
    "Paper review: \"Bag of Tricks for Image Classification with Convolutional Neural Networks\" by Tong He, Zhi Zhang, Hang Zhang, ..."
  ],
  [
    "Image Classification and Feature extraction via Convolutional Neural Networks by dr arshad afridi",
    "The lecture content explains Image Classification and Feature extraction by Convolutional Neural Networks. The following topics ..."
  ],
  [
    "Hybrid Pooling with Wavelets for Convolutional Neural Networks",
    "The need to detect and classify objects correctly is a constant challenge, being able to recognize them at different scales and ..."
  ],
  [
    "Learning Multi-Domain Convolutional Neural Networks for Visual Tracking (MDNet)",
    "Hyeonseob Nam and Bohyung Han, Learning Multi-Domain Convolutional Neural Networks for Visual Tracking, CoRR, ..."
  ],
  [
    "Convolutional Neural Networks Based Active SLAM and Explorations",
    "Mobile robots are high-performance robots that are used to perform a specific function in environments such as land, air and water ..."
  ],
  [
    "Plant Leaf Disease Detection Using Convolutional Neural Network (CNN) Python Neural Network Project",
    "Subscribe to our channel to get this project directly on your email Download this full project with Source Code from ..."
  ],
  [
    "Prosthetic Arm Using EEG Control Signal Based On Deep Convolutional neural network",
    "The goal of our graduation project is to enable amputee people to easily interact with their environments via an AI-enabled ..."
  ],
  [
    "Yann LeCun the father of Convolutional Neural Network CNN",
    "Yann LeCun originally spelled Le Cun, born July 8, 1960, is a French-American computer scientist working primarily in the fields ..."
  ],
  [
    "5-minute:[T-CSVT] T-cnn:Tubelets with convolutional neural networks for object detection from videos",
    "This is the 5-minutes introduction of the following paper: Kang, Kai, et al. \"T-cnn: Tubelets with convolutional neural networks for ..."
  ],
  [
    "AddressNet  Shift based Primitives for Efficient Convolutional Neural Networks",
    "WACV 2019, https://arxiv.org/pdf/1809.08458.pdf."
  ],
  [
    "Minute Article : Convolutional Neural Network CNN - Madhavi Desai #technology #informationtechnology",
    "A minute briefing on Convolutional Neural Network #minutearticle So watch this video till the End if you like the video give it a big ..."
  ],
  [
    "Multi-channel coronal hole detection with convolutional neural networks - SCAN",
    "Daily coronal hole detections for the last two months of each year from 2010 to 2019."
  ],
  [
    "Convolutional Neural Networks (CNNs) - Part 1 | Third Nepal Winter School in AI | Day 3 (2021)",
    "Nripesh Parajuli, a machine learning engineer at Caption Health, San Francisco and a former PhD researcher at Yale University, ..."
  ],
  [
    "Convolutional neural network step by step (6) -  Forward propagation 2 | مشروع بايثون: خطوة بخطوة",
    "Convolutional neural network step by step (6) - Forward propagation 2 | خطوة بخطوة Abdulaziz Alswaji Twitter: ..."
  ],
  [
    "IAIS Paper Reading Series# 3 | Graph Convolutional Neural Networks for Web-Scale Recommender Systems",
    "Graph Convolutional Neural Networks for Web-Scale Recommender System."
  ],
  [
    "An excellent illustration of How CNN(Convolutional Neural Networks) works",
    ""
  ],
  [
    "Quanquan Gu: Benign Overfitting in Two-layer Convolutional Neural Networks",
    "American Statistical Association (ASA), Section on Statistical Learning and Data Science (SLDS) May webinar: Benign Overfitting ..."
  ],
  [
    "SIGGRAPH 2018 Fast Forward - Point Convolutional Neural Networks by Extension Operators",
    "Fast forward video for \"Point Convolutional Neural Networks by Extension Operators\", SIGGRAPH 2018. Matan Atzmon, Haggai ..."
  ],
  [
    "CNN in Malayalam - Deep Learning Part 31 - Convolution to Neural Network",
    "How convolution happens in Neural Network explained in Malayalam. Deep Learning in Malayalam."
  ],
  [
    "ATAL AICTE Sponsored  FDP Day-11 | Convolution Neural Networks for Hand Digit Recognition",
    "ATAL AICTE Sponsored FDP Day-11 | Convolution Neural Networks for Hand Digit Recognition ..."
  ],
  [
    "CNN for semantic tumor segmentaion using MATLAB",
    "CNN for semantic tumor segmentaion using MATLAB #PHDRESEARCH #RESEARCH #PHD #THESIS #Simulink #JOURNAL ..."
  ]
]