[
  [
    "DeepLearningAI",
    "Welcome to the official DeepLearning.AI YouTube channel! Here you can find the videos from our Coursera programs on machine ..."
  ],
  [
    "Deep Learning In 5 Minutes | What Is Deep Learning? | Deep Learning Explained Simply | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Complete Deep Learning",
    ""
  ],
  [
    "Deep Learning With Tensorflow 2.0, Keras and Python",
    "This playlist is a complete course on deep learning designed for beginners. All you need to know is a bit about python, pandas, ..."
  ],
  [
    "Deep Learning Indepth Tutorials In 5 Hours With Krish Naik",
    "Please get all the materials and pdfs in the below link which is for free."
  ],
  [
    "Introduction to Deep Learning Explained in Hindi l Deep Learning Course",
    "AI vs ML vs DL https://youtu.be/Z27llwBA0Uw Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l ..."
  ],
  [
    "What is Deep Learning? (in 5 Minutes) 🔥🔥",
    "What is deep learning? How is it different from AI. Is ML and DL the same thing? I will answer all these questions in an easy and ..."
  ],
  [
    "MIT 6.S191: Introduction to Deep Learning",
    "Course lectures for MIT Introduction to Deep Learning. http://introtodeeplearning.com."
  ],
  [
    "What is Deep Learning? Deep Learning Vs Machine Learning | Complete Deep Learning Course",
    "0:00 Intro 1:52 Deep Learning Definition 1 13:17 Deep Learning Definition 2 20:00 Deep Learning Vs Machine Learning 34:45 ..."
  ],
  [
    "Deep Learning Full Course - Learn Deep Learning in 6 Hours | Deep Learning Tutorial | Edureka",
    "AI & Deep Learning with TensorFlow (Use Code \"YOUTUBE20\"): https://www.edureka.co/ai-deep-learning-with-tensorflow ..."
  ],
  [
    "But what is a neural network? | Chapter 1, Deep learning",
    "What are the neurons, why are there layers, and what is the math underlying it? Help fund future projects: ..."
  ],
  [
    "Introduction to Deep Learning: Machine Learning vs. Deep Learning",
    "Learn about the differences between deep learning and machine learning in this MATLAB® Tech Talk. - MATLAB for Deep ..."
  ],
  [
    "Deep Learning Crash Course for Beginners",
    "Learn the fundamental concepts and terminology of Deep Learning, a sub-branch of Machine Learning. This course is designed ..."
  ],
  [
    "Deep Learning Basics: Introduction and Overview",
    "An introductory lecture for MIT course 6.S094 on the basics of deep learning including a few key ideas, subfields, and the big ..."
  ],
  [
    "100 Days of Deep Learning",
    "A complete end-to-end playlist on Deep Learning where topics like ANN, CNN, and RNN are covered."
  ],
  [
    "Machine Learning vs Deep Learning",
    "What is Machine Learning → http://ibm.biz/machine-learning-is-simple What is Deep Learning ..."
  ],
  [
    "Day 1- Live  Deep Learning Community Session",
    "Enroll for free in the below link to get all the videos and materials https://ineuron.ai/course/Deep-Learning-Foundations Our ..."
  ],
  [
    "Artificial Intelligence Vs Machine Learning Vs Deep Learning l AI vs ML vs DL l Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Deep Learning - Computerphile",
    "Google, Facebook & Amazon all use deep learning methods, but how does it work? Research Fellow & Deep Learning Expert ..."
  ],
  [
    "Deep Learning — Andreas Geiger",
    "Lecture: Deep Learning (Prof. Andreas Geiger, University of Tübingen) Course Website with Slides, Lecture Notes, Problems and ..."
  ],
  [
    "Machine Learning Explained in 100 Seconds",
    "Machine Learning is the process of teaching a computer how perform a task with out explicitly programming it. The process feeds ..."
  ],
  [
    "What is Deep Learning? | Introduction to Deep Learning | Deep Learning Tutorial | Simplilearn",
    "This Deep Learning tutorial will help you in understanding what is Deep learning, why do we need Deep learning, applications of ..."
  ],
  [
    "Deep Learning",
    ""
  ],
  [
    "Neural Network In 5 Minutes | What Is A Neural Network? | How Neural Networks Work | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Neural Network Architectures &amp; Deep Learning",
    "This video describes the variety of neural network architectures available to solve various problems in science ad engineering."
  ],
  [
    "Deep Learning - Computerphile",
    "Deep Learning with Convolutional Neural Networks - Dr Mike Pound explains. CNN background: https://youtu.be/py5byOOHZM8 ..."
  ],
  [
    "What is Deep Learning | Deep Learning Simplified | Deep Learning Tutorial | Edureka",
    "Tensorflow Training (Use Code \"YOUTUBE20\") - https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka ..."
  ],
  [
    "Neural Networks Pt. 1: Inside the Black Box",
    "Neural Networks are one of the most popular Machine Learning algorithms, but they are also one of the most poorly understood."
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "Intro to Machine Learning (ML Zero to Hero - Part 1)",
    "Machine Learning represents a new paradigm in programming, where instead of programming explicit rules in a language such ..."
  ],
  [
    "Artificial Intelligence Class 10 Ch 1 |AI vs Machine Learning vs Deep Learning (Differences) 2022-23",
    "Previous Video:- https://www.youtube.com/watch?v=nhOfB9n938M Next Video:- https://www.youtube.com/watch?v=csgjT73S7b4 ..."
  ],
  [
    "PyTorch for Deep Learning &amp; Machine Learning – Full Course",
    "Learn PyTorch for deep learning in this comprehensive course for beginners. PyTorch is a machine learning framework written in ..."
  ],
  [
    "DeepMind x UCL | Deep Learning Lecture Series 2021",
    "The Deep Learning Lecture Series is a collaboration between DeepMind and the UCL Centre for Artificial Intelligence."
  ],
  [
    "Backpropagation calculus | Chapter 4, Deep learning",
    "Help fund future projects: https://www.patreon.com/3blue1brown An equally valuable form of support is to simply share some of ..."
  ],
  [
    "Deep Learning Systems Course",
    "This is the YouTube channel for our online Deep Learning Systems: Algorithms and Implementation course. All lecture videos will ..."
  ],
  [
    "Deep Learning for NLP at Oxford with Deep Mind 2017",
    "This playlist contains the lecture videos for the Deep Natural Language Processing course offered in Hilary Term 2017 at the ..."
  ],
  [
    "What is Machine Learning?",
    "What is Machine Learning and how does it work: Many people who hear about machine learning often think of it as magic. In this ..."
  ],
  [
    "How Did I Learn Deep Learning in 2.5 months?",
    "Please join as a member in my channel to get additional benefits like materials in Data Science, live streaming for Members and ..."
  ],
  [
    "Transfer Learning | Deep Learning Tutorial 27 (Tensorflow, Keras &amp; Python)",
    "Transfer learning is a very important concept in the field of computer vision and natural language processing. Using transfer ..."
  ],
  [
    "AI VS ML VS DL VS Data Science",
    "Please do subscribe my vlogging channel for motivational videos ..."
  ],
  [
    "Advice for machine learning beginners | Andrej Karpathy and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=cdiD-9MMpb0 Please support this podcast by checking out ..."
  ],
  [
    "Computer Scientist Explains Machine Learning in 5 Levels of Difficulty | WIRED",
    "WIRED has challenged computer scientist and Hidden Door cofounder and CEO Hilary Mason to explain machine learning to 5 ..."
  ],
  [
    "Biology Deep Learning Dr Vikash Bhardwaj ",
    "Welcome to my channel Deep Learning Biology Here i am going to help you to learn fundamental concepts of Lifescience so that ..."
  ],
  [
    "Simple explanation of convolutional neural network | Deep Learning Tutorial 23 (Tensorflow &amp; Python)",
    "A very simple explanation of convolutional neural network or CNN or ConvNet such that even a high school student can ..."
  ],
  [
    "Deep Learning Explainer",
    "I make videos to explain deep learning, natural language processing papers in this channel every week."
  ],
  [
    "Andrew Ng: Advice on Getting Started in Deep Learning | AI Podcast Clips",
    "Full episode with Andrew Ng (Feb 2020): https://www.youtube.com/watch?v=0jspaMLxBig Clips channel (Lex Clips): ..."
  ],
  [
    "Deep Learning -Part-2 | How Neural Network Functions? | Deep Learning Applications | Malayalam",
    "deeplearning Explaining What are the neurons, why are there hidden layers, and how the entire deep learning process taking ..."
  ],
  [
    "8 Deep Learning FAQ answered in 8 minutes | Deep Learning interview questions and answers",
    "8 Deep Learning FAQ answered in 8 minutes | Deep Learning interview questions and answers #DeepLearningFAQ ..."
  ],
  [
    "Why Python is popular for machine learning",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=-DVyjdw4t9I Please support this podcast by checking out ..."
  ],
  [
    "Gradient descent, how neural networks learn | Chapter 2, Deep learning",
    "Enjoy these videos? Consider sharing one or two. Help fund future projects: https://www.patreon.com/3blue1brown Special thanks ..."
  ],
  [
    "Intro to Machine Learning (ML Zero to Hero - Part 1)",
    "Machine Learning represents a new paradigm in programming, where instead of programming explicit rules in a language such ..."
  ],
  [
    "Deep Learning Interview Questions and Answers | AI &amp; Deep Learning Interview Questions | Edureka",
    "AI and Deep-Learning with TensorFlow - https://www.edureka.co/ai-deep-learning-with-tensorflow ** This video covers most of the ..."
  ],
  [
    "Machine Learning basics",
    "When you think of Machine Learning, what do you think of? Learn what Machine Learning is, how computers find patterns, and ..."
  ],
  [
    "What is the Difference Between Deep Learning and Machine Learning?",
    "When talking about artificial intelligence (AI), deep learning and machine learning are invariably mentioned in the same breath."
  ],
  [
    "Machine Learning vs Deep Learning in Telugu",
    "GitHub link: https://github.com/kiransagar1 Instagram-link: https://www.instagram.com/pythonlifetelugu/?hl=en Facebook link: ..."
  ],
  [
    "AI vs Machine Learning vs Deep Learning | Machine Learning Training with Python | Edureka",
    "NIT Warangal Post Graduate Diploma on AI and Machine Learning: ..."
  ],
  [
    "Artificial Intelligence vs Machine Learning vs Deep Learning",
    "Artificial Intelligence vs Machine Learning vs Deep Learning | AI vs ML vs DL ♂️ My name is Reedhima Bakshi and I am a ..."
  ],
  [
    "Machine Learning Zero to Hero (Google I/O&#39;19)",
    "This is a talk for people who know code, but who don't necessarily know machine learning. Learn the 'new' paradigm of machine ..."
  ],
  [
    "Keep Calm and Learn Deep Learning | Tadeo Corradi | TEDxBeechenCliffSchool",
    "The role of deep learning in the development of artificial intelligence. This talk was given at a TEDx event using the TED ..."
  ],
  [
    "Neural Networks and Deep Learning: Crash Course AI #3",
    "You can learn more about CuriosityStream at https://curiositystream.com/crashcourse. Today, we're going to combine the artificial ..."
  ],
  [
    "Learn Deep Learning with Andrew Trask: Grokking Deep Learning",
    "Visit https://brilliant.org/PythonProgrammer/ to get started for free and get 20% off your annual subscription. Thanks to Brilliant for ..."
  ],
  [
    "How Deep Neural Networks Work - Full Course for Beginners",
    "Even if you are completely new to neural networks, this course will get you comfortable with the concepts and math behind them."
  ],
  [
    "What is a neuron? | Deep Learning Tutorial 3 (Tensorflow Tutorial, Keras &amp; Python)",
    "In this video, we will see how you can think of a logistic regression as a neuron. We will use insurance dataset as a sample and ..."
  ],
  [
    "Deep Learning with Python, TensorFlow, and Keras tutorial",
    "An updated deep learning introduction using Python, TensorFlow, and Keras. Text-tutorial and notes: ..."
  ],
  [
    "Artificial Intelligence Class 10 Ch 1 |AI vs Machine Learning vs Deep Learning (Differences) 2022-23",
    "Previous Video:- https://www.youtube.com/watch?v=nhOfB9n938M Next Video:- https://www.youtube.com/watch?v=csgjT73S7b4 ..."
  ],
  [
    "Applications of Deep Neural Networks Course Overview (1.1, Fall 2022)",
    "Fall 2022 Version. Applications of deep neural networks is a course offered in a hybrid format by Washington University in St."
  ],
  [
    "Day 4-Practical ANN Impementation| Live Deep Learning Community Session",
    "Enroll for free in the below link to get all the videos and materials https://ineuron.ai/course/Deep-Learning-Foundations Live Deep ..."
  ],
  [
    "Deep Learning: Long Short-Term Memory Networks (LSTMs)",
    "This video is a part of an online course that provides a comprehensive introduction to practial machine learning methods using ..."
  ],
  [
    "Deep Learning Systems Course",
    "This is the YouTube channel for our online Deep Learning Systems: Algorithms and Implementation course. All lecture videos will ..."
  ],
  [
    "MIT 6.S191: Deep Learning New Frontiers",
    "MIT Introduction to Deep Learning 6.S191: Lecture 6 Deep Learning Limitations and New Frontiers Lecturer: Ava Soleimany ..."
  ],
  [
    "All Machine Learning Models Explained in 5 Minutes | Types of ML Models Basics",
    "Confused about understanding machine learning models? Well, this video will help you grab the basics of each one of them."
  ],
  [
    "PyTorch for Deep Learning &amp; Machine Learning – Full Course",
    "Learn PyTorch for deep learning in this comprehensive course for beginners. PyTorch is a machine learning framework written in ..."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "ICLR 2021 Keynote - &quot;Geometric Deep Learning: The Erlangen Programme of ML&quot; - M Bronstein",
    "Geometric Deep Learning: The Erlangen Programme of ML - ICLR 2021 Keynote by Michael Bronstein (Imperial College London ..."
  ],
  [
    "Backpropagation calculus | Chapter 4, Deep learning",
    "Help fund future projects: https://www.patreon.com/3blue1brown An equally valuable form of support is to simply share some of ..."
  ],
  [
    "How Did I Learn Deep Learning in 2.5 months?",
    "Please join as a member in my channel to get additional benefits like materials in Data Science, live streaming for Members and ..."
  ],
  [
    "Machine Learning Fundamentals: Bias and Variance",
    "Bias and Variance are two fundamental concepts for Machine Learning, and their intuition is just a little different from what you ..."
  ],
  [
    "What&#39;s the Difference Between AI, Machine Learning, and Deep Learning?",
    "With AI thrown around as a buzzword these days, it's important to have a solid understanding of what artificial intelligence actually ..."
  ],
  [
    "Deep Learning for NLP at Oxford with Deep Mind 2017",
    "This playlist contains the lecture videos for the Deep Natural Language Processing course offered in Hilary Term 2017 at the ..."
  ],
  [
    "Derivatives | Deep Learning Tutorial 9 (Tensorflow Tutorial, Keras &amp; Python)",
    "Derivatives and partial derivatives are important concepts that we need to understand in order to gain knowledge on how neural ..."
  ],
  [
    "Loss or Cost Function | Deep Learning Tutorial 11 (Tensorflow Tutorial, Keras &amp; Python)",
    "Loss or a cost function is an important concept we need to understand if you want to grasp how a neural network trains itself."
  ],
  [
    "AI VS ML VS DL VS Data Science",
    "Please do subscribe my vlogging channel for motivational videos ..."
  ],
  [
    "Deep Learning for Turbulence Closure Modeling",
    "Machine learning, and in particular deep neural networks, are currently revolutionizing how we model turbulent fluid dynamics."
  ],
  [
    "Deep Learning - 1 | Introduction | Sinhala",
    "Deep Learning - 1 | Introduction | Sinhala Deep learning is part of a broader family of machine learning methods based on ..."
  ],
  [
    "Why You Should NOT Learn Machine Learning!",
    "Everyone tells you why you should be learning machine learning. It is the next 'big thing' after all. But in this video I'm going to be ..."
  ],
  [
    "Deep Learning Vs Machine Learning | AI Vs Machine Learning Vs Deep Learning",
    "Deep Learning Vs Machine Learning | AI Vs Machine Learning Vs Deep Learning ..."
  ],
  [
    "Deep Learning for Recommender Systems (Nick Pentreath)",
    "Nick Pentreath, a Principal Engineer at IBM, explains how in the last few years, deep learning has achieved significant success in ..."
  ],
  [
    "Geospatial Deep Learning with ArcGIS",
    "Deep Learning is an AI technique that uses deep neural networks to solve complex problems. One area of AI where Deep ..."
  ],
  [
    "Biology Deep Learning Dr Vikash Bhardwaj ",
    "Welcome to my channel Deep Learning Biology Here i am going to help you to learn fundamental concepts of Lifescience so that ..."
  ],
  [
    "Artificial Intelligence (AI) vs Machine Learning vs Deep Learning vs Data Science",
    "Artificial intelligence is a field where set of techniques are used to make computers as smart as humans. There are certain tasks ..."
  ],
  [
    "Transfer Learning | Deep Learning Tutorial 27 (Tensorflow, Keras &amp; Python)",
    "Transfer learning is a very important concept in the field of computer vision and natural language processing. Using transfer ..."
  ],
  [
    "Build your own Deep learning Machine - What you need to know",
    "This video talks about what you need to know when sourcing parts to build your own deep learning machine similar Lambda Labs ..."
  ],
  [
    "Advice for machine learning beginners | Andrej Karpathy and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=cdiD-9MMpb0 Please support this podcast by checking out ..."
  ],
  [
    "Computer Scientist Explains Machine Learning in 5 Levels of Difficulty | WIRED",
    "WIRED has challenged computer scientist and Hidden Door cofounder and CEO Hilary Mason to explain machine learning to 5 ..."
  ],
  [
    "AWS Deep Learning Containers | Amazon Web Services",
    "AWS Deep Learning Containers (AWS DLCs) are Docker images pre-installed with deep learning frameworks to make it easy to ..."
  ],
  [
    "Most Research in Deep Learning is a Total Waste of Time - Jeremy Howard | AI Podcast Clips",
    "This is a clip from a conversation with Jeremy Howard on the Artificial Intelligence podcast. You can watch the full conversation ..."
  ],
  [
    "What Are GANs? | Generative Adversarial Networks Tutorial | Deep Learning Tutorial | Simplilearn",
    "Generative Adversarial Network are very popular in the field of Deep Learning. In this video, you will learn what GANs are and ..."
  ],
  [
    "Can deep learning predict the stock market?",
    "Check out my follow-up video where I explain how some financial market crashes can be predicted: https://youtu.be/6x4-GcIFDlM."
  ],
  [
    "Day 5-Understanding CNN &amp;Impementation| Live Deep Learning Community Session",
    "Enroll for free in the below link to get all the videos and materials https://ineuron.ai/course/Deep-Learning-Foundations Live Deep ..."
  ],
  [
    "10 Deep Learning Projects (Beginner &amp; Advanced)",
    "In this video I show you 10 deep learning projects from beginner to advanced that you can do with TensorFlow or PyTorch."
  ],
  [
    "FastAPI for Machine Learning: Live coding an ML web application.",
    "Welcome! Join us for a live workshop where you can follow along with the creator of FastAPI Sebastián Ramírez to build your very ..."
  ],
  [
    "What Are GANs? | Generative Adversarial Networks Tutorial | Deep Learning Tutorial | Simplilearn",
    "Generative Adversarial Network are very popular in the field of Deep Learning. In this video, you will learn what GANs are and ..."
  ],
  [
    "Why Python is popular for machine learning",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=-DVyjdw4t9I Please support this podcast by checking out ..."
  ],
  [
    "AWS Deep Learning Containers | Amazon Web Services",
    "AWS Deep Learning Containers (AWS DLCs) are Docker images pre-installed with deep learning frameworks to make it easy to ..."
  ],
  [
    "Can deep learning predict the stock market?",
    "Check out my follow-up video where I explain how some financial market crashes can be predicted: https://youtu.be/6x4-GcIFDlM."
  ],
  [
    "How to Choose an NVIDIA GPU for Deep Learning in 2021: Quadro, Ampere, GeForce Compared",
    "If you are thinking about buying one... or two... GPUs for your deep learning computer, you must consider options like Ampere, ..."
  ],
  [
    "Deep Learning Explainer",
    "I make videos to explain deep learning, natural language processing papers in this channel every week."
  ],
  [
    "Stanford CS229: Machine Learning Course, Lecture 1 - Andrew Ng (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2Ze53pq ..."
  ],
  [
    "MIT 6.S191 (2021): Recurrent Neural Networks",
    "MIT Introduction to Deep Learning 6.S191: Lecture 2 Recurrent Neural Networks Lecturer: Ava Soleimany January 2021 For all ..."
  ],
  [
    "Chain Rule | Deep Learning Tutorial 15 (Tensorflow2.0, Keras &amp; Python)",
    "This video gives a very simple explanation of a chain rule that is used while training a neural network. Chain rule is something that ..."
  ],
  [
    "DIY Machine Learning, Deep Learning, &amp; AI projects",
    "Want to build your own AI power projects? Here are a few projects to hone your skills on!"
  ],
  [
    "Build your own Deep learning Machine - What you need to know",
    "This video talks about what you need to know when sourcing parts to build your own deep learning machine similar Lambda Labs ..."
  ],
  [
    "Day 5-Understanding CNN &amp;Impementation| Live Deep Learning Community Session",
    "Enroll for free in the below link to get all the videos and materials https://ineuron.ai/course/Deep-Learning-Foundations Live Deep ..."
  ],
  [
    "10 Deep Learning Projects (Beginner &amp; Advanced)",
    "In this video I show you 10 deep learning projects from beginner to advanced that you can do with TensorFlow or PyTorch."
  ],
  [
    "Quantum Deep Learning",
    "PennyLane lead developer Nathan Killoran shares some insights on the connections between deep learning and quantum ..."
  ],
  [
    "Minimum Laptop Configuration To Start With Machine Learning And Deep Learning💻💻💻💻💻💻",
    "Subscribe my vlogging channel https://www.youtube.com/channel/UCjWY5hREA6FFYrthD0rZNIw Please donate if you want to ..."
  ],
  [
    "Wide &amp; Deep Learning: Memorization + Generalization with TensorFlow (TensorFlow Dev Summit 2017)",
    "Wide models are great for memorization, deep models are great for generalization — why not combine them to create even better ..."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "#60 Geometric Deep Learning Blueprint (Special Edition)",
    "Patreon: https://www.patreon.com/mlst Discord: https://discord.gg/ESrGqhf5CB \"Symmetry, as wide or narrow as you may define ..."
  ],
  [
    "Most Research in Deep Learning is a Total Waste of Time - Jeremy Howard | AI Podcast Clips",
    "This is a clip from a conversation with Jeremy Howard on the Artificial Intelligence podcast. You can watch the full conversation ..."
  ],
  [
    "Transformers Neural Networks Explained | NLP with Deep Learning | Deep Learning Course | Edureka",
    "Edureka Tensorflow Training (Use Code \"YOUTUBE20\"): https://www.edureka.co/ai-deep-learning-with-tensorflow This ..."
  ],
  [
    "The Neural Network, A Visual Introduction | Visualizing Deep Learning, Chapter 1",
    "A visual introduction to the structure of an artificial neural network. More to come! Support me on Patreon!"
  ],
  [
    "Why Choose Deep Learning? | Deep Learning for Engineers, Part 1",
    "This video introduces deep learning from the perspective of solving practical engineering problems. The goal is to provide an ..."
  ],
  [
    "Making music using new sounds generated with machine learning",
    "NSynth Super is an open source experimental instrument. It gives musicians the ability to explore completely new sounds ..."
  ],
  [
    "March 2021 CACM: Understanding Deep Learning (Still) Requires Rethinking Generalization",
    "Chiyuan Zhang discusses \"Understanding Deep Learning (Still) Requires Rethinking Generalization,\" a Research Highlights ..."
  ],
  [
    "Is the New NVIDIA GeForce RTX 3060 a Good Deep Learning GPU?",
    "On February 25, 2021, NVIDIA will release the new RTX 3060 GPU, with 16 GB of GPU RAM this looks to be a good option for ..."
  ],
  [
    "Convolution padding and stride | Deep Learning Tutorial 25 (Tensorflow2.0, Keras &amp; Python)",
    "In this video we will cover what is padding and stride in convolution operation. Padding allows corner pixels in image to ..."
  ],
  [
    "Data Scientist vs Machine Learning Engineer | DS vs ML",
    "Data science and machine learning field is growing exponentially in recent times. In this video I will be explaining the difference ..."
  ],
  [
    "Quantum Machine Learning Explained",
    "IBM Quantum Computing Roadmap → https://ibm.biz/BdPzaR Quantum computers have the potential to solve certain classes of ..."
  ],
  [
    "Why Deep Learning Now? | AI Revolution Documentary",
    "Learn more: https://developer.movidius.com/ https://software.intel.com/en-us/ai-academy ..."
  ],
  [
    "Build a Deep CNN Image Classifier with ANY Images",
    "Get the Code https://github.com/nicknochnack/ImageClassification So...you wanna build your own image classifier eh? Well in this ..."
  ],
  [
    "Deep Learning Tutorial For Beginners | Deep Learning Basics | Deep Learning Course | Simplilearn",
    "Deep Learning is widely used in the field of AI and Data Science. This video on Deep Learning will help you understand what is ..."
  ],
  [
    "Transformer Neural Networks - EXPLAINED! (Attention is all you need)",
    "Please subscribe to keep me alive: https://www.youtube.com/c/CodeEmporium?sub_confirmation=1 BLOG: ..."
  ],
  [
    "Deep Learning Interview Series #7-Asked In Interview-Epochs Vs Batch Vs Iterations In Deep Learning",
    "We at iNeuron are happy to announce multiple series of courses. Finally we are covering Big Data, Cloud,AWS,AIops and MLops."
  ],
  [
    "GFlowNets and System 2 Deep Learning",
    "GFlowNets are instances of a larger family of approaches at the intersection of generative modeling and RL that can be used to ..."
  ],
  [
    "Simple explanation of convolutional neural network | Deep Learning Tutorial 23 (Tensorflow &amp; Python)",
    "A very simple explanation of convolutional neural network or CNN or ConvNet such that even a high school student can ..."
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "Machine Learning: Living in the Age of AI | A WIRED Film",
    "Machine Learning: Living in the Age of AI,” examines the extraordinary ways in which people are interacting with AI today."
  ],
  [
    "Cheapest Deep Learning PC in 2020",
    "Deep Learning is the the most exciting subfield of Artificial Intelligence, yet the necessary hardware costs keep many people from ..."
  ],
  [
    "Self-Driving Car with JavaScript Course – Neural Networks and Machine Learning",
    "Learn how to create a neural network using JavaScript with no libraries. In this course you will learn to make a self-driving car ..."
  ],
  [
    "134 - What are Optimizers in deep learning? (Keras &amp; TensorFlow)",
    ""
  ],
  [
    "How I use Machine Learning as a Data Analyst",
    "Machine Learning Specialization from Coursera https://lukeb.co/MachineLearning Books for Data Nerds ..."
  ],
  [
    "Types Of Machine Learning | Machine Learning Algorithms | Machine Learning Tutorial | Simplilearn",
    "Machine Learning helps you build models that can make predictions and take decisions of their own. This video on Types of ..."
  ],
  [
    "The Rise of Artificial Intelligence through Deep Learning | Yoshua Bengio | TEDxMontreal",
    "A revolution in AI is occurring thanks to progress in deep learning. How far are we towards the goal of achieving human-level AI?"
  ],
  [
    "Part 2-Data Preprocessing-Audio Classification Project Using Deep Learning",
    "In this video we will be developing Audio/ Sound classification using Deep Learning Mel-Frequency Cepstral Coefficients(MFCC): ..."
  ],
  [
    "Deep Learning Specialization by deeplearning.ai — Trailer",
    "This trailer is for the Deep learning Specialization. If you want to break into Artificial Intelligence (AI), this specialization will help ..."
  ],
  [
    "Introduction To Machine Learning And Deep Learning For Starters",
    "Hello All, iNeuron is coming up with the Affordable Advanced Deep Learning, Open CV and NLP(DLCVNLP) course. This batch is ..."
  ],
  [
    "The COOLEST Deep Learning Machine - The Comino Grando RM V2 Short",
    "Checking out a fully custom water-cooled build with 4 A100 40GB cards. An insane powerhouse in a tiny form factor. Comino ..."
  ],
  [
    "How Deep Neural Networks Work - Full Course for Beginners",
    "Even if you are completely new to neural networks, this course will get you comfortable with the concepts and math behind them."
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Part 2-Data Preprocessing-Audio Classification Project Using Deep Learning",
    "In this video we will be developing Audio/ Sound classification using Deep Learning Mel-Frequency Cepstral Coefficients(MFCC): ..."
  ],
  [
    "Introduction To Machine Learning And Deep Learning For Starters",
    "Hello All, iNeuron is coming up with the Affordable Advanced Deep Learning, Open CV and NLP(DLCVNLP) course. This batch is ..."
  ],
  [
    "Deep Learning Specialization by deeplearning.ai — Trailer",
    "This trailer is for the Deep learning Specialization. If you want to break into Artificial Intelligence (AI), this specialization will help ..."
  ],
  [
    "The COOLEST Deep Learning Machine - The Comino Grando RM V2 Short",
    "Checking out a fully custom water-cooled build with 4 A100 40GB cards. An insane powerhouse in a tiny form factor. Comino ..."
  ],
  [
    "What is DEEP LEARNING?|Tamil Tutorial#1|DINESHPRABHU",
    "deeplearning #Artificial_intelligence #machine_learning #deeplearning_tamil #aitamil This is first video of our tamil tutorial on ..."
  ],
  [
    "Barack Obama: Intro to Deep Learning | MIT 6.S191",
    "MIT Introduction to Deep Learning 6.S191 (2020) DISCLAIMER: The following video is synthetic and was created using deep ..."
  ],
  [
    "Deep Learning in ArcGIS Pro 2.9",
    "Learn about the new updates coming to deep learning in the new ArcGIS Pro 2.9 Release. To learn more, please visit: ..."
  ],
  [
    "MarI/O - Machine Learning for Video Games",
    "MarI/O is a program made of neural networks and genetic algorithms that kicks butt at Super Mario World. Source Code: ..."
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "Deep Learning VM Images",
    "Imagine if you could avoid the headache of setting up new libraries, configuring them, and making sure they are all compatible."
  ],
  [
    "History of Deep Learning",
    "In this video, we will learn about the history of Deep Learning."
  ],
  [
    "Deep Learning to Discover Coordinates for Dynamics: Autoencoders &amp; Physics Informed Machine Learning",
    "Joint work with Nathan Kutz: https://www.youtube.com/channel/UCoUOaSVYkTV6W4uLvxvgiFA Discovering physical laws and ..."
  ],
  [
    "Interpretable Deep Learning for New Physics Discovery",
    "In this video, Miles Cranmer discusses a method for converting a neural network into an analytic equation using a particular set of ..."
  ],
  [
    "How Does Deep Learning Work? | Two Minute Papers #24",
    "Artificial neural networks provide us incredibly powerful tools in machine learning that are useful for a variety of tasks ranging from ..."
  ],
  [
    "Introduction To Artificial Neural Network Explained In Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Top Deep Learning Algorithms You Should Know About | Deep Learning Algorithms Explained |Simplilearn",
    "Deep Learning algorithms use artificial neural networks to solve complex problems. This video covers the top 10 deep learning ..."
  ],
  [
    "Detect the Cipher Type With Artificial Neural Networks (Deep Learning)",
    "cryptology, #cryptography, #cryptanalysis In this video, you learn about (classical) cipher type detection with deep learning and ..."
  ],
  [
    "Why Choose Deep Learning? | Deep Learning for Engineers, Part 1",
    "This video introduces deep learning from the perspective of solving practical engineering problems. The goal is to provide an ..."
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Simple Explanation of GRU (Gated Recurrent Units) | Deep Learning Tutorial 37 (Tensorflow &amp; Python)",
    "Simple Explanation of GRU (Gated Recurrent Units): Similar to LSTM, Gated recurrent unit addresses short term memory problem ..."
  ],
  [
    "How Deep Neural Networks Work - Full Course for Beginners",
    "Even if you are completely new to neural networks, this course will get you comfortable with the concepts and math behind them."
  ],
  [
    "Reality behind data science, machine learning jobs",
    "Reality behind data science jobs. Is machine learning really cool? Do you want to learn technology from me?"
  ],
  [
    "Customer churn prediction using ANN | Deep Learning Tutorial 18 (Tensorflow2.0, Keras &amp; Python)",
    "In this video we will build a customer churn prediction model using artificial neural network or ANN. Customer churn measures ..."
  ],
  [
    "MLOps explained | Machine Learning Essentials",
    "In this video, learn about the importance of MLOps and the processes associated with it. Download the 30-day learning journey for ..."
  ],
  [
    "Why Is Deep Learning Hot Right Now?",
    "Learn more at http://www.nvidia.com/object/deep-learning.html Deep learning is the fastest-growing field in artificial intelligence ..."
  ],
  [
    "DEEP LEARNING EXPLICADO",
    "Como é que nós podemos criar um cérebro artificial? Deep learning é um método de aprendizado de máquinas que usa redes ..."
  ],
  [
    "Self-attention in deep learning (transformers)",
    "Self-attention in deep learning (transformers) Self attention is very commonly used in deep learning these days. For example, it is ..."
  ],
  [
    "Deep Learning with SICK dStudio – Handle more complexity with less effort",
    "Industrial artificial intelligence and deep learning sensor: Unlocking the full potential of intelligent sensors with deep learning ..."
  ],
  [
    "Distributed Training On NVIDIA DGX Station A100 | Deep Learning Tutorial 43 (Tensorflow &amp; Python)",
    "Using tensorflow mirrored strategy we will perform distributed training on NVIDIA DGX Station A100 System. Distributed training is ..."
  ],
  [
    "Restricted Boltzmann Machine | Neural Network Tutorial | Deep Learning Tutorial | Edureka",
    "AI & Deep Learning with Tensorflow Training: https://www.edureka.co/ai-deep-learning-with-tensorflow ** This Edureka video on ..."
  ],
  [
    "What is Artificial Intelligence (or Machine Learning)?",
    "Want to learn more about AI and machine learning? Stay current on emerging tech: https://clickhubspot.com/dp7 What is AI?"
  ],
  [
    "Top 10 Deep Learning Algorithms in 2022 Part 1",
    "CONNECT ▭▭▭▭▭▭▭▭▭▭▭▭ 🖥️ Website: https://www.assemblyai.com Twitter: https://twitter.com/AssemblyAI ..."
  ],
  [
    "Sound Generation with Deep Learning || Approaches and Challenges",
    "Join The Sound Of AI Slack community: ..."
  ],
  [
    "A friendly introduction to Deep Learning and Neural Networks",
    "Announcement: New Book by Luis Serrano! Grokking Machine Learning. bit.ly/grokkingML 40% discount code: serranoyt A ..."
  ],
  [
    "Arts of Deep learning",
    "I works as a Data scientist pioneering in Machine learning, Deep learning, and Computer vision and is an AI engineer, ..."
  ],
  [
    "The Deep Learning Revolution",
    "More info at: http://www.nvidia.com/deep-learning Deep learning is the fastest-growing field in artificial intelligence, helping ..."
  ],
  [
    "LSTM Explained | What Is LSTM | Deep Learning Training | Edureka",
    "Edureka Tensorflow Training: https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka LSTM Explained video will ..."
  ],
  [
    "MIT 6.S191: Evidential Deep Learning and Uncertainty",
    "MIT Introduction to Deep Learning 6.S191: Lecture 7 Evidential Deep Learning and Uncertainty Estimation Lecturer: Alexander ..."
  ],
  [
    "Ilya Sutskever: Deep Learning | Lex Fridman Podcast #94",
    "Ilya Sutskever is the co-founder of OpenAI, is one of the most cited computer scientist in history with over 165000 citations, and to ..."
  ],
  [
    "Transformers, explained: Understand the model behind GPT, BERT, and T5",
    "Dale's Blog → https://goo.gle/3xOeWoK Classify text with BERT → https://goo.gle/3AUB431 Over the past five years, Transformers, ..."
  ],
  [
    "Deep Learning Fundamentals with Sebastian Raschka - A New Educational Course from Lightning AI",
    "Deep Learning Fundamentals is a free course on learning deep learning using a modern open-source stack. Units 1 & 2 now ..."
  ],
  [
    "Best Laptop for Machine Learning and Deep Learning | Machine Learning Training | Edureka",
    "Data Science Certification: https://www.edureka.co/data-science-r-programming-certification-course ) This Edureka video on \"Best ..."
  ],
  [
    "A Friendly Introduction to Codeless Deep Learning",
    "Recent deep learning architectures have brought us solutions to previously unsolved problems. Nevertheless for most tools you ..."
  ],
  [
    "Part 1-EDA-Audio Classification Project Using Deep Learning",
    "In this video we will be developing Audio/ Sound classification using Deep Learning Dataset: ..."
  ],
  [
    "What Is Keras? | What Is Keras In Deep Learning | Keras Tutorial For Beginners | Simplilearn",
    "This video on What is Keras will help you understand the basics of a top deep learning library used in data science. You will learn ..."
  ],
  [
    "Simple Explanation of LSTM | Deep Learning Tutorial 36 (Tensorflow, Keras &amp; Python)",
    "LSTM or long short term memory is a special type of RNN that solves traditional RNN's short term memory problem. In this video I ..."
  ],
  [
    "Deep Learning With PyTorch - Full Course",
    "In this course you learn all the fundamentals to get started with PyTorch and Deep Learning. ⭐ Check out Tabnine, the FREE ..."
  ],
  [
    "Machine Learning Fundamentals: Bias and Variance",
    "Bias and Variance are two fundamental concepts for Machine Learning, and their intuition is just a little different from what you ..."
  ],
  [
    "Gradient Descent For Neural Network | Deep Learning Tutorial 12 (Tensorflow2.0, Keras &amp; Python)",
    "Gradient descent is the heart of all supervised learning models. It is important to understand this technique if you are pursuing a ..."
  ],
  [
    "Performing Deep Learning Analysis in ArcGIS",
    "ArcGIS comes with deep learning tools and APIs to support a wide range of usage. Deep learning models and automate tasks can ..."
  ],
  [
    "Distributed Training On NVIDIA DGX Station A100 | Deep Learning Tutorial 43 (Tensorflow &amp; Python)",
    "Using tensorflow mirrored strategy we will perform distributed training on NVIDIA DGX Station A100 System. Distributed training is ..."
  ],
  [
    "What is Artificial Intelligence (or Machine Learning)?",
    "Want to learn more about AI and machine learning? Stay current on emerging tech: https://clickhubspot.com/dp7 What is AI?"
  ],
  [
    "[LIVE] DAY 07 | Deep learning using PYTHON | COMPLETE in 7 - Days",
    "notes: https://github.com/ShapeAI/Python-and-Machine-Learning/blob/main/Important_concepts_in_python.ipynb For more events ..."
  ],
  [
    "Machine Learning Interview Questions and Answers | Machine Learning Interview Preparation | Edureka",
    "Machine Learning Training with Python (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "What Is Keras? | What Is Keras In Deep Learning | Keras Tutorial For Beginners | Simplilearn",
    "This video on What is Keras will help you understand the basics of a top deep learning library used in data science. You will learn ..."
  ],
  [
    "Machine Learning for Aerodynamics - Deep Learning &amp; Neural Networks applied to CFD simulations",
    "For more information, visit https://www.airshaper.com or email info@airshaper.com ..."
  ],
  [
    "Why Is Deep Learning Hot Right Now?",
    "Learn more at http://www.nvidia.com/object/deep-learning.html Deep learning is the fastest-growing field in artificial intelligence ..."
  ],
  [
    "🔥Deep Learning Full Course 2022 | Deep Learning Tutorial for Beginners | Deep Learning | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Transformers, explained: Understand the model behind GPT, BERT, and T5",
    "Dale's Blog → https://goo.gle/3xOeWoK Classify text with BERT → https://goo.gle/3AUB431 Over the past five years, Transformers, ..."
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "Diving into deeper learning | Marc Chun | TEDxDenverTeachers",
    "The complex issues we face today require a key set of problem-solving skills. How can schools best prepare students to be ready ..."
  ],
  [
    "132 - What are Activation functions in deep learning (Keras &amp; Tensorflow)?",
    ""
  ],
  [
    "Sound Generation with Deep Learning || Approaches and Challenges",
    "Join The Sound Of AI Slack community: ..."
  ],
  [
    "Deep Learning Explained In 1 Minute | What Is Deep Learning? | Deep Learning | #Shorts | Simplilearn",
    "Enroll for Free Machine Learning with R Course & Get Your Completion Certificate: ..."
  ],
  [
    "MIT 6.S191: Evidential Deep Learning and Uncertainty",
    "MIT Introduction to Deep Learning 6.S191: Lecture 7 Evidential Deep Learning and Uncertainty Estimation Lecturer: Alexander ..."
  ],
  [
    "Simple Explanation of LSTM | Deep Learning Tutorial 36 (Tensorflow, Keras &amp; Python)",
    "LSTM or long short term memory is a special type of RNN that solves traditional RNN's short term memory problem. In this video I ..."
  ],
  [
    "Deep Learning With PyTorch - Full Course",
    "In this course you learn all the fundamentals to get started with PyTorch and Deep Learning. ⭐ Check out Tabnine, the FREE ..."
  ],
  [
    "Part 1-EDA-Audio Classification Project Using Deep Learning",
    "In this video we will be developing Audio/ Sound classification using Deep Learning Dataset: ..."
  ],
  [
    "Adam Optimizer Explained in Detail with Animations | Optimizers in Deep Learning Part 5",
    "Adaptive Moment Estimation is an algorithm for optimization technique for gradient descent. The method is really efficient when ..."
  ],
  [
    "Complete Roadmap for Machine Learning | ML Roadmap for Beginners",
    "Machine Learning Engineer Roadmap: Step by step 6 months learning roadmap for machine learning engineer career. Most of ..."
  ],
  [
    "The Deep Learning Revolution",
    "More info at: http://www.nvidia.com/deep-learning Deep learning is the fastest-growing field in artificial intelligence, helping ..."
  ],
  [
    "Complete Road Map To Prepare For Deep Learning🔥🔥🔥🔥",
    "In this video I am going to discuss about the complete road map to prepare for deep learning which will be definitely helpful for ..."
  ],
  [
    "Top 10 Machine Learning Project Ideas | Deep Learning AI ML Projects",
    "Checkout Top 10 Machine Learning and Deep Learning AI ML Project Ideas for students and engineers with Free Synopsis & PPT ..."
  ],
  [
    "Processing Image data for Deep Learning",
    "This video is about how to process image data for Deep Learning. I also explained about Grayscale images and RGB images and ..."
  ],
  [
    "Arts of Deep learning",
    "I works as a Data scientist pioneering in Machine learning, Deep learning, and Computer vision and is an AI engineer, ..."
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "A friendly introduction to Deep Learning and Neural Networks",
    "Announcement: New Book by Luis Serrano! Grokking Machine Learning. bit.ly/grokkingML 40% discount code: serranoyt A ..."
  ],
  [
    "Deep Learning with MATLAB: Using Feature Extraction with Neural Networks in MATLAB",
    "This demo uses MATLAB® to train a SVM classifier with features extracted, using a pretrained CNN for classifying images of four ..."
  ],
  [
    "AXIS P3255-LVE– Deep learning. Deep insight",
    "A unique dual chipset makes AXIS P3255-LVE the perfect platform for analytics based on deep learning. Ideal for various ..."
  ],
  [
    "Text Classification Explained | Sentiment Analysis Example | Deep Learning Applications | Edureka",
    "Edureka PGP in AI & ML: https://www.edureka.co/post-graduate/machine-learning-and-ai This Edureka video on What is Text ..."
  ],
  [
    "500+ Machine Learning And Deep Learning Projects All At One Place",
    "Special Thanks To Ashish Patel And All The Bloggers For the Amazing Contribution https://www.linkedin.com/in/ashishpatel2604/ ..."
  ],
  [
    "Introduction to Deep Learning: What Is Deep Learning?",
    "Deep learning is a machine learning technique that learns features and tasks directly from data. This data can include images, text ..."
  ],
  [
    "The Role of AI and Machine Learning in Mechanical Engineering",
    "Mechanical Engineering's Allen Robinson and several other faculty members explain how artificial intelligence and machine ..."
  ],
  [
    "Google Interview Question on Deep Learning",
    "AppliedAICourse.com."
  ],
  [
    "How Deep Neural Networks Work - Full Course for Beginners",
    "Even if you are completely new to neural networks, this course will get you comfortable with the concepts and math behind them."
  ],
  [
    "Theano - Ep. 17 (Deep Learning SIMPLIFIED)",
    "Theano is a Python library that defines a set of mathematical functions for building deep nets. Nets that use these functions as ..."
  ],
  [
    "Machine Learning Roadmap For 2022 | How To Become Machine Learning Engineer | Simplilearn",
    "Are you interested in Machine Learing and do you aspire to become a Machine Learning Engineer? Then, this video will help you ..."
  ],
  [
    "Precision, Recall, F1 score, True Positive|Deep Learning Tutorial 19 (Tensorflow2.0, Keras &amp; Python)",
    "In this video we will go over following concepts, What is true positive, false positive, true negative, false negative What is precision ..."
  ],
  [
    "Deep Learning Frameworks (C2W3L10)",
    ""
  ],
  [
    "Stanford CS230: Deep Learning | Autumn 2018 | Lecture 8 - Career Advice / Reading Research Papers",
    "Andrew Ng, Adjunct Professor & Kian Katanforoosh, Lecturer - Stanford University http://onlinehub.stanford.edu/ Andrew Ng ..."
  ],
  [
    "Backpropagation calculus | Chapter 4, Deep learning",
    "Help fund future projects: https://www.patreon.com/3blue1brown An equally valuable form of support is to simply share some of ..."
  ],
  [
    "What is BERT? | Deep Learning Tutorial 46 (Tensorflow, Keras &amp; Python)",
    "What is BERT (Bidirectional Encoder Representations From Transformers) and how it is used to solve NLP tasks? This video ..."
  ],
  [
    "Student Voice: Experiencing Deeper Learning Through PBL",
    "Although high school student Rahil had some academic struggles after immigrating from Fiji just a few years ago, he found ..."
  ],
  [
    "Andrew Ng&#39;s New Machine Learning Specialization is Out!!!",
    "Here's the link! https://imp.i384100.net/VyWbLj Offered jointly by Coursera, DeepLearning.AI, Stanford University, and the ..."
  ],
  [
    "Generating synthetic data for deep learning",
    "We, the Virtual Reality & Multimedia Group of the Freiberg University of Mining & Technology (Germany), would like to introduce ..."
  ],
  [
    "Top 6 Laptops for Deep Learning | Best Laptops for Gaming | Best Laptops for Deep Learning",
    "In this video, we will talk about the best laptops for deep learning. In case you have a specific budget in mind, let me know in the ..."
  ],
  [
    "How-to: Extracting Building Footprints using Esri&#39;s Deep Learning Model",
    "In this video, learn how to use Esri's Building Footprint Extraction deep learning model with ArcGIS Pro. This deep learning model ..."
  ],
  [
    "22. AutoEncoders - Explained (Deep Learning)",
    "Here, we can understand what Autoencoders is all about."
  ],
  [
    "Deep Learning Concepts: Training vs Inference",
    "In Deep Learning there are two concepts called Training and Inference. These AI concepts define what environment and state the ..."
  ],
  [
    "NGBS2022 Talk 11: Protein design using deep learning – David Baker",
    "Protein design using deep learning Towards a mechanistic understanding of genome regulation Speaker: David Baker, University ..."
  ],
  [
    "MIT 6.S091: Introduction to Deep Reinforcement Learning (Deep RL)",
    "First lecture of MIT course 6.S091: Deep Reinforcement Learning, introducing the fascinating field of Deep RL. For more lecture ..."
  ],
  [
    "Deep Reinforcement Learning Tutorial for Python in 20 Minutes",
    "Worked with supervised learning? Maybe you've dabbled with unsupervised learning. But what about reinforcement learning?"
  ],
  [
    "How Facebook is using Artificial Intelligence (AI) And Deep Learning",
    "In this video I discuss the amazing ways Facebook uses A.I. and machine learning to e.g. understand and interpret your text, ..."
  ],
  [
    "Data Science Projects For Resume | Machine Learning Projects With Source Code",
    "5 Essential end to end data science projects for a data scientist resume. 3 of these projects are machine learning projects and 2 of ..."
  ],
  [
    "Does a Deep Learning Laptop Exist? - Tensorbook Review",
    "Reviewing Lambda and Razer's Tensorbook, a laptop aimed at deep learning, with 16GB of VRAM (GPU memory), 64GB of RAM, ..."
  ],
  [
    "FastAPI for Machine Learning: Live coding an ML web application.",
    "Welcome! Join us for a live workshop where you can follow along with the creator of FastAPI Sebastián Ramírez to build your very ..."
  ],
  [
    "Deep learning project end to end | Potato Disease Classification - 2 :Data collection, preprocessing",
    "End to end deep learning project for potato disease classification. In this session, we will cover, ⭐️ Timestamps ⭐️ 00:00 ..."
  ],
  [
    "Inspiration Exchange - causal deep learning (part 1/2)",
    "Recording of the van der Schaar Lab's seventeenth Inspiration Exchange session, which took place on April 14, 2022, and was ..."
  ],
  [
    "Deep Learning With TensorFlow [2022 Updated]",
    "This Deep Learning with TensorFlow playlist will help you master deep learning and TensorFlow concepts, learn to implement ..."
  ],
  [
    "The Deep Learning Saga",
    "How the brain works, according to Geoff Hinton. Presented at the NIPS'2010 workshops banquet for the Deep Learning and ..."
  ],
  [
    "Deep Learning: A Crash Course (2018) | SIGGRAPH Courses",
    "Deep learning is a revolutionary technique for discovering patterns from data. We'll see how this technology works and what it ..."
  ],
  [
    "Deep Clustering: A Deep Learning Approach for High-Dimensional Data Clustering",
    "Maggie Du introduces a new feature in SAS Viya 3.5 called deep clustering. This is a completely unsupervised deep learning ..."
  ],
  [
    "MIT 6.S191 (2020): Introduction to Deep Learning",
    "MIT Introduction to Deep Learning 6.S191: Lecture 1 Foundations of Deep Learning Lecturer: Alexander Amini January 2020 For ..."
  ],
  [
    "Deep Learning with Raspberry Pi and MATLAB",
    "Do you want to take your deep learning algorithms beyond desktop and apply them in real-world systems? In this webinar, we will ..."
  ],
  [
    "Reality behind data science, machine learning jobs",
    "Reality behind data science jobs. Is machine learning really cool? Do you want to learn technology from me?"
  ],
  [
    "Deep Learning with Go",
    "You've heard about self-driving cars, self-organizing drone swarms, conversational interfaces, and emotion recognition. That's all ..."
  ],
  [
    "Complete Machine Learning In 6 Hours| Krish Naik",
    "All the materials are available in the below link https://courses.ineuron.ai/Mega-Community-Live Time Stamp: 00:00:00 ..."
  ],
  [
    "Keras vs TensorFlow vs Pytorch | Deep Learning Frameworks Comparison 2021 | Simplilearn",
    "With the Deep Learning scene being dominated by three main frameworks, it is very easy to get confused on which one to use?"
  ],
  [
    "Deep Learning With Python | Deep Learning Tutorial For Beginners | Edureka",
    "Tensorflow Training: https://www.edureka.co/ai-deep-learning-with-tensorflow ** This video on \"Deep Learning with Python\" will ..."
  ],
  [
    "PyTorch Crash Course - Getting Started with Deep Learning",
    "Learn how to get started with PyTorch in this Crash Course. It teaches you all important concepts about this Deep Learning ..."
  ],
  [
    "Building a recommendation system using deep learning",
    "In this video, I will show you how to train a model for a recommendation system using #DeepLearning and #PyTorch. I will be ..."
  ],
  [
    "[LIVE] DAY 02 | Deep learning using PYTHON | COMPLETE in 7 - Days",
    "notes: https://github.com/ShapeAI/Python-and-Machine-Learning/blob/main/Important_concepts_in_python.ipynb For more events ..."
  ],
  [
    "Difference between Machine Learning and Deep Learning",
    "Difference between Machine Learning and Deep Learning while also explaining the difference with Artificial intelligence is ..."
  ],
  [
    "COVID Detection Using Deep Learning | COVID Detection With X-Rays | Deep Learning Training | Edureka",
    "Deep Learning Training - TensorFlow Certification(Use Code: YOUTUBE20): ..."
  ],
  [
    "Transfer Learning | Deep Learning Tutorial 27 (Tensorflow, Keras &amp; Python)",
    "Transfer learning is a very important concept in the field of computer vision and natural language processing. Using transfer ..."
  ],
  [
    "Recurrent Neural Network (RNN) Tutorial | RNN LSTM Tutorial | Deep Learning Tutorial | Simplilearn",
    "Free Machine Learning Course: ..."
  ],
  [
    "MSI Laptop Specification- Probably Best for Machine Learning And Deep Learning",
    "amazon link: https://www.amazon.in/gp/product/B07Z867QZR/ref=ppx_yo_dt_b_asin_title_o00_s00?ie=UTF8&psc=1."
  ],
  [
    "Convolutional Neural Networks (CNNs) explained",
    "CNNs for deep learning Included in Machine Leaning / Deep Learning for Programmers Playlist: ..."
  ],
  [
    "Image Captioning using Deep Learning  | Deep Learning Tutorial | Edureka Live",
    "AI & Deep Learning with TensorFlow (Use Code: YOUTUBE20): https://www.edureka.co/ai-deep-learning-with-tensorflow ** This ..."
  ],
  [
    "Machine Learning Full Course | Learn Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning for Computational Fluid Dynamics",
    "Machine learning is rapidly becoming a core technology for scientific computing, with numerous opportunities to advance the field ..."
  ],
  [
    "Handling imbalanced dataset in machine learning | Deep Learning Tutorial 21 (Tensorflow2.0 &amp; Python)",
    "Credit card fraud detection, cancer prediction, customer churn prediction are some of the examples where you might get an ..."
  ],
  [
    "NVIDIA GeForce RTX 3050 GPU Speed up for Deep Learning | Training Neural Networks on GPU vs CPU",
    "NVIDIA GeForce RTX 3050 GPU on Acer Nitro 5 vs CPU performance comparison. Thanks To Acer & NVIDIA for sharing this ..."
  ],
  [
    "Bayesian Deep Learning and Probabilistic Model Construction - ICML 2020 Tutorial",
    "Bayesian Deep Learning and a Probabilistic Perspective of Model Construction ICML 2020 Tutorial Bayesian inference is ..."
  ],
  [
    "Tabular Data: Deep Learning is Not All You Need, Dr. Ravid Shwartz-Ziv",
    "Dr. Ravid Shwartz-Ziv, Research Scientist, NYU & Intel."
  ],
  [
    "Machine Learning With Python Full Course 2022 | Machine Learning Tutorial for Beginners| Simplilearn",
    "Free Machine Learning Course With Completion Certificate: ..."
  ],
  [
    "Deep Learning for Additive Manufacturing",
    "A new #deeplearning method developed by Oak Ridge National Laboratory improves the verification of #3Dprinted parts."
  ],
  [
    "Global Building Footprint Dataset by @Microsoft  || Deep learning || GeoDev",
    "Microsoft has made significant investments in deep learning, computer vision and AI that have been applied to mapping. Over the ..."
  ],
  [
    "Deep Learning Lab Assignment-1 || SPPU || BE IT DL Lab Assignment || 2019 Pattern",
    "Hello Friends, In this video I have explained about the SPPU BE IT 2019 Pattern Deep Learning Lab Assignment-1."
  ],
  [
    "Keras Tutorial For Beginners | Keras For Deep Learning | Deep Learning Tutorial | Simplilearn",
    "Learn to implement neural networks faster and easier with this tutorial on Keras! Learn how to prepare data from scrath, make, ..."
  ],
  [
    "Using MATLAB with Tensorflow and PyTorch for Deep Learning",
    "Watch live to learn about how the deep learning frameworks in MATLAB and Simulink can be used with TensorFlow and PyTorch ..."
  ],
  [
    "Adversarial Examples in Deep Learning",
    "Anil Ananthaswamy (freelance journalist, moderator) Panelists: Sébastien Bubeck (Microsoft Research), Melanie Mitchell (Santa ..."
  ],
  [
    "MIT Deep Learning 6.S191 Teaser",
    "MIT Introduction to Deep Learning: 6.S191. Massachusetts Institute of Technology (MIT) *New 2021 Edition Coming Soon!"
  ],
  [
    "Lesson 1: Practical Deep Learning for Coders 2022",
    "Go to https://course.fast.ai for code, notebooks, quizzes, etc. This course is designed for people with some coding experience who ..."
  ],
  [
    "Keras Image Classification Tutorial | Image Classification Using Deep Learning | Simplilearn",
    "This video on Keras Image Classification Tutorial covers the basics of image classification and how to create neural networks ..."
  ],
  [
    "AI Learns to Escape (using Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 5 rooms I've designed. The AI was trained ..."
  ],
  [
    "Top 6 Laptops for Deep Learning | Best Laptops for Gaming | Best Laptops for Deep Learning",
    "In this video, we will talk about the best laptops for deep learning. In case you have a specific budget in mind, let me know in the ..."
  ],
  [
    "Stanford CS230: Deep Learning | Autumn 2018 | Lecture 2 - Deep Learning Intuition",
    "Andrew Ng, Adjunct Professor & Kian Katanforoosh, Lecturer - Stanford University https://stanford.io/3eJW8yT Andrew Ng Adjunct ..."
  ],
  [
    "Learn PyTorch for Deep Learning. Become a Deep Learning Engineer. Get HIRED. | Zero To Mastery",
    "Learn PyTorch from scratch! This PyTorch course is your step-by-step guide to developing your own deep learning models using ..."
  ],
  [
    "deeplearning.ai&#39;s Heroes of Deep Learning: Dawn Song",
    "Dawn Song is well-known for her research on the intersection of deep learning and security. Aside from her research, Song is also ..."
  ],
  [
    "In-Sight D900 Deep Learning Vision System",
    "Want to learn more? View the In-Sight D900 datasheet at: https://bit.ly/3bmK1pm The In-Sight® D900 is a vision system powered ..."
  ],
  [
    "Student Voice: Experiencing Deeper Learning Through PBL",
    "Although high school student Rahil had some academic struggles after immigrating from Fiji just a few years ago, he found ..."
  ],
  [
    "CNN and RNN in Deep Learning | Deep Learning Tutorial | Deep Learning Algorithms | Simplilearn",
    "This video on CNN and RNN in Deep Learning will help you learn two of the most popular deep learning algorithms i.e., ..."
  ],
  [
    "Keras vs TensorFlow vs Pytorch | Deep Learning Frameworks Comparison 2021 | Simplilearn",
    "With the Deep Learning scene being dominated by three main frameworks, it is very easy to get confused on which one to use?"
  ],
  [
    "Deep Learning: Theory, Algorithms, and Applications",
    "Deep Learning: Theory, Algorithms, and Applications. Berlin, June 2017 The workshop aims at bringing together leading ..."
  ],
  [
    "A.I. Learns to Drive From Scratch in Trackmania",
    "I made an A.I. that teaches itself to drive in the racing game Trackmania, using Machine-Learning. I used Deep-Q-Learning, ..."
  ],
  [
    "Defect Detection with Cognex Deep Learning",
    "Want to learn more? View our Deep Learning vs. Machine Vision eBook: ..."
  ],
  [
    "Machine Learning Course for Beginners",
    "Learn the theory and practical application of machine learning concepts in this comprehensive course for beginners. Learning ..."
  ],
  [
    "How to Generate Art - Intro to Deep Learning #8",
    "We're going to learn how to use deep learning to convert an image into the style of an artist that we choose. We'll go over the ..."
  ],
  [
    "Deep Learning Cars",
    "A small 2D simulation in which cars learn to maneuver through a course by themselves, using a neural network and evolutionary ..."
  ],
  [
    "How Facebook is using Artificial Intelligence (AI) And Deep Learning",
    "In this video I discuss the amazing ways Facebook uses A.I. and machine learning to e.g. understand and interpret your text, ..."
  ],
  [
    "Applications of Deep Neural Networks Course Overview (1.1, Fall 2022)",
    "Fall 2022 Version. Applications of deep neural networks is a course offered in a hybrid format by Washington University in St."
  ],
  [
    "Deep Learning Applications | Deep Learning Applications In Real Life | Deep learning | Simplilearn",
    "This video on Deep Learning Applications covers the exciting areas and sectors of business that uses Deep Learning widely ..."
  ],
  [
    "Machine Learning Full Course - Learn Machine Learning 10 Hours | Machine Learning Tutorial | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "12th Chetana: THE INTERSECTION OF MATHEMATICS AND DEEP LEARNING (MACHINE LEARNING) on 19th September",
    "12th Chetana-Online Lecture Series. Topic:-THE INTERSECTION OF MATHEMATICS AND DEEP LEARNING (MACHINE ..."
  ],
  [
    "Reality behind data science, machine learning jobs",
    "Reality behind data science jobs. Is machine learning really cool? Do you want to learn technology from me?"
  ],
  [
    "The Principles of Deep Learning Theory - Dan Roberts",
    "IAS Physics Group Meeting Topic: The Principles of Deep Learning Theory Speaker: Dan Roberts Affiliation: MIT & Salesforce ..."
  ],
  [
    "Machine Learning Fundamentals: Bias and Variance",
    "Bias and Variance are two fundamental concepts for Machine Learning, and their intuition is just a little different from what you ..."
  ],
  [
    "Two Sigma Presents Deep Learning for Sequences in Quantitative Finance David Kriegman",
    ""
  ],
  [
    "Diabetes Prediction using Deep Learning",
    "Download the Dataset from here: https://drive.google.com/file/d/1SfzFJDQcuCP1XJ3lQl49GiNs_i0yo4Ju/view?usp=sharing."
  ],
  [
    "NVIDIA Deep Learning Institute Instructor-Led Training Available Remotely",
    "NVIDIA's Deep Learning Institute (DLI) is offering instructor-led workshops that are delivered remotely via a virtual classroom."
  ],
  [
    "Deep Learning Chapter 1 Introduction presented by Ian Goodfellow",
    ""
  ],
  [
    "NPTEL Deep Learning Week 7 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Geometric Deep Learning | Michael Bronstein || Radcliffe Institute",
    "As part of the 2017–2018 Fellows' Presentation Series at the Radcliffe Institute for Advanced Study, Michael Bronstein RI '18 ..."
  ],
  [
    "Deep Reinforcement Learning Tutorial for Python in 20 Minutes",
    "Worked with supervised learning? Maybe you've dabbled with unsupervised learning. But what about reinforcement learning?"
  ],
  [
    "Deep Learning Full Course🔥 - Learn Deep Learning in 6 Hours | Deep Learning Tutorial | Simplilearn",
    "FREE Deep Learning Course With Completion Certificate: ..."
  ],
  [
    "Convolutional Neural Networks (CNNs) explained",
    "CNNs for deep learning Included in Machine Leaning / Deep Learning for Programmers Playlist: ..."
  ],
  [
    "MIT 6.S094: Introduction to Deep Learning and Self-Driving Cars",
    "First deep learning intro lecture of course 6.S094: Deep Learning for Self-Driving Cars taught in Winter 2017. INFO: Slides: ..."
  ],
  [
    "Stanford CS230: Deep Learning | Autumn 2018 | Lecture 1 - Class Introduction &amp; Logistics, Andrew Ng",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs visit: https://stanford.io/3eJW8yT ..."
  ],
  [
    "Global Building Footprint Dataset by @Microsoft  || Deep learning || GeoDev",
    "Microsoft has made significant investments in deep learning, computer vision and AI that have been applied to mapping. Over the ..."
  ],
  [
    "AMMI Course &quot;Geometric Deep Learning&quot; - Lecture 1 (Introduction) - Michael Bronstein",
    "Video recording of the course \"Geometric Deep Learning\" taught in the African Master in Machine Intelligence in July-August 2021 ..."
  ],
  [
    "Arts of Deep learning",
    "I works as a Data scientist pioneering in Machine learning, Deep learning, and Computer vision and is an AI engineer, ..."
  ],
  [
    "Real-Time Voice Cloning with Deep Learning",
    "As i am getting more familiar with deep learning, i discover many new programs that are cool yet sometime creepy, one of which is ..."
  ],
  [
    "NPTEL Deep Learning Week 6 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Count people with a high accuracy | CCTV camera, Opencv and Deep Learning",
    "Blog: https://pysource.com/2021/12/07/how-to-count-people-from-cctv-cameras-with-opencv-and-deep-learning/ We will see how ..."
  ],
  [
    "Python for Bioinformatics - Drug Discovery Using Machine Learning and Data Analysis",
    "Learn how to use Python and machine learning to build a bioinformatics project for drug discovery. ✏️ Course developed by ..."
  ],
  [
    "Build a Deep CNN Image Classifier with ANY Images",
    "Get the Code https://github.com/nicknochnack/ImageClassification So...you wanna build your own image classifier eh? Well in this ..."
  ],
  [
    "Build a Generative Adversarial Neural Network with Tensorflow and Python | Deep Learning Projects",
    "Want to get your hands dirty building a deep learning powered GAN with Python? Well in this video you'll learn everything ..."
  ],
  [
    "Deep Learning - 3 | Artificial Neural Network | Sinhala",
    "Deep Learning - 3 | Artificial Neural Network | Sinhala Neural networks are a subset of machine learning and are at the heart of ..."
  ],
  [
    "20221206 - Data Mining and Applications A - Basic Deep Learning (2)",
    ""
  ],
  [
    "Deep Learning vs. Machine Learning, which is better?",
    "Terms Deep Learning and Machine Learning are sometimes used interchangeably. But they are far from being identical. The key ..."
  ],
  [
    "Artificial Intelligence Full Course | Artificial Intelligence Tutorial for Beginners | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "&quot;Interactive Debugging and Testing Support for Deep Learning&quot; by Tianyi Zhang",
    "Recurrent Neural Networks (RNNs) have been widely used in NLP tasks. Yet it is challenging to debug RNNs due to their inherent ..."
  ],
  [
    "CNN and RNN: In Depth Video | CNN and RNN In Deep Learning Explained | Deep Learning | Simplilearn",
    "In this CNN and RNN: In Depth video, you'll learn about what convolution neural network and recurrent neural networks are."
  ],
  [
    "Learn Deep Learning in 6 Weeks",
    "Deep Learning is the dark art of our times. Incredibly powerful, mysteriously accurate, and accessible to just about anyone. In this ..."
  ],
  [
    "Complete Deep Learning &amp; Computer Vision Roadmap for Beginners",
    "Hey, what's up! In this video, I have shared my complete roadmap to learn Deep Learning and Computer Vision. I have provided ..."
  ],
  [
    "MIT 6.S191 (2021): Introduction to Deep Learning",
    "MIT Introduction to Deep Learning 6.S191: Lecture 1 Foundations of Deep Learning Lecturer: Alexander Amini For all lectures, ..."
  ],
  [
    "Train a Deep Learning model for custom object detection using TensorFlow 2.x (On Google Colab)",
    "This video shows step by step tutorial on how to train an object detection model for a custom dataset using TensorFlow 2.x."
  ],
  [
    "Best Coding laptop 2022 | laptop for AI, Machine Learning, Android Studio, Deep Learing | DotCOM💻",
    "Book Techcanvas Consultancy - Tech Solution   🖱️🖱️🖱️https://rzp.io/l/techcanvas 🖱️🖱️🖱️ Best coding laptop under ..."
  ],
  [
    "Learn PyTorch for Deep Learning. Become a Deep Learning Engineer. Get HIRED. | Zero To Mastery",
    "Learn PyTorch from scratch! This PyTorch course is your step-by-step guide to developing your own deep learning models using ..."
  ],
  [
    "Deep Learning Chapter 1 Introduction presented by Ian Goodfellow",
    ""
  ],
  [
    "Diabetes Prediction using Deep Learning",
    "Download the Dataset from here: https://drive.google.com/file/d/1SfzFJDQcuCP1XJ3lQl49GiNs_i0yo4Ju/view?usp=sharing."
  ],
  [
    "NPTEL Deep Learning Week 6 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Emotion Detection using OpenCV &amp; Python | Real time Emotion Detection | Deep Learning | Edureka",
    "Edureka PG Diploma in Artificial Intelligence & ML from E & ICT Academy NIT Warangal(Use Code: YOUTUBE20): ..."
  ],
  [
    "Natural Language Processing | NLP with Deep Learning and Machine Learning | NLP Using Python",
    "Intellipaat natural language processing in python course: https://intellipaat.com/nlp-training-course-using-python/ In this natural ..."
  ],
  [
    "Le fonctionnement des réseaux de neurones - Introduction au Deep Learning #1",
    "Dans cette série de vidéos, on vas tenter de comprendre comment marche le deep learning, et implémenter notre premier réseau ..."
  ],
  [
    "Image Classification using CNN | Deep Learning Tutorial | Machine Learning Project 9 | Edureka",
    "Edureka Machine Learning Certification training (Use Code: YOUTUBE20) ..."
  ],
  [
    "DEEP LEARNING EXPLICADO",
    "Como é que nós podemos criar um cérebro artificial? Deep learning é um método de aprendizado de máquinas que usa redes ..."
  ],
  [
    "Certificate Course on Artificial Intelligence and Deep Learning by IIT Roorkee",
    "Click here for more information about the course - https://bit.ly/2YMcP5i Have you ever wondered how self-driving cars are ..."
  ],
  [
    "Zebra Technologies Deep Learning OCR | Zebra",
    "Zebra's Deep Learning OCR Tool on the VS Camera Lineup is an incredible strong algorithm that works great on difficult to read ..."
  ],
  [
    "CNN and RNN in Deep Learning | Deep Learning Tutorial | Deep Learning Algorithms | Simplilearn",
    "This video on CNN and RNN in Deep Learning will help you learn two of the most popular deep learning algorithms i.e., ..."
  ],
  [
    "MIT 6.S094: Introduction to Deep Learning and Self-Driving Cars",
    "First deep learning intro lecture of course 6.S094: Deep Learning for Self-Driving Cars taught in Winter 2017. INFO: Slides: ..."
  ],
  [
    "Stanford CS224W: Machine Learning with Graphs | 2021 | Lecture 1.1 - Why Graphs",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3Bu1w3n ..."
  ],
  [
    "Deep Learning - DL أهم مصطلحات الذكاء الإصطناعى AI ومفهوم التعليم العميق",
    "التعليم العميق Deep Learning إستخدام علم الشبكات العصبية مقسم على العديد من الطبقات المكونة من الملايين من الوحدات العصبونية ..."
  ],
  [
    "How to publish your research in Machine Learning / Deep Learning | COVID-19 Research Topics",
    "Session Agenda ✓ Background of Machine Learning/Deep Learning ✓ Bibliometric Information of Research in ML/DL ✓ Hot ..."
  ],
  [
    "Machine Learning vs Deep Learning | Tamil",
    "Welcome to Easy Engineering in Tamil The video is about the different between machine learning and deep learning explaining ..."
  ],
  [
    "Le deep learning",
    "Le deep learning, une technique qui révolutionne l'intelligence artificielle...et bientôt notre quotidien ! Écrit et réalisé par David ..."
  ],
  [
    "Deep Learning for Protein Folding - Lecture 17 - MIT Deep Learning in Life Sciences (Spring 2021)",
    "MIT 6.874/6.802/20.390/20.490/HST.506 Spring 2021 Prof. Manolis Kellis Guest lecturers: Bruno Correia, Jinbo Xu, Mohammed ..."
  ],
  [
    "Deep Learning: Beyond the Hype",
    "In this 2018 GDC talk, EA's Magnus Nordin gives an overview of the potential of neural nets in game development, as well as ..."
  ],
  [
    "Real-Time Voice Cloning with Deep Learning",
    "As i am getting more familiar with deep learning, i discover many new programs that are cool yet sometime creepy, one of which is ..."
  ],
  [
    "Nuts detection with DeepLTK Deep Learning Toolkit for LabVIEW",
    "Deep learning based sorting and defect detection in production with DeepLTK - Deep Learning Toolkit for LabVIEW."
  ],
  [
    "Build a Generative Adversarial Neural Network with Tensorflow and Python | Deep Learning Projects",
    "Want to get your hands dirty building a deep learning powered GAN with Python? Well in this video you'll learn everything ..."
  ],
  [
    "Machine Learning for Fluid Mechanics",
    "eigensteve on Twitter This video gives an overview of how Machine Learning is being used in Fluid Mechanics. In fact, fluid ..."
  ],
  [
    "Python for Bioinformatics - Drug Discovery Using Machine Learning and Data Analysis",
    "Learn how to use Python and machine learning to build a bioinformatics project for drug discovery. ✏️ Course developed by ..."
  ],
  [
    "Python Chat Bot Tutorial - Chatbot with Deep Learning (Part 1)",
    "Ever wanted to create an AI Chat bot? This python chatbot tutorial will show you how to create a chatbot with python using deep ..."
  ],
  [
    "O que é Deep Learning? #HipstersPontoTube",
    "Afinal, o que é Deep Learning e onde se aplica? O Gui Silveira explica neste vídeo além de outros conceitos que rodeiam este ..."
  ],
  [
    "What is Deep Learning | Deep Learning Explained | Deep Learning Tutorial For Beginners | Simplilearn",
    "This video on \"what is Deep Learning\" will help you understand what is Deep Learning, why do we need Deep Learning, ..."
  ],
  [
    "Deep Learning - Lecture 1.1 (Introduction: Organization)",
    "Note: the live sessions have moved to 14:15-16:00 in lecture hall N05 at Morgenstelle! Lecture: Deep Learning (Prof. Andreas ..."
  ],
  [
    "🔥FREE Deep Learning Course With Certificate | Deep Learning Course For Beginners | Simplilearn",
    "Enroll for Free Deep Learning Course & Get Your Completion Certificate: ..."
  ],
  [
    "Limitations Of Deep Learning | What are the limitations of deep learning",
    "Limitations Of Deep Learning | What are the limitations of deep learning #LimitationsOfDeepLearning #UnfoldDataScience Hello ..."
  ],
  [
    "Build a Deep CNN Image Classifier with ANY Images",
    "Get the Code https://github.com/nicknochnack/ImageClassification So...you wanna build your own image classifier eh? Well in this ..."
  ],
  [
    "Deep learning for bioimage analysis",
    "Supervised deep learning has the potential to help researchers gain insights from bioimages. But before this happens, there are ..."
  ],
  [
    "Geoffrey Hinton: The Godfather of Deep Learning",
    "When Geoffrey Hinton, a researcher at Google and professor emeritus at the University of Toronto, began his work in deep ..."
  ],
  [
    "Old Photo Restoration Using Deep Learning | 2020 Novel Approach Explained &amp; Results",
    "Read the article: https://medium.com/towards-artificial-intelligence/old-photo-restoration-using-deep-learning-47d4ab1bdc4d This ..."
  ],
  [
    "Artificial Intelligence Full Course | Artificial Intelligence Tutorial for Beginners | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "Connections between physics and deep learning",
    "Max Tegmark - MIT."
  ],
  [
    "20221206 - Data Mining and Applications A - Basic Deep Learning (2)",
    ""
  ],
  [
    "Lecture 1 | Natural Language Processing with Deep Learning",
    "Lecture 1 introduces the concept of Natural Language Processing (NLP) and the problems NLP faces today. The concept of ..."
  ],
  [
    "DeepMind x UCL | Deep Learning Lectures | 8/12 |  Attention and Memory in Deep Learning",
    "Attention and memory have emerged as two vital new components of deep learning over the last few years. This lecture by ..."
  ],
  [
    "Machine Learning and Human Bias",
    "As researchers and engineers, our goal is to make machine learning technology work for everyone."
  ],
  [
    "Machine Learning with Python | Machine Learning Tutorial for Beginners | Machine Learning Tutorial",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Introduction to Artificial Intelligence, Machine Learning, Deep Learning in Telugu | Vamsi Bhavani",
    "This all began with a doubt... AI vs ML vs DL My doubt was why these words used interchangeably even when they are not the ..."
  ],
  [
    "Train a Deep Learning model for custom object detection using TensorFlow 2.x (On Google Colab)",
    "This video shows step by step tutorial on how to train an object detection model for a custom dataset using TensorFlow 2.x."
  ],
  [
    "Chat Bot With PyTorch - NLP And Deep Learning - Python Tutorial (Part 1)",
    "In this Python Tutorial we build a simple chatbot using PyTorch and Deep Learning. I will also provide an introduction to some ..."
  ],
  [
    "Image Classification Using CNN | Deep Learning Projects | Machine Learning Tutorial | Simplilearn",
    "This video, \"Image Classification using CNN,\" is a project-based video by Simplilearn where you'll get to know how to create ..."
  ],
  [
    "TensorFlow &amp; Keras Tutorial 2022 | Deep Learning With TensorFlow &amp; Keras | Simplilearn",
    "Free TensorFlow Course: ..."
  ],
  [
    "NVIDIA Making CPUs, New RTX A5000 &amp; A6000 GPUs, &amp; Deep Learning",
    "NVIDIA announced its new CPU today, a collaboration with ARM yielding the \"Grace\" CPU. The company is also releasing new ..."
  ],
  [
    "MIT 6.S191 (2021): Deep Learning New Frontiers",
    "MIT Introduction to Deep Learning 6.S191: Lecture 6 Deep Learning Limitations and New Frontiers Lecturer: Ava Soleimany ..."
  ],
  [
    "Creating a Deep Learning Model for an Image Dataset",
    "In this livestream, we will go through the steps of creating a deep learning model for an image dataset, showcasing several tools ..."
  ],
  [
    "Top 10 Deep Learning Algorithms in 2022 Part 1",
    "CONNECT ▭▭▭▭▭▭▭▭▭▭▭▭ 🖥️ Website: https://www.assemblyai.com Twitter: https://twitter.com/AssemblyAI ..."
  ],
  [
    "Deep Learning State of the Art (2019) - MIT",
    "New lecture on recent developments in deep learning that are defining the state of the art in our field (algorithms, applications, ..."
  ],
  [
    "Deep Learning Full Course🔥 - Learn Deep Learning in 6 Hours | Deep Learning Tutorial | Simplilearn",
    "FREE Deep Learning Course With Completion Certificate: ..."
  ],
  [
    "DL Project 3. Dog vs Cat Classification using Transfer Learning | Deep Learning Projects in Python",
    "This video is about building a Dog vs Cat classification system using Transfer Learning. Here we used the pre-trained model ..."
  ],
  [
    "1. Artificial Intelligence and Machine Learning",
    "MIT RES.LL-005 Mathematics of Big Data and Machine Learning, IAP 2020 Instructor: Jeremy Kepner, Vijay Gadepally View the ..."
  ],
  [
    "Tensorflow and deep learning - without a PhD by Martin Görner",
    "Please subscribe to our YouTube channel @ https://bit.ly/devoxx-youtube Like us on Facebook ..."
  ],
  [
    "Deep learning iit ropar week 11 assignment solution nptel 2022",
    "deep learning iit ropar week 11 assignment solution nptel 2022 #deeplearning #nptel #iitropar #week11 #assignment #solution."
  ],
  [
    "Introduction to Deep Learning and Neural Networks | Deep1 | Episode 1",
    "Welcome to our video on \"Introduction to Deep Learning and Neural Networks\"! In this video, we will introduce you to the exciting ..."
  ],
  [
    "FORMATION DEEP LEARNING COMPLETE (2021)",
    "Cette formation sur le Deep Learning vous apprendra à développer des réseaux de neurones artificiels, en voyant tous les détails ..."
  ],
  [
    "How to use your trained model - Deep Learning basics with Python, TensorFlow and Keras p.6",
    "In this part, we're going to cover how to actually use your model. We will us our cats vs dogs neural network that we've been ..."
  ],
  [
    "Count people with a high accuracy | CCTV camera, Opencv and Deep Learning",
    "Blog: https://pysource.com/2021/12/07/how-to-count-people-from-cctv-cameras-with-opencv-and-deep-learning/ We will see how ..."
  ],
  [
    "Introduction to Deep Learning: What Are Convolutional Neural Networks?",
    "Broadly, CNNs are a common deep learning architecture – but what exactly is a CNN? This video breaks down this sometimes ..."
  ],
  [
    "Lecture 1: Introduction to Deep Learning for Computer Vision",
    "Lecture 1 gives a broad introduction to computer vision and machine learning. We give a brief history of the two fields, starting in ..."
  ],
  [
    "Deep learning fundamentals with PyTorch | Machine Learning Essentials",
    "In this video, Seth Juarez, Principal Cloud Developer Advocate at Microsoft, displays how to use PyTorch to solve a simple image ..."
  ],
  [
    "CNN and RNN: In Depth Video | CNN and RNN In Deep Learning Explained | Deep Learning | Simplilearn",
    "In this CNN and RNN: In Depth video, you'll learn about what convolution neural network and recurrent neural networks are."
  ],
  [
    "A Friendly Introduction to Codeless Deep Learning with KNIME Analytics Platform",
    "Recent deep learning architectures have brought us solutions to previously unsolved problems. Nevertheless, for most tools, you ..."
  ],
  [
    "Efficient Computing for Deep Learning, Robotics, and AI (Vivienne Sze) | MIT Deep Learning Series",
    "Lecture by Vivienne Sze in January 2020, part of the MIT Deep Learning Lecture Series. Website: https://deeplearning.mit.edu ..."
  ],
  [
    "Konsep Cepat Memahami Deep Learning",
    "Video ini menjelaskan tentang konsep deep learning. Deep learning adalah istilah yang lagi booming dan dipakai ..."
  ],
  [
    "Super Powering Technical Artists Using Deep Learning",
    "In this 2019 GDC session, Unity Technologies' Cesar Romero explains generative models and shows why they've become ..."
  ],
  [
    "Deep Learning on Apple M1 Silicon LIVE",
    "So what does the Deep Learning workflow on the new Apple M1 Silicon 'system on a chip' look like? I lagged out last week (so i ..."
  ],
  [
    "Week 12: Assignment 12| Deep Learning- IIT Ropar |NPTEL Solution 2022 | IIT Madras |Machine Learning",
    "Pls Join: https://t.me/aiByAakash Pls follow me on LinkedIn: https://www.linkedin.com/in/aakash-singh-70a426171 Pls comment ..."
  ],
  [
    "Buying a GPU for Deep Learning? Don&#39;t make this MISTAKE! #shorts",
    "Quick GPU #shorts for y'all! Need more info? Check these out: CUDA Powered GPUs: https://developer.nvidia.com/cuda-gpus ..."
  ],
  [
    "Deep Learning For Plant Species Classification | Deep Learning Projects for Students",
    "The main objective of this classifies the different plant species using a convolution neural network of deep Learning."
  ],
  [
    "Razer x Lambda Tensorbook | The Deep Learning Laptop",
    "Introducing the new Lambda Tensorbook – the world's most powerful laptop for deep learning: https://rzr.to/lambda-tensorbook ..."
  ],
  [
    "Real-time deep learning on video streams - Eran Avidan",
    "Deep learning has recently become an abundant technology for analyzing video data. However, the increasing resolution and ..."
  ],
  [
    "Best Coding laptop 2022 | laptop for AI, Machine Learning, Android Studio, Deep Learing | DotCOM💻",
    "Book Techcanvas Consultancy - Tech Solution   🖱️🖱️🖱️https://rzp.io/l/techcanvas 🖱️🖱️🖱️ Best coding laptop under ..."
  ],
  [
    "Artificial Intelligence And Deep Learning Full Course | Artificial Intelligence Course | Simplilearn",
    "Enroll for Free AI Course & Get Your Completion Certificate: ..."
  ],
  [
    "Derivative of the Tanh Activation function | Deep Learning",
    "In this video, I will show you a step by step guide on how you can compute the derivative of a TanH Function. TanH function is a ..."
  ],
  [
    "NPTEL Deep Learning Week 8 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Tutorial 01: Introduction to Deep learning | Deep learning course syllabus | DL with Fahad Hussain",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Sign Language Detection using ACTION RECOGNITION with Python | LSTM Deep Learning Model",
    "Want to take your sign language model a little further? In this video, you'll learn how to leverage action detection to do so! You'll ..."
  ],
  [
    "Deep Reinforcement Learning in Python Tutorial - A Course on How to Implement Deep Learning Papers",
    "In this intermediate deep learning tutorial, you will learn how to go from reading a paper on deep deterministic policy gradients to ..."
  ],
  [
    "Keras Tutorial 2021 | Creating Deep Learning Models Using Keras | Deep Learning | Simplilearn",
    "Enroll for Free Deep Learning Course & Get Your Completion Certificate: ..."
  ],
  [
    "[LIVE] DAY 05 | Deep learning using PYTHON | COMPLETE in 7 - Days",
    "notes: https://github.com/ShapeAI/Python-and-Machine-Learning/blob/main/Important_concepts_in_python.ipynb For more events ..."
  ],
  [
    "Realtime Object Detection | Object Detection with TensorFlow | Edureka | Deep Learning Live - 1",
    "AI & Deep Learning Using TensorFlow - https://www.edureka.co/ai-deep-learning-with-tensorflow ** This Edureka video will ..."
  ],
  [
    "Nuts and Bolts of Applying Deep Learning (Andrew Ng)",
    "The talks at the Deep Learning School on September 24/25, 2016 were amazing. I clipped out individual talks from the full live ..."
  ],
  [
    "NPTEL Deep Learning Week 10 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Deep Learning for Image Super-Resolution",
    "Conceived and presented by Alice Lucas, Northwestern University. Edited by This talk was given in the context of Northwestern ..."
  ],
  [
    "ArcGIS API for Python: Geospatial Deep Learning with arcgis.learn",
    "In this webinar, we will showcase the Geospatial AI capabilities of the ArcGIS API for Python. We will cover several workflows ..."
  ],
  [
    "Get Started with the OpenVINO™ Deep Learning Workbench | Intel Software",
    "Learn how to get started with the OpenVINO™ Deep Learning Workbench. This video demonstrates how to import your first model ..."
  ],
  [
    "Unsupervised Brain Models - How does Deep Learning inform Neuroscience? (w/ Patrick Mineault)",
    "deeplearning #brain #neuroscience Originally, Deep Learning sprang into existence inspired by how the brain processes ..."
  ],
  [
    "Deep Learning",
    ""
  ],
  [
    "PYTHON &amp; Deep learning | Project Making | COMPLETE in 7 - Days",
    "Submission form: https://forms.gle/2xZpxwXR4KVvkAwCA Last Submission Date : 10th Nov notes: ..."
  ],
  [
    "Deep Maths - machine learning and mathematics",
    "In December 2021 mathematicians at Oxford and Sydney universities together with their collaborators at Google DeepMind ..."
  ],
  [
    "Deep learning: A meaningful ML technique",
    "Intro to deep learning to track deforestation in supply chains → https://goo.gle/3W8btPe Notebook with code in colab ..."
  ],
  [
    "Welcome (Deep Learning Specialization C1W1L01)",
    "Take the Deep Learning Specialization: http://bit.ly/39EsebZ Check out all our courses: https://www.deeplearning.ai Subscribe to ..."
  ],
  [
    "Computer Vision and Perception for Self-Driving Cars (Deep Learning Course)",
    "Learn about Computer Vision and Perception for Self Driving Cars. This series focuses on the different tasks that a Self Driving ..."
  ],
  [
    "¿Qué es el Machine Learning?¿Y Deep Learning? Un mapa conceptual | DotCSV",
    "Antes de profundizar en el apasionante mundo de la Inteligencia Artificial, hay que conocer bien por donde nos movemos."
  ],
  [
    "Deep Learning-1 التعلم العميق (الجزء الاول)",
    "شرحنا في هذا الفيديو فكرة عامة عن التعلم العميق وعلاقته بتعلم الالة والذكاء الاصطناعي والشروط الواجب توفرها لنقول عن الشبكة ..."
  ],
  [
    "Xon Gold 6248 Dual ㅣRTX A6000 Deep Learning Server PC",
    "RTXA6000#intel#ai#DeepLearning#yangcom CPU: Intel Xeon Scalable Gold 6248 (2EA) M/B: ASUS WS C621E SAGE RAM: ..."
  ],
  [
    "Week 10 Assignment 10 | Deep Learning- IIT Ropar |NPTEL Solution 2022 | IIT Madras |Machine Learning",
    "Pls Join: https://t.me/aiByAakash Pls follow me on LinkedIn: https://www.linkedin.com/in/aakash-singh-70a426171 Pls comment ..."
  ],
  [
    "What is Machine Learning With Full Information? – [Hindi] – Quick Support",
    "WhatisMachineLearning #QuickSupport #Technology What is Machine Learning With Full Information? – [Hindi] – Quick Support."
  ],
  [
    "Deep Learning Explained In 1 Minute | What Is Deep Learning? | Deep Learning | #Shorts | Simplilearn",
    "Enroll for Free Machine Learning with R Course & Get Your Completion Certificate: ..."
  ],
  [
    "TensorFlow &amp; Keras Tutorial 2022 | Deep Learning With TensorFlow &amp; Keras | Simplilearn",
    "Free TensorFlow Course: ..."
  ],
  [
    "Detection of Cardiovascular Diseases in ECG Images Using Machine Learning and Deep Learning Methods",
    "Detection of Cardiovascular Diseases in ECG Images Using Machine Learning and Deep Learning Methods | Python IEEE ..."
  ],
  [
    "Deep Learning State of the Art (2019) - MIT",
    "New lecture on recent developments in deep learning that are defining the state of the art in our field (algorithms, applications, ..."
  ],
  [
    "Deep Learning Locate Points in body temperature measurement and thermal imaging",
    "Adaptive Vision #deeplearning Locate Points tool enables you to easily mark and precisely locate measurement points (e.g. ..."
  ],
  [
    "Machine Learning for Trading - Stocks - Shares - Python - AI - Deep Learning Course Algorithmic",
    "Pandas, Time series analysis, Computational Investing, Algorithmic trading, Reinforcement learning for Trading This course ..."
  ],
  [
    "Introduction to Deep Learning and Neural Networks | Deep1 | Episode 1",
    "Welcome to our video on \"Introduction to Deep Learning and Neural Networks\"! In this video, we will introduce you to the exciting ..."
  ],
  [
    "Count people with a high accuracy | CCTV camera, Opencv and Deep Learning",
    "Blog: https://pysource.com/2021/12/07/how-to-count-people-from-cctv-cameras-with-opencv-and-deep-learning/ We will see how ..."
  ],
  [
    "Deep learning iit ropar week 11 assignment solution nptel 2022",
    "deep learning iit ropar week 11 assignment solution nptel 2022 #deeplearning #nptel #iitropar #week11 #assignment #solution."
  ],
  [
    "20221206 - Data Mining and Applications A - Basic Deep Learning (2)",
    ""
  ],
  [
    "Tensorflow and deep learning - without a PhD by Martin Görner",
    "Please subscribe to our YouTube channel @ https://bit.ly/devoxx-youtube Like us on Facebook ..."
  ],
  [
    "Image Classification Using CNN | Deep Learning Projects | Machine Learning Tutorial | Simplilearn",
    "This video, \"Image Classification using CNN,\" is a project-based video by Simplilearn where you'll get to know how to create ..."
  ],
  [
    "Deep learning: A meaningful ML technique",
    "Intro to deep learning to track deforestation in supply chains → https://goo.gle/3W8btPe Notebook with code in colab ..."
  ],
  [
    "Deep Learning Fundamentals Cognitive Classes Solutions IBM Free Certificate",
    "Deep Learning Fundamentals Cognitive Class Quiz Answers | IBM Free Courses | Cognitive Class #techninjas #techninjas2.0 ..."
  ],
  [
    "AI Learns to Escape (using Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 5 rooms I've designed. The AI was trained ..."
  ],
  [
    "Deep learning fundamentals with PyTorch | Machine Learning Essentials",
    "In this video, Seth Juarez, Principal Cloud Developer Advocate at Microsoft, displays how to use PyTorch to solve a simple image ..."
  ],
  [
    "Handwriting to Text Conversion using Deep Learning",
    "datascience #deeplearning #machinelearning In this webinar we will look at how we can extract content out of handwritten ..."
  ],
  [
    "Loss or Cost Function | Deep Learning Tutorial 11 (Tensorflow Tutorial, Keras &amp; Python)",
    "Loss or a cost function is an important concept we need to understand if you want to grasp how a neural network trains itself."
  ],
  [
    "Xon Gold 6248 Dual ㅣRTX A6000 Deep Learning Server PC",
    "RTXA6000#intel#ai#DeepLearning#yangcom CPU: Intel Xeon Scalable Gold 6248 (2EA) M/B: ASUS WS C621E SAGE RAM: ..."
  ],
  [
    "LE PERCEPTRON - DEEP LEARNING (02)",
    "Le Perception est l'unité de base des réseaux de neurones artificiels. Pour apprendre le Deep Learning, il faut commencer par ..."
  ],
  [
    "Creating a Deep Learning Model for an Image Dataset",
    "In this livestream, we will go through the steps of creating a deep learning model for an image dataset, showcasing several tools ..."
  ],
  [
    "Deep Learning for Video Analysis - Victor Campos - UPC Barcelona 2018",
    "https://www.slideshare.net/xavigiro/deep-video-analysis-vctor-campos-upc-barcelona-2018 ..."
  ],
  [
    "NPTEL Deep Learning Week 8 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "شرح سريع و مبسط لما هو التعلم العميق Deep Learning",
    "التعلم العميق Deep Learning هو مجموعة فرعية من التعلم الآلي Machine Learning ، والذي بدوره هو مجموعة فرعية من الذكاء الاصطناعي ..."
  ],
  [
    "Deep Learning Tutorial | Deep Learning TensorFlow | Deep Learning With Neural Networks | Simplilearn",
    "This Deep Learning tutorial will help you in understanding what is Deep Learning, why do we need Deep learning, what is neural ..."
  ],
  [
    "Derivative of the Tanh Activation function | Deep Learning",
    "In this video, I will show you a step by step guide on how you can compute the derivative of a TanH Function. TanH function is a ..."
  ],
  [
    "Comprendre le DeepLearning et les Réseaux de neurones en 10 mins !",
    "Dans cette vidéo de vulgarisation je vais tenter de vous expliquer ce qu'est le deeplearning sans rentrer dans des détails de ..."
  ],
  [
    "NPTEL Deep Learning Week 5 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Deep learning Tutorial with Python | Deep Learning Full course -2021 | TensorFlow | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Deep Q Learning for Video Games - The Math of Intelligence #9",
    "We're going to replicate DeepMind's Deep Q Learning algorithm for Super Mario Bros! This bot will be able to play a bunch of ..."
  ],
  [
    "Sign Language Detection using ACTION RECOGNITION with Python | LSTM Deep Learning Model",
    "Want to take your sign language model a little further? In this video, you'll learn how to leverage action detection to do so! You'll ..."
  ],
  [
    "Week 12: Assignment 12| Deep Learning- IIT Ropar |NPTEL Solution 2022 | IIT Madras |Machine Learning",
    "Pls Join: https://t.me/aiByAakash Pls follow me on LinkedIn: https://www.linkedin.com/in/aakash-singh-70a426171 Pls comment ..."
  ],
  [
    "Top 10 Deep Learning Projects for Engineering Students in 2022 | Deep Learning Projects",
    "Deep Learning is a domain with diverse technologies such as tablets and computers that can learn based on programming and ..."
  ],
  [
    "Nuts and Bolts of Applying Deep Learning (Andrew Ng)",
    "The talks at the Deep Learning School on September 24/25, 2016 were amazing. I clipped out individual talks from the full live ..."
  ],
  [
    "Mobb Deep - The Learning ft. Big Noyd (Burn) (Official Video)",
    "Watch the official music video for \"The Learning (Burn)\" by Mobb Deep featuring Big Noyd Listen to Mobb Deep: ..."
  ],
  [
    "Lecture 03 - Data Science vs Machine Learning vs AI vs Deep Learning vs Data Mining",
    "Data Science vs Machine Learning vs AI vs Deep Learning vs Data Mining."
  ],
  [
    "KÜNSTLICHE INTELLIGENZ vs. MACHINE LEARNING vs. DEEP LEARNING",
    "Inhalt Künstliche #Intelligenz wird unsere #Gesellschaft verändern und ist schon heute aus unserem #Alltag kaum mehr ..."
  ],
  [
    "DL Project 3. Dog vs Cat Classification using Transfer Learning | Deep Learning Projects in Python",
    "This video is about building a Dog vs Cat classification system using Transfer Learning. Here we used the pre-trained model ..."
  ],
  [
    "NPTEL Deep Learning Week 10 Quiz Assignment Solutions | July 2022 | IIT Ropar",
    "Deep Learning NPTEL Elective Course July 2022 ABOUT THE COURSE : Deep Learning has received a lot of attention over ..."
  ],
  [
    "Diabetic Retinopathy Detection by means of Deep Learning | Python IEEE Project 2021 - 2022.",
    "Diabetic Retinopathy Detection by means of Deep Learning | Python Final Year IEEE Project 2021 - 2022. Buy Link: ..."
  ],
  [
    "Intelligence Artificielle VS Machine Learning VS Deep Learning - Les différences entre ces termes",
    "Aujourd'hui on parles des différences qui résident entre les termes d'Intelligence Artificielle, de Machine Learning et de Deep ..."
  ],
  [
    "Artificial Intelligence And Deep Learning Full Course | Artificial Intelligence Course | Simplilearn",
    "Enroll for Free AI Course & Get Your Completion Certificate: ..."
  ],
  [
    "[LIVE] DAY 05 | Deep learning using PYTHON | COMPLETE in 7 - Days",
    "notes: https://github.com/ShapeAI/Python-and-Machine-Learning/blob/main/Important_concepts_in_python.ipynb For more events ..."
  ],
  [
    "Music Generation using Deep Learning",
    "Screencast for Third Year Project at the University of Manchester for my BSc in Artificial Intelligence. Final report and full project ..."
  ],
  [
    "Computer Vision and Perception for Self-Driving Cars (Deep Learning Course)",
    "Learn about Computer Vision and Perception for Self Driving Cars. This series focuses on the different tasks that a Self Driving ..."
  ],
  [
    "Welcome (Deep Learning Specialization C1W1L01)",
    "Take the Deep Learning Specialization: http://bit.ly/39EsebZ Check out all our courses: https://www.deeplearning.ai Subscribe to ..."
  ],
  [
    "Deep Learning",
    ""
  ],
  [
    "PYTHON &amp; Deep learning | Project Making | COMPLETE in 7 - Days",
    "Submission form: https://forms.gle/2xZpxwXR4KVvkAwCA Last Submission Date : 10th Nov notes: ..."
  ],
  [
    "Deep Learning in .NET | .NET Conf 2022",
    "NET is a cross-platform and cross-application scenario open source technology solution. Are you using .NET to complete deep ..."
  ],
  [
    "Energy-Efficient Deep Learning: Challenges and Opportunities",
    "This talk will describe methods to enable energy-efficient processing for deep learning, specifically convolutional neural networks ..."
  ],
  [
    "شرح سريع و مبسط لما هو التعلم العميق Deep Learning",
    "التعلم العميق Deep Learning هو مجموعة فرعية من التعلم الآلي Machine Learning ، والذي بدوره هو مجموعة فرعية من الذكاء الاصطناعي ..."
  ],
  [
    "Deep Learning Determinism",
    "This is a presentation was given on March 20, 2019 at GTC in San Jose, California. Slides: https://bit.ly/dl-determinism-slides ..."
  ],
  [
    "Learn Deep Learning in 60 Minutes  | Deep Learning Tutorial | Deep Learning | Edureka  Live",
    "Edureka Deep Learning Course with Tensorflow Certification ..."
  ],
  [
    "Image Classification With Deep Learning And Tensorflow: Intro Project",
    "In this video, we'll walk through an end to end computer vision project using TensorFlow and Keras. We'll read in an image ..."
  ],
  [
    "Get Started with the OpenVINO™ Deep Learning Workbench | Intel Software",
    "Learn how to get started with the OpenVINO™ Deep Learning Workbench. This video demonstrates how to import your first model ..."
  ],
  [
    "MIT 6.S191: Deep Generative Modeling",
    "MIT Introduction to Deep Learning 6.S191: Lecture 4 Deep Generative Modeling Lecturer: Ava Soleimany January 2022 For all ..."
  ],
  [
    "การเรียนรู้เชิงลึกอะไร | What is Deep Learning?",
    "5 ประเภทของ Deep Learning ได้แก่ DNN, CNN, RNN, GAN, DRL รายละเอียดติดตามได้ในคลิป ซีรีย์ Machine Learning ฉบับเข้าใจง่าย โดย ..."
  ],
  [
    "Generate Video Variations - No dataset or deep learning required, Only Nearest Neighbors!",
    "References: ▻Read the full article: https://www.louisbouchard.ai/vgpnn-generate-video-variations/ ▻Paper covered: Haim, N., ..."
  ],
  [
    "Fare il DOTTORATO SERVE nel 2022? (Informatica e Deep Learning)",
    "Assieme a Luca Arrotta parliamo della scelta del Dottorato di Ricerca, mettendo il focus sull'esperienza di Luca come PhD in ..."
  ],
  [
    "Diferencias entre Inteligencia Artificial vs Machine Learning vs Deep Learning",
    "Estos terminos siempre confunden. En este video aclaro las diferencias y su relación con la ciencia de datos. Espero que te ..."
  ],
  [
    "MIT 6.S094: Deep Learning",
    "This is lecture 1 of course 6.S094: Deep Learning for Self-Driving Cars (2018 version). This class is free and open to everyone."
  ],
  [
    "Stanford CS224N: NLP with Deep Learning | Winter 2019 | Lecture 1 – Introduction and Word Vectors",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3CORGu1 ..."
  ],
  [
    "What Is Artificial Intelligence? | 🔥Artificial Intelligence Course | AI In 5 Minutes | |Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "image classification using deep learning  | image classifcation using deeplearning on custom dataset",
    "Image Classification using CNN | Deep Learning Tutorial | Machine Learning Project | Smart Ai Technologies. Topic AIM:Image ..."
  ],
  [
    "LE PERCEPTRON - DEEP LEARNING (02)",
    "Le Perception est l'unité de base des réseaux de neurones artificiels. Pour apprendre le Deep Learning, il faut commencer par ..."
  ],
  [
    "Comprendre le DeepLearning et les Réseaux de neurones en 10 mins !",
    "Dans cette vidéo de vulgarisation je vais tenter de vous expliquer ce qu'est le deeplearning sans rentrer dans des détails de ..."
  ],
  [
    "How This Guy Uses A.I. to Create Art | Obsessed | WIRED",
    "Artist Refik Anadol doesn't work with paintbrushes or clay. Instead, he uses large collections of data and machine learning ..."
  ],
  [
    "KÜNSTLICHE INTELLIGENZ vs. MACHINE LEARNING vs. DEEP LEARNING",
    "Inhalt Künstliche #Intelligenz wird unsere #Gesellschaft verändern und ist schon heute aus unserem #Alltag kaum mehr ..."
  ],
  [
    "PyTorch Tutorial For Beginners | Deep Learning with Python Tutorial | Edureka | DL Rewind - 1",
    "Topics covered in this video: 00:00:00 Introduction 00:00:32 Agenda 00:00:58 How Deep Learning Changed Our World 00:07:04 ..."
  ],
  [
    "Deploying Deep Learning Models  | Deep Learning for Engineers, Part 5",
    "This video covers the additional work and considerations you need to think about once you have a deep neural network that can ..."
  ],
  [
    "Python for Data Science - Course for Beginners (Learn Python, Pandas, NumPy, Matplotlib)",
    "This Python data science course will take you from knowing nothing about Python to coding and analyzing data with Python using ..."
  ],
  [
    "Deep Learning Model to Detect Normal and Abnormal Heartbeat from ECG signal in MATLAB",
    "Deep Learning Model to Detect Normal and Abnormal Heartbeat from ECG signal using MATLAB This example I used from ..."
  ],
  [
    "الفرق بين Neural Networks vs Deep Learning   S3 E03",
    "شرح مختصر وسهل و مبسط الفرق بين Neural Network vs Machine learning الشبكات العصبية و التعلم العميق Data science vs ..."
  ],
  [
    "AI ROVER AND COGNITIVE DEEP LEARNING",
    "THIS VIDEO IS A PROMOTIONAL VIDEO FOR THE AI ROVE EXPLORING THE CATACOMBS OF THE GREAT PYRAMIDS."
  ],
  [
    "Land use land cover image classification using deep learning | EuroSat | ResNet50 | GeoDev",
    "The EuroSat official GitHub repo: https://github.com/phelber/EuroSAT Full code of this tutorial: ..."
  ],
  [
    "Deep Learning // Dicionário do Programador",
    "HOSPEDAGEM TURBINADA → https://codft.me/HG7EpQsB225vs Você já ouviu falar em Aprendizado Profundo?"
  ],
  [
    "Intelligence Artificielle VS Machine Learning VS Deep Learning - Les différences entre ces termes",
    "Aujourd'hui on parles des différences qui résident entre les termes d'Intelligence Artificielle, de Machine Learning et de Deep ..."
  ],
  [
    "Deep Learning Tutorial | Deep Learning Tutorial for Beginners | Neural Networks | Edureka",
    "Deep Learning Training - https://www.edureka.co/ai-deep-learning-with-tensorflow ) This Edureka \"Deep Learning Tutorial\" video ..."
  ],
  [
    "What is Layer Normalization? | Deep Learning Fundamentals",
    "You might have heard about Batch Normalization before. It is a great way to make your networks faster and better but there are ..."
  ],
  [
    "What is Deep Learning? | Deep Learning Tutorial For Beginners | Edureka | Deep Learning Rewind - 1",
    "Edureka Tensorflow Training - https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka \"What is Deep Learning\" ..."
  ],
  [
    "Deep Learning with Python | Deep Learning Tutorial | Edureka Rewind - 1",
    "Edureka Deep Learning Course with Tensorflow Certification ..."
  ],
  [
    "The Only Deep Learning Book You Need",
    "Description In this video I review my favorite deep learning book. I like that it covers advanced topics in deep learning and also ..."
  ],
  [
    "Introduction to Deep Learning",
    "Artificial Intelligence powered by Deep Learning is rapidly changing the world! Henry AI Labs makes videos with intuitive ..."
  ],
  [
    "🎄👀Looking For Free Deep Learning Project🫶?  Codersarts",
    "codersarts #deeplearning #shorts #machinelearning #youtubeshorts Brain Tumor Detection - Deep Learning: ..."
  ],
  [
    "35. Che differenza c&#39;è tra Intelligenza Artificiale, Machine Learning e Deep learning? #36",
    "Che differenza c'è tra Intelligenza Artificiale, Machine Learning e Deep learning? Sono tre concetti che spesso (a torto) vediamo ..."
  ],
  [
    "Deep Learning入門：Deep Learningとは？",
    "この動画では、ニューラルネットワークの歴史を追いながらDeep Learningの基礎についてやさしく解説します。 前回の動画（ ..."
  ],
  [
    "O QUE É DEEP LEARNING?",
    "Um vídeo introdutório sobre o conceito de redes neurais (atualmente chamado de deep learning), cubos mágicos e Super Mario."
  ],
  [
    "LES GRADIENTS D&#39;UN NEURONE - DEEP LEARNING (03)",
    "En Deep Learning, l'algorithme de la descente de gradient nécessite de connaitre l'expression des gradients de la fonction Cout ..."
  ],
  [
    "Deep Learning",
    "Deep Learning is an Educational YouTube channel solely made so that we can spread knowledge by means of understanding ..."
  ],
  [
    "Problems with RNN | 100 Days of Deep Learning",
    ""
  ],
  [
    "294 - Denoising 3D multi-channel scientific images using Noise2Void deep learning approach",
    "294 - Denoising 3D multi-channel scientific images using Noise2Void deep learning approach This video explains the process of ..."
  ],
  [
    "Deep Learning",
    "Vocabulary (from the Latin for \"name,\" also called wordstock, lexicon, and lexis) refers to all the words in a language that are ..."
  ],
  [
    "DEEP LEARNING",
    "Welcome to my channel Hi My Name Is Jagannath . I am a student . Please support me. Thank you."
  ],
  [
    "Deep Learning Basics (Day-11)",
    "python #datascience #machinelearning ✓Subscribe to our Channel to learn more about the top Data Science, Machine Learning ..."
  ],
  [
    "Deep Learning",
    ""
  ],
  [
    "Machine Learning Engineer Roadmap 2023",
    "Machine Learning Engineering Roadmap | How to Become a Deep Learning Engineer | Data Science Algorithms | AI Frameworks ..."
  ],
  [
    "Deep Learning",
    "Mobile Tips , computer tips , app review , website review Hello friends my name is Deepak Kumar and my channel name is Deep ..."
  ],
  [
    "Machine Learning Projects For Beginners 2023 | Machine Learning Projects | ML Projects | Simplilearn",
    "This video will help you build various \" Machine Learning Projects For Beginners 2023 \" from scratch. Starting with Heart Disease ..."
  ],
  [
    "Deep Learning Full Course - in 2 Hours",
    "Welcome to our full course on Deep Learning! In this intensive 2-hour course, you will learn the fundamentals of deep learning ..."
  ]
]