[
  [
    "K means Clustering Algorithm Explained With an Example Easiest And Quickest Way Ever In Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "K mean clustering algorithm with solve example",
    "Machinelearning #LMT #lastmomenttuitions Machine Learning Full Course: https://bit.ly/3oobHT9 Last moment tuitions are ..."
  ],
  [
    "StatQuest: K-means clustering",
    "K-means clustering is used in all kinds of situations and it's crazy simple. The R code is on the StatQuest GitHub: ..."
  ],
  [
    "K Means Clustering Algorithm | K Means Example in Python | Machine Learning Algorithms | Edureka",
    "Python Training for Data Science (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "K Means Clustering Intuition",
    "Here is a complete intuition behind K Means Clustering Algorithm. We will understand the complete the complete geometric ..."
  ],
  [
    "Machine Learning Tutorial Python - 13:  K Means Clustering Algorithm",
    "K Means clustering algorithm is unsupervised machine learning technique used to cluster data points. In this tutorial we will go ..."
  ],
  [
    "K Means Clustering Algorithm - Solved Numerical Example Big Data Analytics Tutorial by Mahesh Huddar",
    "K Means Clustering Algorithm - Solved Numerical Example - Big Data Analytics Tutorial #BigDataAnalytics ..."
  ],
  [
    "K-Means Clustering Algorithm | Geometric Intuition | Clustering | Unsupervised Learning",
    "K-Means Clustering Algorithm | Geometric Intuition | Clustering | Unsupervised Learning Hi, My name is Nitish, and welcome to ..."
  ],
  [
    "K-Means Clustering Algorithm – Solved Numerical Question 1(Euclidean Distance)(Hindi)",
    "K-Means Clustering Algorithm – Solved Numerical Question 1(Euclidean Distance)(Hindi) Data Warehouse and Data Mining ..."
  ],
  [
    "Live Day 6- Discussing KMeans,Hierarchical And DBScan Clustering Algorithms",
    "Join the community session https://ineuron.ai/course/Mega-Community . Here All the materials will be uploaded. Live ML Playlist: ..."
  ],
  [
    "K-Mean Clustering",
    "Data Warehouse and Mining For more: http://www.anuradhabhatia.com."
  ],
  [
    "K mean clustering with an example in machine learning in hindi | Lec-20",
    "ersahilkagyan #machinelearning Subscribe the channel for more videos ..."
  ],
  [
    "K Means Clustering Algorithm | K Means In Python | Machine Learning Algorithms |Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "K Means Clustering in 15 Minutes | K means clustering explained | K means clustering in python",
    "K Means Clustering in 15 Minutes | K means clustering explained | K means clustering in python #KMeansClustering ..."
  ],
  [
    "K-means Clustering Example / KTU Machine learning",
    "kmeansclusteringexample #machinelearning #k-means Clustering or cluster analysis is the task of grouping a set of objects in ..."
  ],
  [
    "Hindi Machine Learning Tutorial 14 - K Means Clustering",
    "K Means algorithm is unsupervised machine learning technique used to cluster data points. In this tutorial we will go over some ..."
  ],
  [
    "K mean clustering algorithm ( Solved problem )",
    "This video is on K mean Clustering Algorithm with a solved example. Purchase notes right now, more details below: ..."
  ],
  [
    "KMeans Clustering Algorithm | Steps in KMeans Algorithm | Advantages Disadvantages by Mahesh Huddar",
    "KMeans Clustering Algorithm | Steps in KMeans Algorithm | Advantages and Disadvantages by Mahesh Huddar Machine ..."
  ],
  [
    "Unsupervised Learning: Introduction to K-mean Clustering",
    "Correctoin: at 11:53, In cluster 2: ( (8+7+6)/3,(4+5+4)/3 ) instead of ( (8+7+6)/4,(4+5+4)/4 )."
  ],
  [
    "Lecture 13.2 —  Clustering | KMeans Algorithm — [ Machine Learning | Andrew Ng ]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "#24 Partitioning Clustering - K Means Algorithm |DM|",
    "Abroad Education Channel : https://www.youtube.com/channel/UC9sgREj-cfZipx65BLiHGmw Company Specific HR Mock ..."
  ],
  [
    "Machine Learning | K-means Clustering",
    "Kmeans algorithm is an iterative algorithm that tries to partition the dataset into Kpre-defined distinct non-overlapping subgroups ..."
  ],
  [
    "Clustering: K-means and Hierarchical",
    "Announcement: New Book by Luis Serrano! Grokking Machine Learning. bit.ly/grokkingML 40% discount code: serranoyt A ..."
  ],
  [
    "k means clustering solved example in hindi. k means algorithm data mining and machine learning",
    "Please Fill the form - https://docs.google.com/forms/d/1kOxvqvz1IvBMHJ3UeLecLDuK7ePKjHAvHaRcxduHKEE/edit ..."
  ],
  [
    "k-Means Cluster Analysis",
    "The k-Means cluster analysis is one of the simplest and most common procedures for cluster analysis. Thus, the k-Means method ..."
  ],
  [
    "k means clustering example in data mining machine learning in hindi Urdu, k-means example in hindi",
    "In this k means clustering example tutorial, a very important question of k-means example is solved as k means clustering ..."
  ],
  [
    "K means Clustering algorithm in Data Mining | Telugu | Giridhar",
    "K-means clustering algorithm with single attribute value with 2 clusters watch my previous videos Introduction to DWDM video ..."
  ],
  [
    "K-Means Clustering",
    "Intro to the K-Means Clustering method in machine learning."
  ],
  [
    "K-Means Clustering Explanation and Visualization",
    "A step by step explanation of how the K-Means algorithm runs."
  ],
  [
    "K-means clustering: how it works",
    "Full lecture: http://bit.ly/K-means The K-means algorithm starts by placing K points (centroids) at random locations in space."
  ],
  [
    "K means Clustering with example | Detailed Explanation",
    "Kmeans #kmeansclustering Kmedoid Clustering https://youtu.be/WIgJFnz8VNc Hello everyone welcome back to my channel .. in ..."
  ],
  [
    "K Means Clustering Algorithm (Theory) in Telugu ||  Machine learning in Telugu || Python Coding",
    "Hey folks, Welcome to my channel Nerchuko. Follow this channel on Instagram: https://www.instagram.com/nerchu_ko/ Join Our ..."
  ],
  [
    "K - Means clustering  - Unsupervised Learning || தமிழில் || Tamil || ML-9 || Explained || We &amp; Data",
    "What is Unsupervised Learning and clustering, K-Means clustering algorithm explained in a simple and understandable way, For ..."
  ],
  [
    "50 - What is k-means clustering and how to code it in Python?",
    "k-means is probably the simplest unsupervised machine learning algorithm that uses clustering techniques to sort data into ..."
  ],
  [
    "k-means clustering",
    "k-means clustering is a popular baseline for data analysis. This video visualizes how Lloyd's algorithm iteratively updates clusters ..."
  ],
  [
    "4.5 K means example",
    "GATE Insights Version: CSE http://bit.ly/gate_insights or GATE Insights Version: CSE ..."
  ],
  [
    "K-Means Clustering Algorithm - Cluster Analysis | Machine Learning Algorithm | Data Science |Edureka",
    "Data Science Training - https://www.edureka.co/data-science-r-programming-certification-course ) This Edureka k-means ..."
  ],
  [
    "Kmeans Clustering",
    ""
  ],
  [
    "K-means &amp; Image Segmentation - Computerphile",
    "K-means sorts data based on averages. Dr Mike Pound explains how it works. Fire Pong in Detail: https://youtu.be/ZoZMMg1r_Oc ..."
  ],
  [
    "How K-mean clustering groups data-: A Simple Example",
    "In this video we use a very simple example to explain how K-mean clustering works to group observations in K clusters."
  ],
  [
    "Python Machine Learning Tutorial #11 - How K Means Clustering Works",
    "This python machine learning tutorial covers how k means clustering works. K means clustering is an unsupervised machine ..."
  ],
  [
    "K-means Clustering",
    "Lecture 16 in the Introductory Applied Machine Learning (IAML) course by Victor Lavrenko at the University of Edinburgh."
  ],
  [
    "Easy k-Means Clustering with MATLAB",
    "Cluster data using the k-means algorithm in the Live Editor. The Cluster Data Live Editor Task enables you to interactively perform ..."
  ],
  [
    "k-Means Clustering: Simply explained &amp; calculated",
    "The k-Means cluster analysis is one of the simplest and most common methods of cluster analysis. Therefore the k-Means method ..."
  ],
  [
    "ML 22 : K-means Clustering Algorithm with Solved Examples | Clustering",
    "Connect with me by: LIKE & SHARE Videos with your friends. SUBSCRIBE @CS & IT Tutorials by Vrushali ‍   Instagram: ..."
  ],
  [
    "K-MEANS CLUSTERING.mp4",
    "Let's learn in Detail with Let the Data Confess ✨   Save it for future Share it with your network #machinelearning ..."
  ],
  [
    "How does K-Means algorithm work? #Shorts",
    "Learn about K-Means in One minute! #k_means #machine_learning."
  ],
  [
    "K Means Clustering: Pros and Cons of K Means Clustering",
    "Sign up for Our Complete Data Science Training with 57% OFF: https://bit.ly/2RBzGO7 This tutorial provides and introduction to ..."
  ],
  [
    "Applied K-Means Clustering in R",
    "Likes: 727 : Dislikes: 5 : 99.317% : Updated on 10-09-2022 17:20:50 EDT ===== An easy to follow guide on K-Means ..."
  ],
  [
    "K-Means Cluster Analysis in SPSS",
    "This video demonstrates how to conduct a K-Means Cluster Analysis in SPSS. A K-Means Cluster Analysis allows the division of ..."
  ],
  [
    "K-Means Cluster Analysis in SPSS",
    "This video demonstrates how to conduct a K-Means Cluster Analysis in SPSS. A K-Means Cluster Analysis allows the division of ..."
  ],
  [
    "K-Means Clustering Algorithm in Python | Practical Example | Student Clustering Example | sklearn",
    "K-Means Clustering Algorithm in Python | Practical Example | Student Clustering Example | sklearn Hi, my name is Nitish and ..."
  ],
  [
    "SPSS  : K Means Clustering",
    "kobriendublin.wordpress.com SPSS : K Means Clustering."
  ],
  [
    "SAS Tutorial | K-means Clustering Algorithm",
    "In this SAS How To Tutorial, Cat Truxillo explores using the k-means clustering algorithm. In SAS, there are lots of ways that you ..."
  ],
  [
    "K-Means Clustering Algorithm - How it Works and What are the Basic Steps For K Means Clustering",
    "Itronix Solutions Free Certified Courses: https://bit.ly/31nzuHa ▻Machine Learning & AI Certification: https://bit.ly/3lVJErZ ▻Join ..."
  ],
  [
    "Introduction to K-Means Clustering",
    "This video explains what is K-Means Clustering and how this algorithm is used for Clustering Analysis. Watch this video to learn ..."
  ],
  [
    "9 Interview questions on K Means clustering |  Data Science Interview Questions and answers",
    "9 Interview questions on K Means clustering | Data Science Interview Questions and answers Hello , My name is Aman and I am a ..."
  ],
  [
    "Customer Segmentation Using K-Means Clustering | Machine Learning | GeeksforGeeks",
    "In this video, we're going to discuss how to perform K-Means Clustering to segregate customers, based on the given data, in the ..."
  ],
  [
    "How to implement k Means Clustering | Weka Tutorial",
    "Welcome to Dwbiadda's weka tutorial for beginners, as part of this lecture we will see, How to implement k Means Clustering."
  ],
  [
    "K-Means Clustering in Python - Machine Learning From Scratch 12 - Python Tutorial",
    "Get my Free NumPy Handbook: https://www.python-engineer.com/numpybook In this Machine Learning from Scratch Tutorial, we ..."
  ],
  [
    "K-means Clustering Algorithm on Excel on Warehouse Inventory,Tutorial by Hemanth Boddapu",
    "This video is a tutorial on clustering warehouse inventory using K-means clustering Algorithm, a very popular machine learning ..."
  ],
  [
    "Finding K in K-means Clustering Automatically",
    "We all know how K-Means Clustering works! Is there a shortcut by which we can identify the optimum value of clusters in K-means ..."
  ],
  [
    "Writing K-means clustering in Python from Scratch!",
    "Code: https://gist.github.com/tanmayb123/5b9321c3497dcc8b6823590b46bb65ff."
  ],
  [
    "Implementation of Simple K-means Clustering algorithm using Weka Tool",
    "Implementation of Simple K-means Clustering algorithm using Weka Tool."
  ],
  [
    "K-means Algorithm Demo",
    "K-means algorithm demo for Machine Learning class by using poker cards."
  ],
  [
    "K means clustering in unsupervised learning using knime tool | K mean with knime| k mean dataset",
    "K means clustering in unsupervised learning using knime tool | K mean with knime| k mean dataset Our Official Website ..."
  ],
  [
    "K Means algorithm-  Part 1 solved example in hindi",
    "Learn K-Means clustering in very simple way."
  ],
  [
    "How are k-means clustering algorithms sensitive to outliers?",
    "Complete Machine Learning & Data Science using MATLAB: ..."
  ],
  [
    "K means clustering algorithm in data mining in bangla/Data mining tutorial in Bangla",
    "K means clustering algorithm in data mining in bangla/Data mining tutorial in Bangla/k means algorithm/k means algorithm in data ..."
  ],
  [
    "K mean clustering algorithm with solved example ||machine learning in Hindi || ML-#08",
    ""
  ],
  [
    "Visualization of k-means clustering",
    "Visualization of k-means clustering with 400 Gaussian random generated points and 4 clusters."
  ],
  [
    "Targeted Marketing | Clustering | K-means Clustering Algorithm in Hindi | Machine Learning",
    "In this video I have discussed what is Clustering and Euclidean distance formula. How K-means Clustering Algorithm is useful in ..."
  ],
  [
    "KMeans Clustering for Customer Segmentation | Build the K-Means Model",
    "Welcome to \"The AI University\". About this video: This video titled \"K-means Clustering for Customer Segmentation | Build the ..."
  ],
  [
    "Validating K-means cluster anslysis in SPSS",
    "In this video I show and explain how to determine the appropriate and valid number of factors to extract in a k-means cluster ..."
  ],
  [
    "K-Mean Clustering [Single Dataset]",
    "Data Warehouse and Mining For more: http://www.anuradhabhatia.com."
  ],
  [
    "What Is The Difference Between KNN and K-means?",
    "Looking to nail your Machine Learning job interview? In this video, I explain the differences between KNN and K-means, which is ..."
  ],
  [
    "K-means Clustering via Animation!",
    "Interested in learning more about Artificial Intelligence, Data Science, and Machine Learning? Subscribe to this channel, follow us ..."
  ],
  [
    "Machine Learning Tutorial 11 - K-Means Clustering with scikit-learn Python Example",
    "In this video, we'll implement K-Means Clustering, an unsupervised machine learning algorithm. K-means clustering is a type of ..."
  ],
  [
    "KMeans Clustering Example | Python ML | Spotify dataset",
    "Link for the dataset :- https://www.kaggle.com/zaheenhamidani/ultimate-spotify-tracks-db."
  ],
  [
    "K-Means Clustering | Elbow Method | Silhouette Coefficient | Machine Learning | Explained in Sinhala",
    "K-Means clustering is a method of vector quantization, originally from signal processing, that aims to partition n observations into k ..."
  ],
  [
    "K- means  clustering example",
    ""
  ],
  [
    "K-means clustering for Online Retail Business",
    "Hello Folks, In this video, you will learn about K-means clustering, WCSS, and silhouette analysis on an Online Retail dataset."
  ],
  [
    "k means clustering example HD",
    "This is not my work! Please give credits to the original author: https://vimeo.com/110060516 To calculate means from cluster ..."
  ],
  [
    "K means clustering algorithm example2 | Telugu | Giridhar",
    "K-means clustering algorithm by considering 2 attribute values to form 2 clusters among the given dataset watch my previous ..."
  ],
  [
    "K-Means: The Math Behind The Algorithm - Easy Explanation",
    "A very detailed explanation of the simplest form of the K-Means algorithm."
  ],
  [
    "Project 13. Customer Segmentation using K-Means Clustering with Python | Machine Learning Projects",
    "This video is about Customer Segmentation using K-Means Clustering. This is an important example of Market Basket Analysis in ..."
  ],
  [
    "Image compression &amp; Color Quantization using K Means | k-means Clustering in Unsupervised ML",
    "Image compression using K means clustering and Color Quantization using K Means covered in this video. Unsupervised ..."
  ],
  [
    "k mean Clustering for k=2 in MATLAB without built-in function (When data-set is one dimensional)",
    "Know about k mean clustering : https://www.saedsayad.com/clustering_kmeans.htm Code is given in the comment section."
  ],
  [
    "Clustering (3): K-Means Clustering",
    "The K-Means clustering algorithm. Includes derivation as coordinate descent on a squared error cost function, some initialization ..."
  ],
  [
    "Kmeans Clustering Analysis",
    "KTU IT304 DWM kmeans clustering analysis discussion in malayalam KTU CS 402 DMW kmeans(MODULE 5) clustering analysis ..."
  ],
  [
    "k-Means Clustering and Hierarchical Clustering - Overview and Example in R (factoextra to visualize)",
    "In this video, we'll go over the basics of clustering, and give an overview of two of the most popular clustering techniques: k-Means ..."
  ],
  [
    "K means clustering algorithm with example in English | Data Mining | Machine Learning",
    "K means clustering algorithm with example in English is explained here. K means clustering example in Data Mining or in ..."
  ],
  [
    "K Means Clustering Algorithm | Learn Machine Learning in Tamil",
    "K Means Clustering is an unsupervised machine learning technique used to cluster data points. This algorithm solves income ..."
  ],
  [
    "K Means Clustering: Pros and Cons of K Means Clustering",
    "Sign up for Our Complete Data Science Training with 57% OFF: https://bit.ly/2RBzGO7 This tutorial provides and introduction to ..."
  ],
  [
    "Elbow plot - K means clustering",
    ""
  ],
  [
    "K Means Clustering - Problem #1",
    ""
  ],
  [
    "How to Perform K Means Clustering in Python( Step by Step)",
    "This video explains How to Perform K Means Clustering in Python( Step by Step) using Jupyter Notebook. Modules you will learn ..."
  ],
  [
    "K Means Clustering Implementation on Amazon Dataset || Lesson 110 || Machine Learning ||",
    "machinelearning#learningmonkey In this class, we discuss K means clustering implementation on an amazon dataset. Here we ..."
  ],
  [
    "Belajar Data Science: Clustering with k-means",
    "Bagaimana Caranya melakukan Clustering, simak penjelasan lengkapnya dengan analogi yang mudah untuk di mengerti!"
  ],
  [
    "K-means Clustering with Data Analysis | Customer Segmentation",
    "k-means clustering is a method of vector quantization, originally from signal processing, that aims to partition n observations into k ..."
  ],
  [
    "K-means Clustering with Data Analysis | Customer Segmentation",
    "k-means clustering is a method of vector quantization, originally from signal processing, that aims to partition n observations into k ..."
  ],
  [
    "How to Use K-Means Clustering for GrayScale Image Segmentation (with complete MATLAB Code)",
    "K-Means clustering is unsupervised machine learning algorithm that aims to partition N observations into K clusters in which each ..."
  ],
  [
    "K-Means Clustering in 5 Min",
    "Please watch: \"The Teen Innovator\" https://www.youtube.com/watch?v=//studio.yo --~-- This video explains the basics of K-Means ..."
  ],
  [
    "K Medoid with Sovled Example in Hindi | Clustering | Datawarehouse and Data mining series",
    "kmedoid #datawarehouse #datamining #LMT #lastmomenttuitions Data Warehousing & Mining Full Course ..."
  ],
  [
    "K-means Clustering in JMP",
    "How to perform K-means clusterring in JMP (statistical software)"
  ],
  [
    "Part 42 Pros and Cons of K Means Clustering",
    "Statistics, Data Science, Python, machine learning, Benefits of Data Science, Linear regression, Multiple Linear Regression, ..."
  ],
  [
    "K mean clustering algo with solved Example",
    "Topic wise: Introduction to Datawarehouse Meta data in 5 mins Datamart in datawarehouse Architecture of datawarehouse how to ..."
  ],
  [
    "k-means Clustering",
    ""
  ],
  [
    "K-Means Clustering | Elbow Method | Silhouette Coefficient | Machine Learning | Explained in Sinhala",
    "K-Means clustering is a method of vector quantization, originally from signal processing, that aims to partition n observations into k ..."
  ],
  [
    "K means clustering || CSE 4053 || Introduction to Data Mining",
    "K #means #clustering #Bangla #tutorial."
  ],
  [
    "K Means Clustering Tutorial | Iris Data Set | Preet Mehta",
    "K Means algorithm is an unsupervised machine learning technique used to cluster data points. In this tutorial, we will go over ..."
  ],
  [
    "Machine Learning - 22 | K-Means Clustering Practical Implementation | Sinhala",
    "K-Means clustering algorithm is a popular unsupervised Machine Learning algorithm. In Unsupervised Machine Learning, we use ..."
  ],
  [
    "k means clustering | #data mining  | using csv file",
    "formation of several clusters from dataset."
  ],
  [
    "K-Means Clustering for Image Segregation",
    "Dataset: ------------ https://github.com/SatadruMukherjee/Dataset/blob/main/Mixed_Dataset.zip Code: -------- clc clear all close all ..."
  ],
  [
    "K means Clustering Algorithm tutorial",
    "In this video, we'll learn about K-Means Clustering, an unsupervised machine learning algorithm. K-means clustering is a type of ..."
  ],
  [
    "K-Means Clustering Example",
    "A simple example of a real-time simulation of the K-Means Clustering Algorithm using different values for n and k. Developed in ..."
  ],
  [
    "Weka Tutorial for Non-Technical People - Simple K-Means Clustering Algorithm",
    "Download Weka: https://www.cs.waikato.ac.nz/ml/weka/downloading.html ✨ Get my free marketing strategy course: ..."
  ],
  [
    "K Means Clustering Algorithm | Easy expalined | solved example step by step",
    "What is K Means Clustering Algorithm. Easiest way to explain and solved numerical example step by step Euclidean Algorithm ..."
  ],
  [
    "K Means Cluster analysis in Jamovi",
    "K Means Cluster analysis in Jamovi."
  ],
  [
    "Introduction to Clustering and K-means Algorithm",
    "by Batool Arhamna Haider."
  ],
  [
    "WEKA clustering tutorial ! weka clustering k means algorithm in data mining",
    "WEKA clustering tutorial ! weka clustering k means algorithm in data mining https://youtu.be/h5raXGJsyhU ..."
  ],
  [
    "SPSS : K-means Clustering",
    "SPSS : K-means Clustering."
  ],
  [
    "K-means Clustering From Scratch In Python [Machine Learning Tutorial]",
    "In this project, we'll build a k-means clustering algorithm from scratch. Clustering is an unsupervised machine learning technique ..."
  ],
  [
    "K-Means Clustering Algorithms | Machine Learning | Quantra by QuantInsti",
    "This course is perfect for those who have a basic understanding of cryptocurrency trading or who are already trading ..."
  ],
  [
    "K-Means Clustering Algorithm (Unsupervised Learning)",
    "Step by Step explanation of Unsupervised Learning and K_means Algorithm with Practical example. Github code link Shared: ..."
  ],
  [
    "K-Means Clustering Visualization 2",
    "This video is part of an online course, Intro to Machine Learning. Check out the course here: ..."
  ],
  [
    "Hierarchical Clustering : Agglomerative Clustering and Divisive Clustering Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "K- Medoid Clustering with example [ Nothing So Easy]",
    "Simplest Example of K Medoid clustering algorithm."
  ],
  [
    "(ML 16.1) K-means clustering (part 1)",
    "Introduction to the K-means algorithm for clustering."
  ],
  [
    "K-means clustering algorithm with solve example: how it works | NerdML",
    "This video will help you to understand how we can make use of K-Means Clustering algorithm for solving unsupervised learning ..."
  ],
  [
    "K- means clustering algorithm explained with advantages &amp; disadvantages",
    "K- means clustering algorithm explained with advantages & disadvantages #kmeans #kmeansclustering #clustering Connect with ..."
  ],
  [
    "Optimum value of K in K-means Clustering | The elbow curve",
    "In this video, we will discuss Optimum value of K in K-means Clustering, The elbow curve, K-Means Clustering. For good ..."
  ],
  [
    "K-Means Clustering for Customer Segmentation | Data Science Fundamentals",
    "This video aims to help those new to K-Means understand what it does, how it works, and how it helps. K-Means is a foundational ..."
  ],
  [
    "Implement Mall Customers Segmentation K Means Clustering Python Machine Learning Dr. Mahesh Huddar",
    "Implement Mall Customers Segmentation using K Means Clustering and Python Machine Learning by Dr. Mahesh Huddar In this ..."
  ],
  [
    "K-Means Clustering Algorithm From Scratch In Python | ML Algorithms From Scratch",
    "K-Means Clustering Algorithm From Scratch In Python | ML Algorithms From Scratch Hi, my name is Nitish, and welcome to my ..."
  ],
  [
    "Cluster analysis in R - K means clustering | part 2",
    "In this video, you will learn how to carry out K means clustering using R studio. The Video will include: • Determine and visualize ..."
  ],
  [
    "Lec 39: k-means clustering using R",
    "Data Analysis for Biologists Playlist Link: https://www.youtube.com/playlist?list=PLwdnzlV3ogoXmoCXczKiu6WGW0r05Zw02 Prof."
  ],
  [
    "Extracting Dominant Color of an Image using K-Means Clustering",
    "Prerequisite: Color Image Segmentation using K-means Clustering Algorithm (with Complete MATLAB Code) ..."
  ],
  [
    "Belajar Data Mining - Algoritma K-Means Clustering",
    "Biar penasaran...tonton saja videonya sampai habis. Jangan lupa Subscribe, Like, Comment & Share. Terimakasih sudah ..."
  ],
  [
    "K-means Clustering Using Analytic Solver",
    "This video demonstrates how to perform k-means clustering using Analytic Solver, an Excel extension data mining/machine ..."
  ],
  [
    "K-Means Clustering Model from Scratch | Python and NumPy tutorial",
    "This video is a tutorial on how to create a K-Means clustering classifier from scratch using Python, NumPy, and google ..."
  ],
  [
    "Java Data Sci Soltn-Big Data &amp; Visualizatn: Cluster Data Point Using K-means Algorithm| packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "1 2 K Means Clustering and Challenges",
    ""
  ],
  [
    "K-Means Clustering in Scala",
    "Talk given to blip.pt introducing functional programming in Scala and explaining how the k-mean clustering algorithm works."
  ],
  [
    "K Means Clustering Algorithm With Numerical Example",
    "K Means Clustering Algorithm With Numerical Example k means clustering algorithm,k means clustering,k means example ..."
  ],
  [
    "K Means Clustering  in Hindi | Machine Learning Algorithm | Machine Learning Tutorial",
    "Source code and Dataset : https://github.com/nitinsingh1331/K-means-clustring.git Code by Nitin machine learning Tutorial ..."
  ],
  [
    "K Means Clustering using 3Blue1Brown&#39;s manim library.",
    "Code: https://github.com/sid-sr/k-means-visualiser Visualising K Means Clustering using the manim library."
  ],
  [
    "ML 21 - Machine Learning in Tamil - K Means algorithm",
    "ML 21 - Machine Learning in Tamil - K Means algorithm."
  ],
  [
    "Lec 54, K- Means Clustering",
    "Cluster analysis, partitioning method, K – means clustering, basic concept, classifications of this clustering method, python demo, ..."
  ],
  [
    "K-Means Clustering",
    "The K-Means Clustering procedure in Statgraphics 19 implements a machine-learning process to create groups or clusters of ..."
  ],
  [
    "ML4RM: K-means clustering (Part 1)",
    "In this lesson we introduce a first example of unsupervised learning approach: the k-means clustering algorithm. The goal of the ..."
  ],
  [
    "ML 21 - Machine Learning in Tamil - K Means algorithm",
    "ML 21 - Machine Learning in Tamil - K Means algorithm."
  ],
  [
    "Lec 54, K- Means Clustering",
    "Cluster analysis, partitioning method, K – means clustering, basic concept, classifications of this clustering method, python demo, ..."
  ],
  [
    "K-Means Clustering",
    "The K-Means Clustering procedure in Statgraphics 19 implements a machine-learning process to create groups or clusters of ..."
  ],
  [
    "How to Use and Visualize K-Means Clustering in R",
    "Learn to use and visualize K-Means Cluster Analysis in R with the 2020 Economic Freedom Index Data from The Heritage ..."
  ],
  [
    "K Means Clustering",
    "In this video we learn about K-Mean Clustering with short theory and a practical example."
  ],
  [
    "Segmentaion using k-means clustering in opencvشرح عربي",
    "what's app number +2 01210894349 ================== feel free to ask me any question ..."
  ],
  [
    "Hard Clustering with k-means",
    ""
  ],
  [
    "K-Means Clustering Model Using Python | Data Science Algorithms | Edureka | DS Rewind -1",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r... This Edureka video on \"Developing A K-Means ..."
  ],
  [
    "Clustering in Data mining | K means Clustering Algorithm | Hierarchical Clustering | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "K-Means Clustering Algorithm with Python Tutorial",
    "K-Means clustering is a popular unsupervised machine learning algorithm that is commonly used in the exploratory data analysis ..."
  ],
  [
    "0406 Demo K means Clustering on the Titanic Dataset",
    ""
  ],
  [
    "Machine Learning with R Tutorial: Introduction to k-means Clustering",
    "Make sure to like & comment if you liked this video! This is the second video for our course Unsupervised Learning in R by Hank ..."
  ],
  [
    "K-Means Clustering",
    "This time we look at the basic concept of clustering."
  ],
  [
    "K Means Clustering Unsupervised Learning || Lesson 105 || Machine Learning || Learning Monkey ||",
    "machinelearning#learningmonkey In this class, we discuss K means clustering an unsupervised learning model. Take the ..."
  ],
  [
    "K Means Clustering  in Hindi | Machine Learning Algorithm | Machine Learning Tutorial",
    "Source code and Dataset : https://github.com/nitinsingh1331/K-means-clustring.git Code by Nitin machine learning Tutorial ..."
  ],
  [
    "Hierarchical and K Means Clustering Using Rapid Miner 9.8",
    "This speaks about the Hierarchical and K Means Clustering Using Rapid Miner 9.8."
  ],
  [
    "Clustering Método K-Means en Python (ENGLISH SUBTITLES)",
    "Obtén el código de éste y de todos mis videos en https://www.patreon.com/rociochavezcienciadedatos Si te sirvió el vídeo y ..."
  ],
  [
    "K-means clustering 1 - Algorithm",
    "Full video list and slides: https://www.kamperh.com/data414/"
  ],
  [
    "Kernel (RBF) k-means Clustering from the Scratch using Python",
    "Code & dataset : http://github.com/ardianumam/Machine-Learning-From-The-Scratch ** Support by following this channel:) ** Best ..."
  ],
  [
    "K-Means Clustering ❌Unsupervised Machine Learning with Python",
    "K-means clustering is a clustering method that aims to partition N observations into K clusters in which each observation belongs ..."
  ],
  [
    "K-means Clustering algorithm / KTU Machine learning",
    "kmeansclustering #machinelearning #ktu Clustering or cluster analysis is the task of grouping a set of objects in such a way that ..."
  ],
  [
    "QGIS Basic #91: Attribute Based Clustering Function: k-means algorithm Review",
    "What's up guys recently I have looked into the analytics of the channel, and noticed that the channel is shrinking. We have to get ..."
  ],
  [
    "K-means clustering and principal component analysis by using SAS Enterprise Guide 8.3",
    ""
  ],
  [
    "K means clustering Algorithm explained in Sinhala - Part 1",
    "K means clustering Algorithm explained in Sinhala - Part 1."
  ],
  [
    "class1 -  Introduction to K means Algorithm Problem (Malayalam)",
    "Semester 5 -Module 2."
  ],
  [
    "k-means clustering",
    "Implementation of k-means clustering algorithm in matlab. Please if you like my video type your comments and suggestions and ..."
  ],
  [
    "APRENDIZAJE NO SUPERVISADO: K. MEANS CLUSTERING | #15 Curso de Introducción a Machine Learning",
    "Hola! En este video aprenderás sobre uno de los algoritmos de aprendizaje no supervisado, K-means Clustering. Conoce más ..."
  ],
  [
    "K means Clustering From Scratch | Urdu/Hindi | Python Programming",
    ""
  ],
  [
    "K-Means Clustering Model Using Python | Data Science Algorithms | Edureka | Data Science Rewind -3",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r... This Edureka video on \"Developing A K-Means ..."
  ],
  [
    "K Means Clustering using L1 Distance Euclidean Distance Machine Learning by Dr. Mahesh Huddar",
    "K Means Clustering using L1 Distance Euclidean Distance Machine Learning by Dr. Mahesh Huddar This video discusses, how to ..."
  ],
  [
    "K-Means Clustering with Python | Python Data Science (Part 13) | Bangla | Aksadur Rahman",
    "kmeans #clustering #machinelearning #bangla Download link for k means data ..."
  ],
  [
    "Visualizing k Means Algorithm",
    "You can see how to k Means Algorithm for partitioned clustering works on some random data. Programmed in C, plotted with ..."
  ],
  [
    "Introduction to K-Means Clustering",
    "ACCESS the FULL COURSE here: ..."
  ],
  [
    "k-means clustering theory algorithm implementation scaling",
    "Learn to use K-Means clustering from theory to implementation 00:00 Intro 00:47 Theory of Machine Learning 05:00 Colab ..."
  ],
  [
    "ML: k-means Clustering Evaluation قياس أداء خوارزمية كي مينز",
    "ML: k-means Clustering Evaluation قياس أداء خوارزمية كي مينز With-in Cluster Similarity Between Clusters Distance."
  ],
  [
    "Learn k-Means Clustering for Free",
    "In this episode, we show how to do k-means clustering in Excel with the help of PrimaXL, an add-in software. Amazon: ..."
  ],
  [
    "Practice Problem on k-means clustering | MATLAB",
    "Problem Statement: Consider 6 samples in a two-dimensional space: (−1,−1), (−1, 1), (1,−1), (1, 1), (7, 8), (8, 7). Assuming that ..."
  ],
  [
    "K-Means Clustering | Digital Image Processing 10 | MATLAB",
    "K-Means Clustering: Widely known method for machine learning, It can also be used in Images to find out clusters based on the ..."
  ],
  [
    "K-means Clustering using Tableau",
    "Global Superstore (K-means using Tableau) Reference File: ..."
  ],
  [
    "K Means Clustering on Titanic data |  Clustering algorithm | Tableau For Data Science Tutorial 2",
    "K Means Clustering on Titanic data | Clustering algorithm | Tableau For Data Science Tutorial 2 Data set used ..."
  ],
  [
    "K Means Clustering Using Azure Machine Learning",
    "The data analysis starts of with initial task of having to classify data. There are various algorithm which one may employ to classify ..."
  ],
  [
    "K-means Clustering Algorithm",
    "What is K-Mean Clustering Algorithm? Learn by a simple toy dataset. How to set K? What are the strength and weaknesses of ..."
  ],
  [
    "Clustering Data with the K Means Algorithm",
    ""
  ],
  [
    "Calculating True/False Positives in K-Means Clustering (Part 1)",
    "This video gives some insight into how to calculate true positives and false positives after clustering some data with K-means ..."
  ],
  [
    "07-2: K-Means Clustering",
    "고려대학교 공학대학원 스마트제조학과 비즈니스 애널리틱스 7장: 군집화 K-평균 군집화, K-Means Clustering ..."
  ],
  [
    "K-Means Clustering with R",
    "This is an example of clustering using k-means based on two variables: credit score and purchases. You can apply this model to a ..."
  ],
  [
    "K-Means Clustering Algorithm | Elbow Method",
    ""
  ],
  [
    "Data Mining and Data Warehousing Part 14 | K means Clustering Algorithm with example | by PremnArya",
    "Data Mining and Data Warehousing Part 14 | K means Clustering Algorithm with example | by PremnArya DON'T CLICK THIS: ..."
  ],
  [
    "Cluster Analysis   K Means Cluster Analysis in SAS Part 2",
    "Learn how to perform K-means cluster analysis in SAS."
  ],
  [
    "Lec 54, K- Means Clustering",
    "Cluster analysis, partitioning method, K – means clustering, basic concept, classifications of this clustering method, python demo, ..."
  ],
  [
    "K-Means Clustering",
    "This time we look at the basic concept of clustering."
  ],
  [
    "k-means clustering",
    "Implementation of k-means clustering algorithm in matlab. Please if you like my video type your comments and suggestions and ..."
  ],
  [
    "Machine Learning | Intuition behind K-Means Clustering and Intra Cluster Distance",
    "In this video, we will learn about the intuition behind the K-Means Clustering and then we will understand the concept of Intra ..."
  ],
  [
    "Practice Problem on k-means clustering | MATLAB",
    "Problem Statement: Consider 6 samples in a two-dimensional space: (−1,−1), (−1, 1), (1,−1), (1, 1), (7, 8), (8, 7). Assuming that ..."
  ],
  [
    "NLPC7: k-means Clustering / Spherical k-means Clustering (short version)",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence k-means is covered in much more ..."
  ],
  [
    "K-Means Clustering Model Using Python | Data Science Algorithms | Edureka | Data Science Rewind -3",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r... This Edureka video on \"Developing A K-Means ..."
  ],
  [
    "K-means clustering 1 - Algorithm",
    "Full video list and slides: https://www.kamperh.com/data414/"
  ],
  [
    "K Means Clustering using L1 Distance Euclidean Distance Machine Learning by Dr. Mahesh Huddar",
    "K Means Clustering using L1 Distance Euclidean Distance Machine Learning by Dr. Mahesh Huddar This video discusses, how to ..."
  ],
  [
    "K-Means Clustering | Unsupervised Learning",
    "Learn how K-Means clustering works."
  ],
  [
    "K Means Cluster analysis in Jamovi",
    "K Means Cluster analysis in Jamovi."
  ],
  [
    "K Means Clustering in Machine Learning | Machine Learning by Debabrata Bhakat [Episode 09/14]",
    "K-means clustering is a type of unsupervised learning, which is used when you have unlabeled data (i.e., data without defined ..."
  ],
  [
    "Image Segmentation using K Means Clustering   with source code",
    "Image Segmentation: In computer vision, image segmentation is the process of partitioning an image into multiple segments."
  ],
  [
    "K-Means Clustering and Initialization of Centroids",
    "This Video Consist of the Introduction to Clustering , Methods of Clustering , K - means Clustering (algorithm , advantages and ..."
  ],
  [
    "K - Means Clustering: Iris Dataset in R",
    "This is a Data Science and Business Analytics Internship Project by The Sparks Foundation's Graduate Rotational Internship ..."
  ],
  [
    "Clustering in Data mining | K means Clustering Algorithm | Hierarchical Clustering | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Partitioning Methods - K -means Clustering",
    "Data Mining, cluster analysis."
  ],
  [
    "Three Clustering Algorithms You Should Know: k-means clustering, Spectral Clustering, and DBSCAN",
    "This video explains three different unsupervised clustering algorithms: k-means clustering, spectral clustering, and DBSCAN ..."
  ],
  [
    "Hands-on K means clustering",
    "Week 12: ML Bootcamp by Bharath k. Reddy. You will learn K means clustering with a hands-on example on jupyter notebook."
  ],
  [
    "The Partitioning method: K-Means and K-Medoid Clustering",
    "The Partitioning method: K-Means and K-Medoid Clustering."
  ],
  [
    "K Means Clustering  in Hindi | Machine Learning Algorithm | Machine Learning Tutorial",
    "Source code and Dataset : https://github.com/nitinsingh1331/K-means-clustring.git Code by Nitin machine learning Tutorial ..."
  ],
  [
    "K-Means Clustering From Scratch With Python - Dr. Yasin Ceran",
    "K-Means Clustering From Scratch With Python - Dr. Yasin Ceran You might be asked coding questions to build basic machine ..."
  ],
  [
    "Introduction to K means clustering, k means function in R, Understanding the out",
    "This video is part of a course titled “Introduction to Clustering using R”. The course would get you up and started with clustering, ..."
  ],
  [
    "Weka tutorial on clusters using simple k means algorithm in Urdu / Hindi",
    "Weka tool is an open source machine learning tool. It is also one of the best tools for data mining, deep learning, and Artifical ..."
  ],
  [
    "Introduction to Artificial Intelligence with Java: Working with K-means Clustering| packtpub.com",
    "This video tutorial has been taken from Introduction to Artificial Intelligence with Java. You can learn more and buy the full video ..."
  ],
  [
    "K-Means Clustering with R - Part 1",
    "www.Stats-Lab.com | Data Analysis with R | k-Means Clustering."
  ],
  [
    "K-Means Clustering",
    "Subject:Computer Science Paper: Machine learning."
  ],
  [
    "K means clustering | Machine learning Scikit Learn | Scikit learn tutorial",
    "Welcome to dwbiadda machine learning scikit tutorial for beginners, as part of this lecture we will see, K means clustering."
  ],
  [
    "k means clustering | Selecting K in K-Means Clustering | Machine Learning Algorithms | Codegnan",
    "We Going To Learn About k means clustering | Selecting K in K-Means Clustering | Machine Learning Algorithms | Codegnan K ..."
  ],
  [
    "Belajar Data Mining - Algoritma K-Means Clustering",
    "Biar penasaran...tonton saja videonya sampai habis. Jangan lupa Subscribe, Like, Comment & Share. Terimakasih sudah ..."
  ],
  [
    "k means clustering | calculating distance measures",
    ""
  ],
  [
    "K-Means Clustering in Machine Learning | Telugu",
    "k-means #kmeansclustering #machinelearningalgorithms Program: # importing libraries import numpy as nm import ..."
  ],
  [
    "Cluster analysis, linkages, hierarchical and K-means clustering",
    "In this video, let's discuss about clustering (0:25), linkages (3:06), hierarchical (2:04) and K-means clustering (4:30), applications ..."
  ],
  [
    "K means Clustering Algorithm Explained With an Example Easiest And Quickest Way Ever",
    "kmeans#kmeansclustering#machinelearning#techtutorialseverywhere K Means clustering algorithm is an unsupervised machine ..."
  ],
  [
    "c++ K-means clustering",
    "Distribución K-means hecha en visual c++."
  ],
  [
    "Weka - K-Means Clustering - 5 min Demo",
    "Created by: Maurya Nagaraja Created For: ISM 6136.022F15 Coursework Under guidance from: Dr.Balaji Padmanabhan."
  ],
  [
    "R Commander Part-16: K-means Clustering",
    "This video discusses the concept of K-means in R-Commander. Datafile used in this video: https://goo.gl/14rsrj."
  ],
  [
    "K-Means Clustering in Scala",
    "Talk given to blip.pt introducing functional programming in Scala and explaining how the k-mean clustering algorithm works."
  ],
  [
    "Azure Machine Learning Studio | K-Means Clustering RoomData | Machine Learning",
    "Brief overview of vid: Here we look at k-means clustering, with room data. Thanks for watching. Please reach out if you have any ..."
  ],
  [
    "#k-means clustering and predicting type of flower",
    "this is the second task of #spark_foundation."
  ],
  [
    "0404 Visualizing K means Clustering",
    ""
  ],
  [
    "Real Life Example of K Means Clustering",
    "Real Life Numerical Example of K Means Clustering."
  ],
  [
    "k means clustering algorithm example for dimensional data.",
    "k means clustering algorithm example for dimensional data. read more at: www.engineeringway.com."
  ],
  [
    "PCA and k means clustering",
    ""
  ],
  [
    "K Means Algorithm",
    "Basic K - Means Algorithm Cluster analysis How to choose initial centroid for K- Means algorithm? Proximity measures in ..."
  ],
  [
    "K Means Clustering",
    ""
  ],
  [
    "Advanced Statistics for Machine Learning : K-means Clustering | packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "3.13- K means Clustering Algorithm",
    ""
  ],
  [
    "K Means Clustering in Python | University of London Full Course Free!",
    "This lecture is provided by university of London. K-Means clustering is explained clearly in this video, with lectures, exercise, ..."
  ],
  [
    "K-means Clustering Algorithm",
    "What is K-Mean Clustering Algorithm? Learn by a simple toy dataset. How to set K? What are the strength and weaknesses of ..."
  ],
  [
    "K-Means Clustering and Mean Shift Clustering with VisuMap software",
    "This video shows two clustering services with VisuMap on a dataset with 10000 data points."
  ],
  [
    "#63 | K-Means Clustering | Machine Learning",
    "In this video, we will learn about, K-Means Clustering in Machine Learning."
  ],
  [
    "K means clustering algorithm example for the dataset like (1,0),(2,1).... - Part 1",
    "K means clustering algorithm example for the data-set like (1,0),(2,1).... read more at: www.engineeringway.com."
  ],
  [
    "21. K-Means Clustering with R",
    "Here, you can understand how do we go ahead with the K-Means clustering with R -Studio."
  ],
  [
    "K Means Clustering in Python | University of London Full Course Free!",
    "This lecture is provided by university of London. K-Means clustering is explained clearly in this video, with lectures, exercise, ..."
  ],
  [
    "K-MEANS CLUSTERING",
    "CLUSTERING WITH K-MEANS. PLEASE, SEND QUESTIONS."
  ],
  [
    "Weka - K-Means Clustering - 5 min Demo",
    "Created by: Maurya Nagaraja Created For: ISM 6136.022F15 Coursework Under guidance from: Dr.Balaji Padmanabhan."
  ],
  [
    "K Means Clustering",
    ""
  ],
  [
    "k means clustering algorithm in data mining | k means clustering algorithm example [data mining]",
    "K means clustering algorithm and it is a method of vector quantization, originally from signal processing, that is popular for cluster ..."
  ],
  [
    "K Means Clustering Algorithm Explained",
    "In this I have tried to explain K Means clustering algorithm theoretically in the easiest possible way . #KMeans #Clustering ..."
  ],
  [
    "K Means Clustering Part - 1 | K Means Clustering Algorithm Tutorial - 1 | Data Science | Edureka",
    "Data Science Training - https://www.edureka.co/data-science ) Watch Sample Class recording ..."
  ],
  [
    "Demonstration of Dominant colors in an image using k-means clustering",
    "Want to write some software that would allow you to extract a set of colours from an image, and do it in a way that seems natural ..."
  ],
  [
    "K-Means Algorithm Visualization",
    ""
  ],
  [
    "Use K-Means Clustering to Classify Tweets in RapidMiner",
    "Demo of using K-Means Clustering to classify Tweets in RapidMiner. Demo code and data: ..."
  ],
  [
    "Breast Cancer - K Means for Clustering",
    "Dr. AI will help you learning Python for Data Science which is the foundation of Artificial Intelligence. This course channel is ..."
  ],
  [
    "K-Means Clustering: Unsupervised Learning",
    "Try Sunsama for free! https://sunsama.grsm.io/GregHogg SUBSCRIBE with NOTIFICATIONS ON if you enjoyed the video!"
  ],
  [
    "Clustering. what is cluster and clustering. Unsupervised Learning and clustering in hindi",
    "Please Fill the form - https://docs.google.com/forms/d/1kOxvqvz1IvBMHJ3UeLecLDuK7ePKjHAvHaRcxduHKEE/edit ..."
  ],
  [
    "K-Means Clustering | Unsupervised Learning",
    "Learn how K-Means clustering works."
  ],
  [
    "GEO-LOCATION CLUSTERING USING K-MEANS ALGORITHM",
    ""
  ],
  [
    "K Means Clustering Simplified",
    "Clustering is a really important class of algorithms in machine learning. In this video, I simplify K-means clustering and walk you ..."
  ],
  [
    "K-Means Clustering - Machine Learning 101 (Part 13)",
    "In this video, we introduce the K-means clustering algorithm, which is an unsupervised machine learning algorithm. We provide ..."
  ],
  [
    "Azure Machine Learning - Clustering Online Retail Transactions using K-Means Clustering Algorithm",
    "Azure Machine Learning - Clustering Online Retail Transactions using K-Means Clustering Algorithm."
  ],
  [
    "3.13- K means Clustering Algorithm",
    ""
  ],
  [
    "What Is K Means Clustering in Data Science? - Free On LearnVern",
    "For more Free courses and learning please visit http://www.learnvern.com/ We also offer personalized training which is focused ..."
  ],
  [
    "Advanced Statistics for Machine Learning : K-means Clustering | packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "k-Means Clustering Algorithm Explained",
    "In this Video we explain the K-Means Clustering Algorithm in short. If you liked the Video please consider Liking and Subscribing!"
  ],
  [
    "K means clustering in Urdu/Hindi",
    "python #datascience #machinelearning Welcome to our video on K means clustering! In this video, we will be explaining what K ..."
  ],
  [
    "Customer Segmentation Using K-Means Clustering",
    "Hi guys, I did this project as one of my tasks as a Machine Learning Intern at CollegeRanker India. GitHub Link: ..."
  ],
  [
    "K-Means Clustering",
    "This vlog provides a descriptive overview of K-Means clustering technique covering the following items: 1) Introduction of ..."
  ],
  [
    "K Means Clustering",
    "K Means Clustering K-means clustering is one of the simplest and popular unsupervised machine learning algorithms. A cluster ..."
  ],
  [
    "K Means Clustering",
    "Unsupervised K-Means Clustering."
  ],
  [
    "Partition Based Clustering 02 - K Means Clustering Method",
    ""
  ],
  [
    "3.2 Data Science: k-means Clustering Algorithm in Detail and k-means in Python using scikit-learn",
    "kmeans #kmeansclustering #Clustering #MachineLearning #optimization #DataMining #ComputingForAll After going over this ..."
  ],
  [
    "Simple k-means cluster introductory tutorial",
    "This is a simple k-means cluster introductory tutorial. K-means clustering is one of the simplest and popular unsupervised ..."
  ],
  [
    "K-means Clustering - Training Metrics - MicroStrategy",
    "In this tutorial I will demonstrate how cluster algorithms work, explain why they are useful and show you how to implement ..."
  ],
  [
    "14. Machine Learning - K-Means Clustering",
    "Here, I explain what K-Means clustering is all about. It is a simple technique."
  ],
  [
    "Visualizing K-Means Clustering",
    "Source code: https://github.com/daitranskku/machine-learning-basics-with-matlab/"
  ],
  [
    "Limitations of the K Means Algorithm | Unsupervised Learning",
    "Unit 4. Unsupervised Learning Lecture 14. Clustering 2 watch the full list: ..."
  ],
  [
    "K-means Clustering By Avinash Koshal || Sudans Tech",
    "What Is Clustering? Clustering is a set of techniques used to partition data into groups, or clusters. Clusters are loosely defined as ..."
  ],
  [
    "K-means clustering from scratch (Code) | python | Deep Matrix | Machine learning",
    "kmeans #machine_learning #python k-means clustering is a method of vector quantization, originally from signal processing, that ..."
  ],
  [
    "K-means Clustering - California Housing Data",
    ""
  ],
  [
    "K-Means Clustering Explained with Code | Supervised ML Example | Cancer Remission Dataset",
    "The work done in this video is a part of the curriculum at Durham College - Data Analytics for Business Decision Making. Please ..."
  ],
  [
    "CLUK5: Example for Hamerly k-means Clustering",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence 00:00 Example Hamerly k-means ..."
  ],
  [
    "K-Means Clustering - The Math of Intelligence (Week 3)",
    "Let's detect the intruder trying to break into our security system using a very popular ML technique called K-Means Clustering!"
  ],
  [
    "K MEANS CLUSTERING",
    "phyton #ucp."
  ],
  [
    "K Means Clustering for STI Component Stocks",
    "This bitesize video tutorial will use K-Means clustering algorithm to cluster Strait Time Index (STI) component stocks. We use Beta ..."
  ],
  [
    "K-Means Clustering | Prediction using Unsupervised ML",
    "This project is for the beginner level ML enthusiast just for making them familiar with the various steps of Unsupervised ML ..."
  ],
  [
    "หลักการทำงานของ K-Means Clustering (unsupervised learning) ในการแบ่งข้อมูลออกเป็นกลุ่ม ๆ",
    "ดาวน์โหลด Jupyter Notebook ที่ใช้ในคลิปได้ที่ ▻ http://bit.ly/2E8jBbr เชิญสมัครเป็นสมาชิกของช่องนี้ได้ที่ ..."
  ],
  [
    "Cluster Analysis | K-Means Clustering | Hierarchical Clustering | Unsupervised Learning",
    "Cluster analysis is a popular unsupervised learning algorithm that is used in finding segments or clusters in un-labelled data."
  ],
  [
    "Introduction to Explainable k-Means Clustering",
    "Overview of explainable k-means clustering, our work on the first explainable unsupervised machine learning method with ..."
  ],
  [
    "Simple k-means cluster introductory tutorial",
    "This is a simple k-means cluster introductory tutorial. K-means clustering is one of the simplest and popular unsupervised ..."
  ],
  [
    "Limitations of the K Means Algorithm | Unsupervised Learning",
    "Unit 4. Unsupervised Learning Lecture 14. Clustering 2 watch the full list: ..."
  ],
  [
    "K-means Clustering - Training Metrics - MicroStrategy",
    "In this tutorial I will demonstrate how cluster algorithms work, explain why they are useful and show you how to implement ..."
  ],
  [
    "K-means Clustering - California Housing Data",
    ""
  ],
  [
    "K-means Clustering By Avinash Koshal || Sudans Tech",
    "What Is Clustering? Clustering is a set of techniques used to partition data into groups, or clusters. Clusters are loosely defined as ..."
  ],
  [
    "K-Means Clustering Explained with Code | Supervised ML Example | Cancer Remission Dataset",
    "The work done in this video is a part of the curriculum at Durham College - Data Analytics for Business Decision Making. Please ..."
  ],
  [
    "CLUK5: Example for Hamerly k-means Clustering",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence 00:00 Example Hamerly k-means ..."
  ],
  [
    "K Means Clustering for STI Component Stocks",
    "This bitesize video tutorial will use K-Means clustering algorithm to cluster Strait Time Index (STI) component stocks. We use Beta ..."
  ],
  [
    "EEE6512 - Image Segmentation using K-means Clustering Algorithm",
    "Author: Vinayak Deshpande Project: Image Segmentation using K-means Clustering Algorithm Course: EEE6512 Fall - 2016."
  ],
  [
    "K MEANS CLUSTERING",
    "phyton #ucp."
  ],
  [
    "Cluster Analysis | K-Means Clustering | Hierarchical Clustering | Unsupervised Learning",
    "Cluster analysis is a popular unsupervised learning algorithm that is used in finding segments or clusters in un-labelled data."
  ],
  [
    "K Means Clustering &amp; Hierarchical Clustering Algorithm Theory and  Excel Calculation",
    "KMeans & Hierarchical Clustering Microsoft Excel Calculation sheet."
  ],
  [
    "Introduction to Explainable k-Means Clustering",
    "Overview of explainable k-means clustering, our work on the first explainable unsupervised machine learning method with ..."
  ],
  [
    "K-Means and K-Medoids Clustering",
    "Basics of K-Means Clustering and K-Medoids Clustering are discussed in this video along with MATLAB demos. Demo codes for ..."
  ],
  [
    "Azure Machine Learning Studio | K-Means Clustering RoomData | Machine Learning",
    "Brief overview of vid: Here we look at k-means clustering, with room data. Thanks for watching. Please reach out if you have any ..."
  ],
  [
    "K  Means Clustering Algorithm Part 1  - Theory ( Unsupervised)",
    "K means clustering algorithm theory , unsupervised learning #dataanalytics #dataanalytics #machinelearning #industrialtraining ..."
  ],
  [
    "A Comparative Analysis of Student’s Performance Using K Means Clustering",
    "Presenter: Maryam Ahmad Institution: Universiti Teknologi PETRONAS Title: A Comparative Analysis of Student's Performance ..."
  ],
  [
    "CLUK7: Extensions of k-means Clustering",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence 00:00 Extensions of k-means ..."
  ],
  [
    "K-means clustering and Lloyd’s Algorithm",
    "I forgot to mention in video, but k-means is a great example of unsupervised learning. Notice that we are learning structure about ..."
  ],
  [
    "K-Means Algorithm Introduction",
    ""
  ],
  [
    "K-means convergence proof",
    "In this video, a proof for the convergence of K-means clustering algorithm is given."
  ],
  [
    "K Means Clustering Using Hadoop Mapreduce Projects",
    "Contact Best Hadoop Projects Visit us: http://hadoopproject.com/"
  ],
  [
    "K Means Clustering Algorithm In Python From Scratch-Machine Learning",
    "k means clustering algorithm in python from scratch machine learning."
  ],
  [
    "K-Means Clustering via Apache Spark on AWS Sagemaker",
    "Demo video for K-Means Clustering via Apache Spark on AWS Sagemaker. Github repo here: ..."
  ],
  [
    "Data Analytics Tools Series K Means clustering",
    ""
  ],
  [
    "Scikit-Learn : K Means Clustering with Data Cleaning",
    "Scikit-Learn : K Means Clustering with Data Cleaning."
  ],
  [
    "K Means Flow Chart Example in Clustering",
    "K Means Flow Chart Example in Clustering # Data warehousing and Data mining # DWDM # JNTUK # B.Tech click here to ..."
  ],
  [
    "Question 12 -  Describe How K Means Clustering Works  in Machine Learning and Data Science",
    "Question and Answer Page - https://bit.ly/2QfpLfA Machine Learning Questions 1 to 10: https://bit.ly/2VHPaiY Question 11- Explain ..."
  ],
  [
    "LP-III SPPU-BE-COMP Machine Learning - Assignment No.4 K-means Clustering",
    "Assignment on K-Means Clustering: We have given a collection of 8 points. P1=[0.1,0.6] P2=[0.15,0.71] P3=[0.08,0.9] P4=[0.16, ..."
  ],
  [
    "#k-means clustering and predicting type of flower",
    "this is the second task of #spark_foundation."
  ],
  [
    "K Means Clustering|| Live Example|| K Means Project|| K Means Algorithm",
    "K-means clustering is a type of unsupervised learning, which is used when you have unlabeled data (i.e., data without defined ..."
  ],
  [
    "K- Means clustering Google Colab",
    "K- Means clustering with Covid19 geographic disbtribution worldwide data."
  ],
  [
    "K-Means Clustering explained | Data Science With Python",
    "K - means clustering explained with code and examples github source: https://github.com/smainc/K-means_Clustering."
  ],
  [
    "APPRENTISSAGE NON-SUPERVISÉ avec Python (24/30)",
    "L'apprentissage Non-Supervisé (Unsupervised Learning) est une technique de Machine Learning tres populaire. Dans ce tutoriel ..."
  ],
  [
    "5H K-Means Clustering in RapidMiner",
    ""
  ],
  [
    "K-Means clustering Algorithm",
    ""
  ],
  [
    "Day 10 - Machine Learning Using Python -  K - Means Clustering &amp; Hierarchical Clustering",
    "2 Weeks Machine Learning Using Python Complete Playlist Link ..."
  ],
  [
    "K-Means Clustering Model Using Python  | Data Science Algorithms | Edureka | DS Rewind -  3",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "42. Distance Based Clustering --- K means",
    "In this video we discussed k-means, k-medoids, sillhutte etc See Complete Playlists: Design and analysis of algorithms: ..."
  ],
  [
    "K Means Clustering || Unsupervised Machine Learning || Without using ML libraries",
    "Visit: https://blog.nirmites.com."
  ],
  [
    "K-Means Clustering",
    "Python Code Example: https://scikit-learn.org/stable/modules/generated/sklearn.cluster.KMeans.html Supervised Learning: ..."
  ],
  [
    "Machine Learning: Mathematical Basis of k means clustering",
    "This is a sort video lecture on Mathematical Basis of k means clustering. It is part of my series of lectures on machine learning."
  ],
  [
    "K-Means Clustering Algorithm in Data Mining | (part-1)",
    "K-Means clustering algorithm in data mining with Example K-Means clustering algorithm, K-means clustering, k-means clustering ..."
  ],
  [
    "How to build a K-Means Clustering Algorithm using Python and Sklearn",
    "What is K-means clustering and how does it work. How to use Sklearn K-Means Cluster Library. How to use Sklearn K-means ..."
  ],
  [
    "Machine Learning | Unsupervised Learning | k-Means clustering",
    "k-Means Clustering with example, Unsupervised learning algorithm."
  ],
  [
    "K Means Clustering using R | Machine Learning",
    "In this video you will learn how to perform K-means clustering using R. Clustering is a unsupervised learning algorithm used when ..."
  ],
  [
    "[Simple] K-Means Clustering",
    "Belajar K-Means Clustering Please Support our YouTube channel by Subscribing Our YouTube channel. Thank You.. Youtube ..."
  ],
  [
    "K means Clustering Algorithm using PySpark Mllib",
    ""
  ],
  [
    "How to do K-Means Clustering on Images Using C++",
    "This video will help you to perform K-Means Clustering on your images using C++ programming language in easiest and simplest ..."
  ],
  [
    "K Means algorithm | part 2 | Inertia | Silhouette | Elbow Method | Silhouette  score | tamil",
    "in this video you will lean how to use inertia nad silhouette score to find good quality clusters k-means clustering aims to partition ..."
  ],
  [
    "learn K means Clustering in hindi/urdu in python",
    "I am using Jupyter notebook to work on python Video Software used : OBS Studio."
  ],
  [
    "K Means Clustering on IRIS data | Clustering algorithm | Tableau For Data Science Tutorial 1",
    "K Means Clustering on IRIS data | Clustering algorithm | Tableau For Data Science Tutorial 1 Link to the dataset ..."
  ],
  [
    "K-means clustering algorithm",
    ""
  ],
  [
    "K-Means Clustering (Machine Learning) | Electrical Engineering",
    "shorts K-Means Clustering (Machine Learning) | Electrical Engineering To get the study materials (Notes, PPT used in the video, ..."
  ],
  [
    "Situation when K-Means clustering fail to give good results (Visualization with MATLAB)",
    "Code1: clc clear all warning off figure; t=0:0.01:2*pi; x1=2*cos(t)+rand(1,length(t)); y1=2*sin(t)+rand(1,length(t)); scatter(x1,y1,'r'); ..."
  ],
  [
    "K Means Clustering Algorithm Explained With an Example Easiest Way",
    "K Means Clustering Algorithm Explained With Example MACHINE LEARNING INTRODUCING Real Know ENGINEERING EACH ..."
  ],
  [
    "K Means Clustering of Weather Data Using Hamming Distance in Microsoft Excel",
    "K Means Clustering of Weather Data Using Hamming Distance in Microsoft Excel."
  ],
  [
    "42. Distance Based Clustering --- K means",
    "In this video we discussed k-means, k-medoids, sillhutte etc See Complete Playlists: Design and analysis of algorithms: ..."
  ],
  [
    "K MEANS CLUSTERING-PART 1",
    "KMeansCLUSTERING #sklearn #Youtube this video I have tried to explain K Means Clustering . # LIKE, SHARE and SUBSCRIBE ..."
  ],
  [
    "[C#] K-Means Clustering",
    "This is a K-Means Clustering application which is writed using C# programming language on Visual Studio 2017. In this program ..."
  ],
  [
    "Perhitungan Manual Algoritma Clustering - K-MEANS",
    "Algoritma k-means: Langkah 1: Tentukan berapa banyak cluster k dari dataset yang akan dibagi. Langkah 2: Tetapkan secara ..."
  ],
  [
    "K-Means Clustering in Python",
    "Demo of applying K-Means Clustering in python with sklearn. Demo code and data: ..."
  ],
  [
    "K- Means Clustering Algorithm Numerial | Data Mining",
    "K- Means Clustering Algorithm Numerial | Data Mining. Check out my some other tutorial videos as well. Visit : anupp.com.np."
  ],
  [
    "Prediction using Unsupervised K-Means Clustering",
    "The Sparks Foundation Internship Tasks predict the optimal number of k (clusters) of unlabeled data (iris dataset) and represent it ..."
  ],
  [
    "How to segment customers with K-Means clustering | Unsupervised ML",
    "Marketers have always relied on data to personalize their customer's experience but looking at your audience from the basic ..."
  ],
  [
    "Lesson 22: Data Pre-processing with K Means Clustering || Improving Model Performance || Python ||",
    "We use K-Means clustering as an intermediate transformation to improve the predictive power of a model. Key Words: K-Means ..."
  ],
  [
    "K-means Clustering Algorithm Introduction",
    "Step by step example of a k-means algorithm run and a few important properties, like the J criterion, the elbow method and the ..."
  ],
  [
    "【PYTHON OPENCV】K means clustering algorithm applied to three different &#39;clusters&#39; of points k=4",
    "Source Code: https://edwardize.blogspot.com/2021/03/python-opencvk-means-clustering_25.html with ❤ by Edward Lance ..."
  ],
  [
    "K-Means Clustering in Dynamo [Aectech]",
    "Original blog post here! http://aectechy.com/k-means-clustering-algorithm/"
  ],
  [
    "K-Means Clustering Algorithm Tutorial - Machine Learning",
    "According to Wikipedia- k-means clustering is a method of vector quantization, originally from signal processing, that aims to ..."
  ],
  [
    "K Means Clustering || Animation of the Algorithm ||",
    "Among other things, we also provide an animation of how K-Means clustering finds the subgroups within the data in real time."
  ],
  [
    "k-means clustering algorithm",
    "K-means clustering algorithm Unsupervised learning algorithm Partitional clustering."
  ],
  [
    "K - Means clustering  - Unsupervised Learning || English || ML-9 || Explained || We &amp; Data",
    "What is Unsupervised Learning and clustering, K-Means clustering algorithm explained in a simple and understandable way, For ..."
  ],
  [
    "Movie Prediction Through K-means Clustering using RStudio By Zaheer Tufail",
    "Using RStudio we can easily cluster the movie predictiondata.... hierarchical clustering Rstudio... K means clustering..k means ..."
  ],
  [
    "K Means Clustering in Julia",
    "Hi Friends, Good morning/evening. Do you need a FREE Apache Spark and Hadoop VM for practice? You can sign up for free ..."
  ],
  [
    "Clustering with K-Means and Birch Algorithm - AI for Aspiring Researchers",
    "Lecture 8 - Clustering with K-Means and Birch Algorithm - AI for Aspiring Researchers."
  ],
  [
    "Create k-means cluster analysis in r using cluster package",
    "k-means cluster analysis in r using cluster package. Create groupings using k-means cluster analysis. Code cluster analysis in r ..."
  ],
  [
    "K-Means Clustering Algorithm in Data Mining | (part-2) | Python Code",
    "K-Means clustering algorithm in data mining with Example Python sklearn K-Means clustering algorithm, K-means clustering, ..."
  ],
  [
    "Weka Tutorial: Bayesian Classification, Nearest Neighbor, K means Clustering",
    "Demonstrating how to do Bayesian Classification, Nearest Neighbor, K means Clustering using WEKA . Generating data set and ..."
  ],
  [
    "Building a K-Means Clustering Algorithm for Customer Segmentation",
    "My process of creating a simple customer segmentation model in Python, and its significance for companies today!"
  ],
  [
    "K Means Clustering Theory - Machine Learning",
    ""
  ],
  [
    "K-means Clustering on Spark using Cloudera Hadoop Platform",
    "dataset link: http://storm.cis.fordham.edu/~gweiss/data-mining/weka-data/segment-challenge.arff."
  ],
  [
    "K-Means clustering",
    "K-Means clustering #Machine Learning #Unsupervised."
  ],
  [
    "Lab 10 Use K-Means Clustering to Identify #Twitter Topics in #RapidMiner",
    "Objectives: • To learn how to cluster Twitter data with the K-Means model. Data: • Optional: collect about 1000 tweets in ..."
  ],
  [
    "NLPC8: k-Means Clustering the Simpsons Wiki",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence 00:00 k-Means Clustering the ..."
  ],
  [
    "K-means clustering",
    ""
  ],
  [
    "[Mì Úp] Phân cụm với K-Means (chọn K bằng Elbow, Silhoutte)",
    "Phân cụm với K-Means: - K-Means là gì? - Các chọn K bằng Elbow, Silhoutte Coef Link github: ..."
  ],
  [
    "K-Means Clustering Algorithms and it&#39;s Implementation in Python | Machine Learning Algo | Part 02",
    "Title: K-Means Clustering Algorithms and it's Implementation in Python | Machine Learning Algo | Part 02 Buy me a coffee: ..."
  ],
  [
    "K-means clustering in 2D with Python",
    "See the following blog post for code and more information: ..."
  ],
  [
    "Unsupervised Machine Learning (K-Means Clustering )",
    "Greeting everyone! I am glad to share that I have successfully completed Task 2- \"Prediction using Unsupervised ML\" as a Data ..."
  ],
  [
    "K-Means Clustering with Programming in Julia",
    ""
  ],
  [
    "DASS: K-Means clustering",
    "Part of a lecture on clustering."
  ],
  [
    "RSS Fingerprinting Dataset Size Reduction Using Feature-Wise Adaptive k-Means Clustering",
    "The presentation of the paper \"RSS ﬁngerprinting dataset size reduction using feature-wise adaptive k-means clustering\" was ..."
  ],
  [
    "CS 320 Apr16-2021 (Part 1) - K-Means Clustering, From Scratch",
    ""
  ],
  [
    "k means clustering",
    ""
  ],
  [
    "K-means Clustering",
    ""
  ],
  [
    "K Means Clustering Algorithm in Machine Learning #datascience #machinelearning #kmeans",
    "This video is part of the post https://www.postnetwork.co/k-means-clusteri…machine-learning/"
  ],
  [
    "K Means Clustering EN ESPAÑOL ➤ SOLO 5 PASOS! 😁",
    "Algoritmo k medias FÁCIL! ✓ (Cómo funciona el K Means Clustering EN ESPAÑOL y para qué sirve. K means ejemplo) ..."
  ],
  [
    "Business Analytics  Lecture Series - Confusion Matrix and K-Means Clustering",
    ""
  ],
  [
    "K-Means Clustering using Python and R | Data Analysis",
    "Module 2: Genomics and High-Dimensional Data Recitation: Demonstration of Data Visualization, Clustering, and Classification ..."
  ],
  [
    "K-Means clustering",
    "kmeansclustering #clustering #machinelearning."
  ],
  [
    "UNIT 5-K-Means Clustering Algorithm using Python",
    "in this tutorial we will learn K-means clustering algorithm(unsupervised).A clustering algorithm Partitional clustering Hierarchical ..."
  ],
  [
    "K-Means Clustering Numerical",
    "K-Means Clustering Numerical #kmeans #kmean #kmeannumerical #clustering #kmeanclustering#Machinelearning K-Means ..."
  ],
  [
    "K-means Clustering Example",
    "Mr.P.N.Kathavate, Assistant Professor, Information Technology."
  ],
  [
    "K-Means Clustering | #GRIPJUN21",
    "K-Means Clustering is used to identify clusters among the different flower species. Two implementations, one with Principal ..."
  ],
  [
    "K-means Clustering ( KTU CS467 Machine Learning - Module 6 )",
    "K-means clustering."
  ],
  [
    "25. K-Means Clustering Implementation Using Python | With Real World Data Set",
    "This videos tutorials helps to understand practical implementation of K-Means Clustering Algorithm Using Python In this video we ..."
  ],
  [
    "Cluster Project (K Means Clustering) [Adv Excel, Tableau]",
    "In this video I have explained Cluster Project using Advance Excel and Tableau, the insights that we have got from our cluster ..."
  ],
  [
    "Tutorial 9: K-Means Clustering: Part 1",
    "This tutorial studies what clustering is and starts seeing the most known clustering method, K-Means."
  ],
  [
    "C++ Machine Learning Tutorial Part 3: K-Means Clustering Unsupervised Learning",
    "In this video, we make some modifications to our data infrastructure as well as implement the K-Means cluster algorithm."
  ],
  [
    "K Means Clustering",
    "محاضرة التدريسي : د ايمان هاتو المحاضرة حول:Clustering is a process of partitioning a set of data objects into subsets on the basis of ..."
  ],
  [
    "MacQueen&#39;s algorithm for k-means clustering",
    ""
  ],
  [
    "Perhitungan Manual Algoritma Clustering - K-MEANS",
    "Algoritma k-means: Langkah 1: Tentukan berapa banyak cluster k dari dataset yang akan dibagi. Langkah 2: Tetapkan secara ..."
  ],
  [
    "Data Science and Machine Learning - Lecture 10.1 - K-Means Clustering",
    "In this lecture we introduce unsupervised machine learning. More specifically we code the K-means clustering algorithm from ..."
  ],
  [
    "Visualizing K-means clustering in 1D with Python",
    "Code: https://github.com/nrsyed/examples/blob/master/kmeans1d_demo.py See the following blog post for a brief discussion of ..."
  ],
  [
    "K Means Clustering With Julia",
    "K-Means Clustering With Julia."
  ],
  [
    "K-Means Clustering | Unsupervised Learning",
    "Project done as a part of Data Science Internship at The Sparks Foundation's GRIP program."
  ],
  [
    "K means clustering algorithm explained in Hindi(Tutorial - 6)",
    "In this video, I have explained what is clustering and how the K-means clustering algorithm works. Explained in detail in Hindi."
  ],
  [
    "Explainable k-Means Clustering",
    "By Dr. Michal Moshkovitz, Postdoc Researcher, TAU Many clustering algorithms lead to cluster assignments that are hard to ..."
  ],
  [
    "Clustering (Part 1): Motivation and K-means Clustering",
    "Parts of these slides have been adapted from CSCI567 Machine Learning (USC, Drs. Sha & Liu)."
  ],
  [
    "Preprocessing Wikipedia Articles &amp; K Means Clustering",
    "Link to Download articles: http://kopiwiki.dsd.sztaki.hu/ Github link: ..."
  ],
  [
    "K-means using R",
    "Differentiating various species of flower 'Iris' using R. This video has been inspired by another great video: \"How to Perform ..."
  ],
  [
    "13. Clustering : K-Means Clustering Algorithm",
    "Initially, this lecture presents intuition of unsupervised learning and clustering algorithm. Later, this lecture video presents details ..."
  ],
  [
    "An enhanced method of initial cluster center selection for K-means algorithm । ASYU-2021, Turkey",
    "This contribution to core Computer Science has been accepted in Innovations in Intelligent Systems and Applications Conference ..."
  ],
  [
    "K means Clustering Algorithm Explained With an Example Easiest And Quickest Way.",
    "In this video, K-means algorithm example is solved step by step."
  ],
  [
    "Practical session on Weka:   K-means Clustering",
    "This Video use Weka Explorer to do Simple K-Means Clustering."
  ],
  [
    "K-Means Clustering &amp; Hierarchical Clustering (Alchohol QCM- sensor dataset) - Google Colaboratory",
    "Clustering with K-Means Clustering Algorithm and Hierarchical Clustering Algorithm, using Alchohol QCM Sensor dataset."
  ],
  [
    "CODING UNSUPERVISED LEARNING | K-MEANS CLUSTERING | MACHINE LEARNING TUTORIAL | PART 2",
    "In Unsupervised Learning the data has no labels.The Machine just look for the whatever pattern it can find . Supervised Learning ..."
  ],
  [
    "K-Means Clustering Algorithm Solved Example",
    "K-Means Clustering Algorithm Solved Example Data Science Questions and Answers ..."
  ],
  [
    "White Dots Counting &amp; Coloring on Dice using K-means Clustering Algorithm",
    "Prerequisite: Clearing border components https://youtu.be/9UlF--11gsY Region filling In-Built Function ..."
  ],
  [
    "K means clustering Algorithm explained in Sinhala - Part 2",
    "K means clustering Algorithm explained in Sinhala - Part 2."
  ],
  [
    "K Means Clustering - University Canada West",
    "K-Means is an unsupervised method of clustering groups data points into k clusters in which each observation belongs to the ..."
  ],
  [
    "K-means clustering diagnostics",
    ""
  ],
  [
    "Clustering of Text Documents Using K-Means Algorithm",
    "CLUSTERING OF TEXT DOCUMENTS USING K-MEANS ALGORITHM."
  ],
  [
    "Exploratory: Analytics: An Introduction to K-Means Clustering",
    "In this video, Kan introduces K-Means Clustering algorithm, which groups data based on the similarity using a given set of ..."
  ],
  [
    "k-means clustering  #kmeans #kmeansalgorithm #unsupervisedlearning #clustering",
    "k-means clustering https://blogs.oracle.com/datascience/introduction-to-k-means-clustering #agglomerative #Automation2050 ..."
  ],
  [
    "K Means Clustering In Python",
    "K means clustering in python in this video we will learn and understand the machine learning k means clustering algorithm, which ..."
  ],
  [
    "CMPS 460 | Machine Learning | S22 | Session 3.d | K-means Clustering (II)",
    "Lecture (d) of Session 3 of CMPS 460 Machine Learning, Spring 2022 course at Qatar University by Dr. Tamer Elsayed ..."
  ],
  [
    "New Cluster Selection and Fine-grained Search for k-Means Clustering and Wi-Fi Fingerprinting",
    "This paper introduces three variants that apply heuristics based on radio propagation knowledge in the coarse and fine-grained ..."
  ],
  [
    "Mining of Road Accident Data Using K Means Clustering and Apriori Algorithm",
    "Introduction Road and accidents are uncertain and unsure incidents. In today's world, traffic is increasing at a huge rate which ..."
  ],
  [
    "K-means clustering Algorithm",
    ""
  ],
  [
    "DM Lecture - Binning method and k-means clustering",
    "Binning method and k-means clustering Subject: Data Mining(3160714) Dr. Ami Tusharkant Choksi Associate Professor, ..."
  ],
  [
    "Lecture_88: 1 K Means Clustering",
    ""
  ],
  [
    "Computer Vision with Python and OpenCV - Image Quantization with K Means Clustering",
    "In this video, we will learn how Quantize an image with K-means Clustering. The link to the github repository for the code ..."
  ],
  [
    "APPRENTISSAGE NON-SUPERVISÉ avec Python (24/30)",
    "L'apprentissage Non-Supervisé (Unsupervised Learning) est une technique de Machine Learning tres populaire. Dans ce tutoriel ..."
  ],
  [
    "Unsupervised Learning with K-Means Clustering | CMREC, Hyderabad | Pantech eLearing  | ML-Python",
    "1st July to 30th July Certificate download links are available in our Telegram channel : https://t.me/pantechelearning For Mini ..."
  ],
  [
    "K means Clustering Python",
    "PBD Assignment 2 L1F20BSCS0375 M. Kumail D1."
  ],
  [
    "K -means Clustering Algorithm || Lab Assignment",
    "Guided By: Vaishali Baviskar Learn ..."
  ],
  [
    "CLUK6: Limitations of k-Means Clustering",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence 00:00 Limitations of k-Means ..."
  ],
  [
    "K-means Clustering",
    "All bad edits are intentional."
  ],
  [
    "Computer Vision with Python and OpenCV - Image Quantization with K Means Clustering",
    "In this video, we will learn how Quantize an image with K-means Clustering. The link to the github repository for the code ..."
  ],
  [
    "Machine Learning Algo4: K means Clustering Algorithm",
    "Machine Learning course in Marathahalli, Bangalore by 6Benches ..."
  ],
  [
    "CODING UNSUPERVISED LEARNING | K-MEANS CLUSTERING | MACHINE LEARNING TUTORIAL | PART 1",
    "In Unsupervised Learning, the data has no labels. The Machine just looks for whatever pattern it can find. Supervised Learning ..."
  ],
  [
    "K Means Clustering  | aiensured.com",
    "A special technique to cluster structured data into k clusters K is given as input. To learn more about Artificial Intelligence, ..."
  ],
  [
    "CS 432 - DM, Lec 18, K-Means Clustering Algorithm",
    "K-means clustering, characteristics and properties, extensions to the basic k-means algorithm."
  ],
  [
    "K Means Algorithm - Partitioning Based Clustering",
    "Contents taken from google."
  ],
  [
    "K-Means Clustering and Heriarchical Clustering Algorithms - PART 1.",
    "MachineLearning#UnsupervisedAlgorithms I have explained the theoritical part of both algorithms in Part 1 and I have explained ..."
  ],
  [
    "Face Recognition using PCA and K-Means Clustering",
    "Face Recognition using PCA and K-Means Clustering."
  ],
  [
    "Aseda Addai-Deseh: K-Means Clustering",
    "We are in the era of data explosion and exabytes of data are generated every day. Uncovering insights within data has become ..."
  ],
  [
    "K-MEANS CLUSTERING ALGORITHM WITH AN EXAMPLE AND CODE",
    "GITHUB CODE LINK: https://github.com/FAIZANAZAM123/Assigment2/tree/main."
  ],
  [
    "5.9 K-Means Clustering | Distance Based Model | Machine Learning",
    "Video Content Details : 1.K-Means Clustering 2.K-Means Clustering Algorithm 3.K-Means Clustering Algorithm with Example 4."
  ],
  [
    "K means clustering using python",
    "\"The scikit learn library for python is a powerful machine learning tool. K means clustering, which is easily implemented in python, ..."
  ],
  [
    "21. K Means Clustering | Machine Learning with Python | Tech2Teach",
    "In this video, we'll be covering k-Means clustering. So let's get started. Imagine that you have a customer dataset, and you need to ..."
  ],
  [
    "K-means clustering",
    ""
  ],
  [
    "K means Clustering Algorithm Explained With an Example | Data Mining | 2022",
    "kmeans#datamining#machinelearning#easysoln#solved#example."
  ],
  [
    "K-Means Clustering in Python with Code Explained",
    "K-Means Clustering in Python. Subscribe, Like & Share --- Thank You #Subscribe #python #KMeans."
  ],
  [
    "Azure Machine Learning - Clustering (K-Means)",
    "Azure Machine Learning - Clustering (K-Means) -Household power consumption classification."
  ],
  [
    "K means Clustering in Machine Learning | K Means Clustering in Unsupervised Learning",
    "Unsupervised Learning is a machine learning technique in which the users do not need to supervise the model. Instead, it allows ..."
  ],
  [
    "K-means Clustering",
    "Brief description of k-means clustering and its complete code is given in the video ."
  ],
  [
    "CLUK4: Accelerating K-Means Clustering: Elkan&#39;s and Hamerly&#39;s Methods",
    "Lecture Summer 2022 - PARTIAL recording Erich Schubert, TU Dortmund, Artificial Intelligence The standard k-means algorithm ..."
  ],
  [
    "K - MEANS CLUSTERING ALGORITHM",
    "EXPERIMENT NO . 2."
  ],
  [
    "K-Means Clustering Algorithm With Numerical Example - KTU SYLLABUS  - MACHINE LEARNING",
    "K-Means Clustering Algorithm With Numerical Example - KTU SYLLABUS - MACHINE LEARNING."
  ],
  [
    "Part I, K-Medoid Clustering Algorithm, PAM, Data Mining, Exercise, problem, solved, partitioning",
    "K-Medoid Algorithm, PAM, Data Mining, Exercise, problem, solved PAM algorithm is explained with simple example, advantages ..."
  ],
  [
    "K Means Clustering Theory 1",
    ""
  ],
  [
    "K means Clustering | Machine Learning | Perfect eLearning",
    "K means Clustering Please Subscribe Website: https://perfectelearning.com/ Instagram: ..."
  ],
  [
    "K-Means Clustering Algorithm - Pacmann Linear Algebra Assignment",
    "Timestamp: 00:00 Introduction 01:15 Algorithm Overview 02:36 Cluster Assignment 06:41 Update Centroid 10:45 Clustering ..."
  ],
  [
    "7.2 k-Means Clustering",
    "Week 7 lecture for COMP0088 Introduction to Machine Learning (2 of 4)"
  ],
  [
    "K-means clustering (big data)",
    "L1f20bscs0397, D1."
  ],
  [
    "Implementation of K-Means Clustering Algorithm using Python",
    "machinelearning #artificialintelligence #datascience #kmeans #kmeansalgorithm#machinelearningalgorithm #pythontutorial ..."
  ],
  [
    "Calculating True/False Negatives in K-Means Clustering (Part 2)",
    "This video gives some insight into how to calculate true negatives and false negatives after clustering some data with K-means ..."
  ],
  [
    "K Means Clustering in Python and R",
    "Understanding K Means Clustering Machine Learning Algorithm and implementing this algorithm using Python and R with the ..."
  ],
  [
    "PBD Assignment 2 | K-Means Clustering",
    "Github Link: https://github.com/TheAli711/datascience/tree/main/k-means-clustering Dev.to Article: ..."
  ],
  [
    "Parallel K-Means Clustering Based on MapReduce || Big Data Final Year Projects || Java Projects",
    "Data clustering has been received considerable attention in many applications, such as data mining, document retrieval, image ..."
  ],
  [
    "K Means Clustering",
    "خوازمية من خوازميات التعلم بدون اشراف."
  ],
  [
    "K Means Clustering Algorithm (Delphi)",
    "source code : https://github.com/Angedevil-AD/Clustering/tree/main/k%20means%20expl."
  ],
  [
    "k-means clustering by rapidminer",
    "k-means clustering by rapidminer Helpful? Please use the *Thanks* button above! Or, thank me via Patreon: ..."
  ],
  [
    "k mean Clustering for k=2 in MATLAB without built-in function (When data-set is two dimensional)",
    "Prerequisite: k mean Clustering for k=2 in MATLAB without built-in function (When data-set is one dimensional) ..."
  ],
  [
    "K Means Clustering (Part 2)",
    "This video walks through how to determine the optimal number of clusters in a k-means cluster model. Uses elbow plot and review ..."
  ],
  [
    "K Means Clustering Program 2",
    "https://drive.google.com/drive/folders/1M6jNsitrYwv8rnWxLJ-W4BUqmkqGJsPZ?usp=sharing."
  ],
  [
    "Machine Learning on Artificial Intelligence தமிழில் Tamil - Part 24 | K-Means Clustering | DBSCAN",
    "Machine Learning on Artificial Intelligence தமிழில் Tamil - Part 24 | K-Means Clustering |DBSCAN ..."
  ],
  [
    "K Means clustering with python - Indian Cyber Security Solutions",
    "The k-means clustering method is an unsupervised machine learning technique used to identify clusters of data objects in a ..."
  ],
  [
    "Spark MLLib | K Means Clustering using Spark MLLib | K Means Clustering Algorithm",
    "K Means Clustering using Spark MLLib SUBSCRIBE TO 360DigiTMG's YOUTUBE CHANNEL NOW ..."
  ],
  [
    "CEG-MUDE Week 2.6 ML: Unsupervised learning, K-Means clustering (2/3)",
    ""
  ],
  [
    "Prediction using Unsupervised Machine Learning | K means clustering",
    "GRIPDECEMBER21 #GRIPDEC21 #TSF #DSBA In this video, I have shared my Jupyter Notebook code for #task2 of my Data ..."
  ],
  [
    "K MEANS CLUSTERING",
    "K Means clustering."
  ],
  [
    "K Means Clustering Code in Python",
    ""
  ],
  [
    "K-Means Clustering Algorithm || Practice Example  #Data_Science_Master",
    "Data_Science Special Thanks Nitesh sir (CampusX Youtube Channel)"
  ],
  [
    "[Mì Úp] Phân cụm với K-Means (chọn K bằng Elbow, Silhoutte)",
    "Phân cụm với K-Means: - K-Means là gì? - Các chọn K bằng Elbow, Silhoutte Coef Link github: ..."
  ],
  [
    "Big Data Project | K-Means Clustering on Wikipedia Files",
    ""
  ],
  [
    "Azure Machine Learning - Clustering (K-Means)",
    "kmean #kmeanclustering #azureclustering #clusteringinazuremlstudio #aigeek Azure Machine Learning - Clustering (K-Means) ..."
  ],
  [
    "K-Means Clustering Algorithm | Classification Algorithm 2021 #DNSC",
    "All materials in these videos are used for educational purposes and fall within the guidelines of fair use. This video is for ..."
  ],
  [
    "Handwritten Character Recognition using Support Vector Machine (SVM) and K-Means Clustering Algorthm",
    "This video is on how to perform automatic Handwritten Character Recognition using two popular Machine Learning (Predictive ..."
  ],
  [
    "Prediction of Iris Dataset By K-means Clustering",
    "By Praveen Gupta Hello, I'm done with my #task2 of the Data Science and Business Analytics Internship Program at ..."
  ],
  [
    "BI Prcatical- k-means clustering using R",
    "Like, Share, Suscribe.. BI Practicals Practical No.6 PDF: ..."
  ],
  [
    "Learn Python [Algorithms and Data Structures] || 11.2 K means clustering example",
    "Description This course is about data structures, algorithms and graphs. We are going to implement the problems in Python ..."
  ],
  [
    "Crime Rate Prediction  Using K means Clustering With Graph View Project",
    "Hello Guys welcome to Ready2Coding Today I am going to show!! Crime rate Prediction Using k means Clustering With Graph ..."
  ],
  [
    "K-Means Clustering",
    ""
  ],
  [
    "Introduction To K Means Clustering Algorithm(UnSupervised Learning)",
    "K-Mean clustering is an example of un-supervised machine learning algorithm which classifies given points into k groups in such ..."
  ],
  [
    "Belajar Perhitungan Manual Analisis Cluster K-Means dengan Excel",
    "Berikut adalah video yang menyajikan analisis cluster K-Means. Analisis Cluster disebut juga analisis pengelompokan yang ..."
  ],
  [
    "Smoothed K-Means Clustering with OpenCL 2.0 Dynamic Parallelism",
    "RX550 was the compute device with 512 cores or 8 compute units. First run computed each k-means iteration in 9ms for 1M data ..."
  ],
  [
    "Implementing K-Means Clustering Using NumPy",
    "In this video, we implement K-Means Clustering model from scratch. Codebase: https://github.com/oniani/ai GitHub: ..."
  ],
  [
    "K means clustering python from scratch - [Machine Learning Algorithms] (2020)",
    "K mean in one of the clustering algorithm that you can used easily in Python, it's part of machine learning algorithms. we can use ..."
  ],
  [
    "K-Means Clustering Algorithm || Lab Assignment...",
    "Guided By: Vaishali Baviskar Learn more.- https://bit.ly/3afa5nj."
  ],
  [
    "Python Code for K-Means Clustering Algorithm in Machine Learning",
    ""
  ],
  [
    "K-Means  Clustering Explained with Example",
    "For assignment purposes. link for file. https://github.com/raxamalik/Assignment-No-2.git."
  ],
  [
    "K-Means Clustering - Implementing from scratch",
    "Code Notebook: ..."
  ],
  [
    "K means clustering using python on jupyter note book",
    "In this video i have shared my python code of k- means clustering on jupyter note book (anaconda)."
  ],
  [
    "K means clustering implementation in python from scratch (Tutorial - 7, Part - 1)",
    "I have implemented the k-means algorithm in python from scratch and explained it in this video. I have explained everything in ..."
  ],
  [
    "k means clustering in  python",
    "K means clustering ( algorithm of unsupervised learning)"
  ],
  [
    "K means clustering full explanation | Python Programming",
    "kmeans #python #programming Source Code on Github : https://github.com/DaniyalRana12/Assignments Thanks for watching ..."
  ],
  [
    "K Means Clustering | Algorithm | Explanation | Python Code",
    "This video is an brief explanation of a machine learning algorithm Named as K means Clustering with code explanation in Python."
  ],
  [
    "K-means Clustering",
    "Materi tentang K-means Clustering."
  ],
  [
    "Thuật toán K-Means | KMean - KMeans clustering | Khai phá dữ liệu | K-Means Algorithm",
    "Cách giải quyết bài toán Kmean trong khai phá dữ liệu. Video mình tập trung vào phần hướng dẫn bài tập. Lý thuyết mọi người có ..."
  ],
  [
    "Image Quantization With K-Means Clustering Algorithm",
    ""
  ],
  [
    "Image segmentation using K-means clustering in Matlab",
    "تجزئة الصورة بإستخدام خوارزمية K-means في لغة ماتلاب، بالاضافة الى شرح بعض العمليات على الصور الثنائية Binary images وقراءة ..."
  ],
  [
    "K-Means Python script to Flask application (step by step) - PART #1",
    "This tutorial demonstrates how to build a stylish #Flask application from a single Python code executing K-means clustering ..."
  ],
  [
    "Implementing K means Clustering | Unsupervised Machine Learning in Data Science",
    "Unsupervised Learning is a machine learning technique in which the users do not need to supervise the model. Instead, it allows ..."
  ],
  [
    "Learn Python [Algorithms and Data Structures] || 11.1 K means clustering introduction",
    "Description This course is about data structures, algorithms and graphs. We are going to implement the problems in Python ..."
  ],
  [
    "FoDA - L23 : Lloyd&#39;s Algorithm for k-Means Clustering (Chapter 8.3)",
    "k-means clustering formulation, Lloyd's well-known iterative algorithm, initialization, random restarts, choosing k with the elbow ..."
  ],
  [
    "K Means Clustering +Scikit-Learn implementation(Python) : Part 2",
    "KMeansCLUSTERING #sklearn #Python #Sci-kit Learn #JUPYTER this video I have tried to explain K Means Clustering ..."
  ],
  [
    "Solved Problem - 6 - k-means Clustering (Machine Learning)",
    "This video explains how k-means clustering algorithm works with numerical example solved manually. Please refer to below link ..."
  ],
  [
    "R- studio-K means clustering using  Average Silhouette  and Gap Statistics Method - Part 3",
    ""
  ],
  [
    "Machine Learning | K-Means Clustering | in Sinhala - Ashirwada Dayarathne",
    "Machine Learning | K-Means Clustering | in Sinhala - Ashirwada Dayarathne."
  ],
  [
    "Multivariate Statistics: 9.2 K-means clustering",
    "Chapter 9.2 K-means clustering. One of the simplest clustering methods is K-means clustering. Here we assume there are ..."
  ],
  [
    "K Means Clustering Customer Segmentation with Pranav Jaipurkar Data Science",
    ""
  ],
  [
    "K-Means clustering explained in under 2 minutes",
    "I know #kmeans#kmeansclustering,#kmeansclusteringalgorithm,#kmeansclusteringexample,#kmeansclusteringpython ..."
  ],
  [
    "k-means clustering",
    "Welcome to our new season, Data Skeptic: k-means clustering. Each week will feature an interview or discussion related to this ..."
  ],
  [
    "ML Lect 9 - Part2 - k-Means Clustering Examples",
    "In this part of lecture, it is discussed the application of k-Means Clustering on Digits recognition and Image Compression tasks."
  ],
  [
    "K-Means Clustering with Iris data in Google Colab",
    ""
  ],
  [
    "Der K-Means Algorithmus - Einfache und intuitive Erklärung (Deutsch/German)",
    "Eine einfache und intuitive Erklärung des K-Means Clustering Algorithmus für Clusteranalyse und unsupervised machine ..."
  ],
  [
    "VTU AIML LAB7 K-MEANS vs EM",
    "Understand the program better. AIML LAB PLAYLIST: ..."
  ],
  [
    "Summer Course on Machine Learning: Study Case on K-Means Clustering for Customer Segmentation",
    ""
  ],
  [
    "kmeansClustering",
    ""
  ],
  [
    "AI PHARMACIST  Bhabnish WAICY 2021",
    "AI reads prescription and suggest best medicine. Project designed and submitted by our SkillEdu VARSITY student Bhabnish ..."
  ],
  [
    "बिना वजह डरा दिया भाई || #memes #shorts #comedyvideo #comedy #short #ytshorts #youtubeshorts  #memes",
    "funny #memes #comedyvideo #shorts #short यह वीडियो सिर्फ मनोरंजन के लिए बनाया गया ..."
  ],
  [
    "WAH KYA SCENE HAI  | DANK INDIAN MEMES | TRENDING MEMES | INDAIN MEMES COMPLILATION",
    "Wah Kya scene hai | Dank Indian Memes | Trending Memes | Indian Memes Compilation Disclaimer: Copyright Disclaimer under ..."
  ],
  [
    "😂𝐖𝐚𝐡 𝐤𝐲𝐚 𝐬𝐞𝐞𝐧 𝐡𝐚𝐢 𝐄𝐏 𝐗9 || 𝐇𝐞𝐡𝐞 𝐫𝐡𝐚 𝐧𝐡𝐢 𝐣𝐚𝐭𝐚 || 𝐃𝐚𝐧𝐤 𝐌𝐞𝐦𝐞𝐬 ||@Rajnish_Troll",
    "Wah kya seen hai EP X9 || Hehe rha nhi jata || Dank Memes || If You New , So Please ..."
  ],
  [
    "Wah Kya scene hai 😂 | ep 14 _ Dank Indian Memes | trending Memes | Indian Memes  Compliation",
    "Dank Indian Memes | trending Memes | Indian Memes Compliant Disclaimer: Copyright Disclaimer under Section 107 of the ..."
  ],
  [
    "Discover CLUSTER Voicings for ADVANCED Guitar",
    "Master the sound of Clusters for both single note lines & chord voicings with this discovery process! Using Clusters on the #guitar ..."
  ],
  [
    "MINERIADEDATOS-SEMANA14-PARTE1",
    ""
  ]
]