[
  [
    "Machine Learning",
    ""
  ],
  [
    "Machine Learning Full Course - Learn Machine Learning 10 Hours | Machine Learning Tutorial | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "What is Machine Learning?",
    "What is Machine Learning and how does it work: Many people who hear about machine learning often think of it as magic. In this ..."
  ],
  [
    "Stanford CS229: Machine Learning Full Course taught by Andrew Ng | Autumn 2018",
    "Led by Andrew Ng, this course provides a broad introduction to machine learning and statistical pattern recognition. Topics ..."
  ],
  [
    "MACHINE LEARNING",
    ""
  ],
  [
    "Detailed Roadmap for Machine Learning | Free Study Resources | Simply Explained",
    "Telegram: https://t.me/apnikakshaofficial Instagram: https://www.instagram.com/dhattarwalaman/ Resources of this Lecture ..."
  ],
  [
    "Machine Learning Course for Beginners",
    "Learn the theory and practical application of machine learning concepts in this comprehensive course for beginners. Learning ..."
  ],
  [
    "What is Machine Learning With Full Information? – [Hindi] – Quick Support",
    "WhatisMachineLearning #QuickSupport #Technology What is Machine Learning With Full Information? – [Hindi] – Quick Support."
  ],
  [
    "Complete Roadmap To Learn Machine Learning (PDF Included)",
    "In this video, we will look into a parallel conquering technique to learn machine learning from scratch. This video will teach you ..."
  ],
  [
    "Machine Learning — Andrew Ng, Stanford University [FULL COURSE]",
    "About this course ------------------------------ Machine learning is the science of getting computers to act without being explicitly ..."
  ],
  [
    "Complete Machine Learning In 6 Hours| Krish Naik",
    "All the materials are available in the below link https://courses.ineuron.ai/Mega-Community-Live Time Stamp: 00:00:00 ..."
  ],
  [
    "Should I study Machine Learning? Is it required for Placements?",
    "Complete C++ Placement Course (Data Structures+Algorithm) ..."
  ],
  [
    "Types Of Machine Learning | Machine Learning Algorithms | Machine Learning Tutorial | Simplilearn",
    "Machine Learning helps you build models that can make predictions and take decisions of their own. This video on Types of ..."
  ],
  [
    "Machine Learning with Python | Machine Learning Tutorial for Beginners | Machine Learning Tutorial",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Python Machine Learning Tutorial (Data Science)",
    "Python Machine Learning Tutorial - Learn how to predict the kind of music people like. Subscribe for more Python tutorials like ..."
  ],
  [
    "Machine Learning Vs Artificial Intelligence? Same or Different?",
    "Namaskaar Dosto, is video mein maine aapse Artificial Intelligence aur Machine Learning ke baare mein baat ki hai, Artificial ..."
  ],
  [
    "What is Machine Learning?",
    "Got lots of data? Machine learning can help! In this episode of Cloud AI Adventures, Yufeng Guo explains machine learning from ..."
  ],
  [
    "Computer Scientist Explains Machine Learning in 5 Levels of Difficulty | WIRED",
    "WIRED has challenged computer scientist and Hidden Door cofounder and CEO Hilary Mason to explain machine learning to 5 ..."
  ],
  [
    "Machine learning For Beginners in Hindi",
    "Machinelearning #LMT #lastmomenttuitions Machine Learning Full Course: https://bit.ly/3oobHT9 Last moment tuitions are ..."
  ],
  [
    "Machine Learning Full Course in Hindi | Learn Machine Learning in 5 Hours | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Machine Learning Explained in 100 Seconds",
    "Machine Learning is the process of teaching a computer how perform a task with out explicitly programming it. The process feeds ..."
  ],
  [
    "Machine Learning for Everybody – Full Course",
    "Learn Machine Learning in a way that is accessible to absolute beginners. You will learn the basics of Machine Learning and how ..."
  ],
  [
    "What is Machine Learning?",
    "Learn more about Machine Learning → http://ibm.biz/machine-learning-guide Learn more about Deep Learning ..."
  ],
  [
    "Machine Learning vs Deep Learning",
    "What is Machine Learning → http://ibm.biz/machine-learning-is-simple What is Deep Learning ..."
  ],
  [
    "Intro to Machine Learning (ML Zero to Hero - Part 1)",
    "Machine Learning represents a new paradigm in programming, where instead of programming explicit rules in a language such ..."
  ],
  [
    "Tübingen Machine Learning",
    "This is the youtube channel of the machine learning groups at the University of Tübingen."
  ],
  [
    "Supervised, Unsupervised and Reinforcement Learning in Artificial Intelligence in Hindi",
    "Supervised Learning Unsupervised Learning Reinforcement Learning Training Data Only Inputs Reward/Penalty Both Inputs ..."
  ],
  [
    "Machine Learning Fundamentals: Cross Validation",
    "One of the fundamental concepts in machine learning is Cross Validation. It's how we decide which machine learning method ..."
  ],
  [
    "Supervised and Unsupervised Learning In Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning Tutorials For Beginners Using Python In Hindi",
    "In this series, I have covered various Machine learning techniques for beginners. I have tried to cover all the ML Algorithms like ..."
  ],
  [
    "Live Day 1- Introduction To Machine Learning Algorithms For Data Science",
    "Join the community session https://ineuron.ai/course/Mega-Community . Here All the materials will be uploaded. Playlist: ..."
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Edureka",
    "Post Graduate Diploma in Artificial Intelligence by E&ICT Academy NIT Warangal: ..."
  ],
  [
    "Artificial Intelligence Class 10 Ch 1 |AI vs Machine Learning vs Deep Learning (Differences) 2022-23",
    "Previous Video:- https://www.youtube.com/watch?v=nhOfB9n938M Next Video:- https://www.youtube.com/watch?v=csgjT73S7b4 ..."
  ],
  [
    "Machine Learning Zero to Hero (Google I/O&#39;19)",
    "This is a talk for people who know code, but who don't necessarily know machine learning. Learn the 'new' paradigm of machine ..."
  ],
  [
    "The 7 steps of machine learning",
    "How can we tell if a drink is beer or wine? Machine learning, of course! In this episode of Cloud AI Adventures, Yufeng walks ..."
  ],
  [
    "What’s The Difference Between Artificial Intelligence And Machine Learning",
    "In this video I explain the difference between AI and ML and how both can be used in business to solve real world problems."
  ],
  [
    "Complete Machine Learning Course in 60 Hours - Part 1 | Full Machine Learning Course with Python",
    "This Complete Machine Learning Course video will help you understand and learn Machine Learning in detail. This Machine ..."
  ],
  [
    "J. Maya  - Machine Learning (Official Lyric Video)",
    "\"Machine Learning” is a song about social performance, about what happens when you construct so many different versions of ..."
  ],
  [
    "Machine Learning Tutorial Python - 2: Linear Regression Single Variable",
    "In this tutorial we will predict home prices using linear regression. We use training data that has home areas in square feet and ..."
  ],
  [
    "Machine Learning vs Deep Learning vs Artificial Intelligence | ML vs DL vs AI | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Active (Machine) Learning - Computerphile",
    "Machine Learning where you put in a fraction of the effort? What's not to like? - Dr Michel Valstar explains Active & Cooperative ..."
  ],
  [
    "Machine Learning (Hung-yi Lee, NTU)",
    "課程網頁: http://speech.ee.ntu.edu.tw/~tlkagk/courses_ML17_2.html."
  ],
  [
    "Machine Learning Full Course 6 Hours 🔥 | What is Machine Learning? Machine Learning Tutorial",
    "In this Machine Learning tutorial for beginners from WsCube Tech, you will learn basics about machine learning with practical ..."
  ],
  [
    "How I&#39;m Teaching Myself AI &amp; Machine Learning online",
    "Start protecting your browsing for free today with Guardio's 7-day free trial: https://guard.io/InternetMadeCoder How to self study ..."
  ],
  [
    "AI VS ML VS DL VS Data Science",
    "Please do subscribe my vlogging channel for motivational videos ..."
  ],
  [
    "How I Became A Self-Taught Machine Learning Engineer",
    "Machine Learning is not easy, especially if you are a “self-taught” machine learning engineer. But that's exactly what I did. In this ..."
  ],
  [
    "Advice for machine learning beginners | Andrej Karpathy and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=cdiD-9MMpb0 Please support this podcast by checking out ..."
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Training | Edureka",
    "Data Science Training (Use Code \"YOUTUBE20\") ..."
  ],
  [
    "How Machines Learn",
    "How do all the algorithms around us learn to do their jobs? **OMG PLUSHIE BOTS!"
  ],
  [
    "How I would learn Machine Learning (if I could start over)",
    "In this video, I give you my step by step process on how I would learn Machine Learning if I could start over again, and provide you ..."
  ],
  [
    "Machine Learning Tutorials For Beginners Using Python In Hindi",
    "In this series, I have covered various Machine learning techniques for beginners. I have tried to cover all the ML Algorithms like ..."
  ],
  [
    "How to Become a Machine Learning Engineer? – [Hindi] – Quick Support",
    "HowtoBecomeaMachineLearingEngineer? #Education #Career How to Become a Machine Learning Engineer? – [Hindi] – Quick ..."
  ],
  [
    "AI VS ML VS DL VS Data Science",
    "Please do subscribe my vlogging channel for motivational videos ..."
  ],
  [
    "Machine Learning Full Course For Beginners | Machine Learning Tutorial | Machine Learning Course",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Training | Edureka",
    "Data Science Training (Use Code \"YOUTUBE20\") ..."
  ],
  [
    "Overfitting and Underfitting Explained with Examples in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Advice for machine learning beginners | Andrej Karpathy and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=cdiD-9MMpb0 Please support this podcast by checking out ..."
  ],
  [
    "Machine Learning: Living in the Age of AI | A WIRED Film",
    "Machine Learning: Living in the Age of AI,” examines the extraordinary ways in which people are interacting with AI today."
  ],
  [
    "Machine Learning Full Course | Learn Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning, Deep Learning, emerging, emerging technologies in global business environment, mba",
    "Industry 4.0 : Meaning, Nature : https://youtu.be/o_nP6-Cy8X0 Digital Transformation : https://youtu.be/vdrjCtvlhYQ Artificial ..."
  ],
  [
    "Machine Learning &amp; Artificial Intelligence: Crash Course Computer Science #34",
    "So we've talked a lot in this series about how computers fetch and display data, but how do they make decisions on this data?"
  ],
  [
    "Machine Learning Tutorial Python | Machine Learning For Beginners",
    "In this video series, we are going to learn about machine learning with Python. There are activities where computers are better ..."
  ],
  [
    "Machine Learning Interview Questions and Answers | Machine Learning Interview Preparation | Edureka",
    "Machine Learning Training with Python (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "What is Machine Learning?",
    "Machine learning is all around us; on our phones, powering social networks, helping the police and doctors, scientists and mayors ..."
  ],
  [
    "FREE RESOURCES TO LEARN MACHINE LEARNING🔥 | Learn AI/ML/DL for FREE!",
    "Here are a list of free resources for you to learn machine learning. I've shown resources that I used to learn machine learning and ..."
  ],
  [
    "What is Deep Learning? (in 5 Minutes) 🔥🔥",
    "What is deep learning? How is it different from AI. Is ML and DL the same thing? I will answer all these questions in an easy and ..."
  ],
  [
    "Todos podemos aprender Machine learning",
    "Haydé Martínez (@haydemtzl), la profesora del Curso de Introducción a Machine Learning de Platzi, nos cuenta en este video de ..."
  ],
  [
    "Supervised vs. Unsupervised Learning",
    "More about supervised & unsupervised learning → https://ibm.biz/Blog-Supervised-vs-Unsupervised Learn about IBM Watson ..."
  ],
  [
    "🔥Machine Learning | Machine Learning Tutorial For Beginners | Machine Learning Projects | Simplilearn | Updated Machine Learning Playlist 2023",
    "Explore More about the Ai and ML course by simplilearn at: ..."
  ],
  [
    "Why Python is popular for machine learning",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=-DVyjdw4t9I Please support this podcast by checking out ..."
  ],
  [
    "Machine Learning basics",
    "When you think of Machine Learning, what do you think of? Learn what Machine Learning is, how computers find patterns, and ..."
  ],
  [
    "How to study Machine Learning (for Beginners) | Get a FAANG ML Job | Kalpit Veerwal",
    "Enrol in AcadBoost University to build a dream career: Android App: https://bit.ly/3cM5qs9 Website: ..."
  ],
  [
    "#1 Introduction to Machine Learning - Definition &amp; Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "What is Machine Learning in Telugu",
    ""
  ],
  [
    "Machine Learningஎன்றால் என்ன?| What Is Machine Learning in Tamil ?| Introduction to Machine Learning",
    "Ethical Hacking Online Course (English & Tamil) : https://www.kaashivinfotech.com/online-internships/ Complete Ethical Hacking ..."
  ],
  [
    "Complete Roadmap for Machine Learning | ML Roadmap for Beginners",
    "Machine Learning Engineer Roadmap: Step by step 6 months learning roadmap for machine learning engineer career. Most of ..."
  ],
  [
    "What Does A Machine Learning Engineer At Amazon Do?",
    "In this video, I sat down with Ryan Doan, an ex-Amazon Machine Learning Engineer and the creator of MLExpert, to talk about ..."
  ],
  [
    "Linear Regression Explained in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "AI: What is Machine Learning?",
    "AI is all around us. The most widely used form of AI is called Machine Learning and you probably interact with it every day."
  ],
  [
    "#3 Perspectives and Issues in Machine Learning |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning | Machine Learning Tutorial | Simplilearn",
    "In this video, you will learn about Supervised vs Unsupervised vs Reinforcement Learning. You will understand the definition of ..."
  ],
  [
    "Quantum Machine Learning Explained",
    "IBM Quantum Computing Roadmap → https://ibm.biz/BdPzaR Quantum computers have the potential to solve certain classes of ..."
  ],
  [
    "Build Your First Machine Learning AI With Neural Networks",
    "Machine learning is awesome. Who doesn't want to build a cool AI that you can teach to do anything. The only problem is ..."
  ],
  [
    "All Machine Learning Models Explained in 5 Minutes | Types of ML Models Basics",
    "Confused about understanding machine learning models? Well, this video will help you grab the basics of each one of them."
  ],
  [
    "AI Learns to Escape (using Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 5 rooms I've designed. The AI was trained ..."
  ],
  [
    "Machine Learning Methods - Computerphile",
    "We haven't got time to label things, so can we let the computers work it out for themselves? Professor Uwe Aickelin explains ..."
  ],
  [
    "How Machine Learning Works?",
    "In a couple of previous videos, I was talking about the advancement of Artificial intelligence, Artificial intelligence, neural networks ..."
  ],
  [
    "Introduction to Machine Learning | Machine Learning in Tamil - Part 1 | #30",
    "Vanakam Thozhargale, Thozhigale !!! Here I am starting a new series \"Machine Learning in Tamil\". Looking forward to your love ..."
  ],
  [
    "Decision Tree Algorithm | Decision Tree in Python | Machine Learning Algorithms | Edureka",
    "Machine Learning with Python (Use Code \"YOUTUBE20\") : https://www.edureka.co/machine-learning-certification-training ..."
  ],
  [
    "Should You Learn Machine Learning?",
    "Welcome back to another video! Recently there has been a lot of hype around machine learning and AI and it seems like ..."
  ],
  [
    "Machine Learning Explained in 5 Minutes",
    "Machine learning explained simply. In this video you'll learn what exactly machine learning is and machine learning basics."
  ],
  [
    "How To Be A Successful Freelance Machine Learning Engineer",
    "Freelancers in Machine Learning have seen exponential growth in demand over the last year. It actually makes complete sense ..."
  ],
  [
    "Machine learning + neuroscience = biologically feasible computing | Benjamin Migliori | TEDxSanDiego",
    "Whether you're a human, an animal, or a machine, decisions can't be made without perception, which is how we come to ..."
  ],
  [
    "What is Machine Learning in Hindi | Introduction to Machine Learning | How Machine Learning works",
    "Machine learning in Hindi | Applications of Machine Learning | How Machine Learning Works 1. Introduction - What is Machine ..."
  ],
  [
    "Introduction to Machine Learning | Artificial Neurons | Malayalam.",
    "AI #MachineLearning #DeepLearning what is machine learning in malayalam | how artificial intelligence works | artificial ..."
  ],
  [
    "Machine Learning Roadmap for Beginners",
    "Enrol in my brand new Core Machine Learning Course where you get Handwritten notes, write your own research paper, get paid ..."
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Algorithms | Simplilearn",
    "Enroll For Simplilearn's Data Science Job Guarantee Program: ..."
  ],
  [
    "Artificial Intelligence Vs Machine Learning Vs Deep Learning l AI vs ML vs DL l Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "MACHINE LEARNING Resources I use EVERYDAY (and you can too!)",
    "Figured I'd share a bunch of resources I use in my day to day life to learn all things machine learning and data science! Chapters ..."
  ],
  [
    "Introduction to Machine Learning (Tamil)",
    ""
  ],
  [
    "Artificial Intelligence Vs Machine Learning Vs Deep Learning l AI vs ML vs DL l Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "MACHINE LEARNING Resources I use EVERYDAY (and you can too!)",
    "Figured I'd share a bunch of resources I use in my day to day life to learn all things machine learning and data science! Chapters ..."
  ],
  [
    "Machine Learning Tutorial using Python in Hindi 2022",
    "Hello India, We are a team of Artificial Intelligence and Data Science. Introduced brand new course \"Machine Learning Begineer ..."
  ],
  [
    "Which Programming Language for AI? | Machine Learning",
    "How to learn AI for Free : https://goo.gl/6sz9J5 Future Updates : https://goo.gl/fNTNAr Developers who are moving towards ..."
  ],
  [
    "How to Get Started with Machine Learning &amp; AI",
    "So how do you get started with machine learning and AI? What should you learn first? Well in this video I will be discussing the ..."
  ],
  [
    "NPTEL MOOC Machine Learning 2016",
    ""
  ],
  [
    "Machine Learning Interview Questions",
    "In this video, I go over machine learning and modeling interview questions on the data science interview. Subscribe to my data ..."
  ],
  [
    "What are Transformers (Machine Learning Model)?",
    "Learn more about Transformers → http://ibm.biz/ML-Transformers Learn more about AI → http://ibm.biz/more-about-ai Check out ..."
  ],
  [
    "HOW TO GET STARTED WITH MACHINE LEARNING🤖 | Best Way to Learn Machine Learning in 2020",
    "In this video, I talk about how to get started with machine learning, what is AI and ML and what all you need to learn in machine ..."
  ],
  [
    "Machine Learning FOR BEGINNERS - Supervised, Unsupervised and Reinforcement Learning",
    "What do you guys think about an Artificial Intelligence Simplified series?? I got so many requests, but since it's not directly ..."
  ],
  [
    "Data Scientist vs Machine Learning Engineer | DS vs ML",
    "Data science and machine learning field is growing exponentially in recent times. In this video I will be explaining the difference ..."
  ],
  [
    "FastAPI for Machine Learning: Live coding an ML web application.",
    "Welcome! Join us for a live workshop where you can follow along with the creator of FastAPI Sebastián Ramírez to build your very ..."
  ],
  [
    "But what is a neural network? | Chapter 1, Deep learning",
    "What are the neurons, why are there layers, and what is the math underlying it? Help fund future projects: ..."
  ],
  [
    "Essential Mathematics for Machine Learning",
    ""
  ],
  [
    "Artificial Intelligence Full Course | Artificial Intelligence Tutorial for Beginners | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "Introduction to Machine Learning | Artificial Neurons | Malayalam.",
    "AI #MachineLearning #DeepLearning what is machine learning in malayalam | how artificial intelligence works | artificial ..."
  ],
  [
    "Machine Learning Projects",
    ""
  ],
  [
    "Machine Learning - Beginner To Professional Hands-on Python in Hindi",
    "Hello India, We are a team of Artificial Intelligence and Data Science. Introduced brand new course \"Machine Learning Begineer ..."
  ],
  [
    "Machine Learning | B. Tech 5th Semester | AKTU",
    ""
  ],
  [
    "Machine Learning full course 6 Hours in telugu",
    "Python Course in Telugu https://pythonlife.in/python-course-in-telugu.html."
  ],
  [
    "How to make Maths Learning Machine from Cardboard | Maths Learning Machine for Kids",
    "How to make Cardboard machine for Maths Learning | Kids Craft | Cardboard Crafts #mathsproject #mathsmodel ..."
  ],
  [
    "#2 Well Posed Learning Problem in Machine Learning with Examples |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "How does artificial intelligence learn? - Briana Brownell",
    "Explore the three major methods of machine learning, which allows computers to write their own rules to problem solve and ..."
  ],
  [
    "Neural Network Architectures &amp; Deep Learning",
    "This video describes the variety of neural network architectures available to solve various problems in science ad engineering."
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "Introduction to Deep Learning: Machine Learning vs. Deep Learning",
    "Learn about the differences between deep learning and machine learning in this MATLAB® Tech Talk. - MATLAB for Deep ..."
  ],
  [
    "Machine Learning (ML)",
    ""
  ],
  [
    "Machine Learning- Sudeshna Sarkar",
    ""
  ],
  [
    "PyTorch for Deep Learning &amp; Machine Learning – Full Course",
    "Learn PyTorch for deep learning in this comprehensive course for beginners. PyTorch is a machine learning framework written in ..."
  ],
  [
    "What is Artificial Intelligence (or Machine Learning)?",
    "Want to learn more about AI and machine learning? Stay current on emerging tech: https://clickhubspot.com/dp7 What is AI?"
  ],
  [
    "Reality behind data science, machine learning jobs",
    "Reality behind data science jobs. Is machine learning really cool? Do you want to learn technology from me?"
  ],
  [
    "Machine Learning for Engineering and Science Applications",
    ""
  ],
  [
    "Ultimate Machine Learning Roadmap 2022 (PDF Included)!",
    "METACENT $10000 GIVEAWAY: https://gleam.io/tGeMT/metacent-giveaway Metacent links: https://www.metacent.io Machine ..."
  ],
  [
    "AI Learns to Escape (Deep Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 7 rooms I've designed. The AI was trained ..."
  ],
  [
    "Machine learning tutorials in Hindi",
    "Take the Complete course of Python+Machine Learning Bootcamp for Beginners: The course is designed to take you from basics ..."
  ],
  [
    "Machine Learning Engineer | Machine Learning Roadmap | ML Engineer | Telugu | Pashams",
    "Machine Learning Engineer, Machine Learning Roadmap, ML Engineer In this video I have explained about Machine Learning ..."
  ],
  [
    "Day 1/30 Machine Learning Master Class - Sanjay",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "What is Machine Learning?",
    "In this video, you'll learn more about the evolution of machine learning and its impact on daily life."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "Machine Learning Course With Python",
    ""
  ],
  [
    "Deep Learning In 5 Minutes | What Is Deep Learning? | Deep Learning Explained Simply | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Deep Learning Basics: Introduction and Overview",
    "An introductory lecture for MIT course 6.S094 on the basics of deep learning including a few key ideas, subfields, and the big ..."
  ],
  [
    "The Fastest Way To Become A Machine Learning Engineer",
    "Satoshi Istand Details: https://www.tenset.io/en/news/tglp-satoshi-island-land-nft-sale Tokenomics: https://www.satoshi-island.com ..."
  ],
  [
    "Self-taught to ML Research: My 5 Year Machine Learning Journey",
    "This is the step-by-step story of how I went from a self-taught machine learning programmer, to getting a machine learning ..."
  ],
  [
    "PYTHON SPÉCIAL MACHINE LEARNING",
    "Série de tutoriels français Python pour faire du machine Learning. Aucun pré-requis nécessaire. Vous apprendrez toutes les ..."
  ],
  [
    "Real-World Python Machine Learning Tutorial w/ Scikit Learn (sklearn basics, NLP, classifiers, etc)",
    "Follow me https://instagram.com/keithgalli for more tech content! Join the Python Army to get access to perks! YouTube ..."
  ],
  [
    "Mathematics of Machine Learning",
    "Do you need to know math to do machine learning? Yes! The big 4 math disciplines that make up machine learning are linear ..."
  ],
  [
    "Stanford CS229: Machine Learning Course | Summer 2019 (Anand Avati)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/ai."
  ],
  [
    "Artificial Intelligence (AI) vs Machine Learning vs Deep Learning vs Data Science",
    "Artificial intelligence is a field where set of techniques are used to make computers as smart as humans. There are certain tasks ..."
  ],
  [
    "Project 1: End To End Python ML Project (Complete)| Machine Learning Tutorials Using Python In Hindi",
    "This machine learning project using python in Hindi is created to give you a complete understanding on how machine learning ..."
  ],
  [
    "Machine Learning Engineer Average Salary, Resume &amp; Jobs | Machine Learning Engineer | Coding Ninjas",
    "Get COURSES For FREE Using This Scholarship Test. Register Here Now: ..."
  ],
  [
    "Introduction to Machine Learning | Machine Learning in Tamil - Part 1 | #30",
    "Vanakam Thozhargale, Thozhigale !!! Here I am starting a new series \"Machine Learning in Tamil\". Looking forward to your love ..."
  ],
  [
    "🖥️ HOW TO GET STARTED WITH MACHINE LEARNING!",
    "The #1 question I get is how to get started with Machine Learning, so join me today as we talk about this! :D SUBSCRIBE FOR ..."
  ],
  [
    "Stanford CS229: Machine Learning Course, Lecture 1 - Andrew Ng (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2Ze53pq ..."
  ],
  [
    "The truth about AI and why you should learn it - Computerphile explains",
    "If you are into cybersecurity or any other field, you probably want to learn about AI and ML. They can really help your resume and ..."
  ],
  [
    "Live Day 3- Discussing KNN And Naive Baye&#39;s Machine Learning Algorithms",
    "Join the community session https://ineuron.ai/course/Mega-Community . Here All the materials will be uploaded. Playlist: ..."
  ],
  [
    "Deep Learning Basics: Introduction and Overview",
    "An introductory lecture for MIT course 6.S094 on the basics of deep learning including a few key ideas, subfields, and the big ..."
  ],
  [
    "What is backpropagation really doing? | Chapter 3, Deep learning",
    "What's actually happening to a neural network as it learns? Help fund future projects: https://www.patreon.com/3blue1brown An ..."
  ],
  [
    "Machine Learning and Human Bias",
    "As researchers and engineers, our goal is to make machine learning technology work for everyone."
  ],
  [
    "KNN in Python From Scratch! Machine Learning Tutorial",
    "Let's code the KNN (K Nearest Neighbours) algorithm in Python from scratch! Detailed Tutorial: https://youtu.be/ngLyX54e1LU ..."
  ],
  [
    "What is Machine Learning in Telugu",
    ""
  ],
  [
    "Overfitting and Underfitting Explained with Examples in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "MLOps explained | Machine Learning Essentials",
    "In this video, learn about the importance of MLOps and the processes associated with it. Download the 30-day learning journey for ..."
  ],
  [
    "#1 Introduction to Machine Learning - Definition &amp; Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Data Science Interview Questions | Part 1 | Machine Learning Interview Questions",
    "Questions covered in this video 1. Decsion Tree Vs Random Forest 2. Parametric vs Non Parametetric Algo 3. Why not Logistic ..."
  ],
  [
    "MarI/O - Machine Learning for Video Games",
    "MarI/O is a program made of neural networks and genetic algorithms that kicks butt at Super Mario World. Source Code: ..."
  ],
  [
    "What is a Machine Learning Engineer",
    "There's one specific role that builds a bridge between data science and its practical counterpart, machine learning. Meet the ..."
  ],
  [
    "Interview With My Brother Who Sold His Startup For $60 Million | Machine Learning Engineer",
    "My brother (https://twitter.com/madavidj) talks about how to successfully leverage Machine Learning in Startups. Learn computer ..."
  ],
  [
    "Use Machine Learning on a Raspberry Pi for object or face detection,  pose estimation, and more!",
    "Using frameworks like TensorFlow Lite and Open CV, combined with some pre-trained models it is possible to use object ..."
  ],
  [
    "Machine Learning In 2 Minutes | What Is Machine Learning? | Machine Learning Basics | Simplilearn",
    "In this video, Machine Learning in 2 minutes we will first answer the question What is Machine Learning? We will then talk about ..."
  ],
  [
    "Machine Learning Tutorial Python - 2: Linear Regression Single Variable",
    "In this tutorial we will predict home prices using linear regression. We use training data that has home areas in square feet and ..."
  ],
  [
    "Machine Learning Tutorial: From Beginner to Advanced",
    "Explore the fundamentals behind machine learning, focusing on unsupervised and supervised learning. You'll learn what each ..."
  ],
  [
    "Decision Tree Algorithm | Decision Tree in Python | Machine Learning Algorithms | Edureka",
    "Machine Learning with Python (Use Code \"YOUTUBE20\") : https://www.edureka.co/machine-learning-certification-training ..."
  ],
  [
    "Why Python is popular for machine learning",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=-DVyjdw4t9I Please support this podcast by checking out ..."
  ],
  [
    "Does my PC actually use Machine Learning?",
    "I had a chance to visit @PCWorld and speak to Gordon about the state of machine learning and artificial intelligence we use in our ..."
  ],
  [
    "Detecting cancer in real-time with machine learning",
    "Learn more about our research efforts to create a machine learning and augmented reality-powered microscope for real-time ..."
  ],
  [
    "📚3 In-Depth Machine Learning Books You Can&#39;t Miss! #machinelearning #datascience #shorts",
    "shorts."
  ],
  [
    "Artificial Intelligence &amp; Machine Learning - Salary Packages 2022",
    "AI and ML are careers that are going to be in demand in next few years with attractive salary packages. #aiml #ai2022 #ai #ml ..."
  ],
  [
    "Introduction to Machine Learning (Tamil)",
    "A short course introducing the main ideas and algorithms of Machine Learning. The goal of the course is to cover the topics at a ..."
  ],
  [
    "Parameters vs hyperparameters in machine learning",
    "In this short video we will discuss the difference between parameters vs hyperparameters in machine learning. Parameters is ..."
  ],
  [
    "Machine learning + neuroscience = biologically feasible computing | Benjamin Migliori | TEDxSanDiego",
    "Whether you're a human, an animal, or a machine, decisions can't be made without perception, which is how we come to ..."
  ],
  [
    "Day 1/30 Machine Learning Master Class - Sanjay",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Deep Learning Full Course - Learn Deep Learning in 6 Hours | Deep Learning Tutorial | Edureka",
    "AI & Deep Learning with TensorFlow (Use Code \"YOUTUBE20\"): https://www.edureka.co/ai-deep-learning-with-tensorflow ..."
  ],
  [
    "1. Artificial Intelligence and Machine Learning",
    "MIT RES.LL-005 Mathematics of Big Data and Machine Learning, IAP 2020 Instructor: Jeremy Kepner, Vijay Gadepally View the ..."
  ],
  [
    "How I Learnt Machine Learning In 6 Steps (3 months)",
    "SUBSCRIBE for more great content: http://bit.ly/subscribeToSmitha This is a much asked question do here's how I learnt machine ..."
  ],
  [
    "Day 1/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Classification and Regression in Machine Learning",
    "In this short video, Max Margenot gives an overview of supervised and unsupervised machine learning tools. He covers ..."
  ],
  [
    "What are Transformers (Machine Learning Model)?",
    "Learn more about Transformers → http://ibm.biz/ML-Transformers Learn more about AI → http://ibm.biz/more-about-ai Check out ..."
  ],
  [
    "How to Use Machine Learning for Predictive Maintenance",
    "C'mon over to https://realpars.com where you can learn PLC programming faster and easier than you ever thought possible!"
  ],
  [
    "2. Supervised Learning- Machine Learning",
    "1. classification 2. Regression."
  ],
  [
    "How to Become a Machine Learning Engineer",
    "Sign up for Our Complete Data Science Training with 57% OFF: https://bit.ly/33ha91Q Download Our Free Data Science ..."
  ],
  [
    "How I Started a Career in Machine Learning - No PHD Required",
    "Learn more about AWS DeepRacer at – https://amzn.to/2ZvMuIi Alex Schultz shares his story of how he became a Machine ..."
  ],
  [
    "Build Your First Machine Learning AI With Neural Networks",
    "Machine learning is awesome. Who doesn't want to build a cool AI that you can teach to do anything. The only problem is ..."
  ],
  [
    "S4 E4 الفرق بين Data science vs Artificial Intelligence vs Machine Learning vs Deep Learning",
    "For any questions or requests for services, please reach out to Dr. Saleh at: https://www.facebook.com/Dr.Saleh.R.Mousa شرح ..."
  ],
  [
    "Artificial intelligence vs Machine learning vs Deep learning | Tamil | Sundar Ssp",
    "Instagram : https://www.instagram.com/sundarssp/ ○▻Facebook : https://www.facebook.com/learntechofficial."
  ],
  [
    "Powered by TensorFlow: Air Cognizer predicts air quality with machine learning",
    "Machine Learning is helping to solve challenging, real-world problems around the world. Poor air quality is a major obstacle that ..."
  ],
  [
    "The Role of AI and Machine Learning in Mechanical Engineering",
    "Mechanical Engineering's Allen Robinson and several other faculty members explain how artificial intelligence and machine ..."
  ],
  [
    "My understanding of the Manifold Hypothesis | Machine learning",
    "If you think I've misunderstood something, do let me know in the comments. Below are all the blogs/papers/videos I've referred to."
  ],
  [
    "What is a Machine Learning Engineer",
    "There's one specific role that builds a bridge between data science and its practical counterpart, machine learning. Meet the ..."
  ],
  [
    "Machine learning + neuroscience = biologically feasible computing | Benjamin Migliori | TEDxSanDiego",
    "Whether you're a human, an animal, or a machine, decisions can't be made without perception, which is how we come to ..."
  ],
  [
    "Why You Need To learn AI And Machine Learning Right Now?",
    ""
  ],
  [
    "Top 10 Machine Learning Project Ideas | Deep Learning AI ML Projects",
    "Checkout Top 10 Machine Learning and Deep Learning AI ML Project Ideas for students and engineers with Free Synopsis & PPT ..."
  ],
  [
    "Andrew Ng’s Machine Learning Specialization 2022 | What is it and is it worth taking?",
    "Machine Learning Specialization by Andrew Ng https://imp.i384100.net/RyjykN Hands-On Machine Learning with ..."
  ],
  [
    "How to use Machine Learning AI in Unity! (ML-Agents)",
    "Let's learn how to get started unlocking the POWER of Machine Learning AI in Unity! Unity Machine Learning Playlist: ..."
  ],
  [
    "Making music using new sounds generated with machine learning",
    "NSynth Super is an open source experimental instrument. It gives musicians the ability to explore completely new sounds ..."
  ],
  [
    "AI Learns to Escape (Deep Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 7 rooms I've designed. The AI was trained ..."
  ],
  [
    "AI And Machine Learning Full Course | Artificial Intelligence &amp; Machine Learning Course |Simplilearn",
    "This complete Artificial Intelligence and Machine Learning full course video cover all the topics that you need to know to become a ..."
  ],
  [
    "Machine Learning in 10 Hours | Master Machine Learning without any High-level Degree",
    "Machine Learning - The Simple Path to Mastery Get the FREE course eBook ..."
  ],
  [
    "Machine Learning Engineer Average Salary, Resume &amp; Jobs | Machine Learning Engineer | Coding Ninjas",
    "Get COURSES For FREE Using This Scholarship Test. Register Here Now: ..."
  ],
  [
    "What is Artificial Intelligence With Full Information? – [Hindi] – Quick Support",
    "WhatisArtificialIntelligence #QuickSupport #Innovation What is Artificial Intelligence With Full Information? – [Hindi] – Quick ..."
  ],
  [
    "Machine Learning With R | Machine Learning Full Course | Machine Learning Tutorial | Simplilearn",
    "In this video on Machine Learning with R, you will understand machine learning, applications of machine learning, and learn R ..."
  ],
  [
    "What are Transformers (Machine Learning Model)?",
    "Learn more about Transformers → http://ibm.biz/ML-Transformers Learn more about AI → http://ibm.biz/more-about-ai Check out ..."
  ],
  [
    "Python Machine Learning &amp; AI Mega Course - Learn 4 Different Areas of ML &amp; AI",
    "Ready to explore machine learning and artificial intelligence in python? This python machine learning and AI mega course ..."
  ],
  [
    "Machine Learning- Sudeshna Sarkar",
    ""
  ],
  [
    "Backpropagation calculus | Chapter 4, Deep learning",
    "Help fund future projects: https://www.patreon.com/3blue1brown An equally valuable form of support is to simply share some of ..."
  ],
  [
    "How to Become a Machine Learning Engineer",
    "Sign up for Our Complete Data Science Training with 57% OFF: https://bit.ly/33ha91Q Download Our Free Data Science ..."
  ],
  [
    "What is machine learning? | The Royal Society",
    "Love cat pictures? So does your computer. Find out how machine learning is giving technology the ability to recognise household ..."
  ],
  [
    "A Friendly Introduction to Machine Learning",
    "Grokking Machine Learning Book: https://www.manning.com/books/grokking-machine-learning 40% discount promo code: ..."
  ],
  [
    "Stock Price Prediction Using Python &amp; Machine Learning",
    "Stock Price Prediction Using Python & Machine Learning (LSTM). In this video you will learn how to create an artificial neural ..."
  ],
  [
    "Machine Learning Interview Questions | Machine Learning Interview Preparation | Intellipaat",
    "This machine learning interview questions and answers video is an exclusive machine learning interview preparation tutorial ..."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "End Game - Technology | Dystopian Future | Machine Learning | Artificial Intelligence",
    "End Game - Technology - An investigation into the advancements in digital technology unique to the gaming industry. They can ..."
  ],
  [
    "The Role of AI and Machine Learning in Mechanical Engineering",
    "Mechanical Engineering's Allen Robinson and several other faculty members explain how artificial intelligence and machine ..."
  ],
  [
    "How do I select features for Machine Learning?",
    "Selecting the \"best\" features for your Machine Learning model will result in a better performing, easier to understand, and faster ..."
  ],
  [
    "Machine Learning From Scratch In Python - Full Course With 12 Algorithms (5 HOURS)",
    "In this course we implement the most popular Machine Learning algorithms from scratch using only Python and NumPy. Get my ..."
  ],
  [
    "Introduction to Machine Learning (Tamil)",
    "A short course introducing the main ideas and algorithms of Machine Learning. The goal of the course is to cover the topics at a ..."
  ],
  [
    "Top 10 Applications of Machine Learning | Machine Learning Applications &amp; Examples | Simplilearn",
    "This video on \"Top 10 applications of machine learning\" will explain some of the applications of Machine Learning which we come ..."
  ],
  [
    "Machine Learning Full Course 2022 | Learn Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning - 1 | Machine Learning Introduction | Sinhala",
    "Machine Learning Introduction | Machine Learning Tutorial | Sinhala Machine learning (ML) is the study of computer algorithms ..."
  ],
  [
    "Self-taught to ML Research: My 5 Year Machine Learning Journey",
    "This is the step-by-step story of how I went from a self-taught machine learning programmer, to getting a machine learning ..."
  ],
  [
    "What is Machine Learning in Telugu",
    ""
  ],
  [
    "🖥️ HOW TO GET STARTED WITH MACHINE LEARNING!",
    "The #1 question I get is how to get started with Machine Learning, so join me today as we talk about this! :D SUBSCRIBE FOR ..."
  ],
  [
    "Securing machine learning environments on Azure Machine Learning | Machine Learning Essentials",
    "In this video, learn how to use Microsoft Azure to access enterprise-grade security and governance for your Machine Learning ..."
  ],
  [
    "Classification and Regression in Machine Learning",
    "In this short video, Max Margenot gives an overview of supervised and unsupervised machine learning tools. He covers ..."
  ],
  [
    "What are the features in machine learning?",
    "Do you want to learn technology from me?"
  ],
  [
    "Neural Network In 5 Minutes | What Is A Neural Network? | How Neural Networks Work | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Deep Learning Cars",
    "A small 2D simulation in which cars learn to maneuver through a course by themselves, using a neural network and evolutionary ..."
  ],
  [
    "Machine Learning From Scratch",
    ""
  ],
  [
    "Supervised Machine Learning: Crash Course Statistics #36",
    "We've talked a lot about modeling data and making inferences about it, but today we're going to look towards the future at how ..."
  ],
  [
    "🖥️ WRITING MY FIRST MACHINE LEARNING GAME! (1/4)",
    "Enjoyed the Run Forrest Project? Check out this Run Forrest Poster! It is the perfect memorabilia to remember the great times!"
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "#10 Concept Learning - Introduction, Concept Learning As Task |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Machine Learning Algorithms In-Depth Guide For 2022 | ML Algorithms Explained | Simplilearn",
    "This video on Machine Learning Algorithm will take you through a detailed concept of machine learning algorithm. This video will ..."
  ],
  [
    "Machine Learning Projects You NEVER Knew Existed",
    "Looking for machine learning projects to add to your portfolio? This video is about to answer all your prayers all the way from ..."
  ],
  [
    "Predict The Weather with Machine Learning: Beginner Project",
    "In this video, we'll learn how to predict your local weather with machine learning. We'll start by downloading the data, then we'll ..."
  ],
  [
    "Better Medicine Through Machine Learning | Suchi Saria | TEDxBoston",
    "Faster medical treatment saves lives. Machine Learning is already saving lives, by scouring a multitude of patients' data and ..."
  ],
  [
    "Machine Learning tutorials for beginners in hindi + english",
    "Tutorials for beginners - BTech students."
  ],
  [
    "AI &amp; Machine Learning in Finance: AI Applications in the Financial Industry - Panel Discussion",
    "artificialintelligence #machinelearning #financeresearch #AIapplications In this video, we take a look at implementations of AI and ..."
  ],
  [
    "Watch this BEFORE buying a LAPTOP for Machine Learning in 2023 🦾",
    "Machine learning on a laptop, is that even possible? How about Macbooks? What hardware do I need? What should I spend?"
  ],
  [
    "1. Build Your First Machine Learning Model",
    "Follow along with Lukas Biewald to build a simple neural network to classify handwritten digits into “five” or “not five”. You will ..."
  ],
  [
    "What is classification in Machine Learning | Binary and Multi-class classification",
    "This video explains what is classification in machine learning and how does classification in machine learning works with a real ..."
  ],
  [
    "AI Learns to Park - Deep Reinforcement Learning",
    "An AI learns to park a car in a parking lot in a 3D physics simulation. The simulation was implemented using Unity's ML-Agents ..."
  ],
  [
    "How I&#39;d Learn Data Analytics in 2023 (If I Had to Start Over)",
    "Looking to get started in Data Analytics in 2023? This is the video for you! In it, we share what you need to know and the steps you ..."
  ],
  [
    "1. Artificial Intelligence and Machine Learning",
    "MIT RES.LL-005 Mathematics of Big Data and Machine Learning, IAP 2020 Instructor: Jeremy Kepner, Vijay Gadepally View the ..."
  ],
  [
    "What&#39;s the Difference Between AI, Machine Learning, and Deep Learning?",
    "With AI thrown around as a buzzword these days, it's important to have a solid understanding of what artificial intelligence actually ..."
  ],
  [
    "Ultimate Machine Learning Roadmap 2022 (PDF Included)!",
    "METACENT $10000 GIVEAWAY: https://gleam.io/tGeMT/metacent-giveaway Metacent links: https://www.metacent.io Machine ..."
  ],
  [
    "Feature Selection for Embedded Machine Learning | Digi-Key Electronics",
    "Feature selection is the processing of choosing which inputs (or features) are necessary when creating and training a machine ..."
  ],
  [
    "What is Artificial Intelligence With Full Information? – [Hindi] – Quick Support",
    "WhatisArtificialIntelligence #QuickSupport #Innovation What is Artificial Intelligence With Full Information? – [Hindi] – Quick ..."
  ],
  [
    "Book Recommender System | Machine Learning Project | Collaborative Filtering Based Recommender Sys",
    "Code - https://github.com/campusx-official/book-recommender-system Data ..."
  ],
  [
    "Risto Siilasmaa on Machine Learning",
    "Risto Siilasmaa shares his view on why machine learning has become topical, what it means, why you should spend more time ..."
  ],
  [
    "Python Machine Learning Tutorial #1 - Introduction",
    "This is my 2019 python machine learning tutorial introduction. In this video we go through setting up tensorflow and sklearn so that ..."
  ],
  [
    "AI &amp; Machine Learning in Finance: AI Applications in the Financial Industry - Panel Discussion",
    "artificialintelligence #machinelearning #financeresearch #AIapplications In this video, we take a look at implementations of AI and ..."
  ],
  [
    "Machine Learning Interview Questions | Machine Learning Interview Preparation | Intellipaat",
    "This machine learning interview questions and answers video is an exclusive machine learning interview preparation tutorial ..."
  ],
  [
    "AutoML – Automated Machine Learning: Free online course on the AI Campus",
    "The online course \"AutoML – Automated Machine Learning\" addresses the challenge of designing well-performing machine ..."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "When M1 DESTROYS a RTX card for Machine Learning | MacBook Pro vs Dell XPS 15",
    "Testing the M1 Max GPU with a machine learning training session and comparing it to a nVidia RTX 3050ti and RTX 3070."
  ],
  [
    "Intro to JAX: Accelerating Machine Learning research",
    "JAX is a Python package that combines a NumPy-like API with a set of powerful composable transformations for automatic ..."
  ],
  [
    "Top Machine Learning Tools and Frameworks for Beginners | Machine Learning Tutorial | Edureka",
    "Post Graduate Diploma in Artificial Intelligence by E&ICT Academy NIT Warangal: ..."
  ],
  [
    "Intro to machine learning on Google Cloud Platform (Google I/O &#39;18)",
    "There are revolutionary changes happening in hardware and software that are democratizing machine learning (ML). Whether ..."
  ],
  [
    "Transformers, explained: Understand the model behind GPT, BERT, and T5",
    "Dale's Blog → https://goo.gle/3xOeWoK Classify text with BERT → https://goo.gle/3AUB431 Over the past five years, Transformers, ..."
  ],
  [
    "Top Machine Learning Certifications That Will Set You Apart (2022)",
    "In this video I will discuss the top machine learning certifications for 2022. I will be covering specialized machine learning ..."
  ],
  [
    "What is Feature Engineering Explained in Hindi with Examples | Machine Learning",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Using machine learning to optimise agriculture in Brazil | AI by you - Vitor’s story",
    "Vitor Gonçalves da Silva lives in Campinas, Brazil. He is studying agricultural engineering at the University of Campinas. For Vitor ..."
  ],
  [
    "What is Machine Learning?|| Machine learning in  Malayalam",
    "machinelearningmalayalam #malayalam#brAInTek#AI What is Machine Learning?|| Machine learning in Malayalam To keep ..."
  ],
  [
    "Best Laptop for Machine Learning and Deep Learning | Machine Learning Training | Edureka",
    "Data Science Certification: https://www.edureka.co/data-science-r-programming-certification-course ) This Edureka video on \"Best ..."
  ],
  [
    "Machine Learning Algorithms In-Depth Guide For 2022 | ML Algorithms Explained | Simplilearn",
    "This video on Machine Learning Algorithm will take you through a detailed concept of machine learning algorithm. This video will ..."
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "Machine Learning in 10 Hours | Master Machine Learning without any High-level Degree",
    "Machine Learning - The Simple Path to Mastery Get the FREE course eBook ..."
  ],
  [
    "Hello World - Machine Learning Recipes #1",
    "Six lines of Python is all it takes to write your first machine learning program! In this episode, we'll briefly introduce what machine ..."
  ],
  [
    "Data Science Projects For Resume | Machine Learning Projects With Source Code",
    "5 Essential end to end data science projects for a data scientist resume. 3 of these projects are machine learning projects and 2 of ..."
  ],
  [
    "Building smarter games with machine learning",
    "How can machine learning make video games more interactive? In this episode of Making with Machine Learning, Dale ..."
  ],
  [
    "Meta (Facebook) Machine Learning Mock Interview: Illegal Items Detection",
    "Today Zarrar talks us through this question asked by Facebook about how to use Machine Learning to flag illegal items posted on ..."
  ],
  [
    "Stanford CS224W: Machine Learning with Graphs | 2021 | Lecture 1.2 - Applications of Graph ML",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2XQKRsU ..."
  ],
  [
    "Data Science VS Machine Learning: Which One To Pick For 2022!",
    "Data Science and Machine Learning are both lucrative fields within artificial intelligence and tech. But which one is the best to ..."
  ],
  [
    "KNN in Python From Scratch! Machine Learning Tutorial",
    "Let's code the KNN (K Nearest Neighbours) algorithm in Python from scratch! Detailed Tutorial: https://youtu.be/ngLyX54e1LU ..."
  ],
  [
    "🖥️ WRITING MY FIRST MACHINE LEARNING GAME! (1/4)",
    "Enjoyed the Run Forrest Project? Check out this Run Forrest Poster! It is the perfect memorabilia to remember the great times!"
  ],
  [
    "BigQuery ML: Machine Learning with Standard SQL",
    "In this episode of AI Adventures, Yufeng introduces BigQuery ML, which allows you to build machine learning models right within ..."
  ],
  [
    "Life as an AI Researcher &amp; Machine Learning Engineer | Technology | J.P. Morgan",
    "Our J.P. Morgan office is a place where you can solve real-world problems using state of the art machine learning methods and ..."
  ],
  [
    "Machine Learning Tutorial Python - 19: Principal Component Analysis (PCA) with Python Code",
    "PCA or principal component analysis is a dimensionality reduction technique that can help us reduce dimensions of dataset that ..."
  ],
  [
    "End Game - Technology | Dystopian Future | Machine Learning | Artificial Intelligence",
    "End Game - Technology - An investigation into the advancements in digital technology unique to the gaming industry. They can ..."
  ],
  [
    "What is one uniqueness of machine learning projects?#machinelearning #datascience #shortvideos",
    ""
  ],
  [
    "Time Series Forecasting Using Machine Learning| Python",
    "In this video i show how you can use machine learning(ML) technqiues to make time series predictions and forecasting. You can ..."
  ],
  [
    "Introduction To Machine Learning | Machine Learning Basics for Beginners | ML Basics | Simplilearn",
    "Machine Learning is a trending topic nowadays. This Introduction to Machine Learning video will help you to understand what is ..."
  ],
  [
    "Top 10 Machine Learning Project Ideas | Deep Learning AI ML Projects",
    "Checkout Top 10 Machine Learning and Deep Learning AI ML Project Ideas for students and engineers with Free Synopsis & PPT ..."
  ],
  [
    "Saving Seaweed with Machine Learning",
    "MIT student Charlene Xia is using machine learning to monitor the microbiome of seaweed farms in an effort to predict and ..."
  ],
  [
    "Ensemble Method : Bagging (Bootstrap Aggregation) l Machine Learning Course in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Machine Learning Job Roles and Salaries | Machine Learning Engineer | ML Trends | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Support Vector Machine (SVM) Part-2 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "When M1 DESTROYS a RTX card for Machine Learning | MacBook Pro vs Dell XPS 15",
    "Testing the M1 Max GPU with a machine learning training session and comparing it to a nVidia RTX 3050ti and RTX 3070."
  ],
  [
    "Machine Learning From Scratch In Python - Full Course With 12 Algorithms (5 HOURS)",
    "In this course we implement the most popular Machine Learning algorithms from scratch using only Python and NumPy. Get my ..."
  ],
  [
    "Risto Siilasmaa on Machine Learning",
    "Risto Siilasmaa shares his view on why machine learning has become topical, what it means, why you should spend more time ..."
  ],
  [
    "Machine Learning for Fluid Mechanics",
    "eigensteve on Twitter This video gives an overview of how Machine Learning is being used in Fluid Mechanics. In fact, fluid ..."
  ],
  [
    "Deep Learning State of the Art (2020)",
    "Lecture on most recent research and developments in deep learning, and hopes for 2020. This is not intended to be a list of SOTA ..."
  ],
  [
    "AutoML – Automated Machine Learning: Free online course on the AI Campus",
    "The online course \"AutoML – Automated Machine Learning\" addresses the challenge of designing well-performing machine ..."
  ],
  [
    "Ensemble Learning l Machine Learning Course Easiest Explanation Ever in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "AI &amp; Machine Learning in Finance: AI Applications in the Financial Industry - Panel Discussion",
    "artificialintelligence #machinelearning #financeresearch #AIapplications In this video, we take a look at implementations of AI and ..."
  ],
  [
    "🖥️ WRITING MY FIRST MACHINE LEARNING GAME! (1/4)",
    "Enjoyed the Run Forrest Project? Check out this Run Forrest Poster! It is the perfect memorabilia to remember the great times!"
  ],
  [
    "What is Feature Engineering Explained in Hindi with Examples | Machine Learning",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Best Laptop for Machine Learning and Deep Learning | Machine Learning Training | Edureka",
    "Data Science Certification: https://www.edureka.co/data-science-r-programming-certification-course ) This Edureka video on \"Best ..."
  ],
  [
    "Machine Learning Explicado",
    "Machine learning (ou aprendizado de máquina) é um dos termos mais quentes no mundo atual. A ideia é simples: fazer ..."
  ],
  [
    "Top Machine Learning Tools and Frameworks for Beginners | Machine Learning Tutorial | Edureka",
    "Post Graduate Diploma in Artificial Intelligence by E&ICT Academy NIT Warangal: ..."
  ],
  [
    "Intro to machine learning on Google Cloud Platform (Google I/O &#39;18)",
    "There are revolutionary changes happening in hardware and software that are democratizing machine learning (ML). Whether ..."
  ],
  [
    "Machine Learning Algorithms In-Depth Guide For 2022 | ML Algorithms Explained | Simplilearn",
    "This video on Machine Learning Algorithm will take you through a detailed concept of machine learning algorithm. This video will ..."
  ],
  [
    "Tailoring  Basics in Telugu  || Basic tailoring in easy method @ part 147",
    "howto operate sewing machine in easy method || basics in tailoring || how to operate foot pedal and how to use sewing machine ..."
  ],
  [
    "Machine Learning Job Roles and Salaries | Machine Learning Engineer | ML Trends | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Meta (Facebook) Machine Learning Mock Interview: Illegal Items Detection",
    "Today Zarrar talks us through this question asked by Facebook about how to use Machine Learning to flag illegal items posted on ..."
  ],
  [
    "Hello World - Machine Learning Recipes #1",
    "Six lines of Python is all it takes to write your first machine learning program! In this episode, we'll briefly introduce what machine ..."
  ],
  [
    "Learn PyTorch for deep learning in a day. Literally.",
    "Welcome to the most beginner-friendly place on the internet to learn PyTorch for deep learning. All code on GitHub ..."
  ],
  [
    "Intro to JAX: Accelerating Machine Learning research",
    "JAX is a Python package that combines a NumPy-like API with a set of powerful composable transformations for automatic ..."
  ],
  [
    "Introduction To Machine Learning | Machine Learning Basics for Beginners | ML Basics | Simplilearn",
    "Machine Learning is a trending topic nowadays. This Introduction to Machine Learning video will help you to understand what is ..."
  ],
  [
    "Python Tutorial - Python Full Course for Beginners",
    "Python tutorial - Python full course for beginners - Go from Zero to Hero with Python (includes machine learning & web ..."
  ],
  [
    "Building smarter games with machine learning",
    "How can machine learning make video games more interactive? In this episode of Making with Machine Learning, Dale ..."
  ],
  [
    "Data Science Projects For Resume | Machine Learning Projects With Source Code",
    "5 Essential end to end data science projects for a data scientist resume. 3 of these projects are machine learning projects and 2 of ..."
  ],
  [
    "Self-Studying Machine Learning? Remind yourself of these 6 things",
    "Machine learning engineer Daniel Bourke shares his tips for self-studying machine learning. Leanring machine learning can be ..."
  ],
  [
    "Recommendation Systems using Machine Learning",
    "The most common types of recommendation systems are content based and collaborative filtering recommender systems."
  ],
  [
    "Transformers, explained: Understand the model behind GPT, BERT, and T5",
    "Dale's Blog → https://goo.gle/3xOeWoK Classify text with BERT → https://goo.gle/3AUB431 Over the past five years, Transformers, ..."
  ],
  [
    "Stanford CS224W: Machine Learning with Graphs | 2021 | Lecture 1.2 - Applications of Graph ML",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2XQKRsU ..."
  ],
  [
    "Best Coding laptop 2022 | laptop for AI, Machine Learning, Android Studio, Deep Learing | DotCOM💻",
    "Book Techcanvas Consultancy - Tech Solution   🖱️🖱️🖱️https://rzp.io/l/techcanvas 🖱️🖱️🖱️ Best coding laptop under ..."
  ],
  [
    "Introduction to Machine Learning [TAGALOG]",
    "Sa lesson nato pag aaralan nating kung ano ba ang Machine Learning or ML at gagawa tayo ng isang pre diagnostic patient for a ..."
  ],
  [
    "BigQuery ML: Machine Learning with Standard SQL",
    "In this episode of AI Adventures, Yufeng introduces BigQuery ML, which allows you to build machine learning models right within ..."
  ],
  [
    "500+ Machine Learning And Deep Learning Projects All At One Place",
    "Special Thanks To Ashish Patel And All The Bloggers For the Amazing Contribution https://www.linkedin.com/in/ashishpatel2604/ ..."
  ],
  [
    "Support Vector Machine (SVM) Part-2 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "[LIVE] DAY 01 | All you need to know about MACHINE LEARNING",
    "For more events, visit: https://www.devtown.in/events Connect with us on: LinkedIn ..."
  ],
  [
    "PyTorch on Apple Silicon | Machine Learning | M1 Max/Ultra vs nVidia",
    "PyTorch finally has Apple Silicon support, and in this video @Daniel Bourke and I test it out on a few M1 machines. ▶️ Apple M1 ..."
  ],
  [
    "Machine Learning | Association Rules",
    "Association rule learning is a rule-based machine learning method for discovering interesting relations between variables in large ..."
  ],
  [
    "Machine Learning Crash Course | Machine Learning Tutorial | Machine Learning Projects | Simplilearn",
    "Machine Learning is the most debated technology of the 21st century. In this machine learning crash course, you will learn about ..."
  ],
  [
    "Machine Learning Bangla Tutorial - Introduction (মেশিন লার্নিং)",
    "Machine Learning Bangla Tutorials (মেশিন লার্নিং): ..."
  ],
  [
    "3 Months Updated RoadMap To Learn Machine Learning With Videos And Materials",
    "Here is a video on the 3 months updated roadmap to learn MAchine Learning with all the videos and materials github link: ..."
  ],
  [
    "01 - Berkenalan dengan Machine Learning",
    "Pada video ini kita membahas tentang apa itu Machine Learning, bagaimana cara kerjanya, dan bagaimana penerapannya ..."
  ],
  [
    "Machine Learning Tutorial Python - 19: Principal Component Analysis (PCA) with Python Code",
    "PCA or principal component analysis is a dimensionality reduction technique that can help us reduce dimensions of dataset that ..."
  ],
  [
    "Clustering and type of clustering in machine learning | Lec-19 | Er Sahil ka Gyan",
    "ersahilkagyan #machinelearning Ek like toh banta h dost Machine Learning Tutorial (Hindi): ..."
  ],
  [
    "Decision Tree Important Points ll Machine Learning ll DMW ll Data Analytics ll Explained in Hindi",
    "Decision Tree Explained with Example https://youtu.be/RVuy1ezN_qA Myself Shridhar Mankar a Engineer l YouTuber l ..."
  ],
  [
    "Explaining An End To End Machine Learning Project To A Interviewer",
    "Subscribe my vlogging channel https://www.youtube.com/channel/UCjWY5hREA6FFYrthD0rZNIw ⭐ Kite is a free AI-powered ..."
  ],
  [
    "DEMO: Using Snowflake Snowpark As Part Of Your Machine Learning Workflow",
    "In this session, we'll explore exciting new Snowpark enhancements, walk you through demos of these new capabilities, and help ..."
  ],
  [
    "Machine Learning In 5 Minutes | Machine Learning Introduction |What Is Machine Learning |Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "#10 Concept Learning - Introduction, Concept Learning As Task |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "AI: Perbedaan AI, ML (Machine Learning), dan DL (Deep Learning)",
    "Video ini menjelaskan hubungan serta perbedaan AI, ML (Machine Learning), dan DL (Deep Learning)."
  ],
  [
    "The weirdest paradox in statistics (and machine learning)",
    "AD: Get Exclusive NordVPN deal here ➼ https://nordvpn.com/mathemaniac. It's risk-free with Nord's 30-day money-back ..."
  ],
  [
    "Introdução ao Machine Learning (ML de Zero a 100, parte 1)",
    "This video is also available in English: https://goo.gle/2O32RHm O Machine Learning representa um novo paradigma na ..."
  ],
  [
    "Classification In Machine Learning | Machine Learning Tutorial | Python Training | Simplilearn",
    "In this machine learning tutorial video, we'll learn about Classification in Machine Learning. You will learn the basics of ..."
  ],
  [
    "Machine Learning in Oil &amp; Gas",
    "Data-driven predictive maintenance for the oil and gas industry isn't just the wave of the future. It's already here."
  ],
  [
    "Machine Learning for Computational Fluid Dynamics",
    "Machine learning is rapidly becoming a core technology for scientific computing, with numerous opportunities to advance the field ..."
  ],
  [
    "Machine Learning Tutorial Python - 4: Gradient Descent and Cost Function",
    "In this tutorial, we are covering few important concepts in machine learning such as cost function, gradient descent, learning rate ..."
  ],
  [
    "Python TensorFlow for Machine Learning – Neural Network Text Classification Tutorial",
    "This course will give you an introduction to machine learning concepts and neural network implementation using Python and ..."
  ],
  [
    "Ensemble Learning | Ensemble Learning In Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Ensemble Learning is a popular machine learning technique for building models. This video on Ensemble Learning covers the ..."
  ],
  [
    "Can machine learning predict the stock market?",
    "machinelearning #datascience."
  ],
  [
    "Scikit-Learn Course - Machine Learning in Python Tutorial",
    "Scikit-learn is a free software machine learning library for the Python programming language. Learn about machine learning using ..."
  ],
  [
    "Reinforcement Learning from Human Feedback: From Zero to chatGPT",
    "In this talk, we will cover the basics of Reinforcement Learning from Human Feedback (RLHF) and how this technology is being ..."
  ],
  [
    "Support Vector Machine (SVM) Part-1 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Machine Learning in ArcGIS",
    "Machine Learning (ML) is a set of data-driven algorithms and techniques that automate the prediction, classification, and ..."
  ],
  [
    "Linear Algebra - Math for Machine Learning",
    "In this video, W&B's Deep Learning Educator Charles Frye covers the core ideas from linear algebra that you need in order to do ..."
  ],
  [
    "Decision Tree Important Points ll Machine Learning ll DMW ll Data Analytics ll Explained in Hindi",
    "Decision Tree Explained with Example https://youtu.be/RVuy1ezN_qA Myself Shridhar Mankar a Engineer l YouTuber l ..."
  ],
  [
    "Clustering and type of clustering in machine learning | Lec-19 | Er Sahil ka Gyan",
    "ersahilkagyan #machinelearning Ek like toh banta h dost Machine Learning Tutorial (Hindi): ..."
  ],
  [
    "ML Model Deployment With Flask On Heroku | How To Deploy Machine Learning Model With Flask | Edureka",
    "Edureka Deep Learning Training - TensorFlow Certification:- https://www.edureka.co/ai-deep-learning-with-tensorflow This ..."
  ],
  [
    "Decision Tree Classification Clearly Explained!",
    "Here, I've explained Decision Trees in great detail. You'll also learn the math behind splitting the nodes. The next video will show ..."
  ],
  [
    "#78 - Prof. NOAM CHOMSKY (Special Edition)",
    "Patreon: https://www.patreon.com/mlst Discord: https://discord.gg/ESrGqhf5CB In this special edition episode, we're elated to ..."
  ],
  [
    "Machine Learning Full Course 2022 | Learn Machine Learning | Machine Learning Tutorial | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning Bangla Tutorial - Introduction (মেশিন লার্নিং)",
    "Machine Learning Bangla Tutorials (মেশিন লার্নিং): ..."
  ],
  [
    "I tried building a AUTO MACHINE LEARNING Web App 15 Minutes",
    "So you need some AutoML...well now you got it using Python, Pandas Profiling, PyCaret and Streamlit...and close to 15ish ..."
  ],
  [
    "22. Regulation of Machine Learning / Artificial Intelligence in the US",
    "MIT 6.S897 Machine Learning for Healthcare, Spring 2019 Instructor: Andy Coravos, Mark Shervey View the complete course: ..."
  ],
  [
    "PROJECT MAKING | All you need to know about MACHINE LEARNING",
    "HOW TO SUBMIT THE PROJECT? here   https://youtu.be/ezAEy67_i9s For the Internship and Training program registration, ..."
  ],
  [
    "Financial Machine Learning - A Practitioner’s Perspective by Dr. Ernest Chan",
    "QUANTT and QMIND came together to offer a unique experience for those interested in Financial Machine Learning (ML)."
  ],
  [
    "Machine Learning for Kids",
    "An detailed introduction to https://machinelearningforkids.co.uk - a free tool for school children to learn about artificial intelligence ..."
  ],
  [
    "Machine Learning Tutorial Python -1: What is Machine Learning?",
    "What is Machine Learning? This is an introduction to machine learning to begin the python machine learning tutorial series."
  ],
  [
    "Post Graduate Program In AI and Machine Learning In Partnership With Purdue University | Simplilearn",
    "Stay ahead in technology with this Post Graduate Program in AI and Machine Learning in partnership with Purdue & in ..."
  ],
  [
    "Qual a diferença entre Inteligência Artificial, Machine Learning, Data Science, Deep Learning, etc?",
    "ALURA COM 10% DE DESCONTO: https://www.alura.com.br/promocao/news-deschamps ✓ÍNDICE: 01 - Diferença entre todos ..."
  ],
  [
    "Basics Of Principal Component Analysis Explained in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "AI: Perbedaan AI, ML (Machine Learning), dan DL (Deep Learning)",
    "Video ini menjelaskan hubungan serta perbedaan AI, ML (Machine Learning), dan DL (Deep Learning)."
  ],
  [
    "Machine Learning Web App In Python In 60 Seconds! #Shorts",
    "Create an interactive Machine Learning Web App in Python with Streamlit and Scikit-learn. Long video: ..."
  ],
  [
    "BlablaConf 2022 Day 2: Big Data &amp; Machine Learning",
    "BlablaConf 2022 Day 2: Big Data & Machine Learning 0:00 starting soon 9:43 intro 11:49 Meghylost and the tour of africa 25:29 ..."
  ],
  [
    "40000+ Data Science research papers with code | Latest Researchs | Machine Learning | Data Magic",
    "Hello Friends, In this episode, I am going to rlk about the reasearch paper hub where we can find 40000+ latest research papers ..."
  ],
  [
    "MACHINE LEARNING (ML)-Important concepts and questions JNTUH R18/R16 -Covid Pattern .",
    "MACHINE LEARNING (ML)-Important concepts and questions JNTUH R18/R16 -Covid Pattern ."
  ],
  [
    "Making Friends with Machine Learning: Regression",
    "Make friends with the amazing power of machine learning! In this video, Cassie walks you through machine learning terminology ..."
  ],
  [
    "Lecture 1.1 — What Is Machine Learning — [ Machine Learning | Andrew Ng ]",
    "Hey guys! In this channel, you will find contents of all areas related to Artificial Intelligence (AI). Please make sure to smash the ..."
  ],
  [
    "Machine Learning and Economics: An Introduction",
    "Professor Susan Athey presents a high-level overview contrasting traditional econometrics with off-the-shelf machine learning."
  ],
  [
    "Instructor Led Data Science &amp; Machine Learning Program @ Scaler",
    "Please fill the below form to schedule a call from our team."
  ],
  [
    "Silicon Labs Solutions For AI and Machine Learning",
    "AI and Machine Learning are now found in many products, and have applications ranging from device activity detection, gesture ..."
  ],
  [
    "Creating a Game with Learning AI in Unity! (Tutorial / Machine Learning)",
    "Making a game and programming AI behaviour is a lot of fun. But it's even more fun, and in certain cases more efficient, where the ..."
  ],
  [
    "01 - Berkenalan dengan Machine Learning",
    "Pada video ini kita membahas tentang apa itu Machine Learning, bagaimana cara kerjanya, dan bagaimana penerapannya ..."
  ],
  [
    "Cost Function In Machine Learning With Example | Machine Learning Tutorial | Simplilearn",
    "This video on \"Cost Function in Machine Learning\" will help you understand what is the cost function, what is the need for cost ..."
  ],
  [
    "Help Protect the Great Barrier Reef with Machine Learning",
    "We are excited to announce a TensorFlow-sponsored Kaggle challenge to locate and identify harmful crown-of-thorns starfish ..."
  ],
  [
    "Le Machine Learning c’est quoi ?",
    "Vulgariser le Machine Learning avec des chats ? C'est ce que je tente de faire dans cette vidéo en 5min. Les liens : Instagram ..."
  ],
  [
    "A.I. Learns to Drive From Scratch in Trackmania",
    "I made an A.I. that teaches itself to drive in the racing game Trackmania, using Machine-Learning. I used Deep-Q-Learning, ..."
  ],
  [
    "Setup Apple Silicon Mac for Machine Learning in 11 minutes (PyTorch edition)",
    "Setup your Apple M1, M1 Pro, M1 Max or M1 Ultra Mac for data science and machine learning with PyTorch. Get the code on ..."
  ],
  [
    "How machine learning plays a role in F1 racing",
    "F1racing #Fornula1 #MiamiGrandPrix Yahoo Finance's Allie Garfinkle breaks down the impact machine learning has had on ..."
  ],
  [
    "Machine Learning Algorithms Full Course 2022🔥 | Machine Learning Algorithms Explained | Simplilearn",
    "Free Machine Learning Course: ..."
  ],
  [
    "2020 Machine Learning Roadmap (95% valid for 2022)",
    "Getting into machine learning is quite the adventure. And as any adventurer knows, sometimes it can be helpful to have a ..."
  ],
  [
    "Handling imbalanced dataset in machine learning | Deep Learning Tutorial 21 (Tensorflow2.0 &amp; Python)",
    "Credit card fraud detection, cancer prediction, customer churn prediction are some of the examples where you might get an ..."
  ],
  [
    "Machine Learning Tutorial Part - 1 | Machine Learning Tutorial For Beginners  Part - 1 | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning with Python Full Course in 6 Hours | Python for Machine Learning Tutorial | Edureka",
    "Edureka Machine Learning Engineer Masters Program: ..."
  ],
  [
    "Deploy Machine Learning Model using Flask",
    "Flask is a micro web framework written in Python. It is classified as a microframework because it does not require particular tools ..."
  ],
  [
    "SYSTEM Engineer at INFOSYS to MACHINE LEARNING Engineer in 1 YEAR🔥Best Roadmap For NON-TECH Folks❤️",
    "Check OdinSchool DataScience Bootcamp - https://hubs.la/Q01cSbZr0 Follow Me On Instagram ..."
  ],
  [
    "AI And Machine Learning Full Course | Artificial Intelligence &amp; Machine Learning Course |Simplilearn",
    "This complete Artificial Intelligence and Machine Learning full course video cover all the topics that you need to know to become a ..."
  ],
  [
    "DBSCAN (Density Based Spatial Clustering Of Applications with Noise) ll Machine Learning (Hindi)",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Project 9. Heart Disease Prediction using Machine Learning with Python | Machine Learning Projects",
    "This video is about building a Heart Disease Prediction system using Machine Learning with Python. This is one of the important ..."
  ],
  [
    "Kart Racing Game with Machine Learning in Unity! (Tutorial)",
    "A Kart Racing Game with Machine Learning Agents, or ML Agents in Unity - what does it look like? Let's take a look! In this video ..."
  ],
  [
    "Framing a Machine Learning Problem | How to plan a Data Science Project",
    "Framing a Machine Learning Problem | How to plan a Data Science Project Hi, my name is Nitish Singh and you are welcome to ..."
  ],
  [
    "Learn Machine Learning in 3 Months (with curriculum)",
    "How is a total beginner supposed to get started learning machine learning? I'm going to describe a 3 month curriculum to help ..."
  ],
  [
    "Deep Learning With PyTorch - Full Course",
    "In this course you learn all the fundamentals to get started with PyTorch and Deep Learning. ⭐ Check out Tabnine, the FREE ..."
  ],
  [
    "House Price Prediction using ML | Machine Learning Projects 2 | Machine Learning Training | Edureka",
    "Edureka Machine Learning Certification training (Use Code: YOUTUBE20) ..."
  ],
  [
    "TensorFlow: Open source machine learning",
    "TensorFlow is an open source software library for numerical computation using data flow graphs. Originally developed by ..."
  ],
  [
    "Designing Machine Learning Systems | book summary | Read a book with me",
    "Hi, in this video, I am going to summarize the book Designing Machine Learning Systems by Chip Huyen. This book covers a lot of ..."
  ],
  [
    "Stock Market Prediction Using Machine Learning | Machine Learning Tutorial | Simplilearn",
    "This video on Stock Market prediction using Machine Learning will help you analyze the future value of company stocks using ..."
  ],
  [
    "Python for Bioinformatics - Drug Discovery Using Machine Learning and Data Analysis",
    "Learn how to use Python and machine learning to build a bioinformatics project for drug discovery. ✏️ Course developed by ..."
  ],
  [
    "Scikit-Learn Tutorial | Machine Learning With Scikit-Learn | Sklearn | Python Tutorial | Simplilearn",
    "Start learning today's most in-demand skills for FREE: ..."
  ],
  [
    "Getting started with Julia and Machine Learning | Anthony Blaom &amp; Samuel | JuliaCon 2022",
    "A three-hour introductory workshop for newcomers to Julia and machine learning. Participants will have training in some technical ..."
  ],
  [
    "Neural Network In 5 Minutes | What Is A Neural Network? | How Neural Networks Work | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning: Solving Problems Big, Small, and Prickly",
    "From helping farmers in Japan sort cucumbers to helping doctors in India diagnose eye disease, machine learning is changing ..."
  ],
  [
    "Learn DevOps, SRE, Data Analytics, Machine Learning | Spark | AWS | GCP Certification Training",
    "CodeCloud offers career acceleration programs for the most in demand tech roles in Cloud, DevOps, SRE, Data Analytics, ..."
  ],
  [
    "Heart Disease Prediction Using Machine Learning | Cardiovascular Disease Prediction | Simplilearn",
    "This tutorial on Heart Disease Prediction Using Machine Learning is a guide to understanding the Heart Disease study that ..."
  ],
  [
    "Stanford CS224W: Machine Learning with Graphs | 2021 | Lecture 1.1 - Why Graphs",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3Bu1w3n ..."
  ],
  [
    "Python Machine Learning Tutorial #1 - Introduction",
    "This is my 2019 python machine learning tutorial introduction. In this video we go through setting up tensorflow and sklearn so that ..."
  ],
  [
    "#1 Machine Learning Engineering for Production (MLOps) Specialization [Course 1, Week 1, Lesson 1]",
    "The Machine Learning Engineering for Production (MLOps) Specialization teaches you how to conceptualize, build, and maintain ..."
  ],
  [
    "PCA problem / How to compute principal components / KTU Machine learning",
    "pcamachinelearning #exampleforpca #ktu #machinelearning This video helps you to solve pca problems easily. It includes a step ..."
  ],
  [
    "🔥Deep Learning Full Course 2022 | Deep Learning Tutorial for Beginners | Deep Learning | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "What Is Artificial Intelligence? | 🔥Artificial Intelligence Course | AI In 5 Minutes | |Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Stock Prediction using Machine Learning and Python | Machine Learning Training | Edureka",
    "NIT Warangal Post Graduate Program in AI & Machine Learning with Edureka: https://www.edureka.co/nitw-ai-ml-pgp This ..."
  ],
  [
    "Machine Learning With R Full Course | Machine Learning Course For Beginners | Simplilearn",
    "In this Machine Learning with R full course video, you will understand the basics of machine learning and look at the various ..."
  ],
  [
    "[LIVE] DAY 02 | All you need to know about MACHINE LEARNING",
    "For more events, visit: https://www.devtown.in/events Connect with us on: LinkedIn ..."
  ],
  [
    "I tried to make a Valorant AI using computer vision",
    "I went down a rabbit-hole of trying to make a Python program that can play Valorant using computer vision and some radio ..."
  ],
  [
    "Introduction to On-device Machine Learning Solutions with MediaPipe",
    "On-device Machine Learning means using machine learning on edge devices such as Android or iOS smartphones, IoT devices ..."
  ],
  [
    "Hate Speech Detection Using Machine Learning | ML Projects Using Python | Simplilearn",
    "In this video, we are going to cover how to do *Hate speech detection using machine learning* . This video will help you to ..."
  ],
  [
    "Wine Quality Prediction Analysis | Machine Learning | Python",
    "Content Description ⭐️ In this video, I have explained about wine quality prediction analysis. I have done basic preprocessing, ..."
  ],
  [
    "#5 Choosing a Training Experience: Step-1 In Designing A Learning System|ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "What&#39;s New In Machine Learning?",
    "I decided to take a look through the open review papers submitted to ICLR 2023. ICLR is the International Conference on ..."
  ],
  [
    "Machine Learning Tutorial - #1 Einführung in Machine Learning (deutsch/german)",
    "In diesem Video gebe ich eine kurze Einführung in das Thema Machine Learning. Dabei kläre ich zunächst den Unterschied ..."
  ],
  [
    "I tried to melt my M1 MacBook with Machine Learning",
    "How far can I push the M1 MacBook Air with TensorFlow? In this video, we see the absolute limits of the M1 MacBook with ..."
  ],
  [
    "Machine Learning Tutorial | Learn Machine Learning | Intellipaat",
    "Learn machine learning with this machine learning tutorial. Intellipaat Machine Learning course: ..."
  ],
  [
    "Natural Language Processing In 5 Minutes | What Is NLP And How Does It Work? | Simplilearn",
    "Ever wondered how we can talk to machines and have them answer back? That is due to the magic of NLP. In this video, we will ..."
  ],
  [
    "Artificial intelligence and algorithms: pros and cons | DW Documentary (AI documentary)",
    "Developments in artificial intelligence (AI) are leading to fundamental changes in the way we live. Algorithms can already detect ..."
  ],
  [
    "Accuracy &amp; Precision of a Machine Learning Model? #DataScience #InterviewQuestions",
    "For more such interesting interview Q&A in: SQL, Python, Statistics & more, subscribe to our @Analyticsvidhya channel: ..."
  ],
  [
    "What Is Artificial Intelligence? | Artificial Intelligence (AI) In 10 Minutes | Edureka",
    "Machine Learning Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "Real-Time Code Generation Using Machine Learning",
    "Realtime Code Generation using Machine Learning. https://teleporthq.io https://twitter.com/TeleportHQio ..."
  ],
  [
    "🔥Machine Learning Full Course 2022 | Learn Machine Learning | Machine Learning Tutorial| SimpliLearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Machine Learning From Scratch Full course",
    "To master machine learning models, one of the best things you can do is to implement them yourself. Although it might seem like a ..."
  ],
  [
    "Machine Learning Web App In Python In 60 Seconds! #Shorts",
    "Create an interactive Machine Learning Web App in Python with Streamlit and Scikit-learn. Long video: ..."
  ],
  [
    "Machine Learning Projects For Beginners 2023 | Machine Learning Projects | ML Projects | Simplilearn",
    "This video will help you build various \" Machine Learning Projects For Beginners 2023 \" from scratch. Starting with Heart Disease ..."
  ],
  [
    "Artificial Intelligence Robots Development Until 2019 - Machine Learning Robot Ep. 06",
    "Artificial Intelligence Robots Development Until 2019 - Machine Learning Robot Ep. 06 ..."
  ],
  [
    "Predict The Stock Market With Machine Learning And Python",
    "In this tutorial, we'll learn how to predict tomorrow's S&P 500 index price using historical data. We'll also learn how to avoid ..."
  ],
  [
    "¿Qué es machine learning? - explicación sencilla",
    "Estamos rodeados de computadoras que están aprendiendo. En lo que va del siglo XXI, comienzan a hacer cosas interesantes y ..."
  ],
  [
    "Why Should You Learn Machine Learning? |Tutort Academy #shorts #machinelearning",
    "Machine Learning allows computers to enter a self-learning mode in the absence of explicit programming. It is the most important ..."
  ],
  [
    "BUILD and SELL your own A.I Model! $500 - $10,000/month (super simple!)",
    "To follow along sign up here : https://bit.ly/gravity-ai-platform (not a referral link - just a tracking link) CSV files and final zip file: ..."
  ],
  [
    "#90 - Prof. DAVID CHALMERS - Consciousness in LLMs [Special Edition]",
    "Support us! https://www.patreon.com/mlst If you don't like the background music, we published a version with it all removed here ..."
  ],
  [
    "Bayes Theorem Explained with Solved Example in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "🔥Fake News Detection Using Machine Learning | Machine Learning Projects In Python | Simplilearn",
    "This video, \"fake news detection using machine learning,\" is a project-based video by Simplilearn where you'll get to know how to ..."
  ],
  [
    "Machine Learnia",
    "Je m'appelle Guillaume Saint-Cirgue et je suis développeur Machine Learning au Royaume Uni. Je suis passionné par le ..."
  ],
  [
    "Yann LeCun: From Machine Learning to Autonomous Intelligence",
    "EECS Colloquium Wednesday, September 27, 2022 Banatao Auditorium, 310 Sutardja Dai Hall 4-5p Caption available upon ..."
  ],
  [
    "Data Science, Big Data, Machine Learning... ¿son lo mismo?",
    "Data Science, Big Data, Machine Learning, Deep Learning, Inteligencia Artificial ... son palabras que con frecuencia se usan de ..."
  ],
  [
    "[LIVE] DAY 01 | All you need to know about MACHINE LEARNING",
    "For more events, visit: https://www.devtown.in/events Connect with us on: LinkedIn ..."
  ],
  [
    "In the Age of AI (full documentary) | FRONTLINE",
    "A documentary exploring how artificial intelligence is changing life as we know it — from jobs to privacy to a growing rivalry ..."
  ],
  [
    "¿Qué es el Machine Learning?¿Y Deep Learning? Un mapa conceptual | DotCSV",
    "Antes de profundizar en el apasionante mundo de la Inteligencia Artificial, hay que conocer bien por donde nos movemos."
  ],
  [
    "Entrevista Cientista de Dados: Machine Learning e Modelagem",
    "Entrevista Cientista de Dados: Machine Learning e Modelagem Vídeo mencionado sobre jargões: ..."
  ],
  [
    "Day 1/30 Machine Learning Master Class - Sanjay",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Women in Machine Learning Symposium 2022 Keynote",
    "Machine Learning is changing the world by impacting businesses and everyday life. In this Keynote we cover what's new and ..."
  ],
  [
    "Applying Machine Learning To Predict Consumer Spending | Machine Learning Tutorial | Simplilearn",
    "Enroll for Free Machine Learning Course & Get Your Completion Certificate: ..."
  ],
  [
    "Machine Learning Explicado",
    "Machine learning (ou aprendizado de máquina) é um dos termos mais quentes no mundo atual. A ideia é simples: fazer ..."
  ],
  [
    "Five Signs You Won&#39;t Make it in Machine Learning",
    "Avoid these."
  ],
  [
    "A Day In The Life Of A Machine Learning Engineer | Learning Intelligence 36",
    "A day in the life of what it's like to be a machine learning engineer. LINKS FROM THE SHOW: My AI Masters Degree ..."
  ],
  [
    "Full-stack Django &amp; ReactJS || Home Loan Classification Problem ||  Machine Learning Application",
    "django #reactjs #MachineLearningApp In this video, I will show how to create a full-stack application using Django and React JS."
  ],
  [
    "Fundamental Architecture – Machine Learning Is Not Like Your Brain #3",
    "This video dives into the fundamental architecture underlying machine learning and how it differs from the human brain."
  ],
  [
    "Introdução ao Machine Learning (ML de Zero a 100, parte 1)",
    "This video is also available in English: https://goo.gle/2O32RHm O Machine Learning representa um novo paradigma na ..."
  ],
  [
    "Image Classification using CNN | Deep Learning Tutorial | Machine Learning Project 9 | Edureka",
    "Edureka Machine Learning Certification training (Use Code: YOUTUBE20) ..."
  ],
  [
    "Machine Learning Crash Course | Machine Learning Tutorial | Machine Learning Projects | Simplilearn",
    "Machine Learning is the most debated technology of the 21st century. In this machine learning crash course, you will learn about ..."
  ],
  [
    "🔥Machine Learning In-Depth Tutorial 2022 | Machine Learning | Machine Learning Tutorial| Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Lecture 1 &quot;Supervised Learning Setup&quot; -Cornell CS4780 Machine Learning for Decision Making SP17",
    "Cornell class CS4780. (Online version: https://tinyurl.com/eCornellML ) Official class webpage: ..."
  ],
  [
    "Mathematics For Machine Learning | Essential Mathematics - Machine Learning Tutorial | Simplilearn",
    "This video on Mathematics for Machine Learning will give you the foundation to understand the working of machine learning ..."
  ],
  [
    "#63 Analytical Learning with Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Introduction to Machine Learning [TAGALOG]",
    "Sa lesson nato pag aaralan nating kung ano ba ang Machine Learning or ML at gagawa tayo ng isang pre diagnostic patient for a ..."
  ],
  [
    "Character Control with Neural Networks and Machine Learning",
    "In this 2018 GDC talk, Ubisoft's Daniel Holden shows how data-driven systems can vastly reduce the complexity and manpower ..."
  ],
  [
    "Using Machine Learning and AI to serve people and communities",
    "AI is a powerful tool with seemingly unlimited potential, but it must be better understood to be effective for most organizations."
  ],
  [
    "Machine Learning by Pen and Paper - Part 01 | Machine Learning | Rakibul Hassan",
    "টেন মিনিট স্কুলের কোর্স সম্পর্কিত যেকোনো জিজ্ঞাসায় কল করুন 16910 ..."
  ],
  [
    "ChatGPT: This AI has a JAILBREAK?! (Unbelievable AI Progress)",
    "chatgpt #ai #openai ChatGPT, OpenAI's newest model is a GPT-3 variant that has been fine-tuned using Reinforcement Learning ..."
  ],
  [
    "Tania’s Story: Morse code meets machine learning",
    "Ever since Morse opened developer Tania Finlayson's world, she's been working to make it accessible for everyone. Interested in ..."
  ],
  [
    "Machine Learning Multiple Choice Questions and Answers|ML MCQ For AKTU Students|Machine Learning MCQ",
    "Teachers' Day FLAT 25% Discount by Code: UATEACHER25 Machine Learning MCQ: https://imojo.in/38acu0b Deep Learning ..."
  ],
  [
    "DeepMind x UCL | Deep Learning Lectures | 1/12 | Intro to Machine Learning &amp; AI",
    "In this lecture DeepMind Research Scientist and UCL Professor Thore Graepel explains DeepMind's machine learning based ..."
  ],
  [
    "Natural Language Processing | NLP with Deep Learning and Machine Learning | NLP Using Python",
    "Intellipaat natural language processing in python course: https://intellipaat.com/nlp-training-course-using-python/ In this natural ..."
  ],
  [
    "Machine Learning Algorithms Full Course | Machine Learning Algorithms Explained | Simplilearn",
    "This video on Machine Learning Algorithms Full Course will help you learn the basics and advanced concepts of different ..."
  ],
  [
    "Qual a diferença entre Inteligência Artificial, Machine Learning, Data Science, Deep Learning, etc?",
    "ALURA COM 10% DE DESCONTO: https://www.alura.com.br/promocao/news-deschamps ✓ÍNDICE: 01 - Diferença entre todos ..."
  ],
  [
    "Stock Market Prediction Using Machine Learning | Time Series Forecasting Project | Intellipaat",
    "Intellipaat Data Science course: https://intellipaat.com/advanced-certification-data-science-artificial-intelligence-iit-madras/ ..."
  ],
  [
    "BlablaConf 2022 Day 2: Big Data &amp; Machine Learning",
    "BlablaConf 2022 Day 2: Big Data & Machine Learning 0:00 starting soon 9:43 intro 11:49 Meghylost and the tour of africa 25:29 ..."
  ],
  [
    "LE PERCEPTRON - DEEP LEARNING (02)",
    "Le Perception est l'unité de base des réseaux de neurones artificiels. Pour apprendre le Deep Learning, il faut commencer par ..."
  ],
  [
    "ALTROZ DCA | Machine Learning | Stay Ahead Of The Game",
    "Level up your drives with Machine Learning Technology in the ALTROZ DCA, which analyses your driving patterns and adapts to ..."
  ],
  [
    "COVID - 19 Outbreak Prediction using Machine Learning | Machine Learning Training | Edureka",
    "Edureka and NIT Warangal Post Graduate Program on AI and Machine Learning: ..."
  ],
  [
    "Machine Learning Training | Machine Learning Full Course | Machine Learning Tutorial | Intellipaat",
    "Intellipaat Data Science & AI Course: https://intellipaat.com/advanced-certification-data-science-artificial-intelligence-iit-madras/ In ..."
  ],
  [
    "&#39;Machine Learning&#39; asoslari",
    "Tensor Flowga kirish, 3-dars. Bugungi darsimizda \"mashine learning\" o'zi nima ekanligi haqida aniq tushuncha xosil qilamiz."
  ],
  [
    "Machine Learning in Traffic Classification of SDN Network | Ahmed Khan | University of Toronto",
    "UPDATE: I have added all relevant files (including training data) to my github repository: https://github.com/a9khan/trafficclassifier ..."
  ],
  [
    "QUÉ ES EL MACHINE LEARNING Y CÓMO FUNCIONA",
    "En el sector tecnológico hoy en día se habla mucho sobre el término Machine Learning y son muchas las empresas interesadas ..."
  ],
  [
    "Azure Machine Learning Studio: Matchbox Recommender, Movies example",
    "Data files already contained in Azure Machine Learning Studio This playlist (or related videos) is used in two of my online books: ..."
  ],
  [
    "LE PERCEPTRON - DEEP LEARNING (02)",
    "Le Perception est l'unité de base des réseaux de neurones artificiels. Pour apprendre le Deep Learning, il faut commencer par ..."
  ],
  [
    "Mean Squared Error Intuition with Python Implementation | Getting Started with Machine Learning",
    "This the sixth video in \"Getting Started with Machine Learning\" playlist. Timestamps : 0:02:59 Mean Squared Error Intuition 0:05:05 ..."
  ],
  [
    "Machine Learning Training | Machine Learning Full Course | Machine Learning Tutorial | Intellipaat",
    "Intellipaat Data Science & AI Course: https://intellipaat.com/advanced-certification-data-science-artificial-intelligence-iit-madras/ In ..."
  ],
  [
    "ALTROZ DCA | Machine Learning | Stay Ahead Of The Game",
    "Level up your drives with Machine Learning Technology in the ALTROZ DCA, which analyses your driving patterns and adapts to ..."
  ],
  [
    "Machine Learning in Traffic Classification of SDN Network | Ahmed Khan | University of Toronto",
    "UPDATE: I have added all relevant files (including training data) to my github repository: https://github.com/a9khan/trafficclassifier ..."
  ],
  [
    "QUÉ ES EL MACHINE LEARNING Y CÓMO FUNCIONA",
    "En el sector tecnológico hoy en día se habla mucho sobre el término Machine Learning y son muchas las empresas interesadas ..."
  ],
  [
    "سلسلة مفاهيم #1 - What is Machine learning  ما هو تعليم الآله شرح  -",
    "برمجة #code Follow me --------------- Facebook https://www.facebook.com/ramyhakamblog ------------ Twitter ..."
  ],
  [
    "Azure Machine Learning Studio: Matchbox Recommender, Movies example",
    "Data files already contained in Azure Machine Learning Studio This playlist (or related videos) is used in two of my online books: ..."
  ],
  [
    "Music and Machine Learning (Google I/O&#39;19)",
    "New technologies have fundamentally changed the way we make and experience music. In this session Claire Evans, artist, ..."
  ],
  [
    "Machine learning Job&#39;s Salary #job #machinelearning #salary #highpaying #shorts",
    "A call for all the ones who wish to learn machine learning. Zen class has got you covered. Enroll in our program and avail exciting ..."
  ],
  [
    "Ml-01 introduction to machine learning in tamil - இயந்திர வழிக் கற்றல் - ஒரு அறிமுகம்",
    "http://www.kaniyam.com/machine-learning-%e0%ae%aa%e0%ae%95%e0%af%81%e0%ae%a4%e0%ae%bf-1/ introduction to ..."
  ],
  [
    "Deep Maths - machine learning and mathematics",
    "In December 2021 mathematicians at Oxford and Sydney universities together with their collaborators at Google DeepMind ..."
  ],
  [
    "WINTER SKI SKINS, MACHINE LEARNING BUNDLE, WRAPS TRIPLE THREAT  JUMPSHOT RETURN FORTNITE ITEM SHOP",
    "Welcome to the Channel. I Stream Custom FASHION SHOWS ,HIDE N SEEK Scrims/GAMES /Solo,Duos, TRIOS , Squads, ..."
  ],
  [
    "Predict 2023 Recession With Machine Learning &amp; Data Science",
    "GET THE FULL CODE HERE: https://deeplearningcourses.com/c/ai-finance."
  ],
  [
    "Machine Learning Projects Full Course 2022 | Machine Learning Projects For Beginners | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "Python for Beginners - Learn Python in 1 Hour",
    "This Python tutorial for beginners show how to get started with Python quickly. Learn to code in 1 hour! Watch this tutorial get ..."
  ],
  [
    "Machine Learning VS Deep Learning : Quelles différences ?",
    "Aujourd'hui, l'analyse de données représente un facteur clé dans la prise de décision des entreprises. Ces données nécessitent ..."
  ],
  [
    "COVID - 19 Outbreak Prediction using Machine Learning | Machine Learning | Edureka Rewind - 5",
    "Edureka Machine Learning Course Master Program: ..."
  ],
  [
    "How to build a React App to interact with a machine learning model",
    "cartoonify #reactjs #webapp # Subscribe to my channel on this link https://bit.ly/31ZOVFD How to build a custom interface to ..."
  ],
  [
    "Reinforcement Learning from Human Feedback  From Zero to ChatGPT [Record of the live]",
    "In this talk, we will cover the basics of Reinforcement Learning from Human Feedback (RLHF) and how this technology is being ..."
  ],
  [
    "Le deep learning",
    "Le deep learning, une technique qui révolutionne l'intelligence artificielle...et bientôt notre quotidien ! Écrit et réalisé par David ..."
  ],
  [
    "Machine Learning Engineer Salary and Job Description in 2020",
    "How much Machine Learning Engineers make per year? Let's discuss machine learning engineer salary and job description, and ..."
  ],
  [
    "เล่าให้ฟัง EP17: Machine Learning คืออะไร แบบฉบับคนทั่วไป",
    "สวัสดีครับผม แม็ก อิศเรศ ประจิตต์มุทิตา วันนี้ผมจะมาเล่าให้ฟังในหัวข้อ \"Machine Learning คืออะไร แบบฉบับคนทั่วไป\" คำว่า Machine ..."
  ],
  [
    "Inovação | Ep.04 O que é Machine Learning? (Udacity)",
    "Como as máquinas com inteligência artificial aprendem? Por que alguns robôs e programas são capazes de prever o futuro?"
  ],
  [
    "Comment CHOISIR LE BON MODÈLE de Machine Learning ?",
    "Sklearn offre de nombreux algorithmes de Machine Learning. Pour choisir le modèle adapté a votre problème, il existe des ..."
  ],
  [
    "Machine Learning Fundamentals - 1 hour",
    "Get a look at our course on data science and AI here: https://bit.ly/3thtoUJ ..."
  ],
  [
    "How Aurora Solar expanded its business with Machine Learning | Real-Life AI Podcast",
    "In the 2nd episode of the Real-Life AI podcast, Tigran Petrosian hosts Christopher Hopper, the co-founder and CEO of Aurora ..."
  ],
  [
    "Artificial Intelligence Course | Learn Machine Learning and Artificial Intelligence | Intellipaat",
    "Intellipaat Artificial Intelligence Engineer Master's Course: https://intellipaat.com/artificial-intelligence-masters-training-course/ In ..."
  ],
  [
    "Machine Learning/Deep Learning /AI ต่างกันยังไง | เรื่องที่อีกหน่อยทุกคนต้องรู้",
    "สมัครเป็นสมาชิกของช่องนี้เพื่อเข้าถึงสิทธิพิเศษต่างๆ https://www.youtube.com/channel/UCnVT8AHOyCUtAFxPZahRJLw/join ..."
  ],
  [
    "DIFERENCIA ENTRE INTELIGENCIA ARTIFICIAL - MACHINE LEARNING - DEEP LEARNING",
    "Hola! En ocasiones no utilizamos correctamente los términos de Inteligencia Artificial, Machine Learning y Deep Learning, razón ..."
  ],
  [
    "Python Tutorial - Python Full Course for Beginners",
    "Python tutorial - Python full course for beginners - Go from Zero to Hero with Python (includes machine learning & web ..."
  ],
  [
    "#91 - HATTIE ZHOU - Teaching Algorithmic Reasoning via In-context Learning #NeurIPS",
    "Support us! https://www.patreon.com/mlst Hattie Zhou, a PhD student at Université de Montréal and Mila, has set out to ..."
  ],
  [
    "BigQuery Machine Learning using Soccer Data  || #qwiklabs || #GSP851 || [With Explanation🗣️]",
    "Join Telegram: https://t.me/quiccklab Please do like, share and subscribe❤ Please make sure to open the document in normal ..."
  ],
  [
    "Using Label Encoder to encode target labels | Machine Learning",
    "In this tutorial, we'll go over label encoding using scikit-learn's LabelEncoder class. I've witnessed many people use label ..."
  ],
  [
    "Machine Learning Real-time - Stock Prediction Application using Shiny &amp; R",
    "Real-time Scenarios - Stock Prediction Application Data Science & Machine Learning Do it yourself Tutorial by Bharati DW ..."
  ],
  [
    "KÜNSTLICHE INTELLIGENZ vs. MACHINE LEARNING vs. DEEP LEARNING",
    "Inhalt Künstliche #Intelligenz wird unsere #Gesellschaft verändern und ist schon heute aus unserem #Alltag kaum mehr ..."
  ],
  [
    "Machine Learning Roadmap | How to become a Machine Learning Engineer  | ML | Edureka Rewind - 7",
    "Edureka ML Master Program Certification ..."
  ],
  [
    "Machine Learning Engineer Roadmap 2023",
    "Machine Learning Engineering Roadmap | How to Become a Deep Learning Engineer | Data Science Algorithms | AI Frameworks ..."
  ],
  [
    "TUTORIAL: Tu primer modelo de Machine Learning  en español | Regresion Lineal con python",
    "machinelearning Introducción a Machine Learning en Español. ¿Que es el Machine Learning? En este video tutorial vamos a ..."
  ],
  [
    "What is Machine Learning?",
    "Nowadays the term machine learning is used very often, with no real explanation behind it. So today Daniel is going to tell you ..."
  ],
  [
    "Wie funktioniert eigentlich Machine Learning?",
    "Künstliche Intelligenz verändert unser Leben. Alles, fast was wir online tun wird heute schon von \"Machine Learning\" beeinflusst."
  ],
  [
    "Machine Learning: Le Basi (Intelligenza Artificiale) - Gianluca Mauro",
    "Come funziona il machine learning? Partiamo dalle basi. --- Chi è Gianluca Mauro? Gianluca Mauro è il Super Coach di ..."
  ],
  [
    "How to use machine learning to identify log spikes &amp; patterns for PostgreSQL logs with Elastic AIOps",
    "This video will show how Elastic AIOps can help identify anomalies, log spikes, and pattern analysis for a common need to ..."
  ],
  [
    "เริ่มเขียน Machine Learning ใน 5 นาที | Python x Scikit-learn:",
    "สำหรับใครที่เขียนโค้ดเป็นแล้ว แต่อยากย้ายมาสาย AI, Data Science ไปถึง Machine Learning มาดูในตอนนี้ได้เลย ที่เราจะพาทำ ML ..."
  ],
  [
    "Cos&#39;è il Machine Learning (Reti Neurali e A.I.)",
    "Candidati per una CONSULENZA GRATUITA https://bit.ly/2RTQ3bZ ..."
  ],
  [
    "Text Classification using Spark Machine Learning",
    "The goal of text classification is the classification of text documents into a fixed number of predefined categories. Text classification ..."
  ],
  [
    "FORMATION DEEP LEARNING COMPLETE (2021)",
    "Cette formation sur le Deep Learning vous apprendra à développer des réseaux de neurones artificiels, en voyant tous les détails ..."
  ],
  [
    "Entropy in Data Science and Machine learning | in Urdu/Hindi",
    "python #datascience #machinelearning In data science and machine learning, entropy is a measure of disorder or randomness in ..."
  ],
  [
    "Day 2/30 Machine Learning Master Class - Sanjay",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Why Coding is DEAD... and how to make money online.",
    "Ex-Google / ex-Meta TechLead on coding, tech, and making money in the new digital world. Join me in DeFi Pro and make ..."
  ]
]