[
  [
    "Tutorial 48- Naive Bayes&#39; Classifier Indepth Intuition-  Machine Learning",
    "Guys there were some issue in the previous video. So I have reuploaded it. Sorry for the trouble. In probability theory and statistics ..."
  ],
  [
    "Naive Bayes Classifier ll Data Mining And Warehousing Explained with Solved Example in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "1. Solved Example Naive Bayes Classifier to classify New Instance PlayTennis Example Mahesh Huddar",
    "1. Solved Example Naive Bayes Classifier to classify New Instance PlayTennis Example by Mahesh Huddar Here there are 14 ..."
  ],
  [
    "Naive Bayes Classifier | Naive Bayes Algorithm | Naive Bayes Classifier With Example | Simplilearn",
    "This Naive Bayes Classifier tutorial video will introduce you to the basic concepts of Naive Bayes classifier, what the Naive Bayes ..."
  ],
  [
    "#44 Naive Bayes Classifier With Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Naive Bayes, Clearly Explained!!!",
    "When most people want to learn about Naive Bayes, they want to learn about the Multinomial Naive Bayes Classifier - which ..."
  ],
  [
    "Machine Learning | Naive Bayes Classifier",
    "Naive Bayes algorithm is a method set of probabilities. For each attribute from each class set, it uses probability to make ..."
  ],
  [
    "Bayes Theorem Explained with Solved Example in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Machine Learning Tutorial Python - 14: Naive Bayes Classifier Algorithm Part 1",
    "This is part 1 of naive bayes classifier algorithm machine learning tutorial. Naive bayes theorm uses bayes theorm for conditional ..."
  ],
  [
    "Hindi-Naive Baye&#39;s Machine Learning Algorithm Indepth Inution- Part 1",
    "In statistics, naive Bayes classifiers are a family of simple \"probabilistic classifiers\" based on applying Bayes' theorem with strong ..."
  ],
  [
    "Naive Bayes Classifier Algorithm Theorem Explained in Detail in Hindi | Machine Learning Tutorial",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In this ML ..."
  ],
  [
    "Naive Bayes Classifier in Python | Naive Bayes Algorithm | Machine Learning Algorithm | Edureka",
    "Machine Learning Training with Python: https://www.edureka.co/data-science-python-certification-course ** This Edureka video ..."
  ],
  [
    "Naive Bayes Classification Algorithm – Solved Numerical Question 1 in Hindi",
    "Naive Bayes Classification Algorithm – Solved Numerical Question 1 in Hindi Data Warehouse and Data Mining Lectures in Hindi ..."
  ],
  [
    "Naive Bayes Classifier (Part-1) in Telugu || Machine Learning in Telugu || Nerchuko",
    "Hey folks, Welcome to my channel Nerchuko. Follow this channel on Instagram: https://www.instagram.com/nerchu_ko/ Join Our ..."
  ],
  [
    "Naive Bayes Classifier | Part 1 | Conditional Probability",
    "In this video, we will learn the concept of conditional probability About CampusX: CampusX is an online mentorship program for ..."
  ],
  [
    "Naive Bayes Algorithm | Naive Bayes Classifier With Example in Hindi (Part 1)",
    "simple and easy explanation of Naive Bayes Algorithm in Hindi."
  ],
  [
    "Tutorial 49- How To Apply Naive Bayes&#39; Classifier On Text Data (NLP)- Machine Learning",
    "The Naive Bayes classifier is a simple classifier that classifies based on probabilities of events. It is the applied commonly to text ..."
  ],
  [
    "Naive Bayes Theorem explained with simple example (easy trick)",
    "THIS VIDEO SHOWS VERY EASY EXPLANATION OF NAIVE BAYES THEOREM WITH SIMPLE EXAMPLE."
  ],
  [
    "naive bayes algorithm in hindi Urdu - naive bayesian classification in data mining machine learning",
    "This naive bayes algorithm tutorial is in hindi and urdu language that explains what is bayesian classification algorithm with ..."
  ],
  [
    "Naive Bayes",
    ""
  ],
  [
    "Why Is Naive Bayes Naive - Intro to Machine Learning",
    "This video is part of an online course, Intro to Machine Learning. Check out the course here: ..."
  ],
  [
    "Naive Bayes Algorithm with an example in Machine Learning (Hindi) | Lec-11",
    "machinelearning #ersahilkagyan Subscribe the channel for more videos ..."
  ],
  [
    "Naive Bayes Classifier Algorithm in Machine Learning | Machine Learning Tutorial",
    "In this video, learn Naive Bayes Classifier Algorithm in Machine Learning | Machine Learning Tutorial. Find all the videos of the ..."
  ],
  [
    "Bayesian classifier / Naive bayes algorithm / KTU Machine learning",
    "bayesian #naivebayes #machinelearning The bayesian or naive bayes classifier is an algorithm for multiclass datasets. This is ..."
  ],
  [
    "Naive bayes or bayesian classifier problem / KTU Machine learning",
    "naivebayes #bayesian #example #machinelearning The bayesian or naive bayes classifier is an algorithm for multiclass datasets."
  ],
  [
    "2. Solved Example Naive Bayes Classifier to classify New Instance | Species Example by Mahesh Huddar",
    "Solved Example: 1. Naive Bayes Solved Example: https://www.youtube.com/watch?v=XzSlEA4ck2I 2. Naive Bayes Solved ..."
  ],
  [
    "Naive Bayes Classification Algorithm – Solved Numerical Question 2 in Hindi",
    "Naive Bayes Classification Algorithm – Solved Numerical Question 2 in Hindi Data Warehouse and Data Mining Lectures in Hindi ..."
  ],
  [
    "Naïve Bayes Algorithm In Hindi | Naïve Bayes Classifier Explained | Machine Learning |Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "23. Machine Learning Bangla | Naive Bayes Classifier in Machine Learning | Naïve Bayes in ML Bengali",
    "Machine Learning Bangla | Naive Bayes Classifier in Machine Learning | Naïve Bayes in ML Bengali. Basic Python & Machine ..."
  ],
  [
    "Naive Bayes Classifier Tutorial | Naive Bayes Classifier Example | Naive Bayes in R | Edureka",
    "Data Science Training - https://www.edureka.co/data-science-r-programming-certification-course ) This Naive Bayes Tutorial ..."
  ],
  [
    "Naive Bayes Classifier",
    "Lectures 5 and 6 of the Introductory Applied Machine Learning (IAML) course at the University of Edinburgh, taught by Victor ..."
  ],
  [
    "Naïve Bayes Classifier Algorithm | Solved Example Naïve Bayes Algorithm by Mahesh Huddar",
    "Naïve Bayes Classifier Algorithm | Solved Example Naïve Bayes Algorithm by Mahesh Huddar The following concepts are ..."
  ],
  [
    "Naive Bayes Variants : Gaussian Naive Bayes Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Tutorial 47- Bayes&#39; Theorem| Conditional Probability- Machine Learning",
    "In probability theory and statistics, Bayes' theorem describes the probability of an event, based on prior knowledge of conditions ..."
  ],
  [
    "Naive Bayes Theorem explained with example| Bayesian Classification in data mining| Machine Learning",
    "Naive Bayes classifier in English is explained here with fully solved example. Bayesian Classification in data mining or in Machine ..."
  ],
  [
    "Naive Bayes",
    ""
  ],
  [
    "Machine Learning Tutorial Python - 15:  Naive Bayes Classifier Algorithm Part 2",
    "In this python machine learning tutorial for beginners we will build email spam classifier using naive bayes algorithm. We will use ..."
  ],
  [
    "Understanding Naive Bayes Classification Algorithm Mathematics || Lesson 49 || Machine Learning ||",
    "machinelearning#learningmonkey In this class, we discuss how Understanding Naive Bayes Classification Algorithm ..."
  ],
  [
    "59- Naive Bayes Classification in Machine Learning with Python-(Day-28)",
    "dataScience #machineLearning #python #python_ka_chilla The whole Course: ..."
  ],
  [
    "Naive Bayes Variants : Multinomial Naive Bayes l Multinomial Distribution Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Machine Learning Lecture 10 &quot;Naive Bayes continued&quot; -Cornell CS4780 SP17",
    ""
  ],
  [
    "Text Classification Using Naive Bayes | Naive Bayes Algorithm In Machine Learning | Simplilearn",
    "This video on \"Text Classification Using Naive Bayes\" is a brilliant introductory walk through to the Classification of Text using ..."
  ],
  [
    "Naive Bayes Classifier Python | Naive Bayes Algorithm in Python | Machine Learning Algorithm",
    "Intellipaat Python course: https://intellipaat.com/python-certification-training-online/ #NaiveBayesClassifierInPython ..."
  ],
  [
    "Naive Bayes Classifier| Complete Intuition and Mathematics|Machine Learning|",
    "In this video i cover an indepth explanation of the supervised machine learning algorithm - Naive Bayes Classifier. It is one of the ..."
  ],
  [
    "Hindi-Naive Baye&#39;s Machine Learning Algorithm Indepth Inution- Part 2",
    "Download the materials: https://github.com/krishnaik06/Machine-Learning-Algorithms-Materials ML Playlist: ..."
  ],
  [
    "Naive Bayes - Georgia Tech - Machine Learning",
    "Check out the full Advanced Operating Systems course for free at: https://www.udacity.com/course/ud262 Georgia Tech online ..."
  ],
  [
    "Naive Bayes Variants : Bernoulli Naive Bayes l Bernoulli Distribution Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Naive Bayes classifier with solved example 1 in hindi | Lec-12",
    "ersahilkagyan #machinelearning Get the pdf ..."
  ],
  [
    "Naive Bayes with Python",
    "Naive Bayes with Python more content at https://educationalresearchtechniques.com/"
  ],
  [
    "Naive Bayes Classifier Example | A practical explanation of Naive Bayes classifier Machine Learning",
    "How to Develop a Naive Bayes Classifier from Scratch in Python? What does naive Bayes classifier do? Wine dataset Naive ..."
  ],
  [
    "Naive Bayes Classifier Example | A practical explanation of Naive Bayes classifier Machine Learning",
    "How to Develop a Naive Bayes Classifier from Scratch in Python? What does naive Bayes classifier do? Wine dataset Naive ..."
  ],
  [
    "Naive Bayes | Solved Example | Machine Learning",
    "Go through the solved example for Naive Bayes algorithm and also it's implementation using Python."
  ],
  [
    "What Is Naive Bayes Classifier/Theorem in machine learning? Data Mining and Warehousing Urdu/ Hindi",
    "What Is Naive Bayes Classifier/Theorem in machine learning? Data Mining and Warehousing Urdu/ Hindi."
  ],
  [
    "Naive bayes classifier/Naive bayes theorem",
    "KTU I T 304 dwm module 4 naive bayes theorem description and problem solving using naive bayes theorem KTU CS 402 DMW ..."
  ],
  [
    "Gaussian Naive Bayes, Clearly Explained!!!",
    "Gaussian Naive Bayes takes are of all your Naive Bayes needs when your training data are continuous. If that sounds fancy, don't ..."
  ],
  [
    "Naive Bayes in Python - Machine Learning From Scratch 05 - Python Tutorial",
    "Get my Free NumPy Handbook: https://www.python-engineer.com/numpybook In this Machine Learning from Scratch Tutorial, we ..."
  ],
  [
    "Mathematics Basics Required for Naive Bayes || Lesson 48 || Machine Learning || Learning Monkey ||",
    "machinelearning#learningmonkey In this class, we discuss the Mathematics Basics Required for Naive Bayes. Dependent events ..."
  ],
  [
    "ML 19 : Naïve Bayes Classifier Algorithm with Solved Example (All in One)",
    "Connect with me by: LIKE & SHARE Videos with your friends. SUBSCRIBE @csittutorialsbyvrushali Instagram: ..."
  ],
  [
    "Naive Bayes in Hindi | Conditional Probability | Machine Learning",
    "Naive Bayes classifier Naive Bayes algorithm Naive Bayes example Conditional Probability ------------------- Check more videos for ..."
  ],
  [
    "Naive Bayes Theorem | Introduction to Naive Bayes Theorem | Machine Learning Classification",
    "Naive Bayes is a machine learning algorithm for classification problems. It is based on Bayes' probability theorem. It is primarily ..."
  ],
  [
    "Naive Bayes Classifier (Part-2) in Telugu || Machine Learning in Telugu || Nerchuko",
    "Hey folks, Welcome to my channel Nerchuko. Follow this channel on Instagram: https://www.instagram.com/nerchu_ko/ Join Our ..."
  ],
  [
    "Data Mining Lecture -- Bayesian Classification | Naive Bayes Classifier | Solved Example (Eng-Hindi)",
    "In the bayesian classification The final ans doesn't matter in the calculation Because there is no need of value for the decision you ..."
  ],
  [
    "4.10 Naive Bayes classifier",
    "Parameters of Naive Bayes, Feasibility of learning the parameters Link to join the course ..."
  ],
  [
    "Lecture 5 - GDA &amp; Naive Bayes | Stanford CS229: Machine Learning Andrew Ng (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3GfTLkU ..."
  ],
  [
    "3.  Solved Example Naive Bayes Classifier to classify New Instance Car Example by Mahesh Huddar",
    "3. Solved Example Naive Bayes Classifier to classify New Instance Car Example by Mahesh Huddar Solved Example: 1. Naive ..."
  ],
  [
    "ML- Machine Learning-BE CSE-IT- Pros and Cons of Naive Bayes and Applications",
    "Pros and Cons of Naive Bayes and Applications."
  ],
  [
    "Naive Bayes | Machine Learning",
    "Understand the use of Baye's conditional probability in Machine Learning."
  ],
  [
    "[HINDI] Naive Bayes Algorithm in Machine Learning || Easy Explanation - Digital Daru",
    "[HINDI] Naive Bayes Algorithm in Machine Learning || Easy Explanation - Digital Daru Machine Learning Tutorial in hindi,machine ..."
  ],
  [
    "Naive bayes classifier/Naive bayes theorem||Malayalam||Machine Learning Course||Part-21",
    "Naive bayes classifier/Naive bayes theorem||Malayalam||Machine Learning Course||Part-21 This part of \"Machine Learning ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind - 4",
    "Machine Learning Training with Python: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "#19 Bayesian Classification - Bayes Theorem, Naive Bayes Classifier |DM|",
    "Abroad Education Channel : https://www.youtube.com/channel/UC9sgREj-cfZipx65BLiHGmw Company Specific HR Mock ..."
  ],
  [
    "IAML5.12: Naive Bayes for spam detection",
    "http://bit.ly/N-Bayes] How can we distinguish spam from non-spam with a Naive Bayes classifier? We estimate the priors and ..."
  ],
  [
    "Machine Learning Course - 8. Naïve Bayes",
    "A full university-level machine learning course - for free. New lectures every week. Designed as a first course for engineers, ..."
  ],
  [
    "Naive Bayes: Text Classification Example",
    "In this video, I explain the workings of the naive bayes algorithm using a text classification example. This channel is part of ..."
  ],
  [
    "Naive Bayes Classifier Intuition in Machine Learning",
    "Machine Learning: https://www.youtube.com/playlist?list=PL5-M_tYf311ZEzRMjgcfpVUz2Uw9TVChL Android ..."
  ],
  [
    "Bayes&#39; Theorem, Clearly Explained!!!!",
    "Bayes' Theorem is the foundation of Bayesian Statistics. This video was you through, step-by-step, how it is easily derived and ..."
  ],
  [
    "Naive Bayes from Scratch - Machine Learning Python",
    "From scratch implementation of Naive Bayes Classifier in Python. In the video I explain the theory briefly and focus is on the actual ..."
  ],
  [
    "Accuracy of Naive Bayes - Intro to Machine Learning",
    "This video is part of an online course, Intro to Machine Learning. Check out the course here: ..."
  ],
  [
    "machine learning/lecture 31(naive bayes classifier)",
    ""
  ],
  [
    "MACHINE LEARNING : 09 NAIVE BAYES",
    "Implémentation de NAIVE BAYES avec SKLEARN La doc SKLEARN : https://scikit-learn.org/stable/modules/naive_bayes.html Je ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Naive Bayes Classifier &amp; SK learn pipeline |  Learn Machine Learning in Tamil",
    "Naïve Bayes algorithm is a supervised learning algorithm, which is based on Bayes theorem and used for solving classification ..."
  ],
  [
    "Multinomial Naive Bayes Code on Amazon Data set || Lesson 53 || Machine Learning || Learning Monkey",
    "machinelearning#learningmonkey In this class, we discuss the Multinomial Naive Bayes Code on the Amazon Data set."
  ],
  [
    "Machine Learning Usando Excel (Naive Bayes)",
    "Planilha: https://1drv.ms/u/s!Am4PqLFJZ2-ai6JHNSDVUWfuF0OeVg?e=9imYwn Ciência de Dados Com Excel: ..."
  ],
  [
    "24. Machine Learning Bangla || Naive Bayes Algorithm explained with codes (Python sklearn library)",
    "Naive Bayes in Machine Learning Bangla || Naive Bayes Algorithm explained with codes (Python sklearn library). Basic Python ..."
  ],
  [
    "Intuition on Naive Bayes Classification in Machine Learning || Lesson 47 || Machine Learning ||",
    "machinelearning#learningmonkey In this class, we give Intuition on Naive Bayes Classification in Machine Learning. We take an ..."
  ],
  [
    "Naive Bayes Classifier | Part 7 | Mathematics behind Naive Bayes Algorithm",
    "In this video, we will derive the formula for Naive Bayes algorithm About CampusX: CampusX is an online mentorship program for ..."
  ],
  [
    "How Bayesian Theorem Works? (Naive Bayes Algorithm)",
    "Explained the Bayesian theorem which is a back end of Naive Bayes Algorithm in depth with step by step explanation. Check the ..."
  ],
  [
    "Machine Learning Lecture 8 &quot;Estimating Probabilities from Data: Naive Bayes&quot; -Cornell CS4780 SP17",
    "Cornell class CS4780. (Online version: https://tinyurl.com/eCornellML ) Lecture Notes: ..."
  ],
  [
    "Machine Intelligence - Lecture 20 (Bayesian Learning, Bayes Theorem, Naive Bayes)",
    "SYDE 522 – Machine Intelligence (Winter 2019, University of Waterloo) Target Audience: Senior Undergraduate Engineering ..."
  ],
  [
    "7. Solved Exaample Naive Bayes Classification Age Income Student Credit Rating Buys Computer Mahesh",
    "7. Solved Exaample Naive Bayes Classification Age Income Student Credit Rating Buys Computer by Dr. Mahesh Huddar How to ..."
  ],
  [
    "How to implement Naive Bayes from scratch with Python",
    "In the 6th lesson of the Machine Learning from Scratch course, we will learn how to implement the Naive Bayes algorithm."
  ],
  [
    "Log Probability Imbalanced Data Numerical Features in Naive Bayes || Lesson 52 || Machine Learning",
    "machinelearning#learningmonkey In this class, we discuss Log Probability, Imbalanced Data, Numerical Features in Naive Bayes ..."
  ],
  [
    "Hyperparameter Underfitting and Overfitting in Naive Bayes || Lesson 51 || Machine Learning ||",
    "machinelearning#learningmonkey In this class, we discuss Hyperparameter Underfitting and Overfitting in Naive Bayes."
  ],
  [
    "How to solve naive bayes | naive bayes classifier example |bayes&#39; theorem",
    "Here there are 14 training examples of the target concept PlayGolf, where each day is described by the attributes Outlook, ..."
  ],
  [
    "Gaussian Naive Bayes Sex Classifier in Machine Learning",
    "Machine Learning: https://www.youtube.com/playlist?list=PL5-M_tYf311ZEzRMjgcfpVUz2Uw9TVChL Naive Bayes Intuition: ..."
  ],
  [
    "Machine Learning Basics | Naïve Bayes Classifier | Learn Basics of Machine Learning in 10 Minutes",
    "Naïve Bayes Classifier | Machine Learning Basics | Learn Basics of Machine Learning in 10 Minutes."
  ],
  [
    "Part I: Naive Bayes Algorithm, Classifier, Example solved, data mining, machine learning, probabilit",
    "Naive Bayes Algorithm, Classifier, Example solved This video explains about theoretical aspect of Naive Bayes method, ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind - 3",
    "Machine Learning Training with Python: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "Naive Bayes Algorithm Explained | Machine Learning | Python",
    "Watch the video to understand the concepts of Naive Bayes Algorithm and know the overview Naive Bayes Theorem."
  ],
  [
    "Naive bayes classifier/Naive bayes theorem",
    "KTU I T 304 dwm module 4 naive bayes theorem description and problem solving using naive bayes theorem KTU CS 402 DMW ..."
  ],
  [
    "Naive Bayes Classifier in Python | Hindi | Machine Learning Tutorial",
    "machinelearning #naviebayes #andrewng In this video, I have discussed about Navie Bayes Theorem, All Practical!! Go and ..."
  ],
  [
    "12 Machine Learning: Naive Bayes",
    "A lecture on the Naive Bayes Classifier, a very powerful, flexible prediction method based on fundamental Bayesian statistics."
  ],
  [
    "MACHINE LEARNING : 09 NAIVE BAYES",
    "Implémentation de NAIVE BAYES avec SKLEARN La doc SKLEARN : https://scikit-learn.org/stable/modules/naive_bayes.html Je ..."
  ],
  [
    "Naive Bayes Classifier Tutorial | Naive Bayes Demo | Machine Learning Algorithm | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Lecture 35: Weakness of Naive bayes classifier | M estimator | Machine Learning",
    "WeaknessOfNaieveBayesClassifier #MEstimator."
  ],
  [
    "Naive Bayes Classifier &amp; SK learn pipeline |  Learn Machine Learning in Tamil",
    "Naïve Bayes algorithm is a supervised learning algorithm, which is based on Bayes theorem and used for solving classification ..."
  ],
  [
    "IAML5.9: Gaussian Naive Bayes classifier",
    ""
  ],
  [
    "Naive Bayes machine learning Algo in 5 Min ONLY",
    "In machine learning bayesian classification Naive Bayes machine learning AlgoThe final answer doesn't matter in the calculation ..."
  ],
  [
    "How to implement Naïve Bayes Classification Algorithm using WEKA",
    "Naïve Bayes uses a simple implementation of Bayes Theorem (hence naïve) where the prior probability for each class is ..."
  ],
  [
    "Naïve Bayes and Machine Learning Pipelines (Learn ML vid 7)",
    "Video tutorial goes over Bayesian Machine Learning, Conditional Probability, Bayes Theorem, Multivariate distributions, Prior ..."
  ],
  [
    "Part I: Naive Bayes Algorithm, Classifier, Example solved, data mining, machine learning, probabilit",
    "Naive Bayes Algorithm, Classifier, Example solved This video explains about theoretical aspect of Naive Bayes method, ..."
  ],
  [
    "Implementing Multinomial Naive Bayes Classifier Algorithm for Text Classification | Machine Learning",
    "Multinomial Naive Bayes Explained with example. Reference Notes- ..."
  ],
  [
    "naive bayes classifier algorithm with an example in data mining, naive bayes classifier |data mining",
    "naivebayesclassifieralgorithm#naivebayesclassifier#naivebayesclassification#naivebayesclassificationalgorithm#datamining# ..."
  ],
  [
    "Gaussian Naive Bayes Sex Classifier in Machine Learning",
    "Machine Learning: https://www.youtube.com/playlist?list=PL5-M_tYf311ZEzRMjgcfpVUz2Uw9TVChL Naive Bayes Intuition: ..."
  ],
  [
    "Naive Bayes Classifier - Multinomial Bernoulli Gaussian Using Sklearn in Python - Tutorial 32",
    "In this Python for Data Science tutorial, You will learn about Naive Bayes classifier (Multinomial Bernoulli Gaussian) using scikit ..."
  ],
  [
    "[Machine Learning] Naive Bayes Classifier (2/2) - Bayes Theorem",
    "Describe Bayes Theorem in 5 minutes and get ready for programming. Subtitle (English) is ready, please click CC button on ..."
  ],
  [
    "16 - Naive Bayes Implementation | Dr. Sahil Sharma | Machine Learning Practical Series",
    "GitHub Implementation Link: https://github.com/sahil301290/MachineLearning/blob/main/Naive_Bayes_Classifier.ipynb Theory ..."
  ],
  [
    "Naive bayes classifier / algorithm in data mining in bangla/Data mining tutorial in Bangla",
    "Naive bayes classifier / algorithm in data mining in bangla/Data mining tutorial in Bangla/ naive bayes classifier/naive bayes ..."
  ],
  [
    "Naive Bayes Classifier Explained  | Naive Bayes Algorithm | Edureka | Machine Learning Rewind - 6",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Classification Algorithms in Machine Learning | K NN, SVM, Naive Bayes, CART",
    "The video explains what is Classification and Regression algorithms in Supervised Machine Learning. The most commonly used ..."
  ],
  [
    "3.  Solved Example Naive Bayes Classifier to classify New Instance Car Example by Mahesh Huddar",
    "3. Solved Example Naive Bayes Classifier to classify New Instance Car Example by Mahesh Huddar Solved Example: 1. Naive ..."
  ],
  [
    "Machine Learning Project -  Naive Bayes Accuracy",
    "Naive Bayes is one of the best classification algorithm in supervised machine learning. Indeed it work best in text classification."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind - 2",
    "Edureka Machine Learning Course Master Program: ..."
  ],
  [
    "Week 8 Lecture 57 - Naive Bayes",
    "Probabilistic Graphical models, Naive Bayes, Bayesian Networks, Joint Distribution Estimation, Introduction to Probabilistic ..."
  ],
  [
    "How to solve naive bayes | naive bayes classifier example |bayes&#39; theorem",
    "Here there are 14 training examples of the target concept PlayGolf, where each day is described by the attributes Outlook, ..."
  ],
  [
    "Naïve Bayes Model by Mahesh Huddar",
    "Naïve Bayes Model by Mahesh Huddar Website: www.vtupulse.com Facebook: https://www.facebook.com/VTUPulse Naïve Bayes ..."
  ],
  [
    "Hyperparameter Underfitting and Overfitting in Naive Bayes || Lesson 51 || Machine Learning ||",
    "machinelearning#learningmonkey In this class, we discuss Hyperparameter Underfitting and Overfitting in Naive Bayes."
  ],
  [
    "Naive Bayes Algorithm Explained | Machine Learning | Python",
    "Watch the video to understand the concepts of Naive Bayes Algorithm and know the overview Naive Bayes Theorem."
  ],
  [
    "Naive Bayes Classifier | Naive Bayes Algorithm | Naive Bayes Algorithm in Machine Learning | AKTU",
    "Hello Guys,, in this video we are going to discuss about Naive Bayes Classifier. We will discuss Naive Bayes Algorithm."
  ],
  [
    "Naive Bayes in Telugu | Machine Learning Chapter 3 Artificial Intelligence in Telugu | Vamsi Bhavani",
    "learn #withme If you like this video, give it a thumbs up and share it with your friends. All the code in this video, if any can be ..."
  ],
  [
    "Naive Bayes Classification technique Explained Clearly.",
    ""
  ],
  [
    "Gaussian Naive Bayes Sex Classifier in Python sklearn | Machine Learning",
    "Machine Learning: https://www.youtube.com/playlist?list=PL5-M_tYf311ZEzRMjgcfpVUz2Uw9TVChL Gaussian Naive Bayes: ..."
  ],
  [
    "Naive Bayes Classification Model | Machine Learning in Tamil - Part 24 | #54",
    "In this video, I discuss Naive Bayes Classification model. Links http://leadingindia.ai/ http://sridharjs.com/ ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind -  6",
    "Edureka Machine Learning Course Master Program: ..."
  ],
  [
    "Naive Bayes Theorem explained with example| Bayesian Classification in data mining| Machine Learning",
    "Naive Bayes classifier in English is explained here with fully solved example. Bayesian Classification in data mining or in Machine ..."
  ],
  [
    "Machine Learning Zero to Hero in Bangla | part 13 | Naive Bayes Classifier Explained",
    "Machine Learning Tutorial in Bangla | part 13 | Naive Bayes Classifier Explained A Naive Bayes classifier is a probabilistic ..."
  ],
  [
    "Naive Bayes Classifier | Naive Bayes Algorithm | Edureka | Machine Learning Live - 1",
    "Machine Learning Training with Python: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "Live Day 3- Discussing KNN And Naive Baye&#39;s Machine Learning Algorithms",
    "Join the community session https://ineuron.ai/course/Mega-Community . Here All the materials will be uploaded. Playlist: ..."
  ],
  [
    "Machine Learning | Laplace Correction",
    "In statistics, Laplace Smoothing is a technique to smooth categorical data. Laplace Smoothing is introduced to solve the problem ..."
  ],
  [
    "Machine Learning Lecture 9 &quot;Naive Bayes continued&quot; -Cornell CS4780 SP17",
    ""
  ],
  [
    "Tutorial 3: Naive Bayes: Machine Learning Classifier | AI Sangam",
    "Naive Bayes is based on Probability and is a generative model. It treats predictors columns as independent features. You will ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm with Example | ML Training | Edureka",
    "NIT Warangal Post Graduate Program in AI & Machine Learning with Edureka: https://www.edureka.co/nitw-ai-ml-pgp This ..."
  ],
  [
    "Lecture 20: Machine Learning - Naive Bayes&#39;",
    "CS188 Artificial Intelligence, Fall 2013 Instructor: Prof. Dan Klein."
  ],
  [
    "naive bayes classifier | Introduction to Naive Bayes Theorem | Machine Learning Algorithm (2019)",
    "Naivebayesclassifier #MachineLearning #CodeWrestling This video explains the concept of classification of text from a set of ..."
  ],
  [
    "AIML | L - 6 | Machine Learning: Naive Bayes Classifier | DRDO 2022 | Vishvadeep Gothi",
    "In this session, Educator Vishvadeep Gothi will be discussing Machine Learning: Naive Bayes Classifier Call Vishvadeep Gothi's ..."
  ],
  [
    "#39 Bayes Theorem - With Proof &amp; Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners  | Naive Bayes Classifier | Edureka | DS Rewind - 4",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "Naive Bayes classifier explained for Beginners with Examples | Learn Machine Learning",
    "Get a look at our course on data science and AI here : https://aicourse.thinkific.com/collections ..."
  ],
  [
    "Projects on Naive Bayes Classifier - 1 | Lec 39 | Machine Learning | GATE CSE Exam",
    "In this live lecture, you will learn the Machine Learning for GATE Computer Science Engineering Exam. Arun Sir has covered ..."
  ],
  [
    "Naive Bayes تطبيق باستخدام البايثون",
    "This lecture covers the Implementation of Naive Bayes theorem through different examples on Python 1. categorical feature 2."
  ],
  [
    "Part II: Naive Bayes Algorithm, Classifier, Example solved, Data Mining, Machine Learning Supervised",
    "Naive Bayes Algorithm, Classifier, Example solved This video explains how to solve Naive Bayes exercise. Calculate posterior ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm with Example | ML Training | Edureka",
    "NIT Warangal Post Graduate Program in AI & Machine Learning with Edureka: https://www.edureka.co/nitw-ai-ml-pgp This ..."
  ],
  [
    "Live Day 3- Discussing KNN And Naive Baye&#39;s Machine Learning Algorithms",
    "Join the community session https://ineuron.ai/course/Mega-Community . Here All the materials will be uploaded. Playlist: ..."
  ],
  [
    "Lecture 20: Machine Learning - Naive Bayes&#39;",
    "CS188 Artificial Intelligence, Fall 2013 Instructor: Prof. Dan Klein."
  ],
  [
    "Text Classification Using Naive Bayes",
    "This is a low math introduction and tutorial to classifying text using Naive Bayes. One of the most seminal methods to do so."
  ],
  [
    "4.13 Naïve Bayes Classifier| Probabilistic Models | Machine Learning",
    "Video Content Details : 1.Naïve Bayes Classifier 2.Principle of Naïve Bayes Classifier 3.Types of Naïve Bayes Classifier ..."
  ],
  [
    "Naive Bayes Variants|| What is Gaussian Naive Bayes in machine learning? Urdu/Hindi",
    "Naive Bayes Variants|| What is Gaussian Naive Bayes in machine learning? Urdu/Hindi."
  ],
  [
    "Naive Bayes Gaussian Model in Python",
    "This material provides a step-by-step procedure to code the Naive Bayes Gaussian Model in python."
  ],
  [
    "Naive Bayes Classifier | Naive Bayes Algorithm | Edureka | Machine Learning Live - 1",
    "Machine Learning Training with Python: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "Machine Learning Lecture 9 &quot;Naive Bayes continued&quot; -Cornell CS4780 SP17",
    ""
  ],
  [
    "Naive Bayes classifier",
    "The audio and video sync is fixed in this link https://www.youtube.com/edit?o=U&video_id=gH7nFrmDIL8&ar=3 for the Naive ..."
  ],
  [
    "Lecture 21: ML: Naive Bayes",
    ""
  ],
  [
    "Naive Bayes Classifier from Scratch | Lec 41 | Machine Learning | GATE CSE Exam",
    "In this live lecture, you will learn the Machine Learning for GATE Computer Science Engineering Exam. Arun Sir has covered ..."
  ],
  [
    "Naive Bayes classifier explained for Beginners with Examples | Learn Machine Learning",
    "Get a look at our course on data science and AI here : https://aicourse.thinkific.com/collections ..."
  ],
  [
    "Naive Bayes Approach in tamil | Machine learning Naive Bayes Approach in tamil |Naive Bayes in tamil",
    "Naive Bayes Approach in tamil Machine learning Naive Bayes Approach in tamil Naive Bayes in tamil #ml ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind -  6",
    "Edureka Machine Learning Course Master Program: ..."
  ],
  [
    "Data Science &amp; Machine Learning: Naive Bayes in Python Promo",
    "GET 85% OFF HERE: https://deeplearningcourses.com/c/data-science-machine-learning-naive-bayes-in-python."
  ],
  [
    "Naive Bayes&#39; Classifier Indepth Intuition- Machine Learning || By Neeli&#39;s Galaxy || Naive Bayes",
    "This video explains the indepth intution of Naïve Bayes classifier #NaïveBayesClassifierExample #MachineLearning ..."
  ],
  [
    "Part V: Naive Bayes Algorithm, Data Mining, Machine Learning, numeric attributes, solved Examples",
    "This video explains Naive Bayes exercises for Numeric attributes and zero probability problem Previous videos on Naive Bayes ..."
  ],
  [
    "6 Machine Learning using WEKA -- Implement Naïve Bayes classifier",
    "Selenium with Python: https://www.youtube.com/playlist?list=PLxfAx2IY7C9l8hgs_0AbAQRs79zLIuXFQ Python: ..."
  ],
  [
    "Naive Bayes Algorithm Numerical Example In Hindi|| Machine Learning Lectures",
    "Naive Bayes Classification Numerical Example In Hindi|| Machine Learning Lectures Bayesian Classification with Example Naive ..."
  ],
  [
    "Machine Learning - Python Naïve Bayes Spam Classifier Model | Classify Emails with ML Model",
    "In this Video, we're going to build a Spam Classifier Model using the multinomial Naïve Bayes algorithm. Our goal is to code a ..."
  ],
  [
    "Logistic Regression and Naive Bayes in Machine Learning  | Machine Learning Tutorial |Great Learning",
    "Skip Intro: 0:01:11 Looking for a career upgrade & a better salary? We can help, Choose from our no 1 ranked top programmes."
  ],
  [
    "Machine Learning Session 30   NaiveBayes Classifier",
    "for more sessions visit and enroll https://sreeram-trainings-of-ai-technologies.teachable.com/ phone : 6309613028."
  ],
  [
    "Live 2020-04-06!!! Naive Bayes: Gaussian",
    "Today we're going to talk a little more about Naive Bayes. We'll cover the Gaussian version, at the start, as well as discuss why ..."
  ],
  [
    "Implementation of Naive Bayes Classifier in Python | IRIS DataSet | Machine Learning | 2021",
    "Google Colab: https://colab.research.google.com/ Iris Dataset Link: ..."
  ],
  [
    "Naïve Bayes in MATLAB &amp; Classification Learner App | Machine Learning | MATLAB Helper",
    "Learn how to implement Naïve Bayes in MATLAB & classification Learner App. Access premium content at ..."
  ],
  [
    "NAIVE BAYES MODEL IMPLEMENTATION IN AZURE MACHINE LEARNING STUDIO",
    "NAIVE BAYES MODEL IMPLEMENTATION IN AZURE MACHINE LEARNING STUDIO T3 GROUP B."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners  | Naive Bayes Classifier | Edureka | DS Rewind - 4",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "#39 Bayes Theorem - With Proof &amp; Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Naive Bayes with Rapidminer",
    "In this video, I show you how to apply Naive Bayes; a probabilistic classifier, with Rapidminer."
  ],
  [
    "Naive Bayes Algorithm with Solved NB Classification Example",
    "machinelearning #naivebayes #supervisedlearning #machinelearningalgorithms In this video, I will explain a simple yet powerful ..."
  ],
  [
    "Spam Classifier using Naive Bayes in Python",
    "In this video we use our implementation from the last video of naive bayes classifier to classify emails into spam and not spam ..."
  ],
  [
    "Machine Learning - 17 | Naive Bayes Algorithm | Sinhala",
    "Machine Learning - 17 | Naive Bayes Algorithm | Sinhala Naive Bayes is a supervised machine learning algorithm, which is used ..."
  ],
  [
    "zero probability problem || naive bayes || machine learning",
    ""
  ],
  [
    "Naïve Bayes Classifier | Machine Learning | Part 8 | ML",
    "Naïve Bayes is a simple learning algorithm that utilizes Bayes rule, With a strong assumption that the attributes are conditionally ..."
  ],
  [
    "Naive Bayes Classifier Explained | Naive Bayes Algorithm | Edureka | Machine Learning Rewind - 1",
    "Machine Learning Training with Python: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "Naive Bayes Classification in Telugu || Machine Learning in Telugu || Nerchuko",
    "Hey folks, Welcome to my channel Nerchuko. Follow this channel on Instagram: https://www.instagram.com/nerchu_ko/ Join Our ..."
  ],
  [
    "Intuitive Understanding of Naive Bayes Classifier | Machine Learning | Naive Bayes | Algorithm",
    "Machine Learning is one of the most prominent technologies in Industrial Revolution 4.0 Learning ML could be byzantine, so let's ..."
  ],
  [
    "Bloomreach Webinars | Machine Learning 3/5: Naive Bayes Classifier",
    "This lecture continues to build on Bayes rule that we learned last time. We define training and testing data sets and build a ..."
  ],
  [
    "Machine Learning:  Bernoulli Naive Bayes Classifier with SK-Learn Demonstration",
    ""
  ],
  [
    "Naive Bayes in MATLAB",
    "If you found this video helpful then please use this link if you'd like to Buy Me A Coffee. Thank you   ..."
  ],
  [
    "Naive Bayes Classifier Solved Example ||  VTU || Problem-01 || Kannada Machine Learning || Module-04",
    "hope you're having a great day I heartily welcome all of you to the VTU MATHS BADDY channel this channel contains Kannada ..."
  ],
  [
    "Introduction to Naive Bayes Algorithm (Theory) - Machine Learning for Beginners",
    "Lecture 1 - Introduction to Naive Bayes Algorithm (Theory) Followed by Lecture 2 - Introduction to Naive Bayes Algorithm (Code) ..."
  ],
  [
    "naive Bayesian classifier in Kannada | naive bayes classifier | Naive Bayes Algorithm | VTU ML Lab",
    "Hello friends!. In this video, I explained the naive Bayesian classifier in the Kannada language. I hope my explaning approach will ..."
  ],
  [
    "Naive Bayes - Manual Calculation &amp; Using Google Colab",
    "Computational Intelligence Course in Nusa Putra Univ. 11.50: Scikit Learn Implementation 14.30: How to see the source code gnb ..."
  ],
  [
    "Bayes theorem with problems solved / KTU machine learning",
    "bayestheorem #likelihood #machinelearning This video gives you a clear idea about bayes theorem with examples. This includes ..."
  ],
  [
    "Naïve Bayes Classifier - Fun and Easy Machine Learning",
    "In this session, you will learn, - What is Bayes theorem? - What is Naive Bayes Algorithm? - What is the working of Naive Bayes ..."
  ],
  [
    "Naive Bayes Classifier - Machine Learning",
    "Naive Bayes Classifier Optimal (the best) classifier is the one that has maximum possible prediction accuracy or minimum ..."
  ],
  [
    "Naive Bayes - Machine Learning in Python Tutorial (Lesson 6)",
    "In this video we're going to be discussing how we can use Naive Bayes, a classification algorithm, to better predict with probability ..."
  ],
  [
    "Fake News Detection using Machine Learning Naive Bayes | Python Project | Machine Learning Project",
    "Fake News Detection using Machine Learning Naive Bayes | Python Project | Machine Learning Project ..."
  ],
  [
    "Demo on Iris Dataset Classification Using Naive Bayes Classifier | AI with AI |",
    "In this video, We are going to Understand how to work with Machine Learning Classification Technique using a Naive Bayes ..."
  ],
  [
    "Multinomial  Naive Bayes classifier basics for Text Classification | Machine Learning with Python",
    "Multinomial Naive Bayes Classifier for Text Analysis Basics functions for implementation of Multinomial Naive Bayes Classifier ..."
  ],
  [
    "Machine Learning Algorithms in 7 Days: Introduction to Naïve Bayes Algorithm|packtpub.com",
    "This video tutorial has been taken from Machine Learning Algorithms in 7 Days. You can learn more and buy the full video course ..."
  ],
  [
    "Text Classification |  Bernoulli Naive Bayes | Practical Example on Bernoulli Naive Bayes",
    "Explained Text classification Using Bernoulli Naive Bates Algorithm. For Text Cleaning : refer this video ..."
  ],
  [
    "Python Exercise on Naive Bayes",
    ""
  ],
  [
    "Machine Learning Classification: Naive Bayes Intuition Part 2 | By Dr. Ry @Stemplicity",
    "This tutorial explains fundamentals of Machine Learning classification strategy known as Naïve Bayes! So what are naïve Bayes ..."
  ],
  [
    "Naive Bayes Classification in Telugu || Machine Learning in Telugu || Nerchuko",
    "Hey folks, Welcome to my channel Nerchuko. Follow this channel on Instagram: https://www.instagram.com/nerchu_ko/ Join Our ..."
  ],
  [
    "Bayes theorem with problems solved / KTU machine learning",
    "bayestheorem #likelihood #machinelearning This video gives you a clear idea about bayes theorem with examples. This includes ..."
  ],
  [
    "Naive Bayes in Hindi | Machine Learning Algorithm | Machine Learning Tutorial",
    "Source Code and Dataset: Naive Bayes in Hindi | Machine Learning Algorithm | Machine Learning Tutorial ..."
  ],
  [
    "Navie bayes Algorithm in Telugu",
    ""
  ],
  [
    "DIABETES PREDICTION USING NAIVE BAYES CLASSIFIER",
    "This dataset is originally from the National Diabetes and Digestive and Kidney Diseases Institute. The purpose of the dataset is to ..."
  ],
  [
    "Machine Learning Class: Naïve Bayes: Part I",
    "Naïve Bayes Classifier Learning and Inference Gaussian Naïve Bayes Discrete Naïve Bayes."
  ],
  [
    "Machine learning Lecture 21( Naive Bayes Formula)",
    "Introducing Naive Bayes Formula https://sites.google.com/site/gcnandi/"
  ],
  [
    "Machine Learning: PCA &amp; Naive Bayes Classifier",
    "PCA applied on images and Naive Bayes Classifier to classify image. It is shown what happens if different principal components ..."
  ],
  [
    "NAIVE BAYES - TEORÍA | #46 Curso Machine Learning con Python",
    "Naive Bayes es el algoritmo más sencillo y potente. A pesar de los significativos avances de Machine Learning en los últimos ..."
  ],
  [
    "undergraduate machine learning 24: Text classification with Naive Bayes",
    "Naive Bayes classifier, text classification and Twitter sentiment prediction. The slides are available here: ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners  | Naive Bayes Classifier | Edureka | DS Rewind - 5",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "Email Spam Classification |Machine Learning |Naive Bayes classifier",
    "Naive Bayes classifiers are a popular statistical technique of e-mail filtering. They typically use bag of words features to identify ..."
  ],
  [
    "Naive Bayes Classifier Beginners Python| Machine Learning Tutorial part 14",
    "Conditional Probability and Bayes Theorem playlist: ..."
  ],
  [
    "Naive bayes - Machine Learning Algorithm for beginners",
    "hey guys back with another video!! I am pretty sure you guys have heard about the algorithm naive bayes that is the most common ..."
  ],
  [
    "Naive Bayes Variants:  Multinomial Naive Bayes l Multinomial Distribution Urdu/Hindi",
    "Naive Bayes Variants: Multinomial Naive Bayes l Multinomial Distribution Urdu/Hindi."
  ],
  [
    "Naïve Bayes Classifier - Part 6 (Problem Solution ) / KTU CS467 Machine Learning  Module  3",
    ""
  ],
  [
    "Machine Learning: Gaussian Naive Bayes Classifier with SK-Learn Demonstration",
    ""
  ],
  [
    "Naive Bayes In-depth Explanation-2 | Machine Learning",
    "In this video, I will explain what is the Naive Bayes algorithm and how it works."
  ],
  [
    "Naive Bayes Classifier With Excel - Build a Spam Filter!",
    "This video will teach you to implement a naive Bayes classifier with Excel. Using the naive Bayes algorithm, you will implement a ..."
  ],
  [
    "Machine Learning - Naive Bayes Classifier",
    "In machine learning, naïve Bayes classifiers are a family of simple \"probabilistic classifiers\" based on applying Bayes' theorem ..."
  ],
  [
    "Naive Bayes In-depth Explanation -1 | Machine Learning",
    "In this video, I will how Bayes theorem is used to derive the formulation of the Naive Bayes algorithm. This will help you in ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners | Naive Bayes Classifier | Edureka | DS Rewind -  3",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "Naive Bayes Lecture 2 The Naive Bayes Classifier",
    ""
  ],
  [
    "Introduction to Disease-prediction-using-Machine-Learning-Naive Bayes 1/9",
    ""
  ],
  [
    "Artificial Intelligence &amp; Machine Learning: Naive Bayes Algorithm Concept",
    "BobMwiti, #WorkingInUSA, #MachineLearning,"
  ],
  [
    "Naive Bayes Algorithm explained with example || Machine Learning || Artificial Intelligence",
    "Naivebayes #naivebayesalgorithm In this video I clearly explained Naive Bayes algorithm with an appropriate example to predict ..."
  ],
  [
    "Lecture20: Machine Learning: Naive Bayes",
    "CS188 Artificial Intelligence UC Berkeley, Spring 2013 Instructor: Prof. Pieter Abbeel."
  ],
  [
    "Machine Learning Foundations (2022) - Naive Bayes with Numpy",
    "Machine Learning Foundations (2022) - Naive Bayes with Numpy Instructor: Ricardo A. Calix, Ph.D. Link: ..."
  ],
  [
    "Naive Bayes Classifier - Machine Learning",
    "'Naive Bayes' is extremely fast relative to other classification algorithms. It works on Bayes theorem of Probability to predict the ..."
  ],
  [
    "Spam Detection Classifier with Naive Bayes Algorithm | Machine Learning",
    "Developing a Spam Detection Classifier with Naive Bayes algorithm. I tried to make this video short (less than 3 minutes) and as ..."
  ],
  [
    "Probabilistic Model Naive Bayes Algorithm Part 2 | MACHINE LEARNING IN KANNADA #16 | Charan H U",
    "Probabilistic Model Naive Bayes Algorithm Part 2 | MACHINE LEARNING IN KANNADA #16 Hello friends!, In this video I ..."
  ],
  [
    "Spam email classifier using Naive Bayes and SVM",
    ""
  ],
  [
    "Naive Bayes  - 6 | Machine Learning- Python|",
    "Machine Learning Lab manual for VTU 7th semester. http://github.com/madhurish."
  ],
  [
    "SPAM DETECTION ON MOBILE USING NAIVE BAYES ALGORITHM (MACHINE LEARNING)",
    "SPAM DETECTION ON MOBILE USING NAIVE BAYES ALGORITHM (MACHINE LEARNING)"
  ],
  [
    "Naive Bayes in Hindi | Machine Learning Algorithm | Machine Learning Tutorial",
    "Source Code and Dataset: Naive Bayes in Hindi | Machine Learning Algorithm | Machine Learning Tutorial ..."
  ],
  [
    "How Machine Learning works in automating text validation (Multinomial Naive Bayes algorithm)",
    "See how we trained a Multinomial Naive Bayes algorithm to classify any text into one of the 20 categories. Machine learning ..."
  ],
  [
    "Naive Bayes For Text Classification and Laplace Smoothing | Machine Learning",
    "This is the full Course of Data Science. Topics : #Naive bayes Linked IN : https://www.linkedin.com/company/kn-academy ..."
  ],
  [
    "SMS Spam Filter | Naive Bayes ML Algorithm | Machine Learning Project | Naive Bayes Classifier",
    "Project Details The spam detection problem can be tackled in several ways ranging from the very simple to the very complex (a ..."
  ],
  [
    "Learn Naïve Bayes Algorithm in Less than 10 Minutes - Machine Learning",
    "n statistics, naive Bayes classifiers are a family of simple \"probabilistic classifiers\" based on applying Bayes' theorem with strong ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners | Naive Bayes Classifier | Edureka | DS Rewind - 3",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r-programming-certification-course This Edureka video will ..."
  ],
  [
    "100 Days Of Machine Learning - Day 2 | Machine Learning, Naive bayes implementation in python",
    "Join me on #100DaysOfML and follow along to learn machine learning! Day 1: https://youtu.be/3YwN9oB3q8s Day 2 In today's ..."
  ],
  [
    "Machine Learning  For Beginners - Naive Bayes",
    "Dear Students! In this video we will learn about an other classifier named Naïve Bayes, that is used for machine learning ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners | Naive Bayes Classifier | Edureka | DS Rewind - 3",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r-programming-certification-course This Edureka video will ..."
  ],
  [
    "100 Days Of Machine Learning - Day 2 | Machine Learning, Naive bayes implementation in python",
    "Join me on #100DaysOfML and follow along to learn machine learning! Day 1: https://youtu.be/3YwN9oB3q8s Day 2 In today's ..."
  ],
  [
    "Machine Learning  For Beginners - Naive Bayes",
    "Dear Students! In this video we will learn about an other classifier named Naïve Bayes, that is used for machine learning ..."
  ],
  [
    "Naïve Bayes - Machine Learning With Big Data",
    "Link to this course: ..."
  ],
  [
    "ML- Machine Learning-BE CSE-IT- Naive Bayes and Bayes Theorem",
    "Naive Bayes and Bayes Theorem."
  ],
  [
    "[Machine Learning] Naive Bayes Classifier (1/2) - Probability",
    "describe probability briefly for Naive Bayes Classifier all machine learning youtube videos from me, ..."
  ],
  [
    "Machine Learning for Cyber Security: Naive Bayes",
    "Description: In this lecture, we are going to talk about another important machine learning algorithm called Naïve Bayes. You can ..."
  ],
  [
    "MACHINE LEARNING - NAIVE BAYES (with Python)",
    "Tugas Machine learning - Metode Naive Bayes Data : Golf.csv Program : Python oleh Shela Ernita Sari - 025."
  ],
  [
    "Twitter Sentiment Analysis (Naive Bayes Classifier)",
    "[Fall 2020] Week 8: Twitter Sentiment Analysis Learn how to use natural language processing to determine whether the sentiment ..."
  ],
  [
    "Laplace Smoothening In Naive Bayes | Machine Learning",
    "In this video, I will explain what is Laplace smoothening and why we use it in Naive Bayes."
  ],
  [
    "Part 4.1: Train Your Naive Bayes Machine Learning Model",
    "This is the fifth video of the serie about \"Understanding Machine Learning with Python\". In this video, you will understand how to ..."
  ],
  [
    "Data Science &amp; Machine Learning - Naive Bayes Handson- DIY- 32 -of-50",
    "Data Science & Machine Learning - Naive Bayes Handson- DIY- 32 -of-50 Do it yourself Tutorial by Bharati DW Consultancy cell: ..."
  ],
  [
    "Naive Bayes Mathematical derivation",
    "Link to the Wikipedia article and the Shatterline blog example: https://en.wikipedia.org/wiki/Naive_Bayes_classifier ..."
  ],
  [
    "Naive Bayes | Machine Learning Bootcamp",
    "Python #MachineLearning #Classification #naivebayes Don't Forget To Subscribe Our Channel and Click On Bell Icon To Stay ..."
  ],
  [
    "Introduction to Random Forest and Introduction to Naive Bayes Algorithm | Naive Bayes Classifier",
    "7 K-Nearest Neighbor(KNN) Algorithm for Machine Learning | Simple understanding of KNN algorithm!"
  ],
  [
    "Data Science &amp; Machine Learning - Naive Bayes - DIY- 31 -of-50",
    "Data Science & Machine Learning - Naive Bayes - DIY- 31 -of-50 Do it yourself Tutorial by Bharati DW Consultancy cell: ..."
  ],
  [
    "Lecture 34:Artificial Intelligence | Naive Bayes classifier in Machine learning With example",
    "In this video we will learn about Naive Bayes classifier that classify the data on the bases of probability #Naive Bayes classifier ..."
  ],
  [
    "How to do Text Classification using Naive Bayes Classifier and TF-IDF features by Mahesh Huddar",
    "How to do Text / Document Classification using Naive Bayes Classifier and TF-IDF features by Mahesh Huddar Source Code: ..."
  ],
  [
    "Naive Bayes Classifier",
    "Machine Learning || Swapna.C."
  ],
  [
    "Bernoulli Multivariate Naive Bayes | Machine Learning",
    "This is the full Course of Data Science. Topics : #Naive bayes bayes theorem Linked IN ..."
  ],
  [
    "Naive Bayes Classifier in Python (from scratch!)",
    "Let's create a Naive Bayes classifier with barebone NumPy and Pandas! You'll learn how to deal with continuous features and ..."
  ],
  [
    "#40 Bayes Theorem &amp; Concept Learning  |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "What is Naive Bayes Classifier in machine learning | How does Naive Bayes Classifier work",
    "Introduction to Naive Bayes Classifier in Machine Learning. What does naive Bayes classifier do? What is naive Bayes classifier ..."
  ],
  [
    "Using Naive Bayes to Detect Hate Speech: Explained",
    "We go through a quick example of how the Naive Bayes algorithm would be used to detect Hate Speech in online comments."
  ],
  [
    "DEMO on Different Types of Naive Bayes Classifier|Gaussian, Multinomial and Bernoulli | AI with AI",
    "In earlier videos, we have seen What is Naive Bayes and Demo on Gaussian Naive Bayes with Iris DataSet. This video will help ..."
  ],
  [
    "Why Naive Bayes Algorithm is NOT affected by Feature Scaling | Interview Question #Shorts",
    "Why Naive Bayes Algorithm is NOT affected by Feature Scaling is a short video for Machine Learning Interview Question ..."
  ],
  [
    "Naive Bayes Algorithm | Naive Bayes Classifier | Machine Learning",
    "Naive Bayes is the most important supervised machine learning. The complete math, Bayes theorem, and its application is ..."
  ],
  [
    "KFU1108 MACHINE LEARNING KLASIFIKASI NAIVE BAYES",
    "machinelearning #naivebayesalgorithm #naivebayesclassifierinpython machine learning machine learning algorithms machine ..."
  ],
  [
    "Naive Bayes Classifier || Supervised Learning || Machine Learning || Artificial Intelligence",
    "naivebayesclassifier #machinelearning #AI."
  ],
  [
    "Tutorial 16: Naive Bayes Classification in machine learing | Bayesian Classifier in machine learing",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Do Subscribe, likes and Shares to others... Hi, Well come to ..."
  ],
  [
    "I2ML - Supervised Classification - Naive Bayes",
    "This video is part of the open source online lecture \"Introduction to Machine Learning\". URL: https://slds-lmu.github.io/i2ml/"
  ],
  [
    "Naive Bayes text classification | Bournali model | Machine Learning (Bangla )",
    "naiveBayes #bournaliModel #textClassifier."
  ],
  [
    "Python Machine Learning Mini Series - Training KNN, Naive Bayes and Decision Tree Algorithms",
    "In this video we train k Nearest Neighbors, Naive Bayes and Decision Tree algorithms and then use these models to make ..."
  ],
  [
    "03.pre.03 « Naïve Bayes Runthrough « Machine Learning « NUS School of Computing",
    ""
  ],
  [
    "Naive Bayes Algorithm in Machine Learning || Explained!!! Big Data Knowledge Hunt Official",
    "Hello friends! In today's video we talk about Naive Bayes algorithm in machine learning. It is a classification based algorithm ..."
  ],
  [
    "02 - Gaussian Naive Bayes Classifier in Python | Naive Bayes Machine Learning Algorithm Urdu/Hindi",
    "02 - Gaussian Naive Bayes Classifier in Python | Naive Bayes Machine Learning Algorithm Urdu/Hindi What is Gaussian Naive ..."
  ],
  [
    "Classification technique || Naive bayes classifier || Part 1 || Machine learning || Seeratpreet",
    "First part of naive bayes classification technique. I.hope you would like it. stay tuned for the second part. Thank you."
  ],
  [
    "Spam Filtering | Naïve Bayes Classifier | Machine Learning Project",
    "Source Code :- https://github.com/kumudunee/Spam-Filter.git Spam Filtering Spam detection using Naïve Bayes Classifier ..."
  ],
  [
    "Naive Bayes by Tom Mitchell",
    "In order to get the lecture slide go to the following link: ..."
  ],
  [
    "Naive Bayes  Classifier in Machine Learning.",
    "Class Date: 21. 12. 21."
  ],
  [
    "Naïve Bayes Classifier – Part 1  ( Probability Basics) KTU Machine Learning Module 3",
    "Probability Basics."
  ],
  [
    "Spam HAM filtering prediction Naive Bayes Algorithm Machine Learning | Spam Ham prediction Project",
    ""
  ],
  [
    "Machine Learning: Naive Bayes Classifier Gaussian تعلم الآلة: خوارزمية ننيف بيز 4",
    "Machine Learning: Naive Bayes Classifier Gaussian تعلم الآلة: خوارزمية ننيف بيز 4."
  ],
  [
    "Naive Bayes Theorem | Classification | Supervised Learning | Machine Learning",
    "naivebayestheorm #naiebayesrule #naivebayes This video contains information regarding Naive Bayes Theorem its explanation ..."
  ],
  [
    "Naive Bayes Classification in Machine Learning",
    "Naive Bayes Classification in Machine Learning."
  ],
  [
    "Datasciencing vehicle purchasing using Machine Learning method Naive Bayes with Python.",
    "A moderately technical video using Machine Learning method Naive Bayes with Python. To establish a good model that predicts if ..."
  ],
  [
    "How to Build a Gaussian Naive Bayes Classifier from Scratch",
    "How to build a Gaussian Naive bayes classifier from scratch using python, numpy, and pandas Read the blog post here: ..."
  ],
  [
    "How Naive Bayes algorithm works? | MACHINE LEARNING IN KANNADA #17 | Charan H U",
    "How Naive Bayes algorithm works? | MACHINE LEARNING IN KANNADA #17 Hello friends!, In this video I explained about How ..."
  ],
  [
    "6. Gaussian Naive Bayes Classifier Algorithm to classify the person as Male or Female Solved Example",
    "6. Gaussian Naive Bayes Classifier Algorithm to classify the person as Male or Female Solved Example by Dr. Mahesh Huddar ..."
  ],
  [
    "Naïve Bayes Algorithm | Naïve Bayes Classifier in Python | Machine Learning |Inspired- CodewithHarry",
    "MachineLearningUsingPython#Inspiredby#Harrybhai#MachineLearningTraning In this tutorial, we will provide you with a detailed ..."
  ],
  [
    "Naive Bayes Classifier in Python (from scratch!)",
    "Let's create a Naive Bayes classifier with barebone NumPy and Pandas! You'll learn how to deal with continuous features and ..."
  ],
  [
    "02 - Gaussian Naive Bayes Classifier in Python | Naive Bayes Machine Learning Algorithm Urdu/Hindi",
    "02 - Gaussian Naive Bayes Classifier in Python | Naive Bayes Machine Learning Algorithm Urdu/Hindi What is Gaussian Naive ..."
  ],
  [
    "Naive Bayes Machine Learning Algorithm-ML-S1E6 |Archit Raj |TechTable",
    "The video will provide you with a detailed and comprehensive knowledge of the Naive Bayes Classifier Algorithm in python."
  ],
  [
    "Naive Bayes - Class Conditional Independence",
    ""
  ],
  [
    "How Naive Bayes algorithm works? | MACHINE LEARNING IN KANNADA #17 | Charan H U",
    "How Naive Bayes algorithm works? | MACHINE LEARNING IN KANNADA #17 Hello friends!, In this video I explained about How ..."
  ],
  [
    "NAIVE BAYES | HOW IT WORKS | Part - 1 | Machine Learning",
    "Hey guys ! welcome to my channel here i upload videos related to programming , machine learning , data science in hindi."
  ],
  [
    "Naive Bayes Theorem | Classification | Supervised Learning | Machine Learning",
    "naivebayestheorm #naiebayesrule #naivebayes This video contains information regarding Naive Bayes Theorem its explanation ..."
  ],
  [
    "Classification in machine learning (gaussian naive bayes classifier) Part 3 - AI Lecture",
    "Naive bayes with continuous variables."
  ],
  [
    "Spam Detection With Naive Bayes (Intro To Machine Learning Web Apps)",
    "Spam Detection With Naive Bayes (Intro To Machine Learning Web Apps With Flask) Learning how to extract features from text ..."
  ],
  [
    "Naive Bayes Classification in Machine Learning",
    "Naive Bayes Classification in Machine Learning."
  ],
  [
    "Machine Learning Project - Model Using Naive Bayes",
    "Models in machine learning are well defined computations formed as the result of an algorithm that takes some values as input ..."
  ],
  [
    "Complete Machine Learning playlist",
    ""
  ],
  [
    "Datasciencing vehicle purchasing using Machine Learning method Naive Bayes with Python.",
    "A moderately technical video using Machine Learning method Naive Bayes with Python. To establish a good model that predicts if ..."
  ],
  [
    "Naive Bayes Classifier Introduction with Implementation | Lec 38 | Machine Learning | GATE CSE Exam",
    "In this live lecture, you will learn the Machine Learning for GATE Computer Science Engineering Exam. Arun Sir has covered ..."
  ],
  [
    "Machine Learning:  Naive Bayes Classifier Basics",
    ""
  ],
  [
    "Naive bayes text classifier | Multinomial  model | Machine Learning Bangla",
    "naiveBayes #multinomialModel #textClassifier."
  ],
  [
    "Naive bayes algorithm in machine learning explained in hindi || Naive Bayes#machinelearning",
    "Hello Guys Hope you are all doing well.....!!! In this video I have explained , a basic conceptual properties of naive bayes algorithm ..."
  ],
  [
    "Naive bayes algorithm in machine learning explained in hindi  with tenis datset example",
    "Hello Guys Hope you are all doing well.....!!! In this video I have explained , a basic conceptual properties of naive bayes algorithm ..."
  ],
  [
    "Machine Learning: Naive Bayes Classifier Gaussian تعلم الآلة: خوارزمية ننيف بيز 4",
    "Machine Learning: Naive Bayes Classifier Gaussian تعلم الآلة: خوارزمية ننيف بيز 4."
  ],
  [
    "Machine Learning - Python Naïve Bayes Spam Classifier | Part 2 | Run ML Model against Inbox",
    "In this Video, we're going to import the Spam Classifier Model we build in the previous video. Our goal is to run the Spam ..."
  ],
  [
    "Naive Bayes for MNIST Classification - AI for Aspiring Researchers",
    "Lecture 2 - Naive Bayes for MNIST Classification - AI for Aspiring Researchers 24:13 - Should be 870 out of 10000, not 60000 as it ..."
  ],
  [
    "naive Bayesian classifier in Kannada | naive bayes classifier | Naive Bayes Algorithm | VTU ML Lab",
    "Hello friends!. In this video, I explained the naive Bayesian classifier in the Kannada language. I hope my explaning approach will ..."
  ],
  [
    "Cornell CS 5787: Applied Machine Learning. Lecture 8. Part 3: Naive Bayes (Learning)",
    ""
  ],
  [
    "What is Naive Bayes Classifier? | Naive Bayes Classifier in Machine Learning for Data Science",
    "Naive Bayes Algorithms of Supervised Machine Learning covered in this video. Naive Bayes is a classification technique based ..."
  ],
  [
    "Machine Learning Zero to Hero in Bangla | part 14 | Naive Bayes Classifier Advantages",
    "The following are some of the benefits of the Naive Bayes classifier: It is simple and easy to implement It doesn't require as much ..."
  ],
  [
    "Bernoulli Naive Bayes implementation",
    ""
  ],
  [
    "Why Naive Bayes Is Cool - Georgia Tech - Machine Learning",
    "Watch on Udacity: https://www.udacity.com/course/viewer#!/c-ud262/l-478818537/m-482228629 Check out the full Advanced ..."
  ],
  [
    "Bayes theorem | Naive Bayes Classifier | VTU Machine learning 5th prgrm",
    ""
  ],
  [
    "Naive Bayes Classifier MATLAB Implementation",
    "Dataset: https://github.com/SatadruMukherjee/Dataset/blob/main/Social_Network_Ads.csv Code: clc clear all close all warning off ..."
  ],
  [
    "Paris Machine Learning #6 season 4, symbolic AI, recommendations &amp; naïve Bayes",
    "for more info on the program: http://nuit-blanche.blogspot.com/2017/02/ce-soir-paris-machine-learning-6-season.html."
  ],
  [
    "How to use naive bayes in machine learning (part 1)",
    "In this vedio we will learn about naive bayes theorem .We will continue this in our second vedio.If you liked this then you can join ..."
  ],
  [
    "Naive Bayes Part7 தமிழ் | Spam or Ham email classification using Naive Bayes | Sklearn MultinomialNB",
    "Naive Bayes classifier for machine learning in tamil தமிழ் what is Bayes' theorem ? In probability theory and statistics, ..."
  ],
  [
    "Spam Filtering | Naïve Bayes Classifier | Machine Learning Project",
    "Source Code :- https://github.com/kumudunee/Spam-Filter.git Spam Filtering Spam detection using Naïve Bayes Classifier ..."
  ],
  [
    "MACHINE LEARNING AND ITS APPLICATION – NAÏVE BAYES CLASSIFICATION FOR TEXT Algorithm",
    "GREETINGS FROM XERXEZ IT TRAINING AND PROJECTS MACHINE LEARNING AND ITS APPLICATION – NAÏVE BAYES ..."
  ],
  [
    "Learn naive Bayes for text classification..!!",
    ""
  ],
  [
    "Part - 2 || Naive bayes classifier || Classification technique || Machine learning || Seeratpreet",
    "This video contains the Second part of naive bayes classifier in which naive bayes explained with the solved example. I hope you ..."
  ],
  [
    "13 - Naive Bayes Classifier in Machine Learning  - Theory",
    "تم رفع الملفات على الرابط التالي : https://github.com/muhammedessa/Machine-Learning-with-Python."
  ],
  [
    "Introduction to Naive Bayes Function of Disease-prediction-using-Machine-Learning-Naive Bayes 5/9",
    ""
  ],
  [
    "Naive Bayes using Scikit Learn||Machine Learning Tutorial||Part-14||Malayalam",
    "Naive Bayes using Scikit Learn||Machine Learning Tutorial||Part-14||Malayalam This part of \"Machine Learning Tutorial\" in ..."
  ],
  [
    "Getting Started with Machine Learning in R: Naive Bayes on the Pima dataset | packtpub.com",
    "This video tutorial has been taken from Getting Started with Machine Learning in R. You can learn more and buy the full video ..."
  ],
  [
    "03.pre.04 « Naïve Bayes Notebook « Machine Learning « NUS School of Computing",
    ""
  ],
  [
    "1.  Bayesian Belief Network | BBN | Solved Numerical Example | Burglar Alarm System by Mahesh Huddar",
    "1. Bayesian Belief Network (BBN) Solved Numerical Example Burglar Alarm System by Mahesh Huddar Example - 2: ..."
  ],
  [
    "Naive Bayes Classification #artificialintelligence #machinelearning 🤖",
    "https://youtu.be/d4jjFJFfzq8."
  ],
  [
    "Java Projects with Source Code || Text Classification using Naive Bayes  || Machine Learning",
    "Thanks for watching this video. Please Hit Like and Subscribe to my channel ..."
  ],
  [
    "Machine Learning Blink 3.7 (Hands-on step-by-step quadratic Naive Bayes classifier example)",
    "BayesClassifer #machineLearning #classification The PDF notes of this lecture is downloadable at: ..."
  ],
  [
    "Naive Bayes Variants: What is Gaussian Naive Bayes in machine learning?",
    "Naive Bayes Variants: What is Gaussian Naive Bayes in machine learning?"
  ],
  [
    "Lecture 24: Naive Bayes Classifier, And Introduction to Ensemble Machine Learning",
    "CSCI-4930/5930: Machine Learning (Spring 2020) at University of Colorado Denver (CU Denver) Instructor: Ashis Kumer Biswas ..."
  ],
  [
    "Final year project -“ Filtering the spam mail using naive bayes algorithm”|Major project |Batch 11",
    ""
  ],
  [
    "Naive Bayes Algorithm | Machine Learning from Scratch | Upskill with GeeksforGeeks",
    "Hop on to module no. 4 of your machine learning journey from scratch, that is Classification. In this video we will discuss all about ..."
  ],
  [
    "Machine Learning (Module 4) BAYEIAN LEARNING: Naïve Bayes Classifier",
    "Machine Learning (Module 4) BAYEIAN LEARNING: Naïve Bayes Classifier."
  ],
  [
    "Machine Learning Blink 3.7 (Hands-on step-by-step quadratic Naive Bayes classifier example)",
    "BayesClassifer #machineLearning #classification The PDF notes of this lecture is downloadable at: ..."
  ],
  [
    "Naive Bayes Algorithm | Machine Learning from Scratch | Upskill with GeeksforGeeks",
    "Hop on to module no. 4 of your machine learning journey from scratch, that is Classification. In this video we will discuss all about ..."
  ],
  [
    "Machine Learning: Naive Bayes text classifier model",
    "6Benches.in the best among all machine learning training institutes in Bangalore for freshers and experienced, offers 3 months ..."
  ],
  [
    "Naive Bayes -Part2 | Types of model ,| Machine learning | Hindi",
    "Hey guys ! welcome to my channel here i upload videos related to programming , machine learning , data science in hindi."
  ],
  [
    "Naive Bayes - Machine Learning",
    "Marliana Safitri 11750124903 Machine Learning / B Naive Bayes."
  ],
  [
    "Naive Bayes classifier | Bayesian Classification in data mining | Example | Machine Learning",
    "Naive Bayes classifier in Hindi is explained here with fully solved example. Bayesian Classification in data mining or in Machine ..."
  ],
  [
    "Machine Learning Tutorial 4 (Probabilistic Classifiers and Naive Bayes)",
    "0:30 - Probabilistic Classifiers recap 7:50 - Discriminative vs. Generative Approach 25:40 - Naive Bayes (NB) Motivation 38:40 ..."
  ],
  [
    "Data Science &amp; Machine Learning - Naive Bayes Handson contd- DIY- 33 -of-50",
    "Data Science & Machine Learning - Naive Bayes Handson contd- DIY- 33 -of-50 Do it yourself Tutorial by Bharati DW ..."
  ],
  [
    "Part IV: Naive Bayes Numeric Attributes, Supervised, Classification, Data Mining, Machine Learning",
    "This video explains how to solve problems when training data contains numeric attributes.Normal distribution, posterior, likelihood ..."
  ],
  [
    "Description of Naive Bayes Function of Disease-prediction-using Machine Learning-Naive Bayes 7/9",
    ""
  ],
  [
    "1.  Bayesian Belief Network | BBN | Solved Numerical Example | Burglar Alarm System by Mahesh Huddar",
    "1. Bayesian Belief Network (BBN) Solved Numerical Example Burglar Alarm System by Mahesh Huddar Example - 2: ..."
  ],
  [
    "Complete Machine Learning playlist",
    ""
  ],
  [
    "Naive Bayes شرح  خوارزمية",
    ""
  ],
  [
    "Naive Bayes Classifier-Machine Learning",
    "Naive Bayes Classifier is a classification algorithm based on the Bayes Theorem. This tutorial is part of a live class held at Total ..."
  ],
  [
    "Titanic Probability of Surviving with Naive Bayes Classification in Python",
    "Naive Bayes classifiers are built on Bayesian classification methods. These rely on Bayes's theorem, which is an equation ..."
  ],
  [
    "Naive Bayes | Day 19 | Statistics for Machine Learning Tutorial",
    "NaiveBayes #MachineLearning #Learnbay For Machine Learning enthusiasts, EDA — Exploratory Data Analysis — does this."
  ],
  [
    "Machine Learning - Basics of Classification: Naive Bayes Classifier",
    "This is the first in a series of videos, where I explain machine learning algorithms in a simple and practically usable way."
  ],
  [
    "028-Document Classification using Naive Bayes",
    "Now that we know how to do word pre-processing, we can try our hand at classifying documents using the Naive Bayes algorithm."
  ],
  [
    "Machine Learning MOST IMP SOLVED EXAMPLE(Backpropagation, NN, Naive Bayes, DT, k-NN)",
    "Backpropagation neural networks, Naive Bayes, Decision Trees, k-NN, Associative Classification."
  ],
  [
    "Machine Learning - Naive Bayes Classifier",
    ""
  ],
  [
    "Naive Bayes Theory and Code in Python | Part 9 | Machine Learning in Python | The Data Monk",
    "Website - https://thedatamonk.com/ Get all the youtube videos here ..."
  ],
  [
    "CMPS 460 | Machine Learning | S22 | Session 8.d | Probabilistic Modeling (Naive Bayes III)",
    "Lecture (d) of Session 8 of CMPS 460 Machine Learning, Spring 2022 course at Qatar University by Dr. Tamer Elsayed ..."
  ],
  [
    "Naive Bayes Classifier  |  Tutorial 17  | Machine Learning in Hindi",
    "Hello All, In this video, we will be understanding the Naive Bayes Classifier with an example. GITHUB:https://github.com/chb005 ..."
  ],
  [
    "Naive Bayesian Classifier Program in Kannada | naive bayes classifier | VTU ML Lab | Naive Bayes",
    "Hello friends!. In this video, I explained the Naive Bayesian Classifier Program in the Kannada language. I hope my explaining ..."
  ],
  [
    "Machine learning :Classification -Naive bayes algorithm in python",
    ""
  ],
  [
    "Machine Learning: Multinomial Naive Bayes Classifier with SK-Learn Demonstration",
    ""
  ],
  [
    "Machine Learning-Naive Bayes and Linear Regression",
    "Dataset üzerinde Naive Bayes ve Linear Regression Algoritmalarının uygulaması. GitHub: https://github.com/minaodabas."
  ],
  [
    "Naive Bayes Spam Classification",
    "In this video we learn how to use the Naive Bayes algorithm to perform spam classification. This is a natural language processing ..."
  ],
  [
    "Machine Learning Algorithm With R of naive Bayes Problem (BostonHousing data )Date: 21.12.21",
    "Class Lecture date: 21.12.21."
  ],
  [
    "Multinomial Naive Bayes Algorithm| Machine learning algorithm | Probability |Artificial intelligence",
    "Multinomial_Naive_Bayes_Machine_learning Explained very important algorithm of machine learning that is Multinomial Naive ..."
  ],
  [
    "Implementation of Naive Bayes classifier on Wine Dataset | Naive Bayes Classifier in Data Science",
    "Wine Dataset implementation on Naive Bayes Algorithms of Supervised Machine Learning covered in this video. Naive Bayes is a ..."
  ],
  [
    "Prediction Analysis of Heart Patients using Naive Bayes and Random Forest Algorithms",
    "Introduction Heart Diseases remain the biggest cause of deaths for the last two epochs. Recently computer technology develops ..."
  ],
  [
    "Naive Bayes Classifier in Matlab",
    "This is a short demo of how to implement a naive Bayes classifier in Matlab."
  ],
  [
    "Machine Learning: Reinforcement learning, Pandas, Naive Bayes",
    "As an innovative teaching-learning process I asked my third year B. Tech. Computer students to create presentations on different ..."
  ],
  [
    "Lecture 7: Bayes Theorem, Bayesian Belief Network, Naive Bayes and EM Algorithm | Machine Learning",
    "This video will talk about bayes theorem, bayesian belief network, naive bayes and EM Algorithm in machine learning. All these ..."
  ],
  [
    "Machine Learning - 08 - Naive Bayes in R",
    "Upsample/Downsample imbalanced dataset and predicting diabetes using naive Bayes in R. You can follow me on Quora: ..."
  ],
  [
    "IAML5.10: Naive Bayes decision boundary",
    "http://bit.ly/N-Bayes] What does the decision boundary look like for a Naive Bayes classifier? When is it a straight line, an ellipsoid ..."
  ],
  [
    "Projects on Naive Bayes Classifier - 2 | Lec 40 | Machine Learning | GATE CSE Exam",
    "In this live lecture, you will learn the Machine Learning for GATE Computer Science Engineering Exam. Arun Sir has covered ..."
  ],
  [
    "Mathematics for Machine Learning - Lecture 5: Generative learning algorithms &amp; Naive Bayes",
    "This is the Zoom recording of the fifth lecture of the course \"Mathematics for Machine Learning\" at Nagoya University in Fall 2020."
  ],
  [
    "Introduction to Machine Learning and Naive Bayes model",
    "Machine learning (ML) is a field of inquiry devoted to understanding and building methods that 'learn', that is, methods that ..."
  ],
  [
    "[supervised learning] Naive Bayes Classifier",
    ""
  ],
  [
    "Machine Intelligence - Lecture 21 (Naive Bayes, Swarm Intelligence, Ant Colonies)",
    "SYDE 522 – Machine Intelligence (Winter 2019, University of Waterloo) Target Audience: Senior Undergraduate Engineering ..."
  ],
  [
    "Implementation of Naive Bayes Classifier from scratch, without using GaussianNB from scikit-learn",
    "In this video lecture, we will be implementing #NaiveBayes Classifier from scratch, without using GaussianNB API of scikit-learn."
  ],
  [
    "Machine Learning Class: Naïve Bayes: Part II",
    "Naive Bayes Classifier Learning and Inference Gaussian Naive Bayes Discrete Naive Bayes."
  ],
  [
    "Logistic Regression and Naive Bayes Classifier 2_5",
    ""
  ],
  [
    "Artificial Intelligence - S20 - Machine Learning I (Naive Bayes)",
    "Topic: Machine Learning I (Naive Bayes) Date: 4/23/2020 Course: DSCI 6670 / CSCI 6660 - Artificial Intelligence (Spring 2020) ..."
  ],
  [
    "Naive Bayes Supervised learning",
    "Explain supervised learning algorithm in Machine learning."
  ],
  [
    "CMPS 460 | Machine Learning | S22 | Session 8.c | Probabilistic Modeling (Naive Bayes II)",
    "Lecture (c) of Session 8 of CMPS 460 Machine Learning, Spring 2022 course at Qatar University by Dr. Tamer Elsayed ..."
  ],
  [
    "Machine learning Naive Bayes Technique by SETHURAMAN",
    "Using python applying machine learning Naive Bayes Gaussian technique on Iris data set."
  ],
  [
    "Naive Bayes algorithm(Machine learning algorithm)",
    "a very easy explanation of why the probability-based theorem is useful in solving classification problems."
  ],
  [
    "Lecture 15 - Naive Bayes Classifiers",
    "Lecture PDF: https://www.dropbox.com/s/d8fugrvpk9lw3le/Lec14-15-GenerativeModelsForDiscreteData.pdf?dl=0 Naive Bayes ..."
  ],
  [
    "[RoadToAIDeveloper] #1 - Machine Learning - Esercizi Udacity, Naive Bayes!",
    "Nuova Serie sul Machine Learning! Completo gli esercizi del tutorial di Udacity in live! Mi trovi dal Lunedì al Venerdì alle 14 in ..."
  ],
  [
    "Machine Learning - Classification Using Naive Bayes Method",
    ""
  ],
  [
    "The Math Behind Bayesian Classifiers Clearly Explained!",
    "In this video, I've explained the math behind Bayes classifiers with an example. I've also covered the Naive Bayes model."
  ],
  [
    "News Classification using SVM, n-grams, Naive Bayes and Deep Learning",
    "News Classification Built by - Anurag K, Mayank Kejriwal and Vivek Kapoor."
  ],
  [
    "ML.NET Naive Bayes Multi-Class Classifier C# Program   - Copyright www.jfs3tech.com",
    ""
  ],
  [
    "Machine learning | Naive Bayes classifier | Probability",
    "here I have explained the Naive Bayes classifier one of the machine learning algorithm Follow below link for Bayes theorem ..."
  ],
  [
    "Machine learning naive Bayes classifier",
    ""
  ],
  [
    "Naive Bayes Classifier - Machine Learning 03",
    "Naive Bayes Classifier, Smoothing ,Maximum Likelihood Estimation, Maximum A Posterior, Machine Learning 03."
  ],
  [
    "Chatbot Algorithms Comparison (Neural Network, Support Vector Machine, &amp; Naive Bayes)",
    "Intelligent Systems COMP6345 - Final Project Publication: ICISS 2021 Paper Number: 81 Group Members: 1. Christensen Mario ..."
  ],
  [
    "Language Identification  | NLP | Machine Learning | Python | sklearn | naive bayes  | multinomialnb",
    "In natural language processing, language identification or language guessing is the problem of determining which natural ..."
  ],
  [
    "Naïve Bayes Classifier Solved Example In Machine Learning",
    "Naïve Bayes Classifier Solved Example In Machine Learning Data Science Questions and Answers ..."
  ],
  [
    "Memory error in mini project naive bayes (intro to machine learning) udacity",
    "Memory Error while running mini project Naive Bayes - in Intro to Machine Learning udacity Solved."
  ],
  [
    "Naive Bayesian Classification - Classification - Data Mining and Business Intelligence",
    "Subject - Data Mining and Business Intelligence Video Name - Naive Bayesian Classification Chapter - Classification Faculty ..."
  ],
  [
    "Machine Learning Zero to Hero in Bangla | part 15 | Naive Bayes Classifier with Python Code",
    "Machine Learning Zero to Hero in Bangla | part 15 | Naive Bayes Classifier with Python Code Naive Bayes Bayes' Theorem ..."
  ],
  [
    "Naive Bayes in Machine Learning",
    ""
  ],
  [
    "MACHINE LEARNING: DIABETES CLASSIFICATION WITH GAUSSIAN NAIVE BAYES",
    "Authors: 1. Aditya Rahman (160535611825) 2. Galih Hadi Wibowo (160535611832) S1 Teknik Informatika 2016 A Universitas ..."
  ],
  [
    "Machine Learning Lecture 1.6 : Naive Bayes Algorithm",
    "Connect with me : https://www.linkedin.com/in/parth-modi-5587a1148/ Connect with me ..."
  ],
  [
    "Naive Bayes Classifier INDEPTH Intuition - #18",
    "In this video, we will learn about the concepts of the probability namely general rule of multiplication, conditional probability, and ..."
  ],
  [
    "Why is naive bayes so naive??",
    "Naive Bayes is a popular machine learning algorithm. Have you applied naive bayes?? Subscribe to the channel to stay on top of ..."
  ],
  [
    "Your first machine learning project in python step-by-step - Naive Bayes Algorithm implementation",
    "Your first machine learning project in python step-by-step - Naive Bayes Algorithm implementation."
  ],
  [
    "Naïve Bayes Classifier for Predicting the Novel Coronavirus | Python Final Year IEEE Project 2021",
    "Naïve Bayes Classifier for Predicting the Novel Coronavirus | Python Final Year IEEE Project 2021 - 2022. Buy Link: ..."
  ],
  [
    "Naive Bayes in Machine Learning",
    "Naive Bayes in Machine Learning."
  ],
  [
    "Naive Bayes Tutorial For Beginners | Naive Bayes Classifier | Edureka | Data Science Rewind - 2",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r-programming-certification-course This Edureka video will ..."
  ],
  [
    "Belajar Machine Learning &amp; Deep Learning Part 4 : Supervised Learning, Naive Bayes Classifier",
    "Part 1 Install Jupyter Notebook di Anaconda https://youtu.be/Ch55nITVFKs Part 2 Update Anaconda Navigator ..."
  ],
  [
    "4 - Naive Bayes Spam Detector with Python - Machine Learning Algorithms with Sklearn",
    "DONT CLICK HERE: https://tinyurl.com/TeddyCodingg Leave all your doubts in the comments ✌ Always a pleasure to help!"
  ],
  [
    "Naive Bayes Theorem In Machine Learning || MAKAUT || 7th sem",
    "pdf - https://drive.google.com/drive/folders/1IC_X31-lPUdf1eP-CCohbz1fU277iYVC."
  ],
  [
    "Naïve Bayes &quot;by hand&quot; in Excel - build actual model",
    ""
  ],
  [
    "How to use naive bayes in machine learning (part -2)",
    "This is continuation vedio from previous vedio if you have ot watched it then please watch it first.If you liked thid vedio then you ..."
  ],
  [
    "Web Scrapping | Machine Learning | Naive Bayes | Python",
    "Download Pycharm from this link: ttps://www.jetbrains.com/pycharm/download/#section=windows ..."
  ],
  [
    "Summary for Generative Models | Naive Bayes | Machine Learning (INF8245E) | Lecture-5 | Part-3",
    "This video summarizes probabilistic Generative Models with examples. For the tutorial playlist please refer ..."
  ],
  [
    "K Means Naive Bayes | Machine Learning | Craw Security",
    "Craw Security."
  ],
  [
    "NAIVE BAYES - PRÁCTICA | #48 Curso Machine Learning con Python",
    "Para este video continuaremos desarrollando el proyecto que hemos venido trabajando a lo largo de los algoritmos de ..."
  ],
  [
    "chain rule: a pre - requisite for naive bayes",
    "This is an in-depth explanation of the chain rule. We have also covered interview questions which are usually asked on Naive ..."
  ],
  [
    "10.  Naive Bayes   Machine Learning",
    ""
  ],
  [
    "Compare K-Nearest Neighbors, K-Means Clustering, and Naive Bayes machine learning algorithms",
    "Compare K-Nearest Neighbors, K-Means Clustering, and Naive Bayes machine learning algorithms Matlab code for Compare ..."
  ],
  [
    "Machine Learning Session 3 (Introduction to Naive Bayes and Gradient Descent Algorithm)",
    "Introduction to Naive Bayes and Gradient Descent Algorithm."
  ],
  [
    "Naive Bayes Intuition in machine learning  lecture #49",
    "The Link is in the Playlist Description!!! What you'll learn Learn how to solve real life problem using the Machine learning ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners | Naive Bayes Classifier | Edureka | DS Rewind -  1",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "AI3 Machine Learning Part 2 (kNN, Naive Bayes Classifier, and Ensembles)",
    ""
  ],
  [
    "Naïve Bayesian Classification (Tamil)",
    "Dr.R.Satheeskumar Naïve Bayesian Classification in Tamil What is Naïve? Bayes' Theorem with Example. Naïve Bayesian ..."
  ],
  [
    "Machine Learning - Naive Bayes Classifier",
    "VISIT OUR WEBSITE: https://www.pakus.co.id/ FOLLOW US ON INSTAGRAM: https://www.instagram.com/pakusid/ FOLLOW US ..."
  ],
  [
    "CMPS 460 | Machine Learning | S22 | Session 8.b | Probabilistic Modeling (Naive Bayes I)",
    "Lecture (b) of Session 8 of CMPS 460 Machine Learning, Spring 2022 course at Qatar University by Dr. Tamer Elsayed ..."
  ],
  [
    "Gaussian Naive Bayes Code on Cardio Data set || Lesson 54 || Machine Learning || Learning Monkey ||",
    "machinelearning#learningmonkey In this class, we discuss Gaussian Naive Bayes Code on the Cardio Data set. For a better ..."
  ],
  [
    "DSE Final Project Presentation: Priority Mailbox Classifier using Naive Bayes Machine Learning",
    "Final Project Presentation for UIS CSC570: Data Science Essentials."
  ],
  [
    "Naive Bayes 1: The Formula",
    "http://bit.ly/N-Bayes] Components of the Naive Bayes classifier: the prior, the class model and the normalizer."
  ],
  [
    "Chapter 4:Supervised Classification: Naive Bayes in Machine learning بالعربي التصنيف الخاضع للإشراف",
    "NAIVE BAYES CLASSIFIER conditional independence assumption NUMERICAL FEATURES CATEGORICAL FEATURES ..."
  ],
  [
    "Classification Using Naive Bayes Method - Part 2 KTU S7 SYLLABUS MACHINE LEARNING",
    "Classification Using Naive Bayes Method - Part 2 KTU S7 SYLLABUS MACHINE LEARNING."
  ],
  [
    "Lecture 16 | 18 May | Naive Bayes | Machine learning",
    ""
  ],
  [
    "Machine Learning - All about Naive Bayes Classifier Model and comparison.",
    "Feel free to ask your doubts in the comment section."
  ],
  [
    "How to use naive bayes in machine learning (part -2)",
    "This is continuation vedio from previous vedio if you have ot watched it then please watch it first.If you liked thid vedio then you ..."
  ],
  [
    "Naive Bayesian Classification - Classification - Data Mining and Business Intelligence",
    "Subject - Data Mining and Business Intelligence Video Name - Naive Bayesian Classification Chapter - Classification Faculty ..."
  ],
  [
    "DSE Final Project Presentation: Priority Mailbox Classifier using Naive Bayes Machine Learning",
    "Final Project Presentation for UIS CSC570: Data Science Essentials."
  ],
  [
    "10.  Naive Bayes   Machine Learning",
    ""
  ],
  [
    "L2/6 Naive Bayes Jupyter",
    "Dive into Deep Learning UC Berkeley, STAT 157 Slides are at http://courses.d2l.ai The book is at http://www.d2l.ai Naive Bayes ..."
  ],
  [
    "Web Scrapping | Machine Learning | Naive Bayes | Python",
    "Download Pycharm from this link: ttps://www.jetbrains.com/pycharm/download/#section=windows ..."
  ],
  [
    "K Means Naive Bayes | Machine Learning | Craw Security",
    "Craw Security."
  ],
  [
    "Naive Bayes Theorem In Machine Learning || MAKAUT || 7th sem",
    "pdf - https://drive.google.com/drive/folders/1IC_X31-lPUdf1eP-CCohbz1fU277iYVC."
  ],
  [
    "Machine Learning Session 3 (Introduction to Naive Bayes and Gradient Descent Algorithm)",
    "Introduction to Naive Bayes and Gradient Descent Algorithm."
  ],
  [
    "AI3 Machine Learning Part 2 (kNN, Naive Bayes Classifier, and Ensembles)",
    ""
  ],
  [
    "Machine Learning - Naive Bayes Classifier",
    "VISIT OUR WEBSITE: https://www.pakus.co.id/ FOLLOW US ON INSTAGRAM: https://www.instagram.com/pakusid/ FOLLOW US ..."
  ],
  [
    "Praktikum Machine Learning 5 - Naive Bayes - 183040083",
    "Naive Bayes with Variance Threshold, Mutual Information, dan K Fold Cross-Validation Ridha Ahmad Firdaus - 183040083."
  ],
  [
    "Summary for Generative Models | Naive Bayes | Machine Learning (INF8245E) | Lecture-5 | Part-3",
    "This video summarizes probabilistic Generative Models with examples. For the tutorial playlist please refer ..."
  ],
  [
    "Text Classification Using Naive Bayes Naive Bayes Algorithm In Machine Learning Simplilearn",
    ""
  ],
  [
    "Naive Bayes Intuition in machine learning  lecture #49",
    "The Link is in the Playlist Description!!! What you'll learn Learn how to solve real life problem using the Machine learning ..."
  ],
  [
    "chain rule: a pre - requisite for naive bayes",
    "This is an in-depth explanation of the chain rule. We have also covered interview questions which are usually asked on Naive ..."
  ],
  [
    "Lecture 16 | 18 May | Naive Bayes | Machine learning",
    ""
  ],
  [
    "12 - Simple Naive Bayes (Telugu) - తెలుగు",
    "12 - Simple Naive Bayes (Telugu) - తెలుగు Name: Meeraj Kanaparthi Medium: ..."
  ],
  [
    "Machine Learning: k-NN and Naive Bayes",
    "Name of creator: Sergio Itzman Montiel Montero Year: 2021 City/State/Country: Puebla, Puebla, México Details Video: In this ..."
  ],
  [
    "Machine Learning   Naive Bayes Classifier",
    ""
  ],
  [
    "Chapter 4:Supervised Classification: Naive Bayes in Machine learning بالعربي التصنيف الخاضع للإشراف",
    "NAIVE BAYES CLASSIFIER conditional independence assumption NUMERICAL FEATURES CATEGORICAL FEATURES ..."
  ],
  [
    "Machine Learning - All about Naive Bayes Classifier Model and comparison.",
    "Feel free to ask your doubts in the comment section."
  ],
  [
    "Classification Using Naive Bayes Method - Part 2 KTU S7 SYLLABUS MACHINE LEARNING",
    "Classification Using Naive Bayes Method - Part 2 KTU S7 SYLLABUS MACHINE LEARNING."
  ],
  [
    "Naive Bayes pada Machine Learning",
    "link dataset : https://www.kaggle.com/mssmartypants/water-quality."
  ],
  [
    "Fake Review Detection Using Machine Learning Naive Bayes Algorithm PYTHON PROJECT",
    "Fake Review Detection Using Machine Learning-Naive Bayes Algorithm PYTHON PROJECT www.phdresearchlabs.com ..."
  ],
  [
    "Gaussian Naive Bayes Code on Cardio Data set || Lesson 54 || Machine Learning || Learning Monkey ||",
    "machinelearning#learningmonkey In this class, we discuss Gaussian Naive Bayes Code on the Cardio Data set. For a better ..."
  ],
  [
    "Naive Bayes Tutorial For Beginners | Naive Bayes Classifier | Edureka | Data Science Rewind - 2",
    "Edureka Data Science Training: https://www.edureka.co/data-science-r-programming-certification-course This Edureka video will ..."
  ],
  [
    "CMPS 460 | Machine Learning | S22 | Session 8.b | Probabilistic Modeling (Naive Bayes I)",
    "Lecture (b) of Session 8 of CMPS 460 Machine Learning, Spring 2022 course at Qatar University by Dr. Tamer Elsayed ..."
  ],
  [
    "#Machine Learning #NaiveBayes #Classification using #Python #Netobook|#12",
    "This channel will acknowledge you about Machine learning for data science in python, If you didn't watch the previous video click ..."
  ],
  [
    "Naive Bayes Classifier - Machine Learning | perhitungan manual",
    "Assalamualaikum wr.wb Video ini dibuat untuk memenuhi tugas dari Mata Kuliah Machine Learning Nama : Fuji Astuti Nim ..."
  ],
  [
    "Machine Learning | Classification | Naive Bayes Classification",
    "This video describes the Naive Bayes Classification with a solved problem."
  ],
  [
    "Naive Bayes. An example in R",
    "Using the naive Bayes algorithm to detect spam. (As in Bret Lanz book \"Machine Learning in R\".)"
  ],
  [
    "Description of Naive Bayes Function of Disease-prediction-using Machine Learning-Naive Bayes 9/9",
    ""
  ],
  [
    "CLASSIFICATION USING NAIVE BAYES METHOD - KTU S7 SYLLABUS MACHINE LEARNING",
    "CLASSIFICATION USING NAIVE BAYES METHOD - KTU S7 SYLLABUS MACHINE LEARNING."
  ],
  [
    "Why is Naive Bayes naive - Advanced Machine Learning and Signal Processing",
    "Link to this course: ..."
  ],
  [
    "Fake Review Detection Using Machine Learning-Naive Bayes Algorithm PYTHON  PROJECT",
    "Fake Review Detection Using Machine Learning-Naive Bayes Algorithm PYTHON PROJECT Download source code @ WWW."
  ],
  [
    "Naive Bayes on Titanic dataset using Python and R",
    "naive bayes machine learning tutorial: Naive bayes theorm uses bayes theorm for conditional probability with a naive assumption ..."
  ],
  [
    "Naive Bayes Part4 தமிழ் | Laplace smoothing | zero probability | underfit overfit in naive bayes",
    "Naive Bayes classifier for machine learning in tamil தமிழ் what is Bayes' theorem ? In probability theory and statistics, ..."
  ],
  [
    "Naive Bayes Classifier | Lecture 2 (Part 2) | Intro to Machine Learning in R",
    "Naive Bayes Classifier Course Materials: https://github.com/maziarraissi/Introduction-to-Machine-Learning-in-R."
  ],
  [
    "Python - Anaconda - Jupyter Notebook - Random Forest, Naive Bayes, Regressão Logistica",
    "Python - Anaconda - Jupyter Notebook - Random Forest, Naive Bayes, Regressão Logistica."
  ],
  [
    "Titan Lake AutoML (Machine Learning), part 2: KNN, Naive-Bayes classifiers, google sheet",
    "Demonstration using AutoML (Automated Machine Learning) software from Titan Lake. KNN Classification and Gaussian ..."
  ],
  [
    "Naive Bayes Classifier Tutorial For Beginners | Naive Bayes Classifier | Edureka | DS Rewind -  1",
    "Edureka Data Science with Python Certification Course ..."
  ],
  [
    "Mathematics for Machine Learning   Lecture 5  Generative learning algorithms &amp; Naive Bayes",
    "machinelearning #ML is a type of #artificialintelligence #AI that allows software applications to become more accurate at ..."
  ],
  [
    "How to solve Naive Bayes Classifier in Machine Learning? | Machine Learning | DSL Media",
    "How to solve Naive Bayes Classifier in Machine Learning? | Machine Learning | DSL Media #naivebayes #naivebayesexamples ..."
  ],
  [
    "Machine Learning Tutorial 10: Implementation of Naive Bayes classifier",
    ""
  ],
  [
    "Aggressive language detector | NLP | Machine learning | SVM | Logistic regression | Naive Bayes",
    "Purpose of this project is to analyze the Jigsaw comment dataset and classify the data based on toxicity Three algorithms were ..."
  ],
  [
    "Naive Bayes from Scratch in Python: 1. Step of the Algorithm",
    "In this series, we are going to code a Naive Bayes classifier from scratch in Python. And in this video, we are going to write the ..."
  ],
  [
    "Bank Transaction Classification (Naive Bayes)",
    ""
  ],
  [
    "Naive Bayes Classifier Indepth Intuition with Solved Examples | Machine learning in Urdu/Hindi",
    "Naive Bayes Classifier Indepth Intuition with Solved Examples | Machine learning."
  ],
  [
    "ALGORITMA MACHINE LEARNING; NAIVE BAYES",
    ""
  ],
  [
    "Machine Learning Project || Build a Multi Class Text Classification Model || Naïve Bayes Example",
    "About Sia: CS PHD Machine Learning Engineer Software Engineer Hobby Tech Youtuber FAANG Tech Software Engineer Lab ..."
  ],
  [
    "4. Predicting Categories with Naive Bayes and SVMs",
    "Machine Learning with scikit-learn Quick Start Guide is available from: Packt.com: http://bit.ly/2FnS7km Amazon: ..."
  ],
  [
    "Machine Learning தமிழில் Tamil Part 5 | Naive Bayes &amp; Support Vector Machine SVM| bigdatahandson.com",
    "Todays Topic: Naive Bayes/Support vector machine Kaleel Ahamed 9789888424 Free online session on Data science /Machine ..."
  ],
  [
    "100 Days Of Machine Learning - Day 1 | Machine Learning, Naive bayes intuition and use case",
    "Join me on #100DaysOfML and follow along to learn machine learning! Day 1 In today's video, we will be discussing what is naive ..."
  ],
  [
    "[Simple] Naive Bayes",
    "Naive Bayes."
  ],
  [
    "Algoritma Machine Learning | Naive Bayes",
    ""
  ],
  [
    "Statistics for Data Science Naive Bayes Theory Excel Calculation Example Machine Learning",
    "Data Science, Machine Learning, Algorithm, Naive Bayes, Conditional Probability, Bayes Theorem, Laplace Correction."
  ],
  [
    "Lecture 23: Ethics in AI, and Introduction to Naive Bayes Classifier",
    "CSCI-4930/5930: Machine Learning (Spring 2020) at University of Colorado Denver (CU Denver) Instructor: Ashis Kumer Biswas ..."
  ],
  [
    "Naive Bayes - Machine Learning",
    "Video ini dibuat untuk memenuhi tugas mata kuliah Machine Learning yang diampu oleh Bapak Rosyid Video dibuat oleh: ..."
  ],
  [
    "Naive Bayes - Machine Learning",
    "Assalamualaikum Nama : Afrian. F NIM : 11751100064 Matkul : Machine Learning (Tugas Akhir) Semoga Dapat Bermanfaat,,, ..."
  ],
  [
    "Machine Learning Tutorial 11: Naive Bayes Continue",
    ""
  ],
  [
    "Machine Learning Task 3 | Linear Regression and Naive Bayes",
    "2018556038."
  ],
  [
    "What-If (Naive Bayes Classifier Visualization) within",
    "This video showcases the What-If feature within ESI Mineset, the web-based predictive analytics application."
  ],
  [
    "Machine Learning/Naive Bayes and Linear Regression",
    ""
  ],
  [
    "A machine learning approach to find spam messages using the Naive Bayes classifier algorithm 👾",
    "Naive_Bayes #Machine_Learning #Spam_Messages."
  ],
  [
    "[Machine Learning] Bài 2. Code Naive Bayes Models || Machine Learning using Julia || uniLearn",
    "LET'S LIKE AND SUBSCRIBE FOR CHANEL. THANKS ..."
  ],
  [
    "NAIVE BAYES-MACHINE LEARNING",
    "NAMA : MIFTAHUL IHSAN KELAS : MACHINE LEARNING B NIM : 117551100570."
  ],
  [
    "VTU AIML LAB6 NAIVE BAYES",
    "Understand the program better. AIML LAB PLAYLIST: ..."
  ],
  [
    "ALGORITMA NAIVE BAYES | MACHINE LEARNING SERIES #6",
    ""
  ],
  [
    "Machine Learning  - Naïve Bayes Classifier in STATISTICA",
    "Performing Machine learning analysis with Naive Bayes classifier in STATISTICA."
  ],
  [
    "Machine Learning Naive Bayes Theory &amp; KNN Imputation Vaccine Prediction Dataset Python",
    "K Nearest neighbors Imputation in Python."
  ],
  [
    "Gaussian NB Example",
    "This video is part of an online course, Intro to Machine Learning. Check out the course here: ..."
  ],
  [
    "Bayes Optimal Classifier &amp; Gibbs Algorithm",
    ""
  ],
  [
    "STATISTICS- Gaussian/ Normal Distribution",
    "In this video we are going to understand about Normal Distributions and about the Empirical Formula. Support me in Patreon: ..."
  ],
  [
    "Belajar Naive Bayes kurang dari 20 menit",
    "Naive bayes merupakan algoritma yang sangat populer untuk menyelesaikan masalah klasifikasi. Pada materi ini, kita akan ..."
  ],
  [
    "Naive Algorithm for Pattern Searching | GeeksforGeeks",
    "Our courses : https://practice.geeksforgeeks.org/courses/ This video is contributed by Meenal Agrawal. Please Like, Comment and ..."
  ],
  [
    "PROBABILISTIC CLASSIFIERS",
    "Explanation of Bayes theorem, Naive Bayes, and probabilistic classifiers."
  ],
  [
    "Learn Python [Algorithms and Data Structures] || 9.6 Naive bayesian example",
    "Description This course is about data structures, algorithms and graphs. We are going to implement the problems in Python ..."
  ],
  [
    "Machine Learning Projects For Beginners 2023 | Machine Learning Projects | ML Projects | Simplilearn",
    "This video will help you build various \" Machine Learning Projects For Beginners 2023 \" from scratch. Starting with Heart Disease ..."
  ],
  [
    "Day 29/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "SYDE 522 Machine Intelligence",
    ""
  ],
  [
    "Belajar Mudah Naive Bayes",
    "Naïve Bayes didasarkan pada Teorema Bayes yang juga dikenal sebagai Teorema bersyarat, yang dapat Anda anggap sebagai ..."
  ],
  [
    "Gibbs algorithm",
    "Gibbs Algorithm with example."
  ],
  [
    "What You Need to Know About OpenAI&#39;s New ChatGPT Bot - And How it Affects Cybersecurity? SANS Panel",
    "OpenAI is a leading research institute focused on developing artificial intelligence technology in a safe and responsible manner."
  ],
  [
    "Day 28/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "🔥Machine Learning With Python Full Course | Machine Learning Tutorial for Beginner | Simplilearn",
    "Free Machine Learning Course With Completion Certificate: ..."
  ],
  [
    "ML Stanford",
    ""
  ],
  [
    "Penjelasan Algoritma Naive Bayesian Classifier",
    "universitasbudidarma #eforibuulolo Penjelasan Algoritma Naive Bayesian Classifier."
  ],
  [
    "Gaussian or Normal Distribution in Hindi || Probability and Statistics for Machine Learning",
    "Gaussian or Normal Distribution in Hindi || Probability and Statistics for Machine Learning Probability and Statistics for Machine ..."
  ],
  [
    "Machine learning algorithms | Artificial Intelligence | cheatsheet | top machine learning algorithm",
    "Top 10 Machine Learning Algorithms For Beginners: Supervised, Unsupervised Learning and More By Simon Tavasoli Last ..."
  ],
  [
    "Logistic Regression Machine Learning || Easiest way in Hindi",
    "This video explain the concepts of Logistic Regression in Hindi .Logistic regression is used for classification problems in machine ..."
  ],
  [
    "distribusi gauss naive bayes",
    "minggu ke -7."
  ],
  [
    "Explore Random Forest Algorithm  | Machine Learning Training | Edureka | ML Rewind - 3",
    "Edureka Machine Learning Course Master Program ..."
  ],
  [
    "Complete Roadmap for Machine Learning - 2023🔥 | How To Become Machine Learning Engineer? 🤑",
    "Are you interested in staying up-to-date with the latest trends and developments in machine learning? Look no further! In this ..."
  ],
  [
    "IT Companies layoffs: கலக்கத்தில் ஊழியர்கள் | Layoffs | Recession | India | Tamil Nadu",
    "Across the world job cuts are on the rise and India is no exception. Several companies in India have announced layoffs and in the ..."
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Training | Edureka Rewind - 1",
    "Edureka Machine Learning Course Master Program ..."
  ],
  [
    "How Much Coding Do You Need For Data Science?",
    "Explaining how much coding I used in my uni degree and in my job day to day."
  ],
  [
    "Machine Learning Free Courses with Projects for College Submission | Heart Disease Classification",
    "Machine Learning Free Courses with Projects for College Submission | Heart Disease Classification #machinelearning ..."
  ],
  [
    "VTU AIML LAB1 ASTAR",
    "Understand the program better AIML LAB PLAYLIST: ..."
  ],
  [
    "VTU AIML LAB8 KNN CLASSIFICATION",
    "Understand the program better AIML LAB PLAYLIST: ..."
  ]
]