[
  [
    "Introduction to Reinforcement Learning | Scope of Reinforcement Learning by Mahesh Huddar",
    "Introduction to Reinforcement Learning | Scope of Reinforcement Learning by Mahesh Huddar Introduction to Reinforcement ..."
  ],
  [
    "Stanford CS234: Reinforcement Learning | Winter 2019",
    "This class will provide a solid introduction to the field of RL. Students will learn about the core challenges and approaches in the ..."
  ],
  [
    "Reinforcement Learning &amp; their Elements in Hindi | Machine learning tutorials",
    "Machinelearning #LMT #lastmomenttuitions Machine Learning Full Course: https://bit.ly/3oobHT9 Last moment tuitions are ..."
  ],
  [
    "Supervised, Unsupervised and Reinforcement Learning in Artificial Intelligence in Hindi",
    "Supervised Learning Unsupervised Learning Reinforcement Learning Training Data Only Inputs Reward/Penalty Both Inputs ..."
  ],
  [
    "Reinforcement Learning - Developing Intelligent Agents",
    "This series is all about reinforcement learning (RL)! Here, we'll gain an understanding of the intuition, the math, and the coding ..."
  ],
  [
    "An introduction to Reinforcement Learning",
    "This episode gives a general introduction into the field of Reinforcement Learning: - High level description of the field - Policy ..."
  ],
  [
    "Tutorial 1-What Is Reinforcement Machine Learning? 🔥🔥🔥🔥",
    "Reinforcement learning (RL) is an area of machine learning concerned with how software agents ought to take actions in an ..."
  ],
  [
    "DeepMind x UCL | Introduction to Reinforcement Learning 2015",
    "Watch the lectures from DeepMind research lead David Silver's course on reinforcement learning, taught at University College ..."
  ],
  [
    "Reinforcement Learning | Introduction 🤖",
    "Reinforcement learning (RL) is an area of machine learning concerned with how software agents ought to take actions in an ..."
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning | Machine Learning Tutorial | Simplilearn",
    "In this video, you will learn about Supervised vs Unsupervised vs Reinforcement Learning. You will understand the definition of ..."
  ],
  [
    "Unsupervised Learning And Reinforcement Learning In Artificial Intelligence Explained In Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Reinforcement Learning Tutorial | Reinforcement Learning Example Using Python | Edureka",
    "Post Graduate Diploma in Artificial Intelligence by E&ICT Academy NIT Warangal: ..."
  ],
  [
    "Reinforcement Learning Basics",
    "This video is part of the Udacity course \"Reinforcement Learning\". Watch the full course at https://www.udacity.com/course/ud600."
  ],
  [
    "AI Learns to Escape (using Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 5 rooms I've designed. The AI was trained ..."
  ],
  [
    "#60 Reinforcement Learning- Introduction, Markovs Decision Problem with Example |ML|",
    "Telegram group : https://t.me/joinchat/G7ZZ_SsFfcNiMTA9 contact me on Gmail at shraavyareddy810@gmail.com contact me on ..."
  ],
  [
    "Reinforcement Learning",
    ""
  ],
  [
    "Reinforcement Learning Full Course | Reinforcement Learning In Machine Learning | Simplilearn",
    "In this Reinforcement Learning Full Course video, you will understand the basics of reinforcement learning and how it works to ..."
  ],
  [
    "DeepMind x UCL | Deep Learning Lecture Series 2021",
    "The Deep Learning Lecture Series is a collaboration between DeepMind and the UCL Centre for Artificial Intelligence."
  ],
  [
    "Reinforcement Learning: Crash Course AI #9",
    "Reinforcement learning is particularly useful in situations where we want to train AIs to have certain skills we don't fully ..."
  ],
  [
    "MIT 6.S091: Introduction to Deep Reinforcement Learning (Deep RL)",
    "First lecture of MIT course 6.S091: Deep Reinforcement Learning, introducing the fascinating field of Deep RL. For more lecture ..."
  ],
  [
    "#1. Q Learning Algorithm Solved Example | Reinforcement Learning | Machine Learning by Mahesh Huddar",
    "1. Q Learning Algorithm Solved Example | Reinforcement Learning | Machine Learning by Mahesh Huddar Introduction to ..."
  ],
  [
    "Reinforcement Learning in 3 Hours | Full Course using Python",
    "Want to get started with Reinforcement Learning? This is the course for you! This course will take you through all of the ..."
  ],
  [
    "Tutorial 2- Implementing Basic Reinforcement Learning Using Python- Data Science",
    "Reinforcement learning (RL) is an area of machine learning concerned with how software agents ought to take actions in an ..."
  ],
  [
    "Reinforcement Learning Crash Course",
    ""
  ],
  [
    "Reinforcement Learning Course - Full Machine Learning Tutorial",
    "Reinforcement learning is an area of machine learning that involves taking right action to maximize reward in a particular situation ..."
  ],
  [
    "Overview of Reinforcement learning - lecture 86/ machine learning",
    "Reinforcement learning."
  ],
  [
    "Stanford CS234: Reinforcement Learning | Winter 2019 | Lecture 1 - Introduction - Emma Brunskill",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/ai ..."
  ],
  [
    "What is Reinforcement Learning | Reinforcement Learning in AI | Reinforcement Learning in HINDI",
    "supervised learning, unsupervised learning, supervised learning in hindi, supervised learning in artificial intelligence, supervised ..."
  ],
  [
    "A friendly introduction to deep reinforcement learning, Q-networks and policy gradients",
    "A video about reinforcement learning, Q-networks, and policy gradients, explained in a friendly tone with examples and figures."
  ],
  [
    "Reinforcement - Learning | Class 11 Psychology Chapter 6",
    "Previous Video :https://www.youtube.com/watch?v=BNTv_wEyucY Next Video ..."
  ],
  [
    "Reinforcement Learning: Machine Learning Meets Control Theory",
    "Reinforcement learning is a powerful technique at the intersection of machine learning and control theory, and it is inspired by ..."
  ],
  [
    "Reinforcement Learning - Ep. 30 (Deep Learning SIMPLIFIED)",
    "Reinforcement Learning has started to receive a lot of attention in the fields of Machine Learning and Data science. In January of ..."
  ],
  [
    "Reinforcement Learning",
    ""
  ],
  [
    "MIT 6.S191 (2019): Deep Reinforcement Learning",
    "MIT Introduction to Deep Learning 6.S191: Lecture 5 Deep Reinforcement Learning Lecturer: Alexander Amini January 2019 For ..."
  ],
  [
    "Reinforcement theory of motivation, organisational behaviour, OB, reinforcement theory, mba, bba",
    "Organisational Behaviour Playlist : https://youtube.com/playlist?list=PLsh2FvSr3n7de4MNZdEb3WMePB4zSMnPa Organisational ..."
  ],
  [
    "DeepMind x UCL | Reinforcement Learning Course 2018",
    "Interested in learning more about reinforcement learning? Get a deeper look in this comprehensive lecture series created in ..."
  ],
  [
    "Deep Reinforcement Learning Tutorial for Python in 20 Minutes",
    "Worked with supervised learning? Maybe you've dabbled with unsupervised learning. But what about reinforcement learning?"
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning | Data Science Certification Training | Edureka",
    "Python Data Science Training (Use Code \"YOUTUBE20\"): https://www.edureka.co/data-science-python-certification-course ..."
  ],
  [
    "Reinforcement Learning: A Six Part Series",
    "Part one of a six part series on Reinforcement Learning. If you want to understand the fundamentals in a short amount of time, ..."
  ],
  [
    "Stanford CS234: Reinforcement Learning | Winter 2019 | Lecture 2 - Given a Model of the World",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/ai ..."
  ],
  [
    "Multi-Agent Hide and Seek",
    "We've observed agents discovering progressively more complex tool use while playing a simple game of hide-and-seek. Through ..."
  ],
  [
    "Markov Decision Processes (MDPs) - Structuring a Reinforcement Learning Problem",
    "Welcome back to this series on reinforcement learning! In this video, we'll discuss Markov decision processes, or MDPs. Markov ..."
  ],
  [
    "Machine Learning vs Deep Learning",
    "What is Machine Learning → http://ibm.biz/machine-learning-is-simple What is Deep Learning ..."
  ],
  [
    "Reinforcement Learning from Human Feedback: From Zero to chatGPT",
    "In this talk, we will cover the basics of Reinforcement Learning from Human Feedback (RLHF) and how this technology is being ..."
  ],
  [
    "Python Reinforcement Learning Tutorial for Beginners in 25 Minutes",
    "Want to break into Reinforcement Learning with Python? Just not too sure where or how to start? Well in this video you'll learn the ..."
  ],
  [
    "Introduction to Reinforcement Learning: Chapter 1",
    "Complete Book: http://incompleteideas.net/book/RLbook2018.pdf Print Version: ..."
  ],
  [
    "Reinforcement Learning for Stock Prediction",
    "Can we actually predict the price of Google stock based on a dataset of price history? I'll answer that question by building a ..."
  ],
  [
    "Python + PyTorch + Pygame Reinforcement Learning – Train an AI to Play Snake",
    "In this Python Reinforcement Learning course you will learn how to teach an AI to play Snake! We build everything from scratch ..."
  ],
  [
    "Evolutionary Computation vs Reinforcement Learning vs Deep Learning | Risto Miikkulainen",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=CY_LEa9xQtg Please support this podcast by checking out ..."
  ],
  [
    "Reinforcement Learning - ARTIFICIAL INTELLIGENCE (15A05606) - Unit V - LOGICAL REASONING",
    ""
  ],
  [
    "Reinforcement theory of motivation, organisational behaviour, OB, reinforcement theory, mba, bba",
    "Organisational Behaviour Playlist : https://youtube.com/playlist?list=PLsh2FvSr3n7de4MNZdEb3WMePB4zSMnPa Organisational ..."
  ],
  [
    "DeepMind x UCL | Reinforcement Learning Course 2018",
    "Interested in learning more about reinforcement learning? Get a deeper look in this comprehensive lecture series created in ..."
  ],
  [
    "Reinforcement Learning for Engineers, Part 1: What Is Reinforcement Learning?",
    "Check out the other videos in the series: Part 2 - Understanding the Environment and Rewards: https://youtu.be/0ODB_DvMiDI ..."
  ],
  [
    "Markov Decision Processes (MDPs) - Structuring a Reinforcement Learning Problem",
    "Welcome back to this series on reinforcement learning! In this video, we'll discuss Markov decision processes, or MDPs. Markov ..."
  ],
  [
    "An introduction to Policy Gradient methods - Deep Reinforcement Learning",
    "In this episode I introduce Policy Gradient methods for Deep Reinforcement Learning. After a general overview, I dive into ..."
  ],
  [
    "Introduction to Reinforcement Learning: Chapter 1",
    "Complete Book: http://incompleteideas.net/book/RLbook2018.pdf Print Version: ..."
  ],
  [
    "Evolutionary Computation vs Reinforcement Learning vs Deep Learning | Risto Miikkulainen",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=CY_LEa9xQtg Please support this podcast by checking out ..."
  ],
  [
    "Learn Trading with Deep Reinforcement Learning From Dr Thomas Starke",
    "Dr. Thomas Starke Speaks on Deep Reinforcement Learning (DRL). DRL has successfully beat the reigning world champion of ..."
  ],
  [
    "16. Reinforcement Learning, Part 1",
    "MIT 6.S897 Machine Learning for Healthcare, Spring 2019 Instructor: Fredrik D. Johansson View the complete course: ..."
  ],
  [
    "What is Deep Reinforcement Learning? (David Silver, DeepMind) | AI Podcast Clips",
    "Full episode with David Silver (Apr 2020): https://www.youtube.com/watch?v=uPUEq8d73JI Clips channel (Lex Clips): ..."
  ],
  [
    "Reinforcement Learning for Stock Prediction",
    "Can we actually predict the price of Google stock based on a dataset of price history? I'll answer that question by building a ..."
  ],
  [
    "Reinforcement Learning Chapter 2: Multi-Armed Bandits",
    "Complete Book: http://incompleteideas.net/book/RLbook2018.pdf Print Version: ..."
  ],
  [
    "Q-Learning Explained - A Reinforcement Learning Technique",
    "Welcome back to this series on reinforcement learning! In this video, we'll be introducing the idea of Q-learning with value iteration ..."
  ],
  [
    "MarI/O - Machine Learning for Video Games",
    "MarI/O is a program made of neural networks and genetic algorithms that kicks butt at Super Mario World. Source Code: ..."
  ],
  [
    "Reinforcement Learning with Stable Baselines 3 - Introduction (P.1)",
    "Welcome to a tutorial series covering how to do reinforcement learning with the Stable Baselines 3 (SB3) package. The objective ..."
  ],
  [
    "What&#39;s New In Machine Learning?",
    "I decided to take a look through the open review papers submitted to ICLR 2023. ICLR is the International Conference on ..."
  ],
  [
    "Deep Reinforcement Learning: Neural Networks for Learning Control Laws",
    "Deep learning is enabling tremendous breakthroughs in the power of reinforcement learning for control. From games, like chess ..."
  ],
  [
    "Reinforcement Learning Course: Intro to Advanced Actor Critic Methods",
    "Actor critic methods are used in machine learning. They are most useful for applications in robotics as they allow us to output ..."
  ],
  [
    "Reinforcement Learning for Trading Practical Examples and Lessons Learned by Dr. Tom Starke",
    "This talk, titled, “Reinforcement Learning for Trading Practical Examples and Lessons Learned” was given by Dr. Tom Starke at ..."
  ],
  [
    "Machine Learning - 3 | Reinforcement Learning | Sinhala",
    "Reinforcement Learning is another type of Machine Learning. Reinforcement learning involves no supervisor and only a reward ..."
  ],
  [
    "David Silver: AlphaGo, AlphaZero, and Deep Reinforcement Learning | Lex Fridman Podcast #86",
    "David Silver leads the reinforcement learning research group at DeepMind and was lead researcher on AlphaGo, AlphaZero and ..."
  ],
  [
    "Decision Transformer: Reinforcement Learning via Sequence Modeling (Research Paper Explained)",
    "decisiontransformer #reinforcementlearning #transformer Proper credit assignment over long timespans is a fundamental problem ..."
  ],
  [
    "Reinforcement Learning for Gaming | Full Python Course in 9 Hours",
    "Ever wanted to learn how to apply ML to games? Here ya go! What's happening team! This is a compilation of the RL tutorials for ..."
  ],
  [
    "Reinforcement Learning 6: Policy Gradients and Actor Critics",
    "Hado Van Hasselt, Research Scientist, discusses policy gradients and actor critics as part of the Advanced Deep Learning ..."
  ],
  [
    "Deep Reinforcement Learning for Walking Robots - MATLAB and Simulink Robotics Arena",
    "Sebastian Castro demonstrates an example of controlling humanoid robot locomotion using deep reinforcement learning, ..."
  ],
  [
    "A. I. Learns to Play Starcraft 2 (Reinforcement Learning)",
    "Tinkering with reinforcement learning via Stable Baselines 3 and Starcraft 2. Code and model: https://github.com/Sentdex/SC2RL ..."
  ],
  [
    "Reinforcement Learning in TensorFlow with TF-Agents (TF Dev Summit &#39;19)",
    "Learn how to use TensorFlow and Reinforcement Learning to solve complex tasks. See the revamped dev site ..."
  ],
  [
    "Inverse Reinforcement Learning Explained",
    "Inverse Reinforcement Learning (Inverse RL / IRL) is a type of RL where the objective is opposite from forward RL. Instead of ..."
  ],
  [
    "All Machine Learning Models Explained in 5 Minutes | Types of ML Models Basics",
    "Confused about understanding machine learning models? Well, this video will help you grab the basics of each one of them."
  ],
  [
    "How does Reinforcement Learning Work | Environment and Agent in Reinforcement Learning Mahesh Huddar",
    "4. How does Reinforcement Learning Work | Environment and Agent in Reinforcement Learning by Mahesh Huddar Introduction ..."
  ],
  [
    "Reinforcement Learning - Machine Learning || தமிழில் || Tamil || ML-13 || Explained || We &amp; Data",
    "Reinforcement Learning - Machine Learning. What is Agent, Environment, State, Reward etc., all needed for Reinforcement ..."
  ],
  [
    "Reinforcement Learning | Reinforcement Learning In Python | Machine Learning Tutorial | Simplilearn",
    "This video on Reinforcement Learning will help you understand the basics of reinforcement learning. You will learn the concepts ..."
  ],
  [
    "#18 What is Reinforcement Learning | Data Science | Machine Learning Interview Question",
    "Shorts This is the series of Data Science interview Question, Machine Learning Interview Question, Deep Learning Interview ..."
  ],
  [
    "Reinforcement Learning from Human Feedback  From Zero to ChatGPT [Record of the live]",
    "In this talk, we will cover the basics of Reinforcement Learning from Human Feedback (RLHF) and how this technology is being ..."
  ],
  [
    "Q Learning Algorithm | Reinforcement learning | Machine Learning by Dr. Mahesh Huddar",
    "Q Learning Algorithm | Reinforcement learning | Machine Learning by Dr. Mahesh Huddar Introduction to Reinforcement ..."
  ],
  [
    "4 .Reinforcement Learning -machine Learning",
    "Reinforcement Learning."
  ],
  [
    "Q Learning In Reinforcement Learning | Q Learning Example | Machine Learning Tutorial | Simplilearn",
    "Can we train an AI Model to find the best distance between two points without using an algorithm? The answer is yes! with ..."
  ],
  [
    "Deep Learning Basics: Introduction and Overview",
    "An introductory lecture for MIT course 6.S094 on the basics of deep learning including a few key ideas, subfields, and the big ..."
  ],
  [
    "Reinforcement learning overview (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, kicks off a new series on reinforcement learning where we explore how you can ..."
  ],
  [
    "Custom Indicators for Reinforcement Learning Trading Tutorial | $GME Python Trading PT2",
    "So you watched the first tutorial.... Performance for our GME RL Bot was...meh You're probably thinking, \"There has to be a way to ..."
  ],
  [
    "AI Learns to Escape (Deep Reinforcement Learning)",
    "AI Teaches Itself How to Escape! In this video an AI named Albert learns how to escape 7 rooms I've designed. The AI was trained ..."
  ],
  [
    "Build an Mario AI Model with Python | Gaming Reinforcement Learning",
    "Teach AI to play Super Mario In this video you'll learn how to: Setup a Mario Environment Preprocess Mario for Applied ..."
  ],
  [
    "DeepMind x UCL RL Lecture Series - Introduction to Reinforcement Learning [1/13]",
    "Research Scientist Hado van Hasselt introduces the reinforcement learning course and explains how reinforcement learning ..."
  ],
  [
    "Reinforcement Learning Series Intro - Syllabus Overview",
    "Welcome to this series on reinforcement learning! We'll first start out by introducing the absolute basics to build a solid ground for ..."
  ],
  [
    "Deep Learning Cars",
    "A small 2D simulation in which cars learn to maneuver through a course by themselves, using a neural network and evolutionary ..."
  ],
  [
    "Reinforcement Learning With (Deep) Q-Learning Explained",
    "In this video we learn about Reinforcement Learning and (Deep) Q-Learning. You will learn: - What is Reinforcement Learning ..."
  ],
  [
    "Active Reinforcement Learning-Artificial Intelligence-20A05502T-",
    ""
  ],
  [
    "Custom Environments - Reinforcement Learning with Stable Baselines 3 (P.3)",
    "How to incorporate custom environments with stable baselines 3 Text-based tutorial and sample code: ..."
  ],
  [
    "TYPES OF REINFORCEMENT",
    "In this video we will study about the types of reinforcement in Operant Conditioning. Any Doubt mail it to: ..."
  ],
  [
    "Hierarchical Reinforcement Learning",
    ""
  ],
  [
    "Machine Learning Basics | What Is Machine Learning? | Introduction To Machine Learning | Simplilearn",
    "Enroll for FREE Machine Learning Course & Get your Completion Certificate: ..."
  ],
  [
    "MIT 6.S191 (2021): Reinforcement Learning",
    "MIT Introduction to Deep Learning 6.S191: Lecture 5 Deep Reinforcement Learning Lecturer: Alexander Amini January 2021 For ..."
  ],
  [
    "Passive Reinforcement Learning-Artificial Intelligence-20A05502T-UNIT III",
    "UNIT III – Reinforcement Learning and Natural Language Processing Passive Reinforcement Learning Passive Reinforcement ..."
  ],
  [
    "Reinforcement Learning - ARTIFICIAL INTELLIGENCE (15A05606) - Unit V - LOGICAL REASONING",
    ""
  ],
  [
    "Reinforcement Learning Tutorial | Reinforcement Learning Example Using Python | Edureka",
    "Post Graduate Diploma in Artificial Intelligence by E&ICT Academy NIT Warangal: ..."
  ],
  [
    "Types of Machine Learning - Reinforcement Learning - lecture 7/machine learning",
    "Reinforcement Learning."
  ],
  [
    "Machine Learning Full Course - Learn Machine Learning 10 Hours | Machine Learning Tutorial | Edureka",
    "Machine Learning Engineer Masters Program (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "How to use Bellman Equation Reinforcement Learning | Bellman Equation Machine Learning Mahesh Huddar",
    "How to use Bellman Equation in Reinforcement Learning | Bellman Equation in Machine Learning by Mahesh Huddar ..."
  ],
  [
    "Reinforcement Learning for Engineers, Part 3: Policies and Learning Algorithms",
    "Check out the other videos in the series: Part 1 - What Is Reinforcement Learning: https://youtu.be/pc-H4vyg2L4 Part 2 ..."
  ],
  [
    "Introduction to TF Agents and Deep Q Learning (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, introduces TF Agents and walks through how to use the Deep Q Learning model ..."
  ],
  [
    "reinforcement learning  in tamil | what is reinforcement learning ? | Reinforcement Learning Basics",
    "Basic of Machine Learning reinforcement learning reinforcement learning usecase reinforcement learning agent reinforcement ..."
  ],
  [
    "Terms used in reinforcement learning - lecture 87/ machine learning",
    "Reinforcement learning."
  ],
  [
    "Lecture 14 | Deep Reinforcement Learning",
    "In Lecture 14 we move from supervised learning to reinforcement learning (RL), in which an agent must learn to interact with an ..."
  ],
  [
    "MarI/O - Machine Learning for Video Games",
    "MarI/O is a program made of neural networks and genetic algorithms that kicks butt at Super Mario World. Source Code: ..."
  ],
  [
    "RL 8: Value function approach - Temporal Difference Reinforcement Learning - SARSA Algorithm",
    "Value function approach - Temporal Difference Reinforcement Learning (TD learning) - SARSA Algorithm - In this video, we ..."
  ],
  [
    "Reinforcement Learning in Telugu | Artificial intelligence course in Telugu",
    "Reinforcement Learning in Telugu | Artificial intelligence course in Telugu https://youtu.be/fqnDM2mtEhw My Gear Boya Mic: ..."
  ],
  [
    "Reinforcement Learning for Field-Oriented Control of a Permanent Magnet Synchronous Motor",
    "Use reinforcement learning and the DDPG algorithm for field-oriented control of a Permanent Magnet Synchronous Motor."
  ],
  [
    "What is Reinforcement Learning | Types | Example || Stephen SIMON",
    "In this video we are going to learn what is reinforcement learning, the difference between, supervised and reinforcement learning, ..."
  ],
  [
    "Reinforcement learning in Artificial Intelligence",
    "Reinforcement learning in Artificial Intelligence explained in Hindi with example, that can be used in University exams. #Artificial ..."
  ],
  [
    "RL in real life: Bringing reinforcement learning to the enterprise - Edward Jezierski (Microsoft)",
    "(Sponsored by Microsoft) We're entering an era where AI can discover patterns and causality beyond the data we provide."
  ],
  [
    "Introduction to Reinforcement Learning | Reinforcement Learning Tutorial | Intellipaat",
    "Intellipaat Reinforcement Learning training: https://intellipaat.com/reinforcement-learning-training/ In this reinforcement learning ..."
  ],
  [
    "Advanced Skills through Multiple Adversarial Motion Priors in Reinforcement Learning",
    "Nvidia presented parts of this work at GTC 2022, revealing our humanoid-quadruped transformer! Title: Advanced Skills through ..."
  ],
  [
    "Reinforcement Learning (Part 2)",
    "Artificial Intelligence - Passive RL Disclaimer- Some contents are used for educational purpose under fair use. Copyright ..."
  ],
  [
    "Deep Reinforcement Learning in Python Tutorial - A Course on How to Implement Deep Learning Papers",
    "In this intermediate deep learning tutorial, you will learn how to go from reading a paper on deep deterministic policy gradients to ..."
  ],
  [
    "Markov Decision Processes 2 - Reinforcement Learning | Stanford CS221: AI (Autumn 2019)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2Zv1JpK ..."
  ],
  [
    "Offline Reinforcement Learning",
    "Offline Reinforcement Learning describes training an agent without interacting with the environment. The agent learns from ..."
  ],
  [
    "Pieter Abbeel: Deep Reinforcement Learning | Lex Fridman Podcast #10",
    ""
  ],
  [
    "Introduction to OpenAI Gym and Frozen Lake Environment in Python- Reinforcement Learning Tutorial",
    "machinelearning #machinelearningtutorial #machinelearningengineer #reinforcement #reinforcementlearning ..."
  ],
  [
    "Q Learning Intro/Table - Reinforcement Learning p.1",
    "Welcome to a reinforcement learning tutorial. In this part, we're going to focus on Q-Learning. Q-Learning is a model-free form of ..."
  ],
  [
    "What is Machine Learning?",
    "What is Machine Learning and how does it work: Many people who hear about machine learning often think of it as magic. In this ..."
  ],
  [
    "Multi Armed Bandit Problem in Reinforcement Learning Hindi",
    "Multi Armed Bandit Problem in Hindi || Reinforcement Learning in Hindi Our New Channel Fiction Tube ..."
  ],
  [
    "Artificial Intelligence Class 9 Unit 3 | Learning Based (Reinforcement Learning)",
    "Previous Video:- https://www.youtube.com/watch?v=XQ83r-g5G5o Next Video:- https://www.youtube.com/watch?v=L69CK-yQPI0 ..."
  ],
  [
    "Deep Q Learning w/ DQN - Reinforcement Learning p.5",
    "Hello and welcome to the first video about Deep Q-Learning and Deep Q Networks, or DQNs. Deep Q Networks are the deep ..."
  ],
  [
    "Temporal Difference Learning (including Q-Learning) | Reinforcement Learning Part 4",
    "Part four of a six part series on Reinforcement Learning. As the title says, it covers Temporal Difference Learning, Sarsa and ..."
  ],
  [
    "Python Machine Learning Tutorial (Data Science)",
    "Python Machine Learning Tutorial - Learn how to predict the kind of music people like. Subscribe for more Python tutorials like ..."
  ],
  [
    "Reinforcement Learning คืออะไร? | Machine Learning Learner",
    "There are 3 main types of learning problem in machine learning 1.Supervised Learning 2.Unsupervised Learning 3."
  ],
  [
    "Deep Reinforcement Learning for Trading | Backtesting &amp; Trading | Dr. Thomas Starke | Quantra",
    "The course link is as follows: https://quantra.quantinsti.com/course/deep-reinforcement-learning-trading This video explains the ..."
  ],
  [
    "Difference between Reinforcement Learning, Supervised Learning &amp; Unsupervised Learning Mahesh Huddar",
    "Difference between Reinforcement Learning, Supervised Learning and Unsupervised Learning by MaheshHuddar Introduction to ..."
  ],
  [
    "OpenAI Plays Hide and Seek…and Breaks The Game! 🤖",
    "Check out Weights & Biases here and sign up for a free demo: https://www.wandb.com/papers ❤️ Their blog post is available ..."
  ],
  [
    "OpenAI Gym and Python for Q-learning - Reinforcement Learning Code Project",
    "Welcome back to this series on reinforcement learning! Over the next couple of videos, we're going to be building and playing our ..."
  ],
  [
    "10.2 Reinforcement Learning formalism | Mars rover example -[ML |Andrew Ng]",
    "Third and final Course: Unsupervised Learning, Recommenders, Reinforcement Learning. If you liked the content please ..."
  ],
  [
    "The BEST Book On Reinforcement Learning",
    "Science Academy: https://academy.jousefmurad.com/ Website: http://jousefmurad.com Full podcast: ..."
  ],
  [
    "But what is Reinforcement Learning? | Reinforcement Learning Part-1",
    "Video Created By - Rajtilak Pal (M. Tech in AI, IIT Ropar) Believe it or not, Reinforcement Learning is the way to the future."
  ],
  [
    "Reinforcement Learning #6 | Learning and Planning",
    "Reinforcement Learning #6: Learning and Planning Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "Enterprise Applications of Reinforcement Learning",
    "This video is based on the blog post of the same title, which you can find at ..."
  ],
  [
    "Building a Custom Environment for Deep Reinforcement Learning with OpenAI Gym and Python",
    "Tired of working with standard OpenAI Environments? Want to get started building your own custom Reinforcement Learning ..."
  ],
  [
    "A.I. Learns to Drive From Scratch in Trackmania",
    "I made an A.I. that teaches itself to drive in the racing game Trackmania, using Machine-Learning. I used Deep-Q-Learning, ..."
  ],
  [
    "theory of reinforcement with example | reinforcement theory of learning | learning theories",
    "Reinforcement Theory of motivation aims at achieving the desired level of motivation among the employees by means of ..."
  ],
  [
    "Reinforcement Learning Tutorial | Reinforcement Learning in Artificial Intelligence | Full Course",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Reinforcement learning: Fast and slow - Matthew Botvinick",
    "Matthew Botvinick's work straddles the boundaries between cognitive psychology, computational and experimental neuroscience ..."
  ],
  [
    "11. Introduction to Machine Learning",
    "MIT 6.0002 Introduction to Computational Thinking and Data Science, Fall 2016 View the complete course: ..."
  ],
  [
    "Reinforcement Learning #8 | Prediction and Control",
    "Reinforcement Learning #8 | Prediction and Control Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "Reinforcement Learning #0 | Overview",
    "Overview of Reinforcement Learning Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "Reinforcement Learning in Machine Learning Tamil | AI Tutorial in Tamil | Machine Learning in Tamil",
    "Reinforcement Learning in Machine Learning Tamil | Ai Tutorial in Tamil | Machine Learning in Tamil."
  ],
  [
    "Reinforcement Learning Live Example With My Baby 👶👶👶",
    "Reinforcement Learning Live Example."
  ],
  [
    "Reinforcement Learning | RL | Technique of Machine Learning | Artificial Intelligence",
    "Complete syllabus of Machine Learning in Hindi & English Types of Machine Learning. How to control learning process in ..."
  ],
  [
    "Lecture 21: Reinforcement Learning",
    "Lecture 21 gives a brief overview of reinforcement learning (RL). We discuss the reinforcement learning problem where an agent ..."
  ],
  [
    "Basics of Reinforcement Learning &amp; Reinforced Fun",
    "Timestamp: 00:00 Reinforcement Learning 00:41 What is Reinforcement Learning? 01:41 Types of Machine Learning? 02:30 ..."
  ],
  [
    "Deep Learning Basics: Introduction and Overview",
    "An introductory lecture for MIT course 6.S094 on the basics of deep learning including a few key ideas, subfields, and the big ..."
  ],
  [
    "FinRL: A Deep Reinforcement Learning Library for Automated Trading in Quantitative Finance",
    "FinRL is the open source library for practitioners. To efficiently automate trading, AI4Finance provides this educational channel ..."
  ],
  [
    "A.I. Learns to Drive From Scratch in Trackmania",
    "I made an A.I. that teaches itself to drive in the racing game Trackmania, using Machine-Learning. I used Deep-Q-Learning, ..."
  ],
  [
    "Overview of Advanced Methods of Reinforcement Learning in Finance , Week(1-4) All Quiz Answers.",
    "course link: https://www.coursera.org/learn/advanced-methods-reinforcement-learning-finance? Join this channel to get more ..."
  ],
  [
    "CartPole Balance | OpenAI Gym | Reinforcement Learning | Python",
    "Content Description ⭐️ In this video, I have explained about cartpole balancing using reinforcement learning with the help of ..."
  ],
  [
    "Rocket-recycling with Reinforcement Learning",
    "https://github.com/jiupinjia/rocket-recycling."
  ],
  [
    "Sample efficient reinforcement learning with SAC on Kuka robot",
    "Master's thesis: https://github.com/BarisYazici/tum_masters_thesis/blob/master/final_report.pdf Code: ..."
  ],
  [
    "Teaching Deep Reinforcement Learning with MATLAB",
    "Watch this webinar by Professor Rifat Sipahi from Northeastern University to learn about the curriculum materials his team ..."
  ],
  [
    "5 Best Real-World Applications of Reinforcement Learning",
    "Reinforcement Learning Applications | Data Science Tutorial | Machine Learning Project with Python | Deep Learning | AI Hi Guys, ..."
  ],
  [
    "Model Based Reinforcement Learning: Policy Iteration, Value Iteration, and Dynamic Programming",
    "Here we introduce dynamic programming, which is a cornerstone of model-based reinforcement learning. We demonstrate ..."
  ],
  [
    "Reinforcement Learning 1: Introduction to Reinforcement Learning",
    "Hado Van Hasselt, Research Scientist, shares an introduction reinforcement learning as part of the Advanced Deep Learning ..."
  ],
  [
    "But what is a neural network? | Chapter 1, Deep learning",
    "What are the neurons, why are there layers, and what is the math underlying it? Help fund future projects: ..."
  ],
  [
    "Fundamentals of Reinforcement Learning | Free Reinforcement Learning Course Module 1",
    "reinforcementlearning #freecourse Welcome to module 1 of our free reinforcement learning course, from neuralnet.ai In this ..."
  ],
  [
    "Reinforcement Learning คืออะไร",
    "มาทำความรู้จัก Machine Learning อีกประเภทหนึ่งที่ชื่อว่า Reinforcement Learning กัน ติดต่อได้ที่ ..."
  ],
  [
    "Supervised, Unsupervised, and Reinforcement learning in Bengali (Video # 3)",
    "Machine_Learning_Categories In this video, I discussed in details on : 1) Supervised Learning 2) Unsupervised Learning 3) ..."
  ],
  [
    "Reinforcement Learning Control for Wheeled Self-balancing Systems | #SimulinkChallenge2021",
    "This is my submission for the #SimulinkChallenge2021. Here I describe the utilization of Simulink's Reinforcement Learning ..."
  ],
  [
    "Reinforcement Learning for Autonomous Driving",
    "This video is the demo of our reinforcement learning based motion planning framework, done on June 5, 2022, that allows ..."
  ],
  [
    "Stanford CS229: Machine Learning Course, Lecture 1 - Andrew Ng (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/2Ze53pq ..."
  ],
  [
    "Tutorial 59: SARSA Algorithm in Reinforcement Learning |  On-Policy VS OFF-Policy in RL",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Reinforcement Learning Topics You Must Know #shorts #skillslashacademy #programming #datascience",
    "shorts Here are some quick Reinforcement Learning Topics that you must know that are essential in your Data Science journey."
  ],
  [
    "RL-بالعربي - L01- Introduction to Reinforcement Learning",
    "بالعربي-RL هو سلسلة من الدروس عن التعلم المعزز وخوارزمياته باللغة العربية. لمتابعة باقي الدروس ..."
  ],
  [
    "How to apply Reinforcement Learning to Business Problem? #reinforcement #learning #youtubeshorts",
    "How to apply Reinforcement Learning to your Business Problem?? ✓For career guidance content and consultation follow ..."
  ],
  [
    "Multi-Modal Legged Locomotion Framework with Automated Residual Reinforcement Learning",
    "This is the supplementary video of paper Multi-Modal Legged Locomotion Framework with Automated Residual Reinforcement ..."
  ],
  [
    "Lex Fridman: Is Reinforcement Learning a Good Candidate for AGI?",
    "This is a clip from the opening lecture of the MIT Deep Learning lecture series. Full video: ..."
  ],
  [
    "What is Reinforcement Learning ? Explained in 1 Minutes!",
    "shorts #codersarts #coding #deeplearning #machinelearning #datascience #youtubeshorts #ai #ml In this video, you will learn ..."
  ],
  [
    "Value-accelerated Persistent Reinforcement Learning: Training Curriculum for Tabletop Manipulation",
    "This video illustrates the curriculum generated by Value-accelerated Persistent Reinforcement Learning (VaPRL) proposed in our ..."
  ],
  [
    "ai learn to play slither io with reinforcement learning.",
    "in this video,I made a reinforcement learning agent for playing slither io.I used ddpq algorithm, inputs are screenshout and outputs ..."
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "Why reinforcement learning in Tesla?",
    "Why reinforcement learning in Tesla? #reinforcementlearning #tesla Reinforcement learning is one of three basic machine ..."
  ],
  [
    "What is Reinforcement Learning ? with example #deeplearning #shorts #shortvideo",
    ""
  ],
  [
    "Machine Learning Zero to Hero (Google I/O&#39;19)",
    "This is a talk for people who know code, but who don't necessarily know machine learning. Learn the 'new' paradigm of machine ..."
  ],
  [
    "Machine Learning Types | Supervised | Unsupervised | Reinforcement Learning | #machinelearning",
    "Types of Machine Learning Machine learning is a subset of AI, which enables the machine to automatically learn from data, ..."
  ],
  [
    "Framing Tic-Tac-Toe as a Reinforcement Learning Problem",
    "In this video I discuss how to formulate Tic-Tac-Toe as a Reinforcement Learning (RL) Problem, and begin a deep dive into a ..."
  ],
  [
    "Reinforcement Learning: Qwik Start | Qwiklabs GSP691| GCP 2021",
    "In this video we will see how to pass Reinforcement Learning: Qwik Start lab."
  ],
  [
    "Machine Learning for Everybody – Full Course",
    "Learn Machine Learning in a way that is accessible to absolute beginners. You will learn the basics of Machine Learning and how ..."
  ],
  [
    "Machine Learning #63 - Reinforcement Learning #1 - Lernen durch Bestrafung",
    "In diesem Tutorial starten wir mit Reinforcement Learning. ❤❤❤ Früherer Zugang zu Tutorials, Abstimmungen, Live-Events und ..."
  ],
  [
    "Basics Of Principal Component Analysis Explained in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Emergent Real-World Robotic Skills via Unsupervised Off-Policy Reinforcement Learning",
    "Paper: https://arxiv.org/abs/2004.12974 Website: https://sites.google.com/view/dads-skill."
  ],
  [
    "Reinforcement Learning example #deeplearning #shorts",
    ""
  ],
  [
    "Reinforcement Learning with Random Delays - ICLR 2021",
    "Short presentation of Reinforcement Learning with Random Delays, presented at ICLR 2021. Conference paper: ..."
  ],
  [
    "Complete Machine Learning In 6 Hours| Krish Naik",
    "All the materials are available in the below link https://courses.ineuron.ai/Mega-Community-Live Time Stamp: 00:00:00 ..."
  ],
  [
    "AI - Reinforcement learning - Raspberry Robot",
    "Learning obstacle avoidance with reinforcement learning. MRPiZ is a mobile robot with Raspberry Pi Zero and laser ToF sensors."
  ],
  [
    "Machine Learning for Everybody – Full Course",
    "Learn Machine Learning in a way that is accessible to absolute beginners. You will learn the basics of Machine Learning and how ..."
  ],
  [
    "FinRL: A Deep Reinforcement Learning Library for Automated Trading in Quantitative Finance",
    "FinRL is the open source library for practitioners. To efficiently automate trading, AI4Finance provides this educational channel ..."
  ],
  [
    "Deep Reinforcement Learning Course first live: Course presentation, Q&amp;A and playing with Huggy 🐶",
    "In this first live stream of the Deep Reinforcement Learning Course, I'm going to explain how the course will work (scope, units, ..."
  ],
  [
    "Reinforcement Learning based Traffic Signal Control Validated in Real-Time Real World Traffic",
    "We implemented distributed Q-Learning based traffic signal control to optimize vehicles, pedestrians, and neighborhood traffic."
  ],
  [
    "Reinforcement Learning: Thompson Sampling &amp; The Multi Armed Bandit Problem - Part 02",
    "Dr. Soper provides a complete demonstration of how to implement a reinforcement learning-based AI system in Python that uses ..."
  ],
  [
    "Offline Reinforcement Learning",
    "Extended lecture on offline reinforcement learning (practice talk). Covering the following papers: AWAC: ..."
  ],
  [
    "MIT 6.S094: Deep Reinforcement Learning for Motion Planning",
    "This is lecture 2 of course 6.S094: Deep Learning for Self-Driving Cars taught in Winter 2017. This lecture introduces types of ..."
  ],
  [
    "Deep Reinforcement Learning in Pac-man",
    "Project link: https://github.com/tychovdo/PacmanDQN."
  ],
  [
    "Reinforcement Learning: Introduction",
    "Welcome to the Reinforcement Learning seminar series. Hopefully, the videos are helpful understanding the intuition behind ..."
  ],
  [
    "9 -  Reinforcement learning in the brain",
    "In this course, Bence Csaba Farkas introduces concepts of reinforcement learning, and how they might be applied to ..."
  ],
  [
    "Complete Machine Learning In 6 Hours| Krish Naik",
    "All the materials are available in the below link https://courses.ineuron.ai/Mega-Community-Live Time Stamp: 00:00:00 ..."
  ],
  [
    "Active reinforcement learning agent in Reinforcement learning",
    "Active reinforcement learning agent in Reinforcement learning."
  ],
  [
    "Why reinforcement learning in Tesla?",
    "Why reinforcement learning in Tesla? #reinforcementlearning #tesla Reinforcement learning is one of three basic machine ..."
  ],
  [
    "Framing Tic-Tac-Toe as a Reinforcement Learning Problem",
    "In this video I discuss how to formulate Tic-Tac-Toe as a Reinforcement Learning (RL) Problem, and begin a deep dive into a ..."
  ],
  [
    "Microsoft Research Reinforcement Learning Day 2021",
    "Reinforcement Learning Day 2021, hosted by Microsoft Research, was designed to bring together the RL community to build on ..."
  ],
  [
    "Stanford CS229: Machine Learning - Linear Regression and Gradient Descent |  Lecture 2 (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3pqkTry ..."
  ],
  [
    "Tutorial 59: SARSA Algorithm in Reinforcement Learning |  On-Policy VS OFF-Policy in RL",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Reinforcement Learning: Qwik Start | Qwiklabs GSP691| GCP 2021",
    "In this video we will see how to pass Reinforcement Learning: Qwik Start lab."
  ],
  [
    "Basics of Reinforcement Learning &amp; Reinforced Fun",
    "Timestamp: 00:00 Reinforcement Learning 00:41 What is Reinforcement Learning? 01:41 Types of Machine Learning? 02:30 ..."
  ],
  [
    "Reinforcement Learning 6: Temporal-difference methods",
    "Slides: https://cwkx.github.io/data/teaching/dl-and-rl/rl-lecture6.pdf Colab: ..."
  ],
  [
    "Reinforcement Learning 3: Agent Environment Interaction Cycle",
    "reinforcement#deeplearning#intelligence."
  ],
  [
    "Rocket-recycling with Reinforcement Learning",
    "https://github.com/jiupinjia/rocket-recycling."
  ],
  [
    "But what is a neural network? | Chapter 1, Deep learning",
    "What are the neurons, why are there layers, and what is the math underlying it? Help fund future projects: ..."
  ],
  [
    "Physics-informed Reinforcement Learning for perception and reasoning about fluids",
    "In this work we develop an artificial intelligence able to perceive (detect state variables) and reason (make accurate forecasts ..."
  ],
  [
    "Fundamentals of Reinforcement Learning | Free Reinforcement Learning Course Module 1",
    "reinforcementlearning #freecourse Welcome to module 1 of our free reinforcement learning course, from neuralnet.ai In this ..."
  ],
  [
    "Collision Avoidance in Pedestrian-Rich Environments with Deep Reinforcement Learning",
    "This video includes simulation, UAV, and ground vehicle results associated with the paper \"Collision Avoidance in ..."
  ],
  [
    "Reinforcement Learning Control for Wheeled Self-balancing Systems | #SimulinkChallenge2021",
    "This is my submission for the #SimulinkChallenge2021. Here I describe the utilization of Simulink's Reinforcement Learning ..."
  ],
  [
    "Stanford CS234: Reinforcement Learning | Winter 2019 | Lecture 4 - Model Free Control",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/ai ..."
  ],
  [
    "Bellman Principle of Optimality - Reinforcement Learning - Machine Learning",
    "RL07 Bellman Principle of Optimality Bellman Principle of Optimality Dynamic Programming method breaks down a multi-step ..."
  ],
  [
    "Making music using new sounds generated with machine learning",
    "NSynth Super is an open source experimental instrument. It gives musicians the ability to explore completely new sounds ..."
  ],
  [
    "Breakthrough Google Reinforcement Learning | AI &amp; Robotics Tech News",
    "FULL VIDEO HERE: https://youtu.be/_kY_Ca5sbBs #technology #tech #ai."
  ],
  [
    "Breakdown of using Reinforcement Learning with Automation Testing",
    "A brief overview of how Reinforcement Learning can be applied to existing automation testing frameworks to improve overall test ..."
  ],
  [
    "Reinforcement Learning #0 | Overview",
    "Overview of Reinforcement Learning Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "RL #5: Value Functions | The Reinforcement Learning Series",
    "Welcome to the The Reinforcement Learning Series. I will try to explain all the fundamentals concepts of The Reinforcement ..."
  ],
  [
    "Self-Driving Car with JavaScript Course – Neural Networks and Machine Learning",
    "Learn how to create a neural network using JavaScript with no libraries. In this course you will learn to make a self-driving car ..."
  ],
  [
    "ai learn to play slither io with reinforcement learning.",
    "in this video,I made a reinforcement learning agent for playing slither io.I used ddpq algorithm, inputs are screenshout and outputs ..."
  ],
  [
    "Reinforcement Learning 5: Function Approximation and Deep Reinforcement Learning",
    "Hado Van Hasselt, Research Scientist, discusses function approximation and deep reinforcement learning as part of the ..."
  ],
  [
    "Reinforcement Learning for Autonomous Driving",
    "This video is the demo of our reinforcement learning based motion planning framework, done on June 5, 2022, that allows ..."
  ],
  [
    "Part IX Reinforcement Learning Trading Strategy. DQN: Testing Trading Strategy based on Agent Policy",
    "This is the final episode of the Deep Learning Trading Strategy from the beginning to the production series. In this video we are ..."
  ],
  [
    "Leslie Kaelbling: Reinforcement Learning, Planning, and Robotics | Lex Fridman Podcast #15",
    ""
  ],
  [
    "Deep Reinforcement Learning in Medical Imaging",
    "A presentation delivered at the Erlangen Health Hackers on 24.11.2020 about Deep Reinforcement Learning in Medical Imaging."
  ],
  [
    "Reinforcement Learning Topics You Must Know #shorts #skillslashacademy #programming #datascience",
    "shorts Here are some quick Reinforcement Learning Topics that you must know that are essential in your Data Science journey."
  ],
  [
    "AI - Reinforcement learning - Raspberry Robot",
    "Learning obstacle avoidance with reinforcement learning. MRPiZ is a mobile robot with Raspberry Pi Zero and laser ToF sensors."
  ],
  [
    "Complete Roadmap To Learn Machine Learning (PDF Included)",
    "In this video, we will look into a parallel conquering technique to learn machine learning from scratch. This video will teach you ..."
  ],
  [
    "Reinforcement Learning Will Change Marketing",
    "Slack: http://bit.ly/dataworkers-slack Twitter: https://www.twitter.com/nickduddy Instragram: https://www.instagram.com/thedataboi ..."
  ],
  [
    "Reinforcement Learning-Intro Video",
    ""
  ],
  [
    "Types of Machine Learning Algorithms Supervised Unsupervised Reinforcement Learning by Mahesh Huddar",
    "What is Machine Learning | Types of Machine Learning Algorithms | Supervised Unsupervised Reinforcement Learning by ..."
  ],
  [
    "What is an Episode in Reinforcement Learning | Machine Learning Interview Question #Shorts",
    "What is an Episode in Reinforcement Learning is a Machine Learning Interview Question, in a short video, to discuss the concept ..."
  ],
  [
    "Immediate Reinforcement Learning | Reinforcement Learning (INF8953DE) | Lecture - 1 | Part - 3",
    "This video talks about immediate RL aka multi-armed bandits. To follow along with the course schedule and syllabus, visit: ..."
  ],
  [
    "HANDS-ON REINFORCEMENT LEARNING WORKSHOP USING PYTHON",
    "IEEE Young Professionals Affinity Group Montreal Held a workshop for \"hands-on reinforcement learning workshop using Python ..."
  ],
  [
    "Reinforcement Learning with Random Delays - ICLR 2021",
    "Short presentation of Reinforcement Learning with Random Delays, presented at ICLR 2021. Conference paper: ..."
  ],
  [
    "RL #5: Value Functions | The Reinforcement Learning Series",
    "Welcome to the The Reinforcement Learning Series. I will try to explain all the fundamentals concepts of The Reinforcement ..."
  ],
  [
    "Bellman Principle of Optimality - Reinforcement Learning - Machine Learning",
    "RL07 Bellman Principle of Optimality Bellman Principle of Optimality Dynamic Programming method breaks down a multi-step ..."
  ],
  [
    "Reinforcement Learning Will Change Marketing",
    "Slack: http://bit.ly/dataworkers-slack Twitter: https://www.twitter.com/nickduddy Instragram: https://www.instagram.com/thedataboi ..."
  ],
  [
    "AI - Reinforcement learning - Raspberry Robot",
    "Learning obstacle avoidance with reinforcement learning. MRPiZ is a mobile robot with Raspberry Pi Zero and laser ToF sensors."
  ],
  [
    "#1 RLRSV1 : Post1 V1 Series on building recommendation systems with reinforcement learning",
    "This video introduces the complete series which is about building a recommendation system using reinforcement learning."
  ],
  [
    "Complete Roadmap To Learn Machine Learning (PDF Included)",
    "In this video, we will look into a parallel conquering technique to learn machine learning from scratch. This video will teach you ..."
  ],
  [
    "How Reinforcement Learning Algorithms Work - A High Level Overview",
    "Find the full course here: https://courses.dibya.online/p/fastdeeprl Get a high level overview of how Reinforcement Learning ..."
  ],
  [
    "Offline Reinforcement Learning With Only Realizability",
    "Jason Lee (Princeton) https://simons.berkeley.edu/talks/offline-reinforcement-learning-only-realizability Adversarial Approaches in ..."
  ],
  [
    "8.1 Unsupervised Learning, Recommenders, Reinforcement Learning|Welcome! -Machine Learning Andrew Ng",
    "Third and final Course: Unsupervised Learning, Recommenders, Reinforcement Learning. If you liked the content please ..."
  ],
  [
    "Deep Reinforcement Learning in Medical Imaging",
    "A presentation delivered at the Erlangen Health Hackers on 24.11.2020 about Deep Reinforcement Learning in Medical Imaging."
  ],
  [
    "Course Structure | Reinforcement learning in Financial Markets | Dr. Thomas Starke | Quantra Courses",
    "This video is the preview of our course on Deep Reinforcement Learning in Trading ..."
  ],
  [
    "Getting started with reinforcement learning on Kaggle",
    "Kaggle is a platform of choice for most of the machine learning and data science enthusiast. In this video, we explore a new ..."
  ],
  [
    "COG: Connecting New Skills to Past Experience with Offline Reinforcement Learning",
    ""
  ],
  [
    "Self-Driving Car with JavaScript Course – Neural Networks and Machine Learning",
    "Learn how to create a neural network using JavaScript with no libraries. In this course you will learn to make a self-driving car ..."
  ],
  [
    "Markov Process - Reinforcement Learning - Machine Learning",
    "RL03 Markov Process Markov Process - Reinforcement Learning - Machine Learning Process: A process is a sequence of states ..."
  ],
  [
    "Understanding Deep Reinforcement Learning agents for Atari Games! [Paper Explained]",
    "Ever wondered how to understand decision making of DRL agents? This paper presents a perturbation based salinecy method to ..."
  ],
  [
    "AlphaStar explained: StarCraft II using multi-agent reinforcement learning Presented by Kartik Jain",
    "This paper titled AlphaStar: Grandmaster in StarCraft II using multi-agent reinforcement learning by Vinyals et. al. is published in ..."
  ],
  [
    "Reinforcement Learning  Full Video | Innomatics Research Labs",
    "India's First ever 20+ hour course on Reinforcement Learning by 2 time awardee as Best Data Science EdTech in India by Times ..."
  ],
  [
    "K-Qbot: Language Learning Chatbot based on Reinforcement Learning",
    ""
  ],
  [
    "Multi-Agent Image Classification via Reinforcement Learning",
    "Multi-Agent Image Classification via Reinforcement Learning Hossein K. Mousavi, Mohammadreza Nazari, Martin Takáč, Nader ..."
  ],
  [
    "Support Vector Machine (SVM) Part-1 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "How Machines Learn",
    "How do all the algorithms around us learn to do their jobs? **OMG PLUSHIE BOTS!"
  ],
  [
    "Types of Machine Learning Algorithms Supervised Unsupervised Reinforcement Learning by Mahesh Huddar",
    "What is Machine Learning | Types of Machine Learning Algorithms | Supervised Unsupervised Reinforcement Learning by ..."
  ],
  [
    "difference between Deep learning and Reinforcement learning",
    "Follow us on Instagram : https://www.instagram.com/netzwerkacademy https://www.instagram.com/akash_l_kulkarni For more ..."
  ],
  [
    "A History of Reinforcement Learning - Prof. A.G. Barto",
    "Recorded July 19th, 2018 at IJCAI2018 Andrew G. Barto is a professor of computer science at University of Massachusetts ..."
  ],
  [
    "Introduction to Reinforcement Learning | Dr. Thomas Starke | Quantra Courses",
    "This video is the preview of our course on Deep Reinforcement Learning in Trading ..."
  ],
  [
    "RL-بالعربي - L01- Introduction to Reinforcement Learning",
    "بالعربي-RL هو سلسلة من الدروس عن التعلم المعزز وخوارزمياته باللغة العربية. لمتابعة باقي الدروس ..."
  ],
  [
    "Reinforcement Learning-Intro Video",
    ""
  ],
  [
    "A Reinforcement Learning Based Approach for Robotic Grasping Tasks",
    ""
  ],
  [
    "reinforcement learning simulation",
    "reinforcement learning model applied within AnyLogic simulation for pathfinding."
  ],
  [
    "NPTEL | Reinforcement Learning | Assignment 5 Solution | Week 5 answers | April 2021",
    "Answes of NPTEL Course - Reinforcement Learning Assignment no.5 Solution Week 5 answers."
  ],
  [
    "Reinforcement Learning example #deeplearning #shorts",
    ""
  ],
  [
    "Playing Flappy bird using Neural network || Reinforcement learning",
    "We will train a neural network that can play a flappy bird just by observing the screen pixel of the game. The agent will learn to ..."
  ],
  [
    "Visualizing Rewards in Reinforcement Learning",
    "In this video, we will have supercool visualization which will help you to feel the intuition behind rewards. This is the second of 15 ..."
  ],
  [
    "Linear Regression Explained in Hindi ll Machine Learning Course",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Introduction to Reinforcement Learning",
    "Kowshik Chilamkurthy works with LinkedIn as Research Engineer II where he works on Reinforcement Learning related problems ..."
  ],
  [
    "Multi-Agent Competitive Reinforcement Learning",
    "This video corresponds to our paper, Natural Emergence of Heterogeneous Strategies in Artificially Intelligent Competitive Teams, ..."
  ],
  [
    "Immediate Reinforcement Learning | Reinforcement Learning (INF8953DE) | Lecture - 1 | Part - 3",
    "This video talks about immediate RL aka multi-armed bandits. To follow along with the course schedule and syllabus, visit: ..."
  ],
  [
    "Q reinforcement learning",
    "Update for 7/25/2022 What you are seeing is the first few episodes of the AI agent training. The terminal state is either traveling ..."
  ],
  [
    "Tic Tac Toe (Reinforcement Learning)",
    ""
  ],
  [
    "Deep Reinforcement Learning for Online Combinatorial Optimization: The Case of Bipartite Matching",
    "Speaker: Elias Khalil Affiliation: University of Toronto Abstract: From assigning computing tasks to servers and advertisements to ..."
  ],
  [
    "Reinforcement Learning with Q Learning",
    "We are happy to inform you that we are conducting a two-day machine learning workshop series. This is definitely not a beginner ..."
  ],
  [
    "Self-Driving Cars - Lecture 4.1 (Reinforcement Learning: Markov Decision Processes)",
    "Lecture: Self-Driving Cars (Prof. Andreas Geiger, University of Tübingen) Course Website with Slides, Lecture Notes, Problems ..."
  ],
  [
    "NPTEL | Reinforcement Learning | Assignment 6 Solution | Week 6 answers | April 2021",
    "Answes of NPTEL Course - Reinforcement Learning Assignment no.6 Solution Week 6 answers."
  ],
  [
    "Hands-On Reinforcement Learning with R | 11: Exploring Deep Reinforcement Learning Methods",
    "Hands-On Reinforcement Learning with R is available from: Packt.com: http://bit.ly/2qG7L5w Amazon: https://amzn.to/2PBq4S2 ..."
  ],
  [
    "Reinforcement Learning based Routing Protocol WSN Projects | WSN Routing Protocol Tutorials",
    "Reinforcement Learning based Routing Protocol WSN Projects, We provide various research areas for research students over the ..."
  ],
  [
    "Reinforcement Learning in MATLAB with OpenAI Gym - Introduction",
    "In this series, I will go over the implementation of Reinforcement Learning in MATLAB on the OpenAI Gym environment."
  ],
  [
    "Cube Theory 101: Reinforcement Learning Cube Solver",
    "Paper link: https://arxiv.org/abs/1805.07470 Reddit links for discussion: ..."
  ],
  [
    "Q Learning - Reinforcement Learning - Machine Learning",
    "RL13 Q Learning Q Learning - Reinforcement Learning - Machine Learning Monte Carlo Method is conceptually easy but ..."
  ],
  [
    "Reinforcement Learning in Economics and Finance | AISC",
    "For slides and more information on the paper, visit ..."
  ],
  [
    "&quot;Reinforcement Learning for Extended Intelligence&quot; Prof. Shie Mannor (ICINCO 2022)",
    "Keynote Title: Reinforcement Learning for Extended Intelligence Keynote Lecturer: Shie Mannor Presented on: 14/07/2022, ..."
  ],
  [
    "Introduction to Inverse Reinforcement Learning",
    "Introduction video for Inverse Reinforcement learning series. Discusses IRL, it's application and challenges."
  ],
  [
    "I teach AI How to Drive a Car with Reinforcement Learning",
    "Code: https://github.com/monokim/PyRacing Self-driving car is very hot these days. I also want to make a self-driving car. So today ..."
  ],
  [
    "What is... the Rainbow Agent? Deep Reinforcement Learning state-of-the-art.",
    "Namaste! Please like this video and subscribe to my channel. The Rainbow Agent is the current state-of-the-art when it comes to ..."
  ],
  [
    "RL #14 How Recycling Robot works using Finite MDPs? | The Reinforcement Learning Series",
    "Welcome to The Machine Learning Course. I've built this course with all of my heart, patience and effort. Kindly appreciate the ..."
  ],
  [
    "#19 What is Reinforcement Learning | Data Science | Machine Learning Interview Question",
    "Shorts This is the series of Data Science interview Question, Machine Learning Interview Question, Deep Learning Interview ..."
  ],
  [
    "COOPERATIVE INVERSE REINFORCEMENT LEARNING NIPS 2016",
    ""
  ],
  [
    "HANDS-ON REINFORCEMENT LEARNING WORKSHOP USING PYTHON",
    "IEEE Young Professionals Affinity Group Montreal Held a workshop for \"hands-on reinforcement learning workshop using Python ..."
  ],
  [
    "Object Detection Using Deep Reinforcement Learning",
    "This is a project where object detection in images is performed using Deep Reinforcement Learning."
  ],
  [
    "Reinforcement Learning for Batch-to-Batch Bioprocess Optimisation | AISC",
    "Speaker(s): Antonio Del Rio Chanona Moderator: Mehrshad Esfahani Find the recording, slides, and more info at ..."
  ],
  [
    "NPTEL | Reinforcement Learning | Assignment 7 Solution | Week 7 answers | April 2021",
    "Answes of NPTEL Course - Reinforcement Learning Assignment no.7 Solution Week 7 answers Do like, share And subscribe."
  ],
  [
    "Simulation platform for robot training with reinforcement learning",
    "In the scope of the AI4DI research project at TUM, we are developing simulation environments in which AI agents can be ..."
  ],
  [
    "How to create trading Bot with Reinforcement Learning LSTM |  +91-9872993883 for query |Stock",
    "In this video, you can see how to stock market prediction system can be possible by using deep learning. One thing you can feel, ..."
  ],
  [
    "Reinforcement Learning with Lego Mindstorms - Swing Robot",
    "A LEGO Mindstorms Robot learns to swing! Skynet will kill us all! Reinforcement learning algorithm used is a simple linear Neural ..."
  ],
  [
    "Solving Blackjack using Reinforcement Learning",
    "Presentation COMP 6999."
  ],
  [
    "Simple Maze Solver Robot | Reinforcement Learning | Q-Learning | Python",
    "Trial project to supplement my understanding of Reinforcement Learning Repository: ..."
  ],
  [
    "Monte Carlo Reinforcement Learning Part 1",
    "https://medium.com/@thechrisyoon/deriving-policy-gradients-and-implementing-reinforce-f887949bd63 ..."
  ],
  [
    "Live Trading Overview | Reinforcement Learning | Dr. Thomas Starke | Quantra Courses",
    "This video is the preview of our course on Deep Reinforcement Learning in Trading ..."
  ],
  [
    "Q Learning - Reinforcement Learning - Machine Learning",
    "RL13 Q Learning Q Learning - Reinforcement Learning - Machine Learning Monte Carlo Method is conceptually easy but ..."
  ],
  [
    "SPECIAL EDUCATION-Rules of Reinforcement",
    "Something that happens after a behaviour , that increase the occurrence of the same behaviour. Rules of Reinforcement ..."
  ],
  [
    "PyTorch for Deep Learning &amp; Machine Learning – Full Course",
    "Learn PyTorch for deep learning in this comprehensive course for beginners. PyTorch is a machine learning framework written in ..."
  ],
  [
    "NPTEL | Reinforcement Learning | Assignment 9 Solution | Week 9 answers | April 2021",
    "Answes of NPTEL Course - Reinforcement Learning Assignment no.9 Solution Week 9 answers Do like, share And subscribe."
  ],
  [
    "Lecture 10  Reinforcement Learning I",
    ""
  ],
  [
    "Stock Price Prediction Using Python &amp; Machine Learning",
    "Stock Price Prediction Using Python & Machine Learning (LSTM). In this video you will learn how to create an artificial neural ..."
  ],
  [
    "Reinforcement Learning for Search - Roman Grebennikov",
    "We talked about: 00:00 DataTalks.Club intro 01:37 Roman's background 03:18 The talk agenda 04:25 Ranking as a general idea ..."
  ],
  [
    "Hands-on Reinforcement Learning with TensorFlow: Introducing Deep Q-Networks|packtpub.com",
    "This video tutorial has been taken from Hands-on Reinforcement Learning with TensorFlow. You can learn more and buy the full ..."
  ],
  [
    "Apa itu Reinforcement Learning? [Jaringan Syaraf Tiruan Deep Learning] #INDOSOAI",
    "Membahas reinforcement learning, belajar dari experience. Di COLAB. Kami adalah Sekolah Artificial Intelligence (AI) Indonesia!"
  ],
  [
    "Reinforcement Learning | Deep Learning | Future is Here",
    ""
  ],
  [
    "Deep Reinforcement Learning - Hands-On (with Python). Book Review",
    "Apply modern #RL methods to practical problems of #chatbots, #robotics, discrete optimization, we automation, and more."
  ],
  [
    "A Layered Architecture for Active Perception: Image Classification using Deep Reinforcement Learning",
    "This is a demonstration of a RL agent from paper A Layered Architecture for Active Perception: Image Classification using Deep ..."
  ],
  [
    "A Deep Reinforcement Learning Perspective on Internet Congestion Control (ICML 2019)",
    "Noga H. Rotman, PhD Student, Hebrew University AI Week Yuval Ne'eman Workshop for Science, Technology and Security Tel ..."
  ],
  [
    "[Hindi] What is Reinforcement Learning | Types | Example || Stephen SIMON",
    "In this video we are going to learn what is reinforcement learning, the difference between, supervised and reinforcement learning, ..."
  ],
  [
    "why using reinforcement learning for stock trading",
    "1. discounted cash flow model used in finance 2. Bellman equation used in reinforcement learning 3. why AI is better than human ..."
  ],
  [
    "What is Reinforcement Learning? | Machine learning 🌐💻🤖",
    "In this video, we are learning about Reinforcement machine learning in Artificial Intelligence. that's a basic & fundamental of ..."
  ],
  [
    "NICE Presentation: Robust Scheduling through Reinforcement Learning-Guided Integer Programming",
    "This is the official presentation for the AAAI 22-accepted paper, \"NICE: Robust Scheduling through Reinforcement ..."
  ],
  [
    "OMNeT++ 2022: Simulated Environment for Reinforcement Learning Based Intrusion Detection",
    ""
  ],
  [
    "Learning in Neural networks | Unsupervised and Reinforcement Learning | Neural Networks",
    "In this video, we are going to discuss about the unsupervised and reinforcement learning processes in neural networks. Check out ..."
  ],
  [
    "Reinforcement Learning #4 | Components of RL Agent 🔥",
    "Reinforcement Learning Introduction #4 | Components of Agent. Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "Humanoid Trained with Reinforcement Learning algorithm",
    "A humanoid in MuJoCo environment trained with Reinforcment Algorithms using Tensorflow and Keras."
  ],
  [
    "Reinforcement Learning Basic Definitions - Machine Learning",
    "RL02 Reinforcement Learning Basic Definitions Reinforcement learning is an area of machine learning where a software agent ..."
  ],
  [
    "Reinforcement Learning in ML",
    "What is reinforcement learning in machine learning? blog post: ..."
  ],
  [
    "Reinforcement learning, Transfer learning with Examples",
    "This is a FREE & Virtual meetup for the benefit of the community -- -- Tech enthusiasts from ALL experience levels are welcome ..."
  ],
  [
    "Stanford CS234: Reinforcement Learning | Winter 2019 | Lecture 11 - Fast Reinforcement Learning",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/ai ..."
  ],
  [
    "Reinforcement learning with deterministic rewards and actions",
    "We discuss here the learning strategy in the simplified case of actions with deterministic results: both the next state and the reward ..."
  ],
  [
    "Reinforcement learning model in trading | Q learning | Quantra MOOCs | Apply Deep Reinforcement",
    "Free and Full access of a popular MOOC by Quantra is available here: ..."
  ],
  [
    "How to apply Reinforcement Learning to Business Problem? #reinforcement #learning #youtubeshorts",
    "How to apply Reinforcement Learning to your Business Problem?? ✓For career guidance content and consultation follow ..."
  ],
  [
    "NPTEL | Reinforcement Learning | Assignment 10 Solution | Week 10 answers | April 2021",
    ""
  ],
  [
    "Reinforcement Learning with ColdFusion by Minh Vo",
    "In this session we're going to explore Reinforcement Learning and how we can use it in our daily work lives (within the context of ..."
  ],
  [
    "Stability-preserving automatic tuning of PID control with reinforcement learning",
    "Author's Talk by Ayub I. Lakhani , Myisha A. Chowdhury , Qiugang Lu. Full text please visit ..."
  ],
  [
    "Application of Reinforcement Learning in Energy Management system of Hybrid electric vehicles",
    "Application of Reinforcement Learning in Energy Management system of Hybrid electric vehicles."
  ],
  [
    "Reinforcement Learning with Racetracks",
    "The SARSA and Value Iteration algorithm are implemented on various racetrack problems, allowing a car to get from start to finish ..."
  ],
  [
    "Reinforcement Learning",
    "Reinforcement Learning Q-Learning Complete Playlist: ..."
  ],
  [
    "Practical Reinforcement Learning - Example of RL in real-life (1.2)",
    "In this video, I explain the components of RL using an example task of attempting to teach a dog to stay warm during cold days."
  ],
  [
    "Model-Based Reinforcement Learning via Latent-Space Collocation",
    "ICML 2021 poster talk for the paper on \"Model-Based Reinforcement Learning via Latent-Space Collocation\". See details on the ..."
  ],
  [
    "Learning Paradigm-Learning without a Teacher || Reinforcement Learning || Unsupervised Learning",
    "Advanced Neural Networks || Swapna.C || Reinforcement Learning || Unsupervised Learning."
  ],
  [
    "Reinforcement Learning Nptel Assignment 0  Solution July Dec 2021",
    "nptel2021 #swayam #moocscourses #nptelassignment #nptelcourses #nptelanswers #machinelearning #artificialIntelligence ..."
  ],
  [
    "Reinforcement learning in Financial Markets | Dr. Thomas Starke | Quantra Courses",
    "This video is the preview of our course on Deep Reinforcement Learning in Trading ..."
  ],
  [
    "Reinforcement Learning in MATLAB with OpenAI Gym - RL Toolbox",
    "In this video, I introduce RL Toolbox and the RL app as a fantastic utility for solving RL problems."
  ],
  [
    "JCE CSE 17CS73 - M5_L9 - Reinforcement Learning(The Learning Task &amp; Q-Learning) by Prof. Amritkumar",
    "Module-5 Lecture-9 Lecture: Reinforcement Learning(The Learning Task & Q-Learning) JCE CSE 17CS73 - M5_L9 ..."
  ],
  [
    "Solving the Mountain Car Problem Using Reinforcement Learning",
    "This is a program I made for a project in my Robotics class. I must give credit to ..."
  ],
  [
    "Reinforcement Learning | TurtleBot3 Robot | Motion Planning for Robots",
    "Reinforcement Learning is a paradigm of Machine Learning Algorithms, that work on the principle of Learning by Doing."
  ],
  [
    "Antonio Celani: Learning to Fly High: Reinforcement Learning for Soaring and Airborne Wind Energy",
    "Title: Learning to Fly High: Reinforcement Learning for Soaring and Airborne Wind Energy Abstract: Soaring is a flying strategy ..."
  ],
  [
    "Python in Arabic #57 Reinforcement Q-Learning GYM التعليم المعزز",
    "https://towardsdatascience.com/atari-reinforcement-learning-in-depth-part-1-ddqn-ceaa762a546f ..."
  ],
  [
    "【機器學習2021】概述增強式學習 (Reinforcement Learning, RL) (一) – 增強式學習跟機器學習一樣都是三個步驟",
    "slides: https://speech.ee.ntu.edu.tw/~hylee/ml/ml2021-course-data/drl_v5.pdf."
  ],
  [
    "Reinforcement Learning Made Simple - The Goal",
    "This video goes over an introduction to reinforcement learning theory. Specifically, we dive into the objectives reinforcement ..."
  ],
  [
    "Reinforcement Learning in Action: Creating Arena Battle AI for &#39;Blade &amp; Soul&#39;",
    "In this 2019 GDC session, the NCSOFT team shares their experience on how they built pro-level AI agents for the arena 1v1 ..."
  ],
  [
    "Reinforcement Learning in MATLAB - DQN Theory",
    "\"Brief\" look at DQN theory. There are plenty of resources that go over this better than I did. Some examples: ..."
  ],
  [
    "Reinforcement Learning-Based Home Energy Management System for Resiliency - ACC",
    "Oral paper presentation at American Control Conference 2021. With increase in the frequency of natural disasters such as ..."
  ],
  [
    "Reinforcement Learning 5: Markov Property and State Transition Matrix",
    "reinforcement#deeplearning#intelligence."
  ],
  [
    "Virtual-to-real Deep Reinforcement Learning: Mobile Robots Mapless Navigation",
    "(IROS 2017) arxiv: https://arxiv.org/abs/1703.00420 Deep Reinforcement Learning has been successful in various virtual tasks."
  ],
  [
    "Q-Learning |Reinforcement Learning on AI தமிழில் Tamil - Part 45",
    "Q-Learning |Reinforcement Learning on AI தமிழில் Tamil - Part 45 ..."
  ],
  [
    "Deep Reinforcement Learning for Robotic Arm Manipulation",
    "Robotic arm manipulation is notoriously difficult due to the high dimensionality of the action space and observation space. Recent ..."
  ],
  [
    "Boat Attack | Navigation strategies learned by an ML-Agent | Reinforcement Learning",
    "To get the assets and build versions of this environment, check out the following links: Github env build repo ..."
  ],
  [
    "Reinforcement Learning Introduction | RL",
    ""
  ],
  [
    "Reinforcement Learning 4: Agent-Environment Interaction",
    "reinforcement#deeplearning#intelligence."
  ],
  [
    "Reinforcement learning Experment",
    "Reinforcement learning On Hen #amazing #amazingfacts #facts #factsintelugu #intrestingfacts #factsworld #viral #viralvideo ..."
  ],
  [
    "สอน Reinforcement Learning ด้วย TensorFlow (Part 1/5)",
    "Reinforcement Learning: เรียนรู้เทคนิคที่ให้เครื่องคอมพิวเตอร์เรียนรู้ด้วยตนเองจากประสบการณ์การลองผิดลองถูกด้วย TensorFlow ."
  ],
  [
    "Reinforcement learning in healthcare | Dr. Tatiane Nogueira, UFBA, Brazil.",
    "Reinforcement learning (RL) is a subfield of Machine Learning which has achieved increasing applicability in various healthcare ..."
  ],
  [
    "Q Learning Explained | Reinforcement Learning Using Python | Q Learning in Machine Learning",
    "QLearning #python #machinelearning #techtutorialseverywhere In this Q-Learning tutorial, I'll be covering the following topics in ..."
  ],
  [
    "Reinforcement Learning Session 1",
    ""
  ],
  [
    "Device Placement Optimisation with Reinforcement Learning",
    "In this tutorial i am going to explain the paper \"Device Placement Optimization with Reinforcement Learning\" by Azalia Mirhoseini ..."
  ],
  [
    "Deep Learning meets Reinforcement Learning | Reinforcement Learning Part-5",
    "Video Created By - Rajtilak Pal (M. Tech in AI, IIT Ropar) Finally, we present to you the algorithm that changed the look of ..."
  ],
  [
    "Logic Based Action Selection in Reinforcement Learning",
    "An alternative algorithm, where Action selection and State description are based on Inductive, Deductive or Abductive Reasoning."
  ],
  [
    "#Lec 9:Real-Life Applications of Reinforcement Learning|#Tutorial for  Machine Learning|#Hostbox cse",
    "This video is very useful for learn Machine learning Lecture By Nagarajan.S Applications in self-driving cars AWS DeepRacer is ..."
  ],
  [
    "FirstUniv Webinar on Video Games: Reinforcement Learning",
    "Reinforcement Learning is one of the hottest research topics currently and its popularity is only growing day by day. RL is a type of ..."
  ],
  [
    "Democratizing Reinforcement Learning by Rahul Kulkarni &amp; Madhu Shekar",
    "Democratizing Reinforcement Learning by Rahul Kulkarni, Solutions Architect, Amazon and & Madhu Shekar, Head, Digital ..."
  ],
  [
    "Прикладное машинное обучение 7. Intro to Reinforcement Learning",
    "Ссылка на материалы занятия: https://github.com/girafe-ai/ml-mipt/tree/advanced_f20/week1_07_Intro_to_RL Общая ..."
  ],
  [
    "Deep Reinforcement Learning (John Schulman, OpenAI)",
    "The talks at the Deep Learning School on September 24/25, 2016 were amazing. I clipped out individual talks from the full live ..."
  ],
  [
    "Basic Concepts | FrozenLake | Deep Reinforcement Learning",
    "Reinforcement Learning is a paradigm of Machine Learning Algorithms, that work on the principle of Learning by Doing."
  ],
  [
    "Ensemble &amp; Reinforcement Learning",
    "Machine Learning - Part 3."
  ],
  [
    "Deep Learning with R : Introduction to Unsupervised and Reinforcement Learning | packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "COMP3200 - Intro to Artificial Intelligence - Lecture 13 - Intro to Reinforcement Learning",
    "00:00 - Preroll 01:07 - Greetings 02:56 - Lecture Start 03:00 - RL Textbook 04:41 - What is RL? 06:47 - What is Machine Learning?"
  ],
  [
    "Build a board game app with policy gradient (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, walks through how to build a board game app that leverages TF Agents to train a ..."
  ],
  [
    "DQN | Self Driving Car on Highway | Deep Reinforcement Learning",
    "Q Learning is one of the most popular Reinforcement Learning algorithm. Q Learning works by learning the Q - Value function for ..."
  ],
  [
    "Reinforcement learning in sports analytics | AISC",
    "For slides and more information on the paper, visit https://ai.science/e/reinforcement-learning-in-sports-analytics--2021-01-28 ..."
  ],
  [
    "Reinforcement Learning 1: Introduction",
    "Introduction to reinforcement learning #reinforcement#deeplearning#intelligence."
  ],
  [
    "Hands-On Reinforcement Learning with R | 3: Markov Decision Processes in Action",
    "Hands-On Reinforcement Learning with R is available from: Packt.com: http://bit.ly/2qG7L5w Amazon: https://amzn.to/2PBq4S2 ..."
  ],
  [
    "Introduction to Reinforcement Learning ( Machine Learning Tutorial)",
    "In this video, we'll be discussing about the Reinforcement learning Reinforcement learning is an area of machine learning ..."
  ],
  [
    "The what, why and how of Reinforcement Learning.",
    "The past decade has seen the field of Reinforcement Learning make major progress. The recent hype in RL can be attributed to ..."
  ],
  [
    "【Review02】Deep Reinforcement Learning for Traffic Light Control in Vehicular Networks",
    "文献回顾系列 参考文献： Liang, X., Du, X., Wang, G., & Han, Z. (2018). Deep Reinforcement Learning for Traffic Light Control in ..."
  ],
  [
    "#72 | Reinforcement Learning | Machine Learning",
    "In this video, we will learn about, Reinforcement Learning In Machine Learning."
  ],
  [
    "Deep Reinforcement Learning algorithm completing Tekken Tag Tournament at highest difficulty level",
    "What a great milestone! Our #DeepReinforcementLearning agent has become strong enough to complete Tekken Tag ..."
  ],
  [
    "Lecture 13: Evaluating Clustering Algorithm, Introduction to Reinforcement learning",
    "CSCI-4930/5930: Machine Learning (Spring 2020) at University of Colorado Denver (CU Denver) Instructor: Ashis Kumer Biswas ..."
  ],
  [
    "Open AI Gym , Applications in Reinforcement Learning",
    ""
  ],
  [
    "Pommerman: Reinforcement Learning Project",
    "This is our attempt at the NIPS Pommerman challenge as a part of the CS 747: Foundations of Intelligent and Learning Agents ..."
  ],
  [
    "Reinforcement learning tutorial I Introduction to Reinforcement learning I AI JRVAE",
    "In this video on “Reinforcement Learning Tutorial” you will get an in-depth understanding about reinforcement learning ."
  ],
  [
    "Jacek Cyranka: Foundations of Interpretable and Reliable Reinforcement Learning",
    "Open Day of Doctoral Studies in Computer Science, University of Warsaw Dzień otwarty, studia doktoranckie z informatyki, ..."
  ],
  [
    "Reinforcement Learning (RL)  التعلم المعزز بالعربي",
    "Markov Decision Process شرح MDP شرح ماركوف agent, environment,, sate, Supervised Learning."
  ],
  [
    "Reinforcement Learning: Methods and Applications |Dr Rahee Walambe, Saranya| Weekly Webinar - 7",
    "Follow WiDS Mumbai : Facebook: https://www.facebook.com/widsMumbai/ LinkedIn: ..."
  ],
  [
    "Reinforcement Learning : Playing to Win | DSC GHRCE | Shweta Bhatt",
    "Reign the ML world with Reinforcement Learning just like AlphaGo did by defeating the former Go champion Sedol.   DSC ..."
  ],
  [
    "Sanjeev&#39;s talk on &quot;Reinforcement Learning and Applications in Autonomous Driving&quot; at IIT Ropar",
    "Sanjeev was invited to give a talk at IIT Ropar, on October 6, 2020, as a part of the Faculty Development Program sponsored by ..."
  ],
  [
    "Applications of Deep Reinforcement Learning for Cyber Security",
    "Speaker : Paresh Saxena."
  ],
  [
    "General Game-Theoretic Multiagent Reinforcement Learning",
    "Marc Lanctot (DeepMind) https://simons.berkeley.edu/talks/general-game-theoretic-multiagent-reinforcement-learning Multi-Agent ..."
  ],
  [
    "Creating A Reinforcement Learning Terran Bot | Bits of Code",
    "in this episode, Steven shows you how to make your own Refinformcement Learning StarCraft 2 Terran bot to defeat the opponent ..."
  ],
  [
    "Rotary Inverted Pendulum System Using Reinforcement Learning",
    "A rotary inverted pendulum is an unstable and highly nonlinear device and is used as a common model for engineering ..."
  ],
  [
    "DexPoint: Generalizable Point Cloud Reinforcement Learning for Sim-to-Real Dexterous Manipulation",
    "Project page: https://yzqin.github.io/dexpoint/"
  ],
  [
    "Michael Mishal on Reinforcement Learning [TECHNOLOGYANDFRIENDS 714]",
    "Michael Mishal describes how reinforcement learning can use rewards to solve complex artificial intelligence problems."
  ],
  [
    "Deep Reinforcement Learning in Trading | Course Announcement",
    "Ever since Google started Deep Reinforcement Learning with AlphaGo, I was very intrigued and started to develop my own deep ..."
  ],
  [
    "Generalising Robots, Planning Inventory &amp; expanding horizons of Reinforcement Learning |  Meetup #40",
    "PyData Delhi Virtual Meetup #40 Timestamps: 0:00 Timer 0:43 Introduction to PyData and NumFOCUS 6:29 Submit a talk ..."
  ],
  [
    "Automatic Maze Solver using Reinforcement Learning!",
    "Presented in this video is an implementation of Q-learning I did from scratch (including the game world and its visualization)."
  ],
  [
    "An Introduction to Reinforcement Learning",
    "Reinforcement learning (RL) is an area of machine learning concerned with how software agents ought to take actions in an ..."
  ],
  [
    "Digital Twins and Reinforcement Learning using Unity ML-Agents",
    "How to apply simulation and Reinforcement learning in the space of robotics and autonomous vehicles using Unity's ML agents ..."
  ],
  [
    "Unsupervised Domain Adaptation with Dynamics-Aware Rewards in Reinforcement Learning",
    "This video is part of the Reinforcement Learning (RL) reading club organized by Aalto Robot Learning Lab at Aalto University, ..."
  ],
  [
    "Machine Learning #04 What is Reinforcement Learning ?",
    "Machine Learning #04 What is Reinforcement Learning ? Reinforcement learning is a type of Machine Learning algorithms which ..."
  ],
  [
    "Project 1: End To End Python ML Project (Complete)| Machine Learning Tutorials Using Python In Hindi",
    "This machine learning project using python in Hindi is created to give you a complete understanding on how machine learning ..."
  ],
  [
    "Lecture 1.1 — What Is Machine Learning — [ Machine Learning | Andrew Ng ]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "The reinforcement learning framework explained",
    "You will quickly learn how the reinforcement learning framework works and what you need to apply this mathematical model in ..."
  ],
  [
    "Customized Drone using Raspberry Pi and Reinforcement Learning",
    ""
  ],
  [
    "Reinforcement Learning in MATLAB with OpenAI Gym - Environment and first implementation",
    "We discuss the MountainCar-v0 environment and implement a random action policy on this environment in MATLAB #MATLAB ..."
  ],
  [
    "Reinforcement Learning Full Course using Python | Absolute Beginners | Part 01",
    "In this video we'll go over how to build a self-driving taxi using gym openai library. First we'll go over all the theoretical concepts ..."
  ],
  [
    "Reinforcement Learning taught FlapPy Bird",
    "This bot learns via Q-Learning with every move made. With every move made, the bird observes the state it was in, and the action ..."
  ],
  [
    "Using Reinforcement Learning to play Breakout",
    "Code from: https://github.com/boyuanf/DeepQLearning LinkedIn: https://ca.linkedin.com/in/arnavparuthi Previous reinforcement ..."
  ],
  [
    "Carla Autonomous Driving Simulation Reinforcement Learning Turkiye",
    "Carla Autonomous Driving Simulation Reinforcement Learning Turkce Reinforcement Learning Turkiye Carla - How to set up on ..."
  ],
  [
    "A State-Distribution Matching Approach to Non-Episodic Reinforcement Learning",
    "Overview of our proposed algorithm MEDAL, which will be presented at ICML 2022. Paper: https://arxiv.org/abs/2205.05212 ..."
  ],
  [
    "Reinforcement Learning Session 6",
    "Bharat Sreeram whatsapp 8886177798."
  ],
  [
    "How to implement reinforcement learning into AnyLogic: Part 3",
    "This is the third part of a four-part series learning how to build your own machine-learning algorithm within AnyLogic, using the ..."
  ],
  [
    "Animo Island, the game powered by reinforcement learning",
    "shorts An agent, reinforcement learning, and a dream, welcome to Animo Island! We are currently looking for passionate folks to ..."
  ],
  [
    "Generalization in Reinforcement Learning",
    ""
  ],
  [
    "Tutorial 56: Hidden Markov Model Process in Reinforcement Learning | HMM in Reinforcement Learning",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "ALBA  Reinforcement Learning for VOS (BMVC 2020)",
    ""
  ],
  [
    "what is reinforcement learning | machine learning | data science #shorts #machinelearning",
    "what is data science | machine learning | artificial intelligence | deep learning | Data science working place | studio of codejay ..."
  ],
  [
    "Harsh Reality of AI Jobs No one Tells You|",
    "In this video I talk about the reality of Artificial Intelligence jobs. Specifically I discuss: 1. Reality of getting Machine Learning/AI ..."
  ],
  [
    "Visualizing Model Free Prediction in Reinforcement Learning",
    "Model Free approaches fall into place when we don't have any prior information about the system. The video will be covering ..."
  ],
  [
    "Application of Reinforcement Learning in Forex Market",
    "In this video, we discuss the applications of reinforcement learning in financial markets. Please join our discord server to attend ..."
  ],
  [
    "Implementing Reinforcement Learning algorithm in an ego vehicle in Carla&#39;s Environment",
    "In this video, the ROS team of DSi presents a work on autonomous driving with Reinforcement Learning where Carla acts as the ..."
  ],
  [
    "What is Exploration and Exploitation in Reinforcement Learning | Interview Question",
    "What is Exploration and Exploitation in Reinforcement Learning is a good Machine Learning Interview Question. In this short ..."
  ],
  [
    "IIT Madras- CCBR- Prof  Peter Dayan-“Neural Reinforcement Learning”",
    "Prof. Peter Dayan, Director, Gatsby Computational Neuroscience Unit at University College London, UK."
  ],
  [
    "AI Live Project : Reinforcement Learning Solution",
    "Machine Learning is a field that has crazy advancements in the past couple of years. This trend and advancements have created ..."
  ],
  [
    "Setting up TicTacToe for Reinforcement Learning",
    "In this video I setup a TicTacToe simulation using Python. In the next video I apply tabular Q-learning for agent 1 to optimally solve ..."
  ],
  [
    "Practical Reinforcement Learning - Agents and Environments: Temporal Diff Learning| packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "Maze Solver using Q Learning (Reinforcement Learning)",
    "Welcome to all This video is about MATLAB implementation of Maze Solver using Q Learning. About the Reinforcement Learning: ..."
  ],
  [
    "Workshop on: Reinforcement Learning | Mr. Bhargav Patel | Hack the Mountains",
    "Are you curious how software agents ought to take actions in an environment in order to maximize the notion of cumulative reward ..."
  ],
  [
    "Reinforcement learning Part 3 (Policy Search): AI lecture in urdu",
    ""
  ],
  [
    "Markov Decision Process - Reinforcement Learning - Machine Learning",
    "RL04 Markov Decision Process Markov Decision Process - Reinforcement Learning - Machine Learning Markov decision process ..."
  ],
  [
    "Deep Reinforcement learning | Deep Q learning for atari games Deepmind |",
    ""
  ],
  [
    "Reinforcement Learning #2 | History and State 🔥🔥",
    "Reinforcement Learning : Introduction part 2 (History and State) Udemy Course on Reinforcement Learning @ $15: ..."
  ],
  [
    "Neural Architecture Search with Reinforcement Learning(NAS)",
    "In this tutorial we explain the paper \"Neural Architecture Search with Reinforcement Learning\". Paper: ..."
  ],
  [
    "What is the MACHINE LEARNING | Supervised, Unsupervised and Reinforcement Learning | AI",
    "What is the Machine Learning https://physicsonly.com/what-is-the-machine-learning-in-ai/ Bhautik Kapadiya is Scientific Blogger, ..."
  ],
  [
    "Build a Custom Gym Environment for Deep Reinforcement Learning",
    "Learn how to set up your system to mesh with the OpenAI Gym API."
  ],
  [
    "Machine Learning Projects For Beginners 2023 | Machine Learning Projects | ML Projects | Simplilearn",
    "This video will help you build various \" Machine Learning Projects For Beginners 2023 \" from scratch. Starting with Heart Disease ..."
  ],
  [
    "Top 5 Free Online Machine Learning Courses | Computer Vision | NLP | Reinforcement Learning |",
    "MachineLearningCourses #MachineLearning #DeepLearning #DataScience #ComputerVision #NLP #ReinforcementLearning ..."
  ],
  [
    "Reinforcement Theory of Learning",
    "Reinforcement theory (also called “operant conditioning”) is generally associated with the work of B. F. Skinner. Reinforcement ..."
  ],
  [
    "End-to-End Robotic Reinforcement Learning without Reward Engineering",
    "End-to-End Robotic Reinforcement Learning without Reward Engineering Avi Singh, Larry Yang, Kristian Hartikainen, Chelsea ..."
  ],
  [
    "supervised learning, unsupervised learning, &amp; reinforcement learning objectives #shorts #ml #ai",
    "unfoldai #machinelearning #ml #machinelearningbasics #ai #artificialintelligence #beginnersguide #beginners #endtoend ..."
  ],
  [
    "SeaPearl: A Constraint Programming Solver guided by Reinforcement Learning",
    "Félix Chalumeau, Ilan Coulon, Quentin Cappart and Louis-Martin Rousseau Chair: Laurent Perron."
  ],
  [
    "Complete Roadmap for Machine Learning - 2023🔥 | How To Become Machine Learning Engineer? 🤑",
    "Are you interested in staying up-to-date with the latest trends and developments in machine learning? Look no further! In this ..."
  ],
  [
    "Deep reinforcement learning for Flappy Bird",
    "This video shows an AI agent playing the game Flappy Bird at three different difficulties. It was trained using deep Q-learning."
  ],
  [
    "Why You Should Join Our Reinforcement Learning Course | Innomatics Research Labs",
    "India's First ever 20+ hour course on Reinforcement Learning by 2 time awardee as Best Data Science EdTech in India by Times ..."
  ],
  [
    "Reinforcement Learning with Monte Carlo Methods",
    "In this video we learn how to use powerful Monte Carlo methods (random policies) to create an AI agent that learns to play the ..."
  ],
  [
    "Reinforcement Learning Session 8",
    "Bharat Sreeram 8886177798."
  ],
  [
    "Artificial Intelligence Apps Deep Learning Reinforcement learning - Turing AI App Intro",
    "This video is about Turing AI - An Android App to teach AI to android users. The Turing ai app is the first artificial intelligence app ..."
  ],
  [
    "Reinforcement learning for 1dof Spacecraft.",
    "I was recently tinkering some actor-critic based reinforcement learning algorithm and with tried to implement simple pitch control of ..."
  ],
  [
    "Reinforcement Learning in MATLAB - Additional Resources",
    "Additional resources for the reinforcement learning toolbox RL-Designer App: ..."
  ],
  [
    "Uncertainty-aware Contact-safe Model-based Reinforcement Learning",
    "This is the updated version of our previous upload. Timeline: 00:17 Introduction to Model-based Reinforcement Learning (MBRL)."
  ],
  [
    "Supervised, Unsupervised and Reinforcement Learning | Supervised vs Unsupervised vs Reinforcement",
    "This video explains supervised , unsupervised and reinforcement learning in hindi . Also discuss differences between supervised ..."
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning | Types of Artificial Intelligence | ML and AI",
    "Are you having trouble deciphering #machinelearningmodels? This video will teach you the fundamentals of each of them."
  ],
  [
    "COG: Connecting New Skills to Past Experiences with Offline Reinforcement Learning",
    "COG: Connecting New Skills to Past Experiences with Offline Reinforcement Learning. Avi Singh, Albert Yu, Jonathan Yang, ..."
  ],
  [
    "Metaverse and Reinforcement Learning / AI: Opportunities and Challenges",
    "AlbertaAI was founded by a group of passionate volunteers in September 2017. It is a non-profit organization with a vision to ..."
  ],
  [
    "Test and Tuning of Reinforcement Learning Agent in Q-Learning Project",
    "In this Artificial Intelligence Tutorial, we are going to Test and Tune the Reinforcement Learning Agent that we have implemented ..."
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning || Machine Learning with Python",
    "Supervised vs Unsupervised vs Reinforcement Learning || Machine Learning with Python Hi, Welcome to the Tutorial on Machine ..."
  ],
  [
    "Reinforcement Learning: Qwik Start | GSP691 | Perform Foundational Data, ML, and AI Task in Google#6",
    "ReinforcementLearning101 #CreateAnAIPlatformNotebook #CloneTheSampleCode # Overview Introduction Like many other ..."
  ],
  [
    "Reinforcement Learning Solved Lunar Lander",
    "https://github.com/AugustKarlstedt/openai-gym-stuffs."
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Training | Edureka Rewind - 1",
    "Edureka Machine Learning Course Master Program ..."
  ],
  [
    "Miguel Morales: On How Reinforcement Learning Aligned With Human Learnings | The Exploiting Podcast",
    "This is the video version of The Exploiting Podcast, \"Exploiting with Teja Kummarikuntla\" Website: https://exploit.chat Get 10% off ..."
  ],
  [
    "Reinforcement Learning Crash Course - Introduction",
    "Reinforcement Learning Crash Course by Viviane Clay (skip to 0:05:48 for content) 0:00:00 Introduction 0:00:50 Further ..."
  ],
  [
    "Deep reinforcement learning for aggressive quadrotor flights",
    "This is the video of our deep reinforcement learning framework for achieving aggressive quadrotor flights. We have proposed a ..."
  ],
  [
    "#8 RLRSV8 : Post1 V8 Recommendation Systems Using Reinforcement Learning-",
    "This video formulates the process for building a recommendation system using reinforcement learning techniques."
  ],
  [
    "Chat GPT Rewards Model Explained!",
    "How does Reinforcement learning come into play with ChatGPT? ABOUT ME ⭕ Subscribe: ..."
  ],
  [
    "Deep Reinforcement Learning for Autonomous Driving with AWS DeepRacer",
    "Welcome to IJCAI-ECAI 2022 AI4AD Workshop! https://learn-to-race.org/workshop-ai4ad-ijcai2022/ Title: Deep Reinforcement ..."
  ],
  [
    "A Distributional Perspective on Reinforcement Learning",
    ""
  ],
  [
    "Self-Driving race cars using Unity-3D and Deep Reinforcement learning",
    "In this video, the 3D cars learn to drive and race on their own using deep reinforcement learning. After several rounds of training ..."
  ],
  [
    "Maximum Entropy Inverse Reinforcement Learning Part 1",
    "Part 1 of Maximum Entropy Inverse Reinforcement Learning. Discusses the concept of maximum entropy and it's derivation."
  ],
  [
    "Self-Driving Car with Reinforcement Learning in Python | gym | OpenAI",
    "Learn how to build your own self driving car that is able to pick a passenger and drop him off at a given distination all using Python ..."
  ],
  [
    "Hands-On Reinforcement Learning with R | 12: Deep Q-Learning Using Keras",
    "Hands-On Reinforcement Learning with R is available from: Packt.com: http://bit.ly/2qG7L5w Amazon: https://amzn.to/2PBq4S2 ..."
  ],
  [
    "Introduction to Reinforcement Learning with Azure Personalizer",
    "Azure Personalizer enables the use of reinforcement learning for personalization with few lines of code!. It enables a full learning ..."
  ],
  [
    "Reinforcement Learning: Two DOF robot arm learning to reach the target in task space",
    "Source code is available at https://github.com/deepakraina99/ai-modeling-control-robotics."
  ],
  [
    "Fitted Value/Policy Iteration algorithm for Offline Reinforcement Learning (Paper Explained)",
    "Summary of the video: A Fitted Value/Policy Iteration algorithm solves the offline/batch reinforcement learning problem."
  ],
  [
    "Yannic Kilcher",
    "I make videos about machine learning research papers, programming, and issues of the AI community, and the broader impact of ..."
  ],
  [
    "Day 29/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Reinforcement Learning Solved Lunar Lander",
    "https://github.com/AugustKarlstedt/openai-gym-stuffs."
  ],
  [
    "Democratizing Reinforcement Learning by Rahul Kulkarni &amp; Madhu Shekar",
    "Democratizing Reinforcement Learning by Rahul Kulkarni, Solutions Architect, Amazon and & Madhu Shekar, Head, Digital ..."
  ],
  [
    "Day 29/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "Challenges of real world reinforcement learning",
    "In this talk to RLAI (rlai.ualberta.ca), I discuss why RL in the real world can be difficult, and how we might do better in practice."
  ],
  [
    "D.Reinforcement learning problem characteristics",
    "Machine learning."
  ],
  [
    "Deep reinforcement learning for aggressive quadrotor flights",
    "This is the video of our deep reinforcement learning framework for achieving aggressive quadrotor flights. We have proposed a ..."
  ],
  [
    "Supervised vs Unsupervised vs Reinforcement Learning | Types of Artificial Intelligence | ML and AI",
    "Are you having trouble deciphering #machinelearningmodels? This video will teach you the fundamentals of each of them."
  ],
  [
    "Arduino Reinforcement learning Crawling Robot",
    "Hello youtubers I did some reserach on reinforcement learning algorithms and finally made my own algorithm.This is based on ..."
  ],
  [
    "Policy Iteration - Model Based Reinforcement Learning - Machine Learning",
    "RL09 02 Policy Iteration Model Based Reinforcement Learning Machine Learning Model Based Reinforcement Learning In ..."
  ],
  [
    "Fitted Value/Policy Iteration algorithm for Offline Reinforcement Learning (Paper Explained)",
    "Summary of the video: A Fitted Value/Policy Iteration algorithm solves the offline/batch reinforcement learning problem."
  ],
  [
    "#31 RLRSV31 : Post7 V3 - Building self learning recommendation system using reinforcement learning",
    "This is the seventh post of the series on building self learning recommendation system using reinforcement learning. This video ..."
  ],
  [
    "Comparing Models in Production with Multi Armed Bandits and Reinforcement Learning by Chris Fregly",
    ""
  ],
  [
    "Self-Driving race cars using Unity-3D and Deep Reinforcement learning",
    "In this video, the 3D cars learn to drive and race on their own using deep reinforcement learning. After several rounds of training ..."
  ],
  [
    "Reinforcement Learning Crash Course - Introduction",
    "Reinforcement Learning Crash Course by Viviane Clay (skip to 0:05:48 for content) 0:00:00 Introduction 0:00:50 Further ..."
  ],
  [
    "IIT Madras- CCBR-Prof  Balaraman Ravindran-“Introduction to Reinforcement Learning”",
    "Prof. Balaraman Ravindran, Associate Professor at the Department of Computer Science and Engineering, IITM (CCBR)"
  ],
  [
    "Reinforcement learning for 1dof Spacecraft.",
    "I was recently tinkering some actor-critic based reinforcement learning algorithm and with tried to implement simple pitch control of ..."
  ],
  [
    "पुनर्बलन का सिद्धांत||Reinforcement Theory of Hull",
    "शिक्षा मनोविज्ञान के सिद्धांत: ..."
  ],
  [
    "Introduction to Reinforcement Learning with Azure Personalizer",
    "Azure Personalizer enables the use of reinforcement learning for personalization with few lines of code!. It enables a full learning ..."
  ],
  [
    "Hands-On Reinforcement Learning with Java : Understanding Stock Prediction Problem | packtpub.com",
    "This video tutorial has been taken from Hands-On Reinforcement Learning with Java. You can learn more and buy the full video ..."
  ],
  [
    "। Skill of Reinforcement । पुनर्बलन कौशल । Micro Teaching । सूक्ष्मशिक्षण ।",
    "reinforcement #reinforcementskill #microteaching #Teachingtechnique #पुनर्बलन #शिक्षणकौशल #teachingskills ..."
  ],
  [
    "Reinforcement Learning in MATLAB with OpenAI Gym - Q-Learning",
    "In this video, I show how to solve an environment using Q Learning in MATLAB."
  ],
  [
    "Unit 5 Part-1 | MACHINE LEARNING AKTU | Most Important Questions",
    "Unit 5 Part-1 Guys these are most important Questions of ML including previous year Questions also Topics Covered ..."
  ],
  [
    "Reinforcement Learning Bootcamp - Lecture 1",
    "We talked about multi-arm bandits in this session! Website - https://www.normschool.com/ Slides are not of our own, it is ..."
  ],
  [
    "Meta Reinforcement Learning (RL Project)",
    "Meta Reinforcement Learning (RL Project)"
  ],
  [
    "Reinforcement Learning in MATLAB with OpenAI-GYM - RL Toolbox 2",
    "I create a wrapper for the openAI-Gym environment to load into MATLAB and also create a custom DQN network. code: ..."
  ],
  [
    "Reinforcement Learning for Trading - Practical Examples and Lessons Learned | Dr Tom Starke",
    "Over the last two decades trading has seen a remarkable evolution from open-outcry in the Wall Street pits to screen trading all ..."
  ],
  [
    "Predicting off-road vehicle trajectories using inverse reinforcement learning",
    "Accompanying video for our CoRL 2018 paper \"Integrating kinematics and environment context into deep inverse reinforcement ..."
  ],
  [
    "Sim2Real Transfer: Time-in-State Deep Reinforcement Learning",
    "Demo of the transfer of policies to the autonomous robotic car in presence of variable runtime latencies. Paper: Sim2Real Transfer ..."
  ],
  [
    "Reinforcement Learning - Machine Learning ||  English || ML-13 || Explained || We &amp; Data",
    "Reinforcement Learning - Machine Learning. What is Agent, Environment, State, Reward etc., all needed for Reinforcement ..."
  ],
  [
    "Partial Observability | POMDP | Reinforcement Learning (INF8953DE) | Lecture - 12 | Part - 1",
    "This video gives you a brief overview of Partial Observability and POMDP To follow along with the course schedule and syllabus, ..."
  ],
  [
    "Temporal Difference Learning, Monte Carlo Method, Dynamic Programming in Reinforcement Learning",
    "Explanation of DP, MC, TD(lambda) in RL context. https://joonyounggwak.blogspot.com/ https://github.com/jgwak1."
  ],
  [
    "How to solve any maze using Reinforcement Learning - Dynamic Programming [Javascript]",
    "Links: This project: https://github.com/karthik947/Reinforcement-Learning--DP-Solve-any-Maze Gridworld: ..."
  ],
  [
    "Day 28/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "TD(lambda) Method in Reinforcement Learning",
    ""
  ],
  [
    "Kenji Doya, OIST: Neural circuits for reinforcement learning and mental stimulation",
    "Canonical Computation in Brains and Machines; Session 8 - Learning 1 ccbm2018.org."
  ],
  [
    "Reinforcement Learning with Python - Unit 1 MDP in RL - 20221221",
    "12/21 bigDataSpark Forum 教學活動：Python 強化學習 - \"Unit 1 Markov Decision Process (MDP) in RL\" Python 強化學習 Unit 1 ..."
  ],
  [
    "Free Class Recording: Machine Learning for Finance and Trading",
    "You can get the slides for the presentation here: ..."
  ],
  [
    "Reinforcement Learning: Qwik Start [GSP691]",
    "Reinforcement Learning: Qwik Start [GSP691] Link to the Lab: https://google.qwiklabs.com/focuses/10285?parent=catalog Full ..."
  ],
  [
    "AI Summit - Headfirst Reinforcement Learning - Azzeddine CHENINE",
    "Join the School of AI Algiers Community discord: https://discord.gg/cSzeHvnd ▻Subscribe to School of AI Algiers on YouTube: ..."
  ],
  [
    "[Reinforcement Learning] Controlling Commercial Cooling Systems Using Reinforcement Learning",
    "Paper link: https://arxiv.org/abs/2211.07357?fbclid=IwAR2N8EioCmfFjTLoxlakhLf9w3AcPmhHRClU4ry806L7Spl064EP4DYOhGk ..."
  ],
  [
    "Reinforcement Learning in Machine Learning || Reinforcemt Learning in easiest way",
    "This Video explained Reinforcement learning in easiest way in Hindi . Reinforcement learning (RL) is an area of machine learning ..."
  ],
  [
    "Gagne&#39;s Hierarchy of Learning for CTET, DSSSB, KVS, HTET, REET &amp; TETs | Pedagogy by Himanshi Singh",
    "Hello friends, this is Himanshi singh from Let's LEARN. Iss video mein humne discuss kia hai NCTE ke new notice ke baare mein ..."
  ],
  [
    "The 12 Steps to Machine Learning and AI",
    "A summary of the 12 Steps of Machine Learning and AI: 1 Objective & criteria 2 Data collection 3 Data splitting 4 Exploration 5 ..."
  ],
  [
    "Explore Random Forest Algorithm  | Machine Learning Training | Edureka | ML Rewind - 3",
    "Edureka Machine Learning Course Master Program ..."
  ],
  [
    "Machine learning algorithms | Artificial Intelligence | cheatsheet | top machine learning algorithm",
    "Top 10 Machine Learning Algorithms For Beginners: Supervised, Unsupervised Learning and More By Simon Tavasoli Last ..."
  ],
  [
    "Reinforcement Learning for Aiming  with Q-Learning algorithm || #reinforcementlearning #deeplearning",
    "Github link : https://github.com/tanzeelgcuf/Reinforcement-learning-for-aiming On running the test trails, both cubes fell for 7 times ..."
  ],
  [
    "Hull&#39;s reinforcement theory हल का पुनर्बलन सिद्धांत",
    "useful for B.ed,B.T.C,UGC NET CTET UP TET UK TET KVS and all teaching exams. Hull's reinforcement theory- Main concepts of ..."
  ],
  [
    "Tom uses AI to find Jerry. Q- learning - Reinforcement learning.",
    "This video discusses the task of reaching a goal in the grid. Our agent here uses q learning which is a reinforcement learning ..."
  ],
  [
    "Tesla Self Driving Simulator",
    "How does Tesla's Full Self Driving Software work? In this video, we'll learn the entire pipeline by building a javascript demo in a ..."
  ],
  [
    "Reinforcement Skill in micro teaching punarbalan koshal components ghatak lesson plan hindi english",
    "Reinforcement Skill in micro teaching punarbalan koshal components ghatak lesson plan hindi english B.ed class hind english ..."
  ]
]