[
  [
    "Support Vector Machine (SVM) Part-1 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Support Vector Machines Part 1 (of 3): Main Ideas!!!",
    "Support Vector Machines are one of the most mysterious methods in Machine Learning. This StatQuest sweeps away the mystery ..."
  ],
  [
    "Support Vector Machine in Hindi | Machine learning tutorials",
    "Machinelearning #LMT #lastmomenttuitions Machine Learning Full Course: https://bit.ly/3oobHT9 Last moment tuitions are ..."
  ],
  [
    "Support Vector Machine (SVM) in 2 minutes",
    "2-Minute crash course on Support Vector Machine, one of the simplest and most elegant classification methods in Machine ..."
  ],
  [
    "Support Vector Machine - How Support Vector Machine Works | SVM In Machine Learning | Simplilearn",
    "This Support Vector Machine (SVM) tutorial video will help you understand the basics of the Support Vector Machine algorithm, ..."
  ],
  [
    "Support Vector Machine (SVM) Basic Intuition- Part 1| Machine Learning",
    "In machine learning, support-vector machines are supervised learning models with associated learning algorithms that analyze ..."
  ],
  [
    "Machine Learning Tutorial Python - 10  Support Vector Machine (SVM)",
    "Support vector machine (SVM) is a popular classification algorithm. This tutorial covers some theory first and then goes over ..."
  ],
  [
    "Support Vector Machines (SVM)",
    ""
  ],
  [
    "Support Vector Machine by Mahesh Huddar",
    "Support Vector Machine by Mahesh Huddar Solved Linear SVM Example: https://www.youtube.com/watch?v=ivPoCcYfFAw ..."
  ],
  [
    "Support Vector Machines: All you need to know!",
    "MachineLearning #Deeplearning #SVM Support vector machine (SVM) is one of the best nonlinear supervised machine learning ..."
  ],
  [
    "Support Vector Machine (SVM) Part-2 ll Machine Learning Course Explained in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "16. Learning: Support Vector Machines",
    "MIT 6.034 Artificial Intelligence, Fall 2010 View the complete course: http://ocw.mit.edu/6-034F10 Instructor: Patrick Winston In this ..."
  ],
  [
    "Support Vector Machine In Python | Machine Learning in Python Tutorial | Python Training | Edureka",
    "Python Certification Training: https://www.edureka.co/machine-learning-certification-training ** This Edureka video on 'Support ..."
  ],
  [
    "Introduction Support Vector Machine",
    ""
  ],
  [
    "Support Vector Machine Classifier Indepth Intution In Hindi| Krish Naik",
    "github url : https://github.com/krishnaik06/Machine-Learning-Algorithms-Materials Stats Playlist In Hindi: ..."
  ],
  [
    "Solved Support Vector Machine | Linear SVM Example by Mahesh Huddar",
    "Solved Support Vector Machine | Linear SVM Example by Mahesh Huddar Website: www.vtupulse.com Facebook: ..."
  ],
  [
    "Machine Learning | Support Vector Machine",
    "A Support Vector Machine (SVM) is a discriminative classifier formally defined by a separating hyperplane. In other words, given ..."
  ],
  [
    "Support Vector Machines : Data Science Concepts",
    "Scary name. Simple method."
  ],
  [
    "Support vector machine in machine learning | Support vector machine python | SVM parameter tuning",
    "Support vector machine in machine learning | Support vector machine python | SVM parameter tuning Hello , My name is Aman ..."
  ],
  [
    "Maths Intuition Behind Support Vector Machine Part 2 | Machine Learning Data Science",
    "In machine learning, support-vector machines are supervised learning models with associated learning algorithms that analyze ..."
  ],
  [
    "Hindi Machine Learning Tutorial 11 - Support Vector Machine",
    "Support vector machine is a popular classification algorithm. This tutorial covers some theory first and then goes over python ..."
  ],
  [
    "support vector machine svm in data mining &amp; machine learning in hindi urdu",
    "This support vector machine svm in data mining is in hindi and urdu language. It explains what is support vector machine in data ..."
  ],
  [
    "Mathematics of SVM | Support Vector Machines | Hard margin SVM",
    "Created by InShot:https://inshotapp.com/share/youtube.html."
  ],
  [
    "Support Vector Machine - Georgia Tech - Machine Learning",
    "Check out the full Advanced Operating Systems course for free at: https://www.udacity.com/course/ud262 Georgia Tech online ..."
  ],
  [
    "Lecture 6 - Support Vector Machines | Stanford CS229: Machine Learning Andrew Ng (Autumn 2018)",
    "For more information about Stanford's Artificial Intelligence professional and graduate programs, visit: https://stanford.io/3Gchxyg ..."
  ],
  [
    "Support Vector Machine Algorithm in Machine Learning | Machine Learning Tutorial",
    "In this video, learn Support Vector Machine Algorithm in Machine Learning | Machine Learning Tutorial. Find all the videos of the ..."
  ],
  [
    "Support  Vector  Machine Algorithm  in Telugu",
    "svm #supportvectormachine #machinelearningalgorithm import numpy as np import matplotlib.pyplot as plt from sklearn import ..."
  ],
  [
    "Support Vector Machines - THE MATH YOU  SHOULD KNOW",
    "In this video, we are going to see exactly why SVMs are so versatile by getting into the math that powers it. If you like this video ..."
  ],
  [
    "Support vector machine in telugu",
    "What is support vector machine in machine learning ."
  ],
  [
    "Svm(support vector machines)",
    "KTU IT 304 DWM svm discussion in malayalam KTU CS 402 DMW svm (module IV) discussion in malayalam."
  ],
  [
    "SVM (The Math) : Data Science Concepts",
    "Let's get mathematical. SVM Intuition Video: https://www.youtube.com/watch?v=iEQ0e-WLgkQ."
  ],
  [
    "Support Vector Machines in Python from Start to Finish.",
    "NOTE: You can support StatQuest by purchasing the Jupyter Notebook and Python code seen in this video here: ..."
  ],
  [
    "Non-Linear Support Vector Machine (SVM) And Kernel Function ll Machine Learning Course in Hindi",
    "Myself Shridhar Mankar a Engineer l YouTuber l Educational Blogger l Educator l Podcaster. My Aim- To Make Engineering ..."
  ],
  [
    "Support Vector Machines (SVMs): A friendly introduction",
    "Announcement: New Book by Luis Serrano! Grokking Machine Learning. bit.ly/grokkingML 40% discount code: serranoyt An ..."
  ],
  [
    "Lecture 12.1 —  Support Vector Machines | Optimization Objective — [ Machine Learning | Andrew Ng]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "3.7 SVM Support Vector Machine",
    "GATE Insights Version: CSE http://bit.ly/gate_insights or GATE Insights Version: CSE ..."
  ],
  [
    "The Kernel Trick in Support Vector Machine (SVM)",
    "SVM can only produce linear boundaries between classes by default, which not enough for most machine learning applications."
  ],
  [
    "support vector machine in data mining  | SVM | linear and non linear support vector machine",
    "supportvectormachineindatamining#SVM#linearandnonlinearsupportvectormachine#SUPPORTVECTORMACHINE#datamining# ..."
  ],
  [
    "Tutorial on Support Vector Machines and using them in MATLAB",
    "A support vector machine (SVM) is a popular machine learning technique that delivers highly accurate, compact models."
  ],
  [
    "Support Vector Machine | Face Detection",
    "First Principles of Computer Vision is a lecture series presented by Shree Nayar who is faculty in the Computer Science ..."
  ],
  [
    "Lecture 11- Support Vector Machines",
    "This video is about SVM."
  ],
  [
    "Support Vector Machines | Geometric Intuition",
    "Like my content? Consider supporting the channel. The link is provided below- https://campusx.mojo.page/support-campusx."
  ],
  [
    "Lecture 68 — Support Vector Machines  Mathematical Formulation | Stanford",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "Lecture 12.2 — Support Vector Machines | Large Margin Intuition — [Machine Learning | Andrew Ng]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "Lecture 12.4 — Support Vector Machines | (Kernels-I) — [ Machine Learning | Andrew Ng]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "Solved Support Vector Machine | Non-Linear SVM Example by Mahesh Huddar",
    "Solved Support Vector Machine | Non-Linear SVM Example by Mahesh Huddar Support Vector Machine: ..."
  ],
  [
    "Support Vector Machines I  Machine Learning",
    "Support Vector Machines I Linear Classification Machine Learning Fundamentals #MachineLearning #ml #deeplearning ..."
  ],
  [
    "Support Vector Machine with example in machine learning | Lec-17",
    "machinelearning #ersahilkagyan Subscribe the channel for more videos ..."
  ],
  [
    "Support Vector Machines||Malayalam||Machine Learning Course||Part-17",
    "Support Vector Machines||Malayalam||Machine Learning Course||Part-17 This part of \"Machine Learning Course\" in Malayalam ..."
  ],
  [
    "Lecture 11 : Support Vector Machine - I",
    "SVM, Linear classifier, Perceptron criteria, gradient descent optimization, Support Vector Machine."
  ],
  [
    "Support Vector Machines (SVM) Overview and Demo using R",
    "Quick overview and examples /demos of Support Vector Machines (SVM) using R. The getting started with SVM video covers the ..."
  ],
  [
    "Support Vector Machines (SVM) - the basics | simply explained",
    "This video is intended for beginners 1. The equation of a straight line 2. The general form of a straight line (02:19) 3. The distance ..."
  ],
  [
    "Support Vector Machines using RapidMiner",
    ""
  ],
  [
    "Support Vector Machine (SVM) with R - Classification and Prediction Example",
    "Includes an example with, - brief definition of what is svm? - svm classification model - svm classification plot - interpretation ..."
  ],
  [
    "How to implement SVM (Support Vector Machine) from scratch with Python",
    "In the 9th lesson of the Machine Learning from Scratch course, we will learn how to implement the SVM (Support Vector Machine) ..."
  ],
  [
    "Lecture 12.3 — Support Vector Machines | Mathematics Behind Large Margin Classification (Optional)",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "SVM Tutorial | Support Vector Machine In Python | Python Tutorial | Python Training | Edureka",
    "Edureka Python Certification Training: https://www.edureka.co/machine-learning-certification-training This Edureka video on ..."
  ],
  [
    "Support Vector Machines Math Explained Step By Step - Hard Margin Primal Formulation",
    "This video is a summary of math behind primal formulation of Hard Margin Support Vector Machines (SVM). Get ready for your ..."
  ],
  [
    "Machine Learning: What is a Support Vector Machine?",
    "This video is a part of an online course that provides a comprehensive introduction to practial machine learning methods using ..."
  ],
  [
    "Support Vector Machines I  Machine Learning",
    "Support Vector Machines I Linear Classification Machine Learning Fundamentals #MachineLearning #ml #deeplearning ..."
  ],
  [
    "Support Vector Machines (3): Kernels",
    "The kernel trick in the SVM dual; examples of kernels; kernel form for least-squares regression."
  ],
  [
    "38.  Support Vector Machine -SVM",
    "Machine learning See Complete Playlists: Design and analysis of algorithms: ..."
  ],
  [
    "Lecture 14 - Support Vector Machines",
    "Support Vector Machines - One of the most successful learning algorithms; getting a complex model at the price of a simple one."
  ],
  [
    "Basics of Support Vector Machine - part 1 / KTU Machine Learning",
    "svm #supportvectormachine #machinelearning This lecture introduces the basics you needed to understand support vector ..."
  ],
  [
    "Support Vector Machines | Geometric Intuition",
    "Like my content? Consider supporting the channel. The link is provided below- https://campusx.mojo.page/support-campusx."
  ],
  [
    "Practical Example on Support Vector Machine |  SVM Explained",
    "In this video I have explained Support vector machine(SVM) with practical example. SVM is a popular machine learning algorithm ..."
  ],
  [
    "Support Vector Machines - Theory and Implementation (MATLAB, CVX)",
    "In this video, we present the theoretical/mathematical introduction and practical implementation of linear Support Vector Machines ..."
  ],
  [
    "Support Vector Machine Intro and Application  - Practical Machine Learning Tutorial with Python p.20",
    "In this tutorial, we introduce the theory of the Support Vector Machine (SVM), which is a classification learning algorithm for ..."
  ],
  [
    "The C Parameter for Support Vector Machines - GCB 535",
    "A description of how C affects SVM models."
  ],
  [
    "Lecture 12.2 — Support Vector Machines | Large Margin Intuition — [Machine Learning | Andrew Ng]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "Machine Learning Tutorial 7 - Support Vector Machines (SVM) in Scikit-learn",
    "In this video, we'll implement Support Vector Machines using SciKit-Learn Library! SVM are supervised learning models with ..."
  ],
  [
    "How Support Vector Machines work / How to open a black box",
    "Part of the End-to-End Machine Learning School course library at http://e2eml.school A gentle introduction to how support vector ..."
  ],
  [
    "Support Vector Machine with example in machine learning | Lec-17",
    "machinelearning #ersahilkagyan Subscribe the channel for more videos ..."
  ],
  [
    "#1 SUPPORT VECTOR REGRESSION Clearly Explained",
    "Support vector regression clearly explained is good for learning data science. Support vector regression is considered superior to ..."
  ],
  [
    "Support Vector Machines (2): Dual &amp; soft-margin forms",
    "Lagrangian optimization for the SVM objective; dual form of the SVM; soft-margin SVM formulation; hinge loss interpretation."
  ],
  [
    "SVM (Support Vector Machine) in Python - Machine Learning From Scratch 07 - Python Tutorial",
    "Get my Free NumPy Handbook: https://www.python-engineer.com/numpybook In this Machine Learning from Scratch Tutorial, we ..."
  ],
  [
    "Support Vector Machine in Hindi (SVM) | Machine Learning",
    "In this video I have covered Support Vector Machine (SVM) in machine learning, svm advantages and disadvantages, svm ..."
  ],
  [
    "Support vector machine (SVM) - part 2 / Mathematical formulation of SVM / KTU Machine learning",
    "svm #supportvectormachine #machinelearning This lecture decribes support vector machine or svm and mathematical ..."
  ],
  [
    "Support Vector Machine (SVM) Classification Algorithm  Part 3 in Hindi   Machine Learning Tutorial",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In this ML ..."
  ],
  [
    "10. Support Vector Machines",
    "We define the soft-margin support vector machine (SVM) directly in terms of its objective function (L2-regularized, hinge loss ..."
  ],
  [
    "Mega-R5. Support Vector Machines",
    "MIT 6.034 Artificial Intelligence, Fall 2010 View the complete course: http://ocw.mit.edu/6-034F10 Instructor: Mark Seifter We start ..."
  ],
  [
    "Hyperparameters C &amp; Gamma in Support Vector Machine (SVM)",
    "In this video, I'll try to explain the hyperparameters C & Gamma in Support Vector Machine (SVM) in the simplest possible way."
  ],
  [
    "Support Vector Machines for Classification &amp; Regression | Machine Learning in Tamil - Part 19 | #49",
    "In this video, I discuss Support Vector Machines for tasks such as classification and regression. Links http://leadingindia.ai/ ..."
  ],
  [
    "When should I use Support Vector Machines (SVM)?",
    "Since I just made a course on SVMs and the topic is still fresh in my mind, I made a free educational lecture about when to use ..."
  ],
  [
    "Support Vector Machines Regression with Python",
    "Support Vector Machines Regression with Python more content at https://educationalresearchtechniques.com/"
  ],
  [
    "Data Mining with Weka (4.5: Support vector machines)",
    "Data Mining with Weka: online course from the University of Waikato Class 4 - Lesson 5: Support vector machines ..."
  ],
  [
    "Part 26-Support Vector Machines Regression",
    "Chapters: 0:00 The big picture 1:30 The roadmap 2:01 Support Vector Regressors (main idea) 3:23 SVR optimization problem ..."
  ],
  [
    "Support Vector Machines in R",
    "In this video I will explain how you can fit a support vector machines model in R #SupportVectorMachines #SVM #Modelling."
  ],
  [
    "Support Vector Machine (SVM) Algorithm  Part 2 in Hindi   Machine Learning Tutorial",
    "Course name: “Machine Learning – Beginner to Professional Hands-on Python Course in Hindi” In this ML course tutorial, we are ..."
  ],
  [
    "Mod-01 Lec-29 Support Vector Machine",
    "Pattern Recognition and Application by Prof. P.K. Biswas,Department of Electronics & Communication Engineering,IIT Kharagpur."
  ],
  [
    "ML Lecture 20: Support Vector Machine (SVM)",
    ""
  ],
  [
    "SVM Kernels | Support Vector Machines 101 | By Dr. Ry @Stemplicity",
    "This tutorial explains fundamentals of Machine Learning classification strategy known as Support Vector Machines! So what are ..."
  ],
  [
    "Machine Learning Lecture 14 &quot;(Linear) Support Vector Machines&quot; -Cornell CS4780 SP17",
    "Lecture Notes: http://www.cs.cornell.edu/courses/cs4780/2018fa/lectures/lecturenote09.html."
  ],
  [
    "Support Vector Machine (SVM) in 7 minutes - Fun Machine Learning",
    "Want to learn what make Support Vector Machine (SVM) so powerful. Click here to watch the full tutorial. ⭐6-in-1 AI MEGA ..."
  ],
  [
    "Python Machine Learning #4 - Support Vector Machines",
    "Today's episode is about Support Vector Machines which are a very powerful tool for the classification of data! Website: ..."
  ],
  [
    "3.7 SVM Support Vector Machine",
    "GATE Insights Version: CSE http://bit.ly/gate_insights or GATE Insights Version: CSE ..."
  ],
  [
    "Support Vector Machine: Slack Variables [E25]",
    "In this video, we saw how can we use SVM to separate linearly separable data with some outliers. Introduced the concept of slack ..."
  ],
  [
    "Machine Learning 41: Support Vector Machines - SMO Algorithm",
    "We finally present an algorithm for solving the dual optimization problem for support vector machines, namely the SMO algorithm ..."
  ],
  [
    "Image Classification Through Support Vector Machine (SVM) | Machine Learning",
    "In this tutorial we are going to learn: 1. Support Vector Machine as Image Classifier 2. How to Save data by Pickle 3. How to save ..."
  ],
  [
    "How to use Support Vector Machines to Predict Diamond Price - Part 1",
    "In this tutorial, I will show you how to perform Machine learning with Python using Support Vector Machines (SVMs), with the ..."
  ],
  [
    "Quantum Machine Learning with Support Vector Machines",
    "LinkedIn: https://www.linkedin.com/in/anisha-musti-056703180/ Medium: https://medium.com/@anishamusti."
  ],
  [
    "Fantastic Explanation of Support Vector Machine algorithm | Support Vector Machine Intuition",
    "Welcome to \"The AI University\". About this video: This video provides a fantastic explanation of support vector machine algorithm ..."
  ],
  [
    "Support vector machine (SVM) - part 2 / Mathematical formulation of SVM / KTU Machine learning",
    "svm #supportvectormachine #machinelearning This lecture decribes support vector machine or svm and mathematical ..."
  ],
  [
    "Support Vector Machine | Face Detection",
    "First Principles of Computer Vision is a lecture series presented by Shree Nayar who is faculty in the Computer Science ..."
  ],
  [
    "Lecture 12.6 — Support Vector Machines | Using An SVM — [ Machine Learning | Andrew Ng]",
    "GREAT DEAL*** ***12% OFF*** ***Apple MacBook Pro*** *BUY HERE:* https://amzn.to/3Wa365r."
  ],
  [
    "Support Vector Machines Regression with Python",
    "Support Vector Machines Regression with Python more content at https://educationalresearchtechniques.com/"
  ],
  [
    "Support Vector Machines Part 3: The Radial (RBF) Kernel (Part 3 of 3)",
    "Support Vector Machines use kernel functions to do all the hard work and this StatQuest dives deep into one of the most popular: ..."
  ],
  [
    "Support vector machine based classification using rapid miner",
    ""
  ],
  [
    "Support Vector Regression - in Comparison to Linear Regression [Lecture 3.6]",
    "\"How to use the support vector machine for regression problems? Why it is different to linear regression?\" Subscribe the channel ..."
  ],
  [
    "Support Vector Machines Explained",
    "Link to Article: https://linguisticmaz.medium.com/support-vector-machines-explained-8804cac06883 Link to explanation of ..."
  ],
  [
    "Training SVM model in Python| Hyper-parameter Tuning|GridSearch CV |Support Vector Machines #3|",
    "In this video i cover how to train an svm model in python using sklearn library on the popular sklearn wine dataset. Following ..."
  ],
  [
    "Part 25-Support Vector Machines, the Kernel trick",
    "Chapters: 0:00 The big picture 2:58 The road map 3:51 What is the Kernel trick? 6:00 SVM optimization problem 9:17 the RBF ..."
  ],
  [
    "Support Vector Machines - Part 4: Nonlinear SVMs",
    "This video is about Support Vector Machines - Part 4: Nonlinear SVMs Abstract: This is a series of videos about Support Vector ..."
  ],
  [
    "Support vector machines - 1 : Lagrangian formulation",
    "In this lecture we will discuss the Lagrangian formulation for the support vector machines."
  ],
  [
    "Support Vector Machines - Main Ideas! [Lecture 3.1]",
    "\"What is the key idea of a support vector machine (SVM)? Understand the theory of SVMs, a basic algorithm in machine learning.\""
  ],
  [
    "Azure Machine Learning Studio: Two-Class Support Vector Machine",
    "Dataset: https://www.ishelp.info/data/bikebuyers.csv This playlist (or related videos) is used in two of my online books: 1."
  ],
  [
    "ML 10:  Support Vector Machine | SVM Kernal | Soft Margin | Working with Examples",
    "Detail About: 1. Introduction Support Vector Machine 2. Types of SVM 3. SVM Algorithm Steps 4. Working of SVM 5. SVM Kernal 6."
  ],
  [
    "Support Vector Machines: A Visual Explanation with Sample Python Code",
    "SVMs are a popular classification technique used in data science and machine learning. In this video, I walk through how support ..."
  ],
  [
    "Support Vector Machines",
    ""
  ],
  [
    "Support Vector Machines - The Math of Intelligence (Week 1)",
    "Support Vector Machines are a very popular type of machine learning model used for classification when you have a small ..."
  ],
  [
    "Support Vector Machine (SVM) Algorithm Tutorial | Support Vector Machine Explained",
    "In this video, we'll give an Introduction to Support Vector Machines. we'll implement Support Vector Machines using SciKit-Learn ..."
  ],
  [
    "SVM Intuition Math and Solved Example |Support Vector Machines Learning Urdu/Hindi, Dr Arshad Afridi",
    "Support Vector Machines (SVM) Intuition is presented in this detailed video lecture with simple understandable Math and Solved ..."
  ],
  [
    "How SVM (Support Vector Machine) algorithm works",
    "Follow my podcast: http://anchor.fm/tkorting In this video I explain how SVM (Support Vector Machine) algorithm works to classify a ..."
  ],
  [
    "3. Support vector machine   Extract features and labels",
    "This video is a basic Introduction to classification and Support vector machines to Extract features and labels. This is a basic ..."
  ],
  [
    "MLVU 6.3: Support vector machines",
    "We start our investigation of support vector machines by looking into intuition behind the maximum margin hyperplane objective, ..."
  ],
  [
    "9 Support Vector Machines",
    "Virginia Tech Machine Learning Fall 2015."
  ],
  [
    "Support Vector Machines (SVM) Math Explained | Mathematics of SVM",
    "Support Vector Machines (SVM) are one of the most popular machine learning classifiers.This video is part of our Free ..."
  ],
  [
    "SVM in tamil part1 | what is support vector machines ? | hard margin | soft margin | slack variable",
    "In this video you will learn below topics related to SVM support vector machines In machine learning, support-vector machines ..."
  ],
  [
    "Part 16: Support vector machines for text classification using the e1071 R package",
    ""
  ],
  [
    "Support Vector Machines: Slack Variables",
    "Note: I seem to be incapable of pronouncing https://en.wikipedia.org/wiki/Xi_(letter)"
  ],
  [
    "4.4 Support Vector Machine with RBF Kernel [Applied Machine Learning || Varada Kolhatkar || UBC]",
    "A very high-level introduction of SVM RBFs. What are the similarities and difference between kNNs and SVM RBFs, what are ..."
  ],
  [
    "Introduction to Support Vector Machines  [SVM]",
    ""
  ],
  [
    "Did you know you could create support vector machines in Excel? | xl8ml.com",
    "Machine learning in Excel Watch and browse loads of real life case studies from Netflix style recommendation engines, to house ..."
  ],
  [
    "SVM with Examples in Urdu/Hindi |Support Vector Machines in AI, ML Data Science P1| Dr Arshad Afridi",
    "In this lecture we explained Support Vector Machine (SVM) from basic to advanced level. SVM is discussed with examples."
  ],
  [
    "[2021.04.08 Lesson8] Support Vector Machines",
    "Advanced MATLAB Programming for Machine Learning＞ Please find the syllabus and relevant materials on new link: ..."
  ],
  [
    "Support Vector Machines (SVM) by Example",
    "A short instructional video explaining the principle of Support Vector Machines by using a very simple example and animations."
  ],
  [
    "Part 14: Support Vector Machines",
    "In this video, I briefly described support vector machines and their application. I am collecting small donations for a primary school ..."
  ],
  [
    "7.3.2. Math behind Support Vector Machine Classifier",
    "In this video, I explained about the math behind Support Vector Machine Classifier. Once you watch the video, you will get a clear ..."
  ],
  [
    "Big Data Analytics : Support Vector Machines",
    ""
  ],
  [
    "Support Vector Machine Fundamentals - Practical Machine Learning Tutorial with Python p.23",
    "In this tutorial, we cover some more of the fundamentals of the Support Vector Machine. https://pythonprogramming.net ..."
  ],
  [
    "Support Vector machine  ( شرح عربي )",
    "هذا الفيديو صدقه جاريه علي روح جدي اتمني الدعاء له ========================================== مصدر 1 ..."
  ],
  [
    "SVM from Scratch - Machine Learning Python (Support Vector Machine)",
    "A from scratch implementation of SVM using the CVXOPT package in Python to solve the quadratic programming. Specifically ..."
  ],
  [
    "Support vector machines",
    ""
  ],
  [
    "Easy Way to Understand Support Vector Machines",
    "The next stop on our journey through classification algorithms in machine learning is the SVM algorithm and that is an acronym for ..."
  ],
  [
    "Support Vector Machine Learning MNIST Handwritten Digits",
    "Learn how to use Support Vector Machines (SVM) to classify handwritten digits from the MNIST database. This is a powerful ..."
  ],
  [
    "Training Support Vector Machines: an Application to Face Detection",
    ""
  ],
  [
    "Types of Support Vector Machines | What is Vectors and Hyperplane in SVM? | AI with AI",
    "This Video Helps You to Understand Different types of Support Vector Machines and also Explains What is Vectors and ..."
  ],
  [
    "Machine Learning Blink 9.2 (Hands-on step-by-step Support Vector Machine example)",
    "SVM #optimization #Lagrangian You can download the PDF of the lecture notes at: ..."
  ],
  [
    "Support Vector Machines and Kernel Transformations",
    ""
  ],
  [
    "Support Vector Machine Optimization - Practical Machine Learning Tutorial with Python p.24",
    "In this tutorial, we discuss the optimization problem that is the Support Vector Machine, as well as how we intend to solve it ..."
  ],
  [
    "Kernel Trick for Support Vector Machines [Lecture 3.4]",
    "\"What is the so-called Kernel trick? Why is it so beneficial for the dual formulation of the SVM?\" Subscribe the channel ..."
  ],
  [
    "Support Vector Machines II Machine Learning Fundamentals",
    "Support Vector Machines II Linear Classification Machine Learning Fundamentals #ml #MachineLearning ..."
  ],
  [
    "19-Support Vector Machines Classification Regression| Hyperplane | Support Vectors | SVM",
    "supportvectormachines #svm #supervisedalgorithms #techcharades #supervisedlearning #datascience #machinelearning."
  ],
  [
    "38.  Support Vector Machine -SVM",
    "Machine learning See Complete Playlists: Design and analysis of algorithms: ..."
  ],
  [
    "Part 23-Support Vector Machines (SVM) What are they?",
    "Chapters: 0:00 The big picture, what is the goal of SVM? 2:11 The road map 3:54 SVM Geometry, what is a hyperplane?"
  ],
  [
    "Support Vector machine in python ( شرح عربي )",
    "our group https://www.facebook.com/groups/89513... ========================================== our page ..."
  ],
  [
    "Support Vector Machines (SVM) - Part 1 - Linear Support Vector Machines",
    "In this lesson we look at Support Vector Machine (SVM) algorithms which are used in Classification. Support Vector Machine ..."
  ],
  [
    "038 Artificial Neural Networks and Support Vector Machines",
    ""
  ],
  [
    "Pattern Recognition [PR] Episode 28 - Laplacian Support Vector Machines",
    "In this video, we introduce the Laplacian SVM. Full Transcript ..."
  ],
  [
    "Week 9 : Support Vector Machines.",
    "Week 9 of ML bootcamp by Bharath k Reddy. You will learn- 1: Intution for Support Vector Machines. 2: Intution for Loss function ..."
  ],
  [
    "What is Support Vector Machine In Machine Learning in 5 mins",
    "This video explains the concept of Support Vector Machine In Machine Learning in 5 minutes. Machine Learning 101: ..."
  ],
  [
    "Support Vector Machines - Machine Learning 101 (Part 9)",
    "In this video, we continue our last topic, support vector machines. We recall the support vector classifier. We provide mathematical ..."
  ],
  [
    "Lecture 24 : Support Vector Machine III",
    ""
  ],
  [
    "Support Vector Machines - Part 1: Introduction",
    "This video is about Support Vector Machines - Part 1: Introduction Abstract: This is a series of videos about Support Vector ..."
  ],
  [
    "[05x05] Support-Vector Machine using LIBSVM.jl | Classification Supervised Machine Learning [Julia]",
    "In this Machine Learning coding tutorial, you'll learn how to build a Support-Vector Machine in Julia using the LIBSVM.jl Package."
  ],
  [
    "Support Vector Machine | SVM Tutorial | Edureka | ML/DS Live - 1",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Non Linear Support Vector Machines (Non Linear SVM)",
    "We looked at the linear type SVM in Part I of our SVM lesson series http://youtu.be/LXGaYVXkGtg. Here we are looking at ..."
  ],
  [
    "Support Vector Machines (SVM) in Machine Learning",
    "SVM or support vector machines are robust in performing classification and is eligible for higher dimensions also. In this tutorial ..."
  ],
  [
    "Big Data Analytics : Support Vector Machines",
    ""
  ],
  [
    "Machine Learning Tutorial 6 - Introduction to Support Vector Machines (SVM)",
    "In this video, we'll give an Introduction to Support Vector Machines! SVM are supervised learning models with associated learning ..."
  ],
  [
    "Support Vector Machine Tutorial For Beginners | SVM Tutorial | Edureka | Data Science Live - 1",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Kernel Trick in Support Vector Machine (SVM) | explained with visualization",
    "svm #kerneltrick #SupportVectorMachine In this video I have explained Support vector machine with Kernel trick. This goes deep ..."
  ],
  [
    "CS480/680 Lecture 13: Support vector machines",
    ""
  ],
  [
    "Support vector machine | Analytic Platform: KNIME",
    "DM kami di Instagram https://www.instagram.com/nnlearn/ Link download dataset: https://www.kaggle.com/andrewmvd/hear."
  ],
  [
    "Kernel Trick in Support Vector Machine (SVM)",
    "Support Vector Machines or SVMs perform very badly with datasets that are not linearly separable. However, this issue can be ..."
  ],
  [
    "Hands on Machine Learning - Chapter 5 - Support Vector Machines (SVM)",
    "An overview of Chapter 5 of the book Hands-on Machine Learning with Scikit-Learn Keras & Tensorflow Kernel Trick ..."
  ],
  [
    "Support Vector Machine | SVM Tutorial | Machine learning training | Edureka | ML Rewind - 1",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "¿Cómo funciona SVM?",
    "Imagina por un momento que te dan la tarea de graficar en un plano 2D datos que corresponden a triángulos y cuadrados."
  ],
  [
    "23-a LFD: Support vector machines (SVM). Fat hyperplanes and robustness to input noise.",
    "Machine Learning From Data, Rensselaer Fall 2020. Professor Malik Magdon-Ismail talks about the support vector machine and ..."
  ],
  [
    "Support Vector Machines: Part-1",
    "Support Vector Machines abbreviated as #svm is primarily a #classification #algorithm which tries to find the most optimum ..."
  ],
  [
    "Support Vector Machine in Python",
    "In machine learning, support-vector machines (SVMs) are supervised learning models with associated learning algorithms that ..."
  ],
  [
    "Support Vector Machines (SVM) Soft Margin Math Explained Step By Step - Primal &amp; Dual Formulations",
    "This video is a step by step explanation of math behind primal and dual formulation of Soft Margin Support Vector Machines ..."
  ],
  [
    "Machine Learning in ArcGIS Pro (Part 5 of 6): Support Vector Machine Algorithm - GIS Master Class",
    "This video is part five of a six video Geographic Information Systems (GIS) Master Class series. In the series, I will teach you about ..."
  ],
  [
    "SVM with Examples in Urdu/Hindi |Support Vector Machines in AI, ML Data Science P1| Dr Arshad Afridi",
    "In this lecture we explained Support Vector Machine (SVM) from basic to advanced level. SVM is discussed with examples."
  ],
  [
    "4.3 Support Vector Machines - Machine Learning Class 10-701",
    "Introduction to Machine Learning 10-701 CMU 2015 http://alex.smola.org/teaching/10-701... Lecture 4, Linear Methods Part 3, ..."
  ],
  [
    "Support Vector Machines for Structured Outputs",
    "Over the last decade, much of the research on discriminative learning has focused on problems like classification and regression, ..."
  ],
  [
    "Soft Margin for Support Vector Machines [Lecture 3.5]",
    "\"How to account for small violations of linearity and outliers for the SVM? Hard margin vs. soft margin. What are the so-calles slack ..."
  ],
  [
    "Support Vector Machines(SVM) Kernel Trick Math Step By Step Explained",
    "This video is a summary of math behind Kernel Trick for Soft Margin Support Vector Machines (SVM). Get ready for your interviews ..."
  ],
  [
    "Support Vector Machines",
    "Support Vector Machines."
  ],
  [
    "Support vector machines",
    "In this video I have explained the Support Vector Machines which is a supervised machine learning model which is used for ..."
  ],
  [
    "5.3 Nonlinear SVM | 5 Support Vector Machines | Pattern Recognition Class 2012",
    "The Pattern Recognition Class 2012 by Prof. Fred Hamprecht. It took place at the HCI / University of Heidelberg during the ..."
  ],
  [
    "Module_5- Support Vector Machines",
    "Mrs Saranya Babu Asst. Professor, Dept. of CSE, AJIET Mangalore Based on VTU 15CS82 (Big Data Analytics)- Module 5 i have ..."
  ],
  [
    "SVM or Support Vector Machine Learning Regression in Python and Sklearn",
    "SVM or Support Vector Machine Learning Regression in Python and Sklearn is a short video tutorial to explain the concepts ..."
  ],
  [
    "How Do Support Vector Machines (SVM) Work?",
    "Learn the basic concepts of maximum margin classifier, support vector classifier and support vector machines Kernel trick: ..."
  ],
  [
    "Support vector machines",
    "We introduce support vector machines as a tool to classify data by solving a convex optimisation problem."
  ],
  [
    "What are support vector machines?",
    "Support vector machines are maximum margin methods allowing the model to be written as the sum of the influences of some of ..."
  ],
  [
    "Training Support Vector Machines: an Application to Face Detection",
    ""
  ],
  [
    "Support Vector Machines",
    "This is a talk I gave at General Assembly on the basics of support vector machines, a machine learning model that can be used for ..."
  ],
  [
    "Lecture 29 - Support Vector Machines (04/14/2017)",
    "Introduction to Machine Learning - Support Vector Machines (Apr 14, 2017)"
  ],
  [
    "SVM Intuition Math and Solved Example |Support Vector Machines Learning Urdu/Hindi, Dr Arshad Afridi",
    "Support Vector Machines (SVM) Intuition is presented in this detailed video lecture with simple understandable Math and Solved ..."
  ],
  [
    "SVM or Support Vector Machine Learning Regression in Python and Sklearn",
    "SVM or Support Vector Machine Learning Regression in Python and Sklearn is a short video tutorial to explain the concepts ..."
  ],
  [
    "What are support vector machines?",
    "Support vector machines are maximum margin methods allowing the model to be written as the sum of the influences of some of ..."
  ],
  [
    "Support Vector Machines (SVM) (COMP 09012)",
    "This is part of a lecture series in Machine Learning at IT Sligo. This is part of the Online Master of Engineering in Connected and ..."
  ],
  [
    "Lecture 29 - Support Vector Machines (04/14/2017)",
    "Introduction to Machine Learning - Support Vector Machines (Apr 14, 2017)"
  ],
  [
    "Training Support Vector Machines: an Application to Face Detection",
    ""
  ],
  [
    "Support Vector Machines for Classification",
    ""
  ],
  [
    "Random Forest and Support Vector Machines Getting the Most from Your Classifiers",
    "Brett Wujek talks about tuning random forest and support vector machine algorithms to train high quality models. Learn more at ..."
  ],
  [
    "SVM Intuition Math and Solved Example |Support Vector Machines Learning Urdu/Hindi, Dr Arshad Afridi",
    "Support Vector Machines (SVM) Intuition is presented in this detailed video lecture with simple understandable Math and Solved ..."
  ],
  [
    "But How Does a Support Vector Machine Actually Work?",
    "Artificial Intelligence For Everyone: Episode #9 What is a Support Vector Machine (SVM)? How can Support Vector Machines ..."
  ],
  [
    "Support Vector Machines (SVM) - Google Colab",
    "dataset : https://drive.google.com/file/d/1gYJXnGxmmnumgFVCT4_Gx-0BenU_5ilv/view?usp=sharing."
  ],
  [
    "Support Vector Machine Tutorial For Beginners | SVM Tutorial | Edureka | Machine Learning Rewind - 4",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Support Vector Machines",
    "In this video we look at the intent and operation of a Support Vector Machine. The forst part covers theory and then we do 2 ..."
  ],
  [
    "Support Vector Machines",
    "This is a talk I gave at General Assembly on the basics of support vector machines, a machine learning model that can be used for ..."
  ],
  [
    "What is Support Vector Machines",
    "In this video I will explain you a machine learning algorithm \"Support Vector Machines \". #SupportVectorMachines #SVM ..."
  ],
  [
    "Types of Support Vector Machines | What is Vectors and Hyperplane in SVM? | AI with AI",
    "This Video Helps You to Understand Different types of Support Vector Machines and also Explains What is Vectors and ..."
  ],
  [
    "Hands-on Machine Learning -- Support Vector Machines",
    "Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow (2nd Edition) by Aurélien Géron Support Vector Machines ..."
  ],
  [
    "Data Science Lecture 5: Support vector machines [part of the IDS course @RWTH]",
    "Data Science Lecture 5: Support vector machines [part of the IDS course @RWTH] This online lecture of the Introduction to Data ..."
  ],
  [
    "Support Vector Machines Workshop",
    "This workshop aims to develop an intuition for support vector machines (SVM) and to introduce commonly used libraries."
  ],
  [
    "62- Support Vector Machine | Machine Learning in Python-(Day-30)",
    "dataScience #machineLearning #python #python_ka_chilla The whole Course: ..."
  ],
  [
    "Kernels in Support Vector Machines (SVM)",
    "In this video, I explain kernels, one of the essential components of SVMs. This channel is part of CSEdu4All, an educational ..."
  ],
  [
    "Support Vector Machines (SVM) Numerical Example",
    "Numerical Example; Support Vector Machines (SVM); Linear Separable Problem;"
  ],
  [
    "Derive the Dual Formulation for Support Vector Machines [Lecture 3.3]",
    "\"What is a dual formulation? How is this dual formulation related to the Lagrangian? How to derive the dual formulation for SVMs?"
  ],
  [
    "Support Vector Machine Code on Amazon Mobile Data Set | Lesson 86| Machine Learning |Learning Monkey",
    "machinelearning#learningmonkey In this class, we discuss the Support Vector Machine Code on Amazon Mobile Data Set."
  ],
  [
    "Support Vector Machines - OvR SVM (Week 10-05)",
    "Lecture Slides available at course page: https://www.zubairkhalid.org/ee514_2021.html This video: Support Vector Machines ..."
  ],
  [
    "Mod-06 Lec-40 Support Vector Machine (SVM)",
    "Pattern Recognition by Prof. C.A. Murthy & Prof. Sukhendu Das,Department of Computer Science and Engineering,IIT Madras."
  ],
  [
    "Active Learning for Support Vector Machines (SVMs)",
    "Brief tutorial on active learning for support vector machines. Based on: S. Tong and D. Koller (2001). \"Support vector machine ..."
  ],
  [
    "Support Vector Machine Tutorial For Beginners | SVM Tutorial | Edureka | Data Science Live - 1",
    "Edureka's Data Science Training: https://www.edureka.co/data-science-python-certification-course This Edureka video on ..."
  ],
  [
    "Lecture 13: Support Vector Machine (SVM) Part 1",
    ""
  ],
  [
    "Support vector machines (SVM) clearly explained | part - 1",
    "Theoretical explanation of support vector machines with better understanding #machinelearning #svm Python Tutorials playlist ..."
  ],
  [
    "Support Vector Machines - Neural Network Presentation",
    "Presentation on Support Vector Machine Under guidance by:- Dr. Chandra Prakash #nitdelhi #neural_network #ML ..."
  ],
  [
    "Overview of Support Vector Machines",
    "Training on Overview of Support Vector Machines by Vamsidhar Ambatipudi."
  ],
  [
    "Support Vector Machine- Topic # 8- Urdu/Hindi",
    "Course: Foundation of Al Topic: Supervised Learning- Support Vector Machine An overview of Supervised Learning followed by ..."
  ],
  [
    "Support Vector Machines",
    ""
  ],
  [
    "Support vector machines: not nearly as useful as most people think (but still important!)",
    "Support vector machines (SVMs) are a well-known class of machine learning models that get asked about a fair bit during ..."
  ],
  [
    "Non-linear Support Vector Machines Explained",
    "Link to Article: https://linguisticmaz.medium.com/support-vector-machines-explained-ii-f2688fbf02ae This series is designed to ..."
  ],
  [
    "Soft &amp; Hard Margin Support Vector Machine (SVM)| Machine Learning # 13",
    "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/ahmadbazzi01211 ..."
  ],
  [
    "Sample: Accord.NET Support Vector Machines",
    "Demonstration of handwritten digit recognition with the Accord.NET Framework. The Accord.NET Framework is a framework for ..."
  ],
  [
    "Support Vector Machines | Stock market prediction | Quantra Course Introduction",
    "Part of the course Trading With Machine Learning : Classification and SVM ..."
  ],
  [
    "MLIP L33 Introduction to Support Vector Machines (SVM)",
    "Link to the course page for all the relevant material: ..."
  ],
  [
    "Support Vector Machines - Nonlinear SVM and The Kernel Trick (Week 10-04)",
    "Lecture Slides available at course page: https://www.zubairkhalid.org/ee514_2021.html This video: Support Vector Machines ..."
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 4",
    "In this video we show the derivation of the dual optimization setup by using the Karush-Kuhn-Tucker conditions."
  ],
  [
    "Non-linear Support Vector Machine demo using RBF kernel 01",
    "Non-linear Support Vector Machine demo using RBF kernel."
  ],
  [
    "MBA - AI - Support Vector Machines in R",
    ""
  ],
  [
    "Predicting Blurred Numbers using Support Vector Machines(check the description for GitHub link)",
    "Link: https://github.com/NaNdalal-dev/Blurred_numbers_prediction."
  ],
  [
    "Developments on Support Vector Machines for Multiple-Expert Learning",
    "In supervised learning scenarios, some applications require solve a classification problem wherein labels are not given as a ..."
  ],
  [
    "Support Vector Machine (SVM) in Machine Learning |  Convex Optimization Application # 3",
    "Let's reach 100K subscribers https://www.youtube.com/c/AhmadBazzi?sub_confirmation=1 About The SVM method is a ..."
  ],
  [
    "Random Forest : Comparison with Logistic Regression and Support Vector Machine (SVM)",
    "Decision Trees: https://youtu.be/OlreMWwTJ_8 #DataScience​​​ #MachineLearning​​​ #RandomForest #DecisionTrees ..."
  ],
  [
    "Intro to ML.  Unit 08.  SVM.  Section 3.  Support Vector Machines",
    "This video is part of a series of videos for the Introduction to Machine Learning class at NYU taught by Prof. Sundeep Rangan."
  ],
  [
    "Lecture 14 | Support Vector Machines | Artificial Intelligence |Urdu",
    "Prepared by Sahar Waqar Reference: MIT 6.034."
  ],
  [
    "Introduction to Machine Learning Algorithms (5/6): Regularization and Support Vector Machines",
    "Introduction to Machine Learning Algorithms (part 5/6) Regularization and Support Vector Machines ..."
  ],
  [
    "Lecture 14: Support Vector Machine 2",
    ""
  ],
  [
    "Learn Support Vector Machines | ML with Python",
    "Use this link to copy the Cloudbook and code along with the trainer: ..."
  ],
  [
    "Support Vector Machines",
    ""
  ],
  [
    "KNN(K Nearest Neighbors) and SVM(Support Vector Machines) Important Interview Questions",
    ""
  ],
  [
    "14.2 - Support Vector Machines (SVM)",
    "Doing some machine learning with python's sklearn. This time we're going to play with support vector machines."
  ],
  [
    "Classification with Support Vector Machines | Part 2 (0-14) of Machine Learning Mastery",
    "How to classify with Support Vector Machines. Get the FREE course eBook ..."
  ],
  [
    "Support Vector Machines (Meeting 15)",
    "Broadcasted live on Twitch -- Watch live at https://www.twitch.tv/townviewml​ This was our fifteenth meeting. This week we ..."
  ],
  [
    "Support Vector Machines: Part 3: Non-separable Case",
    "This video is about Support Vector Machines: Part 3: Non-separable Case Abstract: This is a series of videos about Support ..."
  ],
  [
    "Support Vector Machines 3: Soft Margin SVM",
    ""
  ],
  [
    "Support Vector Machines | SVM | Implementation | Python | scikit-learn | SVM Kernel tricks |tutorial",
    "A support vector machine (SVM) is a supervised machine learning model that uses classification algorithms for two-group ..."
  ],
  [
    "UNSW 2020T2 | COMP9417 Machine Learning Week 8 | Support Vector Machines",
    ""
  ],
  [
    "Support Vector Machines [Workshop]",
    "Hi members! In this AI Club Machine Learning workshop, we learned how to create and train a Supervised Machine Learning ..."
  ],
  [
    "LECTURE 16||CS402 DATAMINING AND WAREHOUSING/Module 4/Support Vector Machines",
    ""
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 5",
    "In this video we continue with the derivation of the dual problem by using the KKT conditions."
  ],
  [
    "4.6: Support Vector Machines",
    "Week 4 lecture for COMP0088 Introduction to Machine Learning (6 of 6)"
  ],
  [
    "How Support Vector Machines Work | Intuitively and Clearly Explained in 4 minutes",
    "Support Vector Machine is a classic prediction technique in Machine Learning, particularly used for classification techniques."
  ],
  [
    "Test your understanding  on Support Vector Machines",
    "Prerequisite: Support Vector Machine Intuition: https://youtu.be/2SWT0TZbWHk SVM with kernel visualization ..."
  ],
  [
    "Learning for Machines [3.4] Support Vector Machine | Support Vector | Machine learning | Utkarshini",
    "freemachinelearningcourse #machinelearning #begginermachinelearning #freecourse #utkarshiniedutech Get the latest carrier ..."
  ],
  [
    "Mar25_Lecture2 Support Vector Machines. Derivation of quadratic optimization problem.",
    ""
  ],
  [
    "Support Vector Machines - Presentation 2 (Part Two)",
    "I talk about SVMs for non-separable data points."
  ],
  [
    "ML 3: Support Vector Machines.",
    "Support Vector Machines ('SVMs') are excellent tools for both classification and regression. Regression is used when we wish to ..."
  ],
  [
    "Support vector machines and kernels",
    "Kernel functions allow the support vector machines to work in high-dimensional, **implicit** feature space, **without ever ..."
  ],
  [
    "Support Vector Machines (SVM) for Beginners – 1.1",
    "Please find the full tutorial here: ..."
  ],
  [
    "Lecture 07 Support Vector Machines",
    "Machine Learning by Andrew Ng [Coursera] 0701 Optimization objective 0702 Large Margin Intuition 0703 The mathematics ..."
  ],
  [
    "Introduction to SVM(Support Vector Machine)",
    "In this lecture I have explained how SVM algorithm works."
  ],
  [
    "Support Vector Machines",
    "This Video discusses about the brief Explanation of Support Vector Machine."
  ],
  [
    "Understanding the mathematics behind Support Vector Machines ( Part 1)",
    "Learn Machine Learning & Data Science with MATLAB: ..."
  ],
  [
    "Support Vector Machines - Presentation 2 (Part One)",
    "I explain kernel functions."
  ],
  [
    "Exploring the math in Support Vector Machines -an IEEE Computer Society Silicon Valley Chapter Event",
    "An IEEE Day event The talk examines some of the mathematical intuition behind SVM. The speaker, Dr. Vishnu S. Pendyala, ..."
  ],
  [
    "Support Vector Machines",
    ""
  ],
  [
    "Support Vector Machines - Part 2b: Linearly Separable Case (cont&#39;d)",
    "This video is about Support Vector Machines - Part 2b: Linearly Separable Case (cont'd) Abstract: This is a series of videos about ..."
  ],
  [
    "SVM(Support Vector Machines) Introduction | SVM Case Study",
    "Please find the code in my Github link: https://github.com/amanvista/ML_Projects/tree/master/SVM."
  ],
  [
    "Support Vector Machines (SVM) for Beginners – 1.2",
    "Please find the full tutorial here: ..."
  ],
  [
    "Topic 31: Support Vector Machines",
    ""
  ],
  [
    "Introduction to Support Vector Machines",
    "Lecture in the Big Data and Machine Learning series."
  ],
  [
    "Part 17: Tuning Support Vector Machines for biomedical text classification in R",
    ""
  ],
  [
    "Support vector machines",
    "Support vector machines."
  ],
  [
    "Question #4 | Support Vector Machines | Types of kernels | ML Interview Questions &amp; Answers  #2022",
    "Types of kernels Suppose you build an SVM model using a polynomial kernel with default hyperparameters. It gives an accuracy ..."
  ],
  [
    "Quantum Support Vector Machine Kernel Algorithm",
    "Using IBM's qiskit to run this quantum machine learning algorithm and classify the Breast-Cancer dataset."
  ],
  [
    "Cork AI #5 - A Practical Guide to using Support Vector Machines",
    "Cork AI#5 was the fifth meetup sponsored by fourTheorem. here professor Paul Walsh gives a guide to using support vector ..."
  ],
  [
    "Support Vector Machines Part 1  : The Intuition",
    "Support Vector Machines Part 1 : The Intuition."
  ],
  [
    "SIT320 - Task 10a - Support Vector Machines - Video 1",
    "First video that give an overview of SVMs 1/2."
  ],
  [
    "Machine Learning - Support Vector Machines - Part 4 (SVM using Pytorch)",
    "In this video we look at how to implement support vector classifier in Pytorch."
  ],
  [
    "A Bi-objective Hyper-Heuristic Support Vector Machines for Big Data Cyber-Security",
    "A Bi-objective Hyper-Heuristic Support Vector Machines for Big Data Cyber-Security S/W: PYTHON, DJANGO ..."
  ],
  [
    "support vector machines and gesture recognition in max",
    "using ml.lib from cmu-artfab.org, an implementation of support vector machines (svm) for classifcation of iphone position in space ..."
  ],
  [
    "Support Vector Machines",
    "A brief introduction to Support Vector Machines."
  ],
  [
    "Support Vector Machines",
    "Content taken from Analytics Vidhya."
  ],
  [
    "Support Vector Machines: Solving using Lagrange",
    "In this video, I explain how to solve SVMs using Lagrangian multipliers. This channel is part of CSEdu4All, an educational ..."
  ],
  [
    "BDR: Support Vector Machines",
    "Description and an example of the Support Vector Machines algorithm."
  ],
  [
    "Machine Learning: Support-Vector Machines (SVMs)",
    "Validation, cross validation and grid search with multi class SVM. Given a set of training examples, each marked as belonging to ..."
  ],
  [
    "Destekçi Vektör Makineleri ( Support Vector Machine), (Weka Eğitim Serisi 14)",
    "Weka altında SMO ve LibSVM kullanımı, çekirdek fonksiyonları (kernel functions) ve temel olarak SVM algoritmasının nasıl ..."
  ],
  [
    "Support Vector Machines (Python) | Complete Tutorial in Python",
    "In this video, we discuss everything you need to know about Support Vector Machines in Python using sklearn! This is a complete ..."
  ],
  [
    "Lecture 23 - Part 1 - Support Vector Machines (Maximum Margin Classifier)",
    ""
  ],
  [
    "Lecture 6 (Part 1) - Support Vector Machine (SVM) and Kernel Trick - Machine Learning Course",
    "Machine Learning course taught by Dr. Mohamed-Rafik Bouguelia, at Halmstad University, Sweden. This lecture presents ..."
  ],
  [
    "41  Support Vector Machines SVM Overview",
    "Full Playlist - https://www.youtube.com/playlist?list=PLhPDbwEV7bBR7MkBsUmZ3XqWu91ZB9A_8 Course Resources ..."
  ],
  [
    "Support Vector Machines",
    "Full video (45 mins) is a part of 20 hours Machine Learning using R. This self paced learning course can be purchased from ..."
  ],
  [
    "Utilizing Quantum Support Vector Machines for Classification of Parkinson’s Disease",
    "I focused on building a QML algorithm to identify whether a patient has Parkinson's disease based on their speech features."
  ],
  [
    "Support Vector Machine",
    "\"(1) Revisiting the Lagrangian (2) Complementary slackness (3) Support vectors (4) Support vector machines (5) Issues with ..."
  ],
  [
    "Hard margin support vector machines: traditional derivation of margin",
    "Here is the full (traditional) mathematical derivation of the margin for the separating hyperplane in support vector machines."
  ],
  [
    "Support Vector Machines Part 2",
    "Support Vector Machines Part 1 #SVM#Machine learning Awesome song and introduction # Basic concepts and Maximal Margin ..."
  ],
  [
    "Support Vector Machines Tutorial",
    "Machine Learning Spring 2018."
  ],
  [
    "Question #2 | Support Vector Machines | Cost of Misclassifications | ML Interview Questions   #2022",
    "Cost of Misclassifications: For two classes, i.e. class A and class B, If the number of data points that are misclassified is more for ..."
  ],
  [
    "EE368 SC - SUPPORT VECTOR MACHINES/NETWORKS (SVM)",
    "Introduction to SVM.. SUPPORT VECTOR CLASSIFICATION & REGRESSION.."
  ],
  [
    "Lecture 18: Support Vector Machines (Part 2)",
    "CSCI-4930/5930: Machine Learning (Spring 2020) at University of Colorado Denver (CU Denver) Instructor: Ashis Kumer Biswas ..."
  ],
  [
    "What are Support Vector Machines?",
    "Get Our Complete Data Science Training at 57% OFF: https://bit.ly/3FtFsKf Download Our Free Data Science Career Guide: ..."
  ],
  [
    "Support Vector Machines",
    "VTU 8th sem BDA."
  ],
  [
    "075  Lecture 12 5 — Support Vector Machines   Kernels II — Machine Learning   Andrew Ng",
    ""
  ],
  [
    "How to Use LibSVM (Support Vector Machine) in C#",
    "How to Use Support Vector Machines in C# for Text Classification and or sentence prediction. I took an existing blog post that ..."
  ],
  [
    "What is SVM (Support Vector Machine) | Machine Learning Learner",
    ""
  ],
  [
    "Machine Learning: Support Vector Machine (SVM)",
    "iTeam https://www.facebook.com/iTeamUJ/ iTeam Academic Group https://www.facebook.com/groups/iTeam.Ju/"
  ],
  [
    "Using Support Vector Machines for both classification and regression solutions",
    "Step by step using Jupyter Notebook on Saturn Cloud."
  ],
  [
    "Support Vector Machines and Radon&#39;s Theorem",
    "A support vector machine (SVM) is an algorithm which finds a hyperplane that optimally separates labeled data points in R^n into ..."
  ],
  [
    "Support Vector Machines Part 1 :",
    "Support Vector Machines Part #SVM #Support Vector Machines are one of the most mysterious methods in Machine Learning."
  ],
  [
    "Support Vector Machines (SVM) Overview (Week 10-01)",
    "Lecture Slides available at course page: https://www.zubairkhalid.org/ee514_2021.html This video: Support Vector Machines ..."
  ],
  [
    "Support Vector Machines",
    "Intuition behind support vector machines. Draws on Provost-Fawcett book, Data Science for Business."
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 3",
    "In this video we continue studying the support vector machines classifier. Here we show the non linear case and the usage of the ..."
  ],
  [
    "Support Vector Machines - Hard SVM (Week 10-02)",
    "Lecture Slides available at course page: https://www.zubairkhalid.org/ee514_2021.html This video: Support Vector Machines ..."
  ],
  [
    "Support Vector Machines: 4. Primal and Dual Problem Introduction",
    "In this video I've Explained the difference between Primal Probem and Dual Proablem that we encounter in Support Vector ..."
  ],
  [
    "Support Vector Machines | Machine Learning from Scratch | Upskill with Python",
    "This video is a part of full ML series where we've discussed a lot of algorithm of Machine Learning in Detail from intuition on code ..."
  ],
  [
    "Support Vector Machines (Intro)",
    "SVM for classification, hard margin and soft margin problems, translating to quadratic programming."
  ],
  [
    "Chapter 7.1 | Support Vector Machines Workflow  | Machine Learning in Hindi | DataTheory",
    "Follow me on LinkedIn - https://www.linkedin.com/in/rahul-dogra-854244213/ This week we will start learning about Support ..."
  ],
  [
    "Support Vector Machines on PYNQ - Xilinx XOHW20_107",
    "A demonstration of my OpenHW 2020 submission - Hardware Acceleration of Support Vector Machines on PYNQ. You can find ..."
  ],
  [
    "Understanding Support Vector Machines From Scratch Part 3 - (Machine Learning)",
    "In this video, we will understand svm from scratch PART-3 Link for SVM playlist:- ..."
  ],
  [
    "A Bi objective Hyper heuristic Support Vector Machines for Big Data Cyber Security || Python Project",
    "For More Details Contact Name:Venkatarao Ganipisetty Mobile:+91 9966499110 Email :venkatjavaprojects@gmail.com ..."
  ],
  [
    "Support Vector Machines Explained - Machine Learning",
    ""
  ],
  [
    "quarter DIP Support Vector Machine: Two Separable Classes",
    "The video is about a well-known statistical model called support vector machine (SVM). The outline of this video includes: (1) ..."
  ],
  [
    "Data Analytics: Week 8 : Linear Methods and Support Vector Machines",
    ""
  ],
  [
    "Rule-extraction from support vector machines",
    "A video introduction to rule-extraction from support vector machines (SVMs) by Dr. Joachim Diederich. An important step towards ..."
  ],
  [
    "8 2 Support Vector Machines | Machine Learning",
    "SUPPORT VECTOR MACHINE* Skip to the end Q: First, can we intuitively say what the solution should look like? A: Yes, but we ..."
  ],
  [
    "Support Vector Machines 1",
    ""
  ],
  [
    "Support Vector Machines (SVM)",
    ""
  ],
  [
    "Support Vector Machines(SVM)",
    "In this video I have explained the Support Vector Machine algorithm using the concepts of support vectors, Boundary line, ..."
  ],
  [
    "Pattern Recognition  - Part 2 - Lecture 8 - Support Vector Machines",
    "Tiago Koketsu Rodrigues Graduate School of Information Sciences Tohoku University 課題１ ..."
  ],
  [
    "Support Vector Machines - Presentation 1 (Part Two)",
    "I talk about the geometric margin and pose an optimization problem to find the optimal margin for a set of training points."
  ],
  [
    "Maximum Margin Classifier, SVM - Support Vector Machine",
    "Explanation and example of finding a separating hyperplane using linear programming. 0:00 - Maximum Margin Classifier 2:20 ..."
  ],
  [
    "Python Implementation of Support Vector Machines, GridSearchCV",
    "Python Implementation of Support Vector Machines, GridSearchCV."
  ],
  [
    "ML 12.1 - Support Vector Machines",
    ""
  ],
  [
    "Machine Learning | 14 | Support Vector Machines SVM",
    "Machine Learning Course - CS 156 by Professor Yaser Abu-Mostafa This is an introductory course in machine learning (ML) that ..."
  ],
  [
    "Support Vector Machines with Kernels",
    "Support Vector Machines with Kernels."
  ],
  [
    "Support Vector Machines | Linear &amp; Non-Linear SVM | Kernel Function",
    "In this video we will talk about: Support Vector Machines, Linear and Non Linear SVMs, Kernel Functions."
  ],
  [
    "Support Vector Machine",
    "\"(1) Revisiting the Lagrangian (2) Complementary slackness (3) Support vectors (4) Support vector machines (5) Issues with ..."
  ],
  [
    "Hard margin support vector machines: traditional derivation of margin",
    "Here is the full (traditional) mathematical derivation of the margin for the separating hyperplane in support vector machines."
  ],
  [
    "Support Vector Machines Part 2",
    "Support Vector Machines Part 1 #SVM#Machine learning Awesome song and introduction # Basic concepts and Maximal Margin ..."
  ],
  [
    "MBA - AI - Regression + Support Vector Machines",
    ""
  ],
  [
    "Support Vector Machines - Study Session",
    "Support Vector Machines - Study Session w/ D Thomas services: contact@septillionai.com or services@mathematical.guru."
  ],
  [
    "Support Vector Machines--Geometric Formulation",
    "Prerequisite: Linear Separability Criterion with Convex Hull (SVM) https://youtu.be/c8AvwQeSRdQ Learn Complete Machine ..."
  ],
  [
    "Question #2 | Support Vector Machines | Cost of Misclassifications | ML Interview Questions   #2022",
    "Cost of Misclassifications: For two classes, i.e. class A and class B, If the number of data points that are misclassified is more for ..."
  ],
  [
    "Soft margin support vector machines: the loss function approach",
    "Soft margin support vector machines can be understood through a loss function, quantifying the number of errors the classifier ..."
  ],
  [
    "Lecture 18: Support Vector Machines (Part 2)",
    "CSCI-4930/5930: Machine Learning (Spring 2020) at University of Colorado Denver (CU Denver) Instructor: Ashis Kumer Biswas ..."
  ],
  [
    "EE368 SC - SUPPORT VECTOR MACHINES/NETWORKS (SVM)",
    "Introduction to SVM.. SUPPORT VECTOR CLASSIFICATION & REGRESSION.."
  ],
  [
    "What are Support Vector Machines?",
    "Get Our Complete Data Science Training at 57% OFF: https://bit.ly/3FtFsKf Download Our Free Data Science Career Guide: ..."
  ],
  [
    "Support Vector Machines",
    "VTU 8th sem BDA."
  ],
  [
    "075  Lecture 12 5 — Support Vector Machines   Kernels II — Machine Learning   Andrew Ng",
    ""
  ],
  [
    "Support Vector Machines | Machine Learning from Scratch | Upskill with Python",
    "This video is a part of full ML series where we've discussed a lot of algorithm of Machine Learning in Detail from intuition on code ..."
  ],
  [
    "Support Vector Machines and Radon&#39;s Theorem",
    "A support vector machine (SVM) is an algorithm which finds a hyperplane that optimally separates labeled data points in R^n into ..."
  ],
  [
    "Support Vector Machines Part 1 :",
    "Support Vector Machines Part #SVM #Support Vector Machines are one of the most mysterious methods in Machine Learning."
  ],
  [
    "Support Vector Machines (SVM) Overview (Week 10-01)",
    "Lecture Slides available at course page: https://www.zubairkhalid.org/ee514_2021.html This video: Support Vector Machines ..."
  ],
  [
    "Using Support Vector Machines for both classification and regression solutions",
    "Step by step using Jupyter Notebook on Saturn Cloud."
  ],
  [
    "Support Vector Machines in Python",
    "Code and Data used in this video can be found here: https://github.com/Mazen-ALG/The-Data-Series Link to Article: ..."
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 3",
    "In this video we continue studying the support vector machines classifier. Here we show the non linear case and the usage of the ..."
  ],
  [
    "Support Vector Machines",
    "Intuition behind support vector machines. Draws on Provost-Fawcett book, Data Science for Business."
  ],
  [
    "Day 18 Support Vector machines",
    ""
  ],
  [
    "Support Vector Machines: 4. Primal and Dual Problem Introduction",
    "In this video I've Explained the difference between Primal Probem and Dual Proablem that we encounter in Support Vector ..."
  ],
  [
    "Lecture 22: Support Vector Machines and Kernel Methods",
    "All of the lecture recordings, slides, and notes are available on our lab website: darbelofflab.mit.edu."
  ],
  [
    "Support Vector Machines (Intro)",
    "SVM for classification, hard margin and soft margin problems, translating to quadratic programming."
  ],
  [
    "Chapter 7.1 | Support Vector Machines Workflow  | Machine Learning in Hindi | DataTheory",
    "Follow me on LinkedIn - https://www.linkedin.com/in/rahul-dogra-854244213/ This week we will start learning about Support ..."
  ],
  [
    "Understanding Support Vector Machines From Scratch Part 3 - (Machine Learning)",
    "In this video, we will understand svm from scratch PART-3 Link for SVM playlist:- ..."
  ],
  [
    "Support Vector Machines on PYNQ - Xilinx XOHW20_107",
    "A demonstration of my OpenHW 2020 submission - Hardware Acceleration of Support Vector Machines on PYNQ. You can find ..."
  ],
  [
    "Support Vector Machines intuitive explanation",
    "Support Vector Machines is finding the maximum margin separator in a dimension in which data is linearly separable."
  ],
  [
    "A Bi objective Hyper heuristic Support Vector Machines for Big Data Cyber Security || Python Project",
    "For More Details Contact Name:Venkatarao Ganipisetty Mobile:+91 9966499110 Email :venkatjavaprojects@gmail.com ..."
  ],
  [
    "Support Vector Machines Explained - Machine Learning",
    ""
  ],
  [
    "Data Analytics: Week 8 : Linear Methods and Support Vector Machines",
    ""
  ],
  [
    "8 2 Support Vector Machines | Machine Learning",
    "SUPPORT VECTOR MACHINE* Skip to the end Q: First, can we intuitively say what the solution should look like? A: Yes, but we ..."
  ],
  [
    "Rule-extraction from support vector machines",
    "A video introduction to rule-extraction from support vector machines (SVMs) by Dr. Joachim Diederich. An important step towards ..."
  ],
  [
    "Support Vector Machines 1",
    ""
  ],
  [
    "Support Vector Machines(SVM)",
    "In this video I have explained the Support Vector Machine algorithm using the concepts of support vectors, Boundary line, ..."
  ],
  [
    "Pattern Recognition  - Part 2 - Lecture 8 - Support Vector Machines",
    "Tiago Koketsu Rodrigues Graduate School of Information Sciences Tohoku University 課題１ ..."
  ],
  [
    "Support Vector Machines - Presentation 1 (Part Two)",
    "I talk about the geometric margin and pose an optimization problem to find the optimal margin for a set of training points."
  ],
  [
    "Primal Form: Support Vector Machines",
    "We will derive the primal form for SVMs using concepts of linear classifiers in this video. Pre-requisites: knowledge about linear ..."
  ],
  [
    "Introduction to Machine Learning - Support Vector Machines (II)",
    "04/11/2016: CSE474/574 - Support Vector Machines (II)"
  ],
  [
    "ML 12.1 - Support Vector Machines",
    ""
  ],
  [
    "Python Implementation of Support Vector Machines, GridSearchCV",
    "Python Implementation of Support Vector Machines, GridSearchCV."
  ],
  [
    "Machine Learning | 14 | Support Vector Machines SVM",
    "Machine Learning Course - CS 156 by Professor Yaser Abu-Mostafa This is an introductory course in machine learning (ML) that ..."
  ],
  [
    "Vehicle Detection using Support Vector Machines",
    "A project for Udacity Self-Driving Car Engineer Nanodegree GitHub - https://github.com/r0busta/CarND-Vehicle-Detection."
  ],
  [
    "Support Vector Machines with Kernels",
    "Support Vector Machines with Kernels."
  ],
  [
    "Support Vector Machines | Linear &amp; Non-Linear SVM | Kernel Function",
    "In this video we will talk about: Support Vector Machines, Linear and Non Linear SVMs, Kernel Functions."
  ],
  [
    "How SVM (Support Vector Machines) solves the non-linear problems using Kernel trick  #2",
    ""
  ],
  [
    "SIT320 - Task 10a - Support Vector Machines - Video 2",
    "Second video that explains the math behind SVMs + quadratic programming problem + kernels. 2/2."
  ],
  [
    "Spam classification with Naive Bayes and Support Vector Machines-part2",
    "Spam classification with Naive Bayes and Support Vector Machines."
  ],
  [
    "Support Vector Machine | Build Email Spam Filter | R Programming | Re-Live | IvyProSchool",
    "In this tutorial we will learn about Support Vector Machine, Kernel function, how to find the right hyperplane, practical SVM Case ..."
  ],
  [
    "7   2   Support Vector Machines  Mathematical Formulation 12 15",
    ""
  ],
  [
    "Support Vector Machines: 3. What is Margin?",
    "Explanation of Margin and formulation of Optimization Problem in Support Vector Machines algorithm. Get the Lecture Notes ..."
  ],
  [
    "ch5 Support Vector Machines",
    "데이터마이닝 2 Chapter 5 Support Vector Machines By Il-Youp Kwak (https://ikwak2.github.io/) Textbook: Hands-On Machine ..."
  ],
  [
    "Understanding Regression using Support Vector Machines",
    "Understanding Regression using Support Vector Machines."
  ],
  [
    "A Bi-objective Hyper-Heuristic Support Vector Machines for Big Data Cyber-Security",
    "A Bi-objective Hyper-Heuristic Support Vector Machines for Big Data Cyber-Security S/W: PYTHON, DJANGO ..."
  ],
  [
    "Why Support Vector Machines (SVM) Are Large Margin Classifiers",
    "In this video I discuss about why the Support Vector Machines (SVM) are called large margin classifiers by looking their ..."
  ],
  [
    "Support Vector Machines 1",
    ""
  ],
  [
    "Mary-Jo &amp; the Support Vector Machines - LASSO",
    "Episode #2: We went down to the countryside to bring an ode to the LASSO (a.k.a. Least Absolute Shrinkage and Selection ..."
  ],
  [
    "ITJDM06 - Multi-view Scaling Support Vector Machines for Classification and Feature Selection",
    "IEEE PROJECTS, FINAL YEAR PROJECTS (CSE, IT, ECE, EEE, E&I, MCA, MSC, ME, M.TECH, BCA, BSC, MS) SPIRO PRIME ..."
  ],
  [
    "Support Vector Machines Tutorial",
    "Machine Learning Spring 2018."
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 1",
    "In this video, we introduce the support vector machines classifier, showing the optimization problem setup in the basic case."
  ],
  [
    "13-2 Stützvektormaschinen / Support Vector Machines / SVM – Industrial Data Science",
    "Interdisziplinäre Vorlesung Industrial Data Science an der TU Dortmund im Wintersemester 2020/21. Vorlesung 13, Teil 2 00:00 ..."
  ],
  [
    "Support Vector Machines SVM Dual Form Derivation Lagrange Constraint Optimization |Dr Arshad Afridi",
    "In this video we derive the dual form Lagrange Constraint Optimization of Support Vector Machines. We derive the dual form of ..."
  ],
  [
    "Zoe B. - Scaling Multi-Instance Support Vector Machines for Big Data Classification - VURS 2021",
    "Title: Scaling Multi-Instance Support Vector Machines for Big Data Classification More Projects: ..."
  ],
  [
    "Support Vector Machines Explained - Machine Learning",
    ""
  ],
  [
    "School of AI January 2020 ~ Support Vector Machines (SVM) by Wilco Bonestroo",
    "The 16th official school of AI meet up is held at Saxion University of Applied Sciences in Enschede on January 9th 2020 with host ..."
  ],
  [
    "Support Vector Machines: Constrained Optimization and Lagrangian Duality",
    "Transforming the SVM optimization problem into a dual form, leading to an intuitive result involving inner products."
  ],
  [
    "Intelligence Artificielle: Support Vector Machines",
    "Présentation des classificateurs SVM (Support Vector Machines)"
  ],
  [
    "Tutorial 7: Support Vector Machines: Part 3",
    "In this video we continue studying the support vector machines classifier. Here we show the non linear case and the usage of the ..."
  ],
  [
    "Machine Learning - Support Vector Machines - Part 1 (Hard Margin)",
    "This video covers the mathematical formulation of Hard Margin SVM."
  ],
  [
    "A CBIR CLASSIFICATION USING SUPPORT VECTOR MACHINES",
    "IEEE 2016 based ''A CBIR CLASSIFICATION USING SUPPORT VECTOR MACHINES''."
  ],
  [
    "Support Vector Machines - p1",
    "ML: Support Vector Machines - part 1."
  ],
  [
    "Support Vector Machines",
    "ML_Group 3 Presentation. Short Presentations."
  ],
  [
    "Introduction to Support Vector Machines",
    "Support Vector Machines (SVMs) for classification. Rather than explicitly representing a decision boundary between classes, ..."
  ],
  [
    "SVM, Support Vector Machines",
    "R code is here: https://gist.github.com/ashipunov/d4d017b5a85641616771f4a73b3293f4."
  ],
  [
    "SVM Support Vector Machines with Python   derja",
    "Support vector machines (SVMs) SVC, NuSVC and LinearSVC sklearn SVM: Maximum margin separating hyperplane, Non-linear ..."
  ],
  [
    "210 kernelized support vector machines",
    "Artificial intelligence."
  ],
  [
    "Math for ML (29) - Teoria Support Vector Machines",
    "Zapis spotkania naszej grupy na temat książki Mathematics for Machine Learning. Spotkanie odbyło się 04.10.2020 Prowadzący: ..."
  ],
  [
    "Support Vector Machines-Visualising Kernels",
    "Support Vector Machines uses kernels to separate non-linearly distributed datasets. However, in order to make this intuitive."
  ],
  [
    "Support Vector Machines (SVM) - Part 1 - Geometric and Mathematical Intuition",
    "In this video we discussed about: 1) What is SVM? 2) Hard Margin SVM 3) Soft Margin SVM Both geometric and mathematical ..."
  ],
  [
    "10-701 Student Presentation - Scalable Support Vector Machines and applications to Computer Vision",
    "Wen-Sheng Chu, Ishan Misra, Francisco Vicente Support Vector Machines (SVMs) are powerful tools in both classification and ..."
  ],
  [
    "04.1 Data Science and Python - Mathematics behind SVM (Support Vector Machines) made easy",
    "An easy intuitive explanation of the maths behind Support vector Machines and how we find a large margin separator. Guiding ..."
  ],
  [
    "Week 12 Part 2: Support Vector Machines",
    ""
  ],
  [
    "A Bi objective Hyper heuristic Support Vector Machines for Big Data Cyber Security || Python Project",
    "For More Details Contact Name:Venkatarao Ganipisetty Mobile:+91 9966499110 Email :venkatjavaprojects@gmail.com ..."
  ],
  [
    "A Bi objective Hyper Heuristic Support Vector Machines for Big Data Cyber Security",
    "python #datascience #internship #projects."
  ],
  [
    "support vector machines- demo lecture",
    ""
  ],
  [
    "Support Vector Machines (SVM) - part 1",
    "This is the first video presenting description of support vector machine. Few more shall follow this edition in shaa Allaah."
  ],
  [
    "Logistic Regression &amp; Support Vector Machines",
    "Presented by WWCode Data Science Sponsored by The Home Depot This video is Part 5 of 6 of the Intro to Machine Learning ..."
  ],
  [
    "SVM - Support Vector Machines",
    "Apresentaçao sobre Support Vector Machine para a Disciplina de Inteligência Artificial Universidade Federal do Maranhão."
  ],
  [
    "Support Vector Machines - p2",
    "ML: Support Vector Machines - part 2."
  ],
  [
    "Spam classification with Naive Bayes and Support Vector Machines-part2",
    "Spam classification with Naive Bayes and Support Vector Machines."
  ],
  [
    "Support Vector Machines Part 3",
    "Awesome song and introduction # Basic concepts and Maximal Margin Classifiers # Soft Margins (allowing misclassifications) ..."
  ],
  [
    "Support Vector Machines (SVM)",
    "CS402 - 31-05-2021 (Module 4)"
  ],
  [
    "Support Vector Machines - Presentation 1 (Part One)",
    "I talk about confident predictions using a margin concept and introduce the functional margin."
  ],
  [
    "Understanding Support Vector Machines From Scratch - (Machine Learning)",
    "In this video, we will understand svm from scratch PART-1 Link for SVM playlist:- ..."
  ],
  [
    "Example  Support Vector Machines for Classification",
    "A Scikit-Learn example for Support Vector Machines."
  ],
  [
    "Machine Learning and AI Support Vector Machines in Python 2019",
    "check out this link http://fainbory.com/7qhi to view more details."
  ],
  [
    "SL 9 Support Vector Machines",
    ""
  ],
  [
    "Lecture 15 (Support Vector Machines - Part 2)",
    "Support Vector Machines."
  ],
  [
    "Support Vector Machines",
    "Machine Learning Spring 2018."
  ],
  [
    "210 kernelized support vector machines",
    "Artificial intelligence."
  ],
  [
    "Image classification using Support Vector Machine (SVM) in Matlab",
    "In this video i have made a demo regarding image classification using svm. Specifically this demo describes about image ..."
  ],
  [
    "Support Vector Machines - p2",
    "ML: Support Vector Machines - part 2."
  ],
  [
    "Support Vector Machines Part 3",
    "Awesome song and introduction # Basic concepts and Maximal Margin Classifiers # Soft Margins (allowing misclassifications) ..."
  ],
  [
    "Support Vector Machines - Presentation 1 (Part One)",
    "I talk about confident predictions using a margin concept and introduce the functional margin."
  ],
  [
    "Occupancy-Driven Lighting with  Support Vector Machines and RPi Sensors",
    "Please see our website for details: https://sites.google.com/site/cosboswiki/ This demo is presented by Quan Wang, Xinchi Zhang, ..."
  ],
  [
    "Support Vector Machines (SVM)",
    "CS402 - 31-05-2021 (Module 4)"
  ],
  [
    "Understanding Support Vector Machines From Scratch - (Machine Learning)",
    "In this video, we will understand svm from scratch PART-1 Link for SVM playlist:- ..."
  ],
  [
    "SL 9 Support Vector Machines",
    ""
  ],
  [
    "AI &amp; ML in Finance - Lecture 17 - Support Vector Machines",
    "17th lecture in the online class \"Artificial Intelligence & Machine Learning in Finance\" held at Leipzig University, Faculty of ..."
  ],
  [
    "How to use Support Vector Machines to Predict Diamond Price - Part 2",
    "In this tutorial, I will show you how to perform Machine learning with Python using Support Vector Machines (SVMs), with the ..."
  ],
  [
    "Lecture 15 (Support Vector Machines - Part 2)",
    "Support Vector Machines."
  ],
  [
    "Support Vector Machines - An example problem (fkp - Institute of AI)",
    "This video is to share knowledge on Data Science & AI."
  ],
  [
    "support vector machines- demo lecture",
    ""
  ],
  [
    "18. Machine Learning Tutorial (Bangla) | SVM in Machine Learning | Support Vector Machine in ML",
    "SVM Classification in Machine Learning || Support Vector Machine (SVM) Bangla Tutorial. All dataset available here: ..."
  ],
  [
    "Machine Learning and AI Support Vector Machines in Python 2019",
    "check out this link http://fainbory.com/7qhi to view more details."
  ],
  [
    "Support Vector Machines 2: Kernel Functions",
    ""
  ],
  [
    "Data Mining with Weka | 24 |   Support vector machines SVMs",
    "Data Mining with Weka | 24 | Support vector machines SVMs Department of Computer Science University of Waikato New ..."
  ],
  [
    "Support Vector Machines Implementation Python | Hyperplane | SVM Kernels | Linear | Polynomial | RBF",
    "SVM is one of the most popular and widely used supervised machine learning algorithms. SVM offers very high accuracy ..."
  ],
  [
    "From support vector machines to kernel machines",
    "We discuss in this module about kernel functions, an elegant way to transform simple, essentially linear machine learning models, ..."
  ],
  [
    "Support Vector Machines video",
    ""
  ],
  [
    "Machine Learning 38: Support Vector Machines - Dual Problem",
    "We use techniques from convex optimization to derive a dual formulation of finding the maximum margin separating hyperplane."
  ],
  [
    "Wear State Estimation of Rolling Element Bearings using Support Vector Machines",
    "DOI: Pending (Preprint) Link to view paper: ..."
  ],
  [
    "Mary-Jo &amp; the Support Vector Machines - Gradient Boosting",
    "Episode #1: Gradient Boosting! © ℗ written, performed & produced by Marjolein Fokkema (2022)"
  ],
  [
    "Support Vector Machines",
    "Machine Learning Spring 2018."
  ],
  [
    "Question #3 | Support Vector Machines | Hyper parameter | ML Interview Questions &amp; Answers  #2022",
    "Support Vector Machines Interview Questions Question #3: https://youtu.be/dbiqUzooHkQ Question #2: ..."
  ],
  [
    "Support vector machines (ECE 592 Module 38)",
    "This module looks at support vector machines (SVM). An SVM is a classifier, where we try to find 2 parallel hyper planes that ..."
  ],
  [
    "Support Vector Machines (SVM) - part 3",
    "This is the third video presenting description of SVM starting from different SVM hyper-parameters parameters and the effect of ..."
  ],
  [
    "DA1G2- Support Vector Machines",
    ""
  ],
  [
    "EP28: Support Vector Machines using Python and Sci-kit Learn",
    "In this video I talk about implementing SVM using Python and Sci-kit Learn. Link to Google colab ..."
  ],
  [
    "Apprendre Machine Learning | Support vector machines (SVMs)",
    "Apprendre Machine Learning Support Vector Machine #Datascience #Ai #Artifcial Intelligence #Machine Learning."
  ],
  [
    "Lecture 14   Support Vector Machines",
    "View course materials on the course website - http://work.caltech.edu/telecourse.html Produced in association with Caltech ..."
  ],
  [
    "2110597 Pattern Recognition L8 Support Vector Machines",
    "Slides: https://ekapolc.github.io/slides/pattern/L8-Support_Vector_Machines.pdf."
  ],
  [
    "07 support vector machines",
    ""
  ],
  [
    "STAT 5660 Lecture 16 Support Vector Machines",
    "Course website: https://sites.google.com/a/georgiasouthern.edu/stephen-carden/teaching/stat-5660-statistical-data-analytics ..."
  ],
  [
    "Support Vector Machines tutorial",
    ""
  ],
  [
    "Support Vector Machines and Non Linear Transformation (Part 2)",
    ""
  ],
  [
    "EP27: Introduction to Support Vector Machines",
    "A Brief intro to Support Vector Machines."
  ],
  [
    "Machine Learning | Support vector machine-based diagnosis of Tuberculosis",
    "Author and Presenter: Maheen Shakeel https://www.researchgate.net/profile/Maheen_Shakeel Title: Support vector ..."
  ],
  [
    "Support Vector Machines Linear Data, Classification/Supervised Learning, Data Mining and Warehousing",
    "Support Vector Machines Linear Data, Classification Supervised Learning, Data Mining and Warehousing."
  ],
  [
    "Support Vector Machines Analytical Problems",
    "Listeners will be able to understand analyitcally how SVM algortihm works for linear classification problems."
  ],
  [
    "CS480/680 Lecture 14: Support vector machines (continued)",
    ""
  ],
  [
    "# SMA &#39;s  # ML SERIES #SVM ALGORITHM # SUPPORT VECTOR MACHINES#( CONCEPT + PYTHON CODING)",
    "HELLO GUYS!!!!!!!! In this video you will get a clear idea about a classification algorithm which is support vector machines through ..."
  ],
  [
    "Lecture 14   Support Vector Machines",
    "Support Vector Machines - Introduction; supervised, unsupervised, and reinforcement learning. Components of the learning ..."
  ],
  [
    "10 नरम सपोर्ट वेक्टर मशीन Soft support vector machines (Hindi Machine Learning)",
    "सब वीडियो: https://www.youtube.com/watch?v=19gsKaPjI48&list=PLQectjaXp6b2lORQubk3SQYP9sEUAaUbx ..."
  ],
  [
    "Session 17, Support Vector Machines (Kechen Zhang)",
    "Mathematical Foundations of BME 1 (Reza Shadmehr, PhD), Spring 2018 http://www.shadmehrlab.org/courses_mathfound TA: ..."
  ],
  [
    "Machine Learning 36: Support Vector Machines - Rewriting the Problem",
    "We continue our study of support vector machines and rewrite the optimization problem into a convex one to simplify the ..."
  ],
  [
    "Mary-Jo &amp; the Support Vector Machines - No Classifiers!",
    "Episode #3: We went down to the 7th layer of hell to exorcise the use of classifiers. Please teach your children and students about ..."
  ],
  [
    "Support Vector Machine Algorithm || SVM Algorithm Machine Learning",
    "Supoort Vector Machine is easily explained in this video . In machine learning, support-vector machines are supervised learning ..."
  ],
  [
    "Support vector machines    |  Class - 2 |  Data Science | 28-09-21.",
    "Support vector machines | Class - 2 | Data Science | 28-09-21. Support vector machines (SVM s) are a set of supervised learning ..."
  ],
  [
    "Support Vector Machines tutorial",
    ""
  ],
  [
    "Kernelized Support Vector Machines (ELE492)",
    "ELE492 Book Chapter Presentations Hacettepe University."
  ],
  [
    "Why Support Vector Machines (SVM) Are Large Margin Classifiers",
    "In this video I discuss about why the Support Vector Machines (SVM) are called large margin classifiers by looking their ..."
  ],
  [
    "Support Vector Machines In Statistical Shape Analysis",
    ""
  ],
  [
    "Lecture 17: Dual Support-Vector Machines",
    ""
  ],
  [
    "Machine Learning Lecture 18: Support vector machines (SVM) cost function/K-Nearest Neigbors (KNN)",
    ""
  ],
  [
    "Machine Learning - Support Vector Machines - Part 2 (Soft Margin)",
    "This video covers the mathematical formulation of Soft Margin SVM."
  ],
  [
    "Support Vector Machines | ML-005 Lecture 12 | Stanford University | Andrew Ng",
    "Contents: Optimization Objective, Large Margin Intuition, Mathematics Behind Large Margin Classification Optional, Kernels, ..."
  ],
  [
    "Wear State Estimation of Rolling Element Bearings using Support Vector Machines",
    "DOI: Pending (Preprint) Link to view paper: ..."
  ],
  [
    "Multi-view Scaling Support Vector Machines for Classification and Feature Selection - ClickMyProject",
    "With the explosive growth of data, the multi-view data is widely used in many fields, such as data mining, machine learning, ..."
  ],
  [
    "Support Vector Machine | Build Email Spam Filter | R Programming | Re-Live | IvyProSchool",
    "In this tutorial we will learn about Support Vector Machine, Kernel function, how to find the right hyperplane, practical SVM Case ..."
  ],
  [
    "Support Vector Machines Teoría Explicada",
    "Desarrollo intuitivo de la teoría del modelo de Support Vector Machines. Juan Carlos Girón. Jose Rolando Josué Postgrado en ..."
  ],
  [
    "Machine Learning: Support Vector Machine (SVM)",
    "iTeam https://www.facebook.com/iTeamUJ/ iTeam Academic Group https://www.facebook.com/groups/iTeam.Ju/"
  ],
  [
    "Relaxing music &amp; Machine Learning - Part 15: Support Vector Machines model",
    "Enjoy the beauty of music, surfing and learn to use the Support Vector Machines. See how to setup a workspace to start your first ..."
  ],
  [
    "Support Vector Machines Analytical Problems",
    "Listeners will be able to understand analyitcally how SVM algortihm works for linear classification problems."
  ],
  [
    "Machine Learning and AI Support Vector Machines in Python",
    "Course content Welcome Beginner's Corner Review of Linear Classifiers Linear SVM Duality Kernel Methods Implementations ..."
  ],
  [
    "Question #3 | Support Vector Machines | Hyper parameter | ML Interview Questions &amp; Answers  #2022",
    "Support Vector Machines Interview Questions Question #3: https://youtu.be/dbiqUzooHkQ Question #2: ..."
  ],
  [
    "Session-6 Support Vector Machines by Prof. Suryakant V Gangashetty, KLU",
    ""
  ],
  [
    "Paper 1: Privacy-preserving Distributed Support Vector Machines",
    "Privacy-preserving Distributed Support Vector Machines Simone Bottoni (University of Insubria), Stefano Braghin (IBM Research ..."
  ],
  [
    "Support Vector Machines - Put it into work",
    ""
  ],
  [
    "208 linear classifiers support vector machines",
    "Artificial intelligence."
  ],
  [
    "Implement Support Vector Machines (SVM) in Python",
    "In this video I will implement the SVM Machine Learning model on a real dataset using Python. We will see which frameworks ..."
  ],
  [
    "Support Vector Machines - Advanced Machine Learning and Signal Processing",
    "Link to this course: ..."
  ],
  [
    "Chapter 7 | Support Vector Machines Workflow | Machine Learning in Hindi | DataTheory",
    "Follow me on LinkedIn - https://www.linkedin.com/in/rahul-dogra-854244213/ This week we will start learning about Support ..."
  ],
  [
    "Multi-view Scaling Support Vector Machines - MyProjectBazaar",
    "With the explosive growth of data, the multi-view data is widely used in many fields, such as data mining, machine learning, ..."
  ],
  [
    "18 Autoencoders, CNNs, Classification, Support Vector Machines",
    ""
  ],
  [
    "Week 8: Linear Models (Logistic Regression and Support Vector Machines) by Stanley Dukor",
    "Classes from AI6Lagos Cohort 7 which was held virtually in 2021. Course structure page: ..."
  ],
  [
    "Knowledge Discovery with Support Vector Machines",
    "http://j.mp/2bzwjSB."
  ],
  [
    "Support Vector Machines - Nikhil Soni",
    ""
  ],
  [
    "(Support Vector Machines (SVM || آلة المتجهات الداعمة",
    "SVM."
  ],
  [
    "Bias and Variance Explained Simply | Data Science Interview Question",
    "For more such interesting interview Q&A in: SQL, Python, Statistics & more, subscribe to our @Analyticsvidhya channel: ..."
  ],
  [
    "Machine Learning Projects For Beginners 2023 | Machine Learning Projects | ML Projects | Simplilearn",
    "This video will help you build various \" Machine Learning Projects For Beginners 2023 \" from scratch. Starting with Heart Disease ..."
  ],
  [
    "ML Stanford",
    ""
  ],
  [
    "Day 28/30 Machine Learning Master Class - Sanjay - Pantech.ai | Pantech Solutions | Warriorsway",
    "If You Haven't Register still, Register Now: ..."
  ],
  [
    "SYDE 522 Machine Intelligence",
    ""
  ],
  [
    "Machine Learning Algorithms | Machine Learning Tutorial | Data Science Training | Edureka Rewind - 1",
    "Edureka Machine Learning Course Master Program ..."
  ],
  [
    "Confusion Matrix Solved Example Accuracy Precision Recall F1 Score Prevalence by Mahesh Huddar",
    "Confusion Matrix Solved Example Accuracy, Precision, Recall, F1 Score, Sensitivity, Specificity Prevalence in Machine Learning ..."
  ],
  [
    "Five semesters of linear algebra and all I do is solve Python dependency problems -  Tim Hopper",
    "normconf.com."
  ],
  [
    "🔥Machine Learning With Python Full Course | Machine Learning Tutorial for Beginner | Simplilearn",
    "Free Machine Learning Course With Completion Certificate: ..."
  ],
  [
    "A New Revolution For Tech Education | Democratizing The Future of Education",
    "As per our commitment to delivering technology-related knowledge, we are happy to announce PW Skills is collaborating with ..."
  ],
  [
    "AL and ML Explained. Will AI Replace Developers?",
    "What is ML and how it works? Will AI replace programmers? To know this one need to know a bit more about machine learning."
  ],
  [
    "EIGEN VALUES &amp; EIGEN VECTORS | MATRICES |S-6| ENGINEERING MATHS | LINEAR ALGEBRA |SAURABH DAHIVADKAR",
    "In linear algebra, an eigenvector or characteristic vector of a linear transformation is a nonzero vector that changes at most by a ..."
  ],
  [
    "Fav fav.",
    ""
  ],
  [
    "Discord Recording: Ocean ETH Predict Challenge Workshop #4",
    "Join the conversation! Twitter - https://twitter.com/oceanprotocol​ Telegram - https://t.me/oceanprotocol_community​ Check us ..."
  ],
  [
    "프로그래밍",
    ""
  ],
  [
    "INQA Conference 2022: Dennis Willsch, Jülich",
    "Title: Applications on Quantum Annealers at FZJ Abstract: \"Quantum annealing is a new computer technology that gradually ..."
  ],
  [
    "Master class on Embedded system using Arm Cortex M4 : 4 / 30 Days - M.K Jeevarajan",
    "If you haven't Registered Yet Register here ..."
  ],
  [
    "Pitch &amp; Bat Arcade Machines @ Myrtle Beach Were RIGGED to be EASIER? 1962 Williams World Series",
    "Not a pinball machine Repair , but made by the great Pinball and Arcade Game manufacturer WILLIAMS . What a neat game."
  ],
  [
    "NeurIPS 2022: Human-in-the-loop is here to stay",
    "Fedor Zhdanov, Head of ML, Toloka Toloka is proud to be a gold sponsor of NeurIPS (November 28 to December 9, 2022) ..."
  ],
  [
    "Data Science Vs Machine Learning- More Jobs, Easy, Salary, Skills Needed, Best Field, Future Growth",
    "Data Science Vs Machine Learning More Jobs, Easy, Salary, Skills Needed, Best Field, Future Growth in Hindi ✓✓Follow me on ..."
  ]
]