[
  [
    "TensorFlow",
    "Welcome to the official TensorFlow YouTube channel. Stay up to date with the latest TensorFlow news, tutorials, best practices, ..."
  ],
  [
    "Deep Learning With Tensorflow 2.0, Keras and Python",
    "This playlist is a complete course on deep learning designed for beginners. All you need to know is a bit about python, pandas, ..."
  ],
  [
    "TensorFlow 2.0 Beginner Tutorials",
    "Welcome to TensorFlow Tutorials with the goal to build a strong foundation so we can start building our own projects! I have tried ..."
  ],
  [
    "TensorFlow 2.0 Complete Course - Python Neural Networks for Beginners Tutorial",
    "Learn how to use TensorFlow 2.0 in this full tutorial course for beginners. This course is designed for Python programmers looking ..."
  ],
  [
    "Why TensorFlow?",
    "TensorFlow is an open-source end-to-end platform for Machine Learning. It provides a comprehensive ecosystem of tools for ..."
  ],
  [
    "TensorFlow In 10 Minutes | TensorFlow Tutorial For Beginners | Deep Learning &amp; TensorFlow | Edureka",
    "AI and Deep-Learning with TensorFlow (Use Code \"YOUTUBE20\"): ..."
  ],
  [
    "TensorFlow 2.0 Tutorial For Beginners | TensorFlow Demo | Deep Learning &amp; TensorFlow | Simplilearn",
    "Enroll for FREE Artificial Intelligence Course & Get your Completion Certificate: ..."
  ],
  [
    "Tensorflow Tutorial for Python in 10 Minutes",
    "Want to build a deep learning model? Struggling to get your head around Tensorflow? Just want a clear walkthrough of which ..."
  ],
  [
    "TensorFlow in 100 Seconds",
    "TensorFlow is a tool for machine learning capable of building deep neural networks with high-level Python code. It provides ..."
  ],
  [
    "TensorFlow Recommenders Addons",
    "TensorFlow Recommenders Addons is a collection of projects related to large-scale recommendation systems. It leverages ..."
  ],
  [
    "TensorFlow 2.0 Tutorial - Full Course | TensorFlow Tutorial | Deep Learning | Great Learning",
    "1000+ Free Courses With Free Certificates: ..."
  ],
  [
    "Keras vs TensorFlow vs Pytorch | Deep Learning Frameworks Comparison 2021 | Simplilearn",
    "With the Deep Learning scene being dominated by three main frameworks, it is very easy to get confused on which one to use?"
  ],
  [
    "Tensorflow for beginners||Hindi",
    "In this Video I explain what tensorflow is, why you should use it and explain that it's uses in Machine Learning, particularly Neural ..."
  ],
  [
    "Pytorch vs Tensorflow vs Keras | Deep Learning Tutorial 6 (Tensorflow Tutorial, Keras &amp; Python)",
    "We will go over what is the difference between pytorch, tensorflow and keras in this video. Pytorch and Tensorflow are two most ..."
  ],
  [
    "Intro to Machine Learning (ML Zero to Hero - Part 1)",
    "Machine Learning represents a new paradigm in programming, where instead of programming explicit rules in a language such ..."
  ],
  [
    "TensorFlow Zero to Mastery Full Course in Hindi 2022",
    "TensorFlow Zero to Mastery Full Course in Hindi 2022."
  ],
  [
    "TensorFlow 2.0 Python Tutorial in Hindi | Deep Learning",
    ""
  ],
  [
    "TensorFlow.js Quick Start",
    "Get started with TensorFlow.js by building a digit recognizer from scratch in this quick start tutorial ..."
  ],
  [
    "TensorFlow 2.0 Introduction Python Tutorial in Hindi | Deep learning | Data Science | ML",
    "In TensorFlow 2.0 Python Tutorial in Hindi, we are going to learn 2.02 What is TensorFlow 2.0? 4.24 Application of TensorFlow ..."
  ],
  [
    "Learn TensorFlow and Deep Learning fundamentals with Python (code-first introduction) Part 1/2",
    "Ready to learn the fundamentals of TensorFlow and deep learning with Python? Well, you've come to the right place. After this ..."
  ],
  [
    "What is Tensorflow  in Hindi | Explained |",
    "Hey guys today in this video i am gonna show you what is tensorflow and some tensorflow basic coding praticals Tensorflow ..."
  ],
  [
    "Keras with TensorFlow Course - Python Deep Learning and Neural Networks for Beginners Tutorial",
    "This course will teach you how to use Keras, a neural network API written in Python and integrated with TensorFlow. We will learn ..."
  ],
  [
    "Python TensorFlow for Machine Learning – Neural Network Text Classification Tutorial",
    "This course will give you an introduction to machine learning concepts and neural network implementation using Python and ..."
  ],
  [
    "Deep Learning basics with Python, TensorFlow and Keras",
    ""
  ],
  [
    "Tensorflow Object Detection in 5 Hours with Python | Full Course with 3 Projects",
    "Want to get up to speed on AI powered Object Detection but not sure where to start? Want to start building your own deep learning ..."
  ],
  [
    "Tensorflow Input Pipeline | tf Dataset | Deep Learning Tutorial 44 (Tensorflow, Keras &amp; Python)",
    "Tensorflow tf.Data api allows you to build a data input pipeline. Using this you can handle large dataset for your deep learning ..."
  ],
  [
    "Tensorflow and deep learning in Telugu",
    "In this playlist you will learn basics of tensorflow i.e. tensorflow 1.0 and deep learning basics."
  ],
  [
    "July 2019 - Practical Machine Learning with Tensorflow",
    ""
  ],
  [
    "PyTorch vs TensorFlow | Ishan Misra and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=FUS6ceIvUnI Please support this podcast by checking out ..."
  ],
  [
    "Deep Learning with Python, TensorFlow, and Keras tutorial",
    "An updated deep learning introduction using Python, TensorFlow, and Keras. Text-tutorial and notes: ..."
  ],
  [
    "How to create your FIRST NEURAL NETWORK with TensorFlow!",
    "In this Python Tutorial we learn how to create our first neural network with TensorFlow. We use the TensorFlow Keras API to build ..."
  ],
  [
    "How to Make Money with Tensorflow",
    "Tensorflow is a popular open source machine learning library released by Google that allows developers to build ML models ..."
  ],
  [
    "TensorFlow Full Course | Learn TensorFlow in 3 Hours | TensorFlow Tutorial For Beginners | Edureka",
    "TensorFlow Training (Use Code: YOUTUBE20): https://www.edureka.co/ai-deep-learning-with-tensorflow ** This Edureka ..."
  ],
  [
    "Simple explanation of convolutional neural network | Deep Learning Tutorial 23 (Tensorflow &amp; Python)",
    "A very simple explanation of convolutional neural network or CNN or ConvNet such that even a high school student can ..."
  ],
  [
    "Deep Learning With TensorFlow [2022 Updated]",
    "This Deep Learning with TensorFlow playlist will help you master deep learning and TensorFlow concepts, learn to implement ..."
  ],
  [
    "Machine Learning Zero to Hero (Google I/O&#39;19)",
    "This is a talk for people who know code, but who don't necessarily know machine learning. Learn the 'new' paradigm of machine ..."
  ],
  [
    "Get started with using TensorFlow to solve for regression problems (Coding TensorFlow)",
    "You often have to solve for regression problems when training your machine learning models. In this episode of Coding ..."
  ],
  [
    "Tensorflow Tutorial for Beginners | Tensorflow on Neural Networks | Intellipaat",
    "Intellipaat AI course: https://intellipaat.com/artificial-intelligence-deep-learning-course-with-tensorflow/ In this tensorflow tutorial for ..."
  ],
  [
    "TensorFlow: Open source machine learning",
    "TensorFlow is an open source software library for numerical computation using data flow graphs. Originally developed by ..."
  ],
  [
    "Incredible things your community is creating with TensorFlow.js  - #MadeWithTFJS",
    "Usage of Machine Learning in JavaScript has grown exponentially since 2020 and is expected to continue. Check out just a few of ..."
  ],
  [
    "I built the same model with TensorFlow and PyTorch | Which Framework is better?",
    "I created the same model with TensorFlow and PyTorch. Which Deep Learning Framework is better? TensorFlow vs. PyTorch!"
  ],
  [
    "tf serving tutorial | tensorflow serving tutorial | Deep Learning Tutorial 48 (Tensorflow, Python)",
    "Are you using flask or Fast API to serve your machine learning models? tf serving is a tool that allows you to bring up a model ..."
  ],
  [
    "Introducing TensorFlow Lite (Coding TensorFlow)",
    "In this episode of Coding TensorFlow, Laurence Moroney, Developer Advocate for TensorFlow at Google, introduces us to ..."
  ],
  [
    "TensorFlow high-level APIs: Part 1 - loading data",
    "Welcome to Part 1 of our mini-series on TensorFlow high-level APIs! In this 3 part mini-series, TensorFlow Engineering Manager ..."
  ],
  [
    "What is YOLO algorithm? | Deep Learning Tutorial 31 (Tensorflow, Keras &amp; Python)",
    "YOLO (You only look once) is a state of the art object detection algorithm that has become main method of detecting objects in the ..."
  ],
  [
    "Introducing convolutional neural networks (ML Zero to Hero - Part 3)",
    "In part three of Machine Learning Zero to Hero, AI Advocate Laurence Moroney (lmoroney@) discusses convolutional neural ..."
  ],
  [
    "My First Machine Learning Project (Tensorflow Deep-Learning)",
    "This is my very first machine-learning project in python using tensorflow. It utilizes a deep learning neural network and is trained ..."
  ],
  [
    "Install Tensorflow Object Detection From Scratch in 5 Steps | Python Deep Learning",
    "Running into errors? Tired of seeing \"ERROR: XXXXX something didn't go right\" I hear you! Installing Tensorflow Object Detection ..."
  ],
  [
    "TensorFlow In 10 Minutes | TensorFlow Tutorial For Beginners | TensorFlow Explained | Simplilearn",
    "In this video on TensorFlow, you will be introduced to the basic concepts of TensorFlow. We will start off with a brief about ..."
  ],
  [
    "Introduction to Tensorflow Cloud",
    "Tutorials and notebooks → https://goo.gle/3iUJAJs Learn more → https://goo.gle/3zMVBX8 Getting started with TensorFlow Cloud ..."
  ],
  [
    "Should You Use PyTorch or TensorFlow in 2022?",
    "Should You Use PyTorch or TensorFlow in 2022? Find out here! Detailed blog post: ..."
  ],
  [
    "Saving and Loading Models (Coding TensorFlow)",
    "Training models can take a very long time, and you definitely don't want to have to retrain everything over a single mishap."
  ],
  [
    "TensorFlow Tutorial (Sherry Moore, Google Brain)",
    "The talks at the Deep Learning School on September 24/25, 2016 were amazing. I clipped out individual talks from the full live ..."
  ],
  [
    "Getting Started with TensorFlow in Google Colaboratory (Coding TensorFlow)",
    "Welcome to Coding TensorFlow! In the previous video, you were introduced to Google Colaboratory (https://bit.ly/2Twz4bD), now ..."
  ],
  [
    "Install tensorflow 2.0 | Deep Learning Tutorial 5 (Tensorflow Tutorial, Keras &amp; Python)",
    "I will show how to install tensorflow 2.0 on windows computer. I will be installing it on top of anaconda. Video to install anaconda ..."
  ],
  [
    "Build a smart IoT device with TensorFlow Lite and Raspberry Pi",
    "Learn how to build smart IoT devices using TensorFlow Lite and Raspberry Pi. Discover pre-trained object detection and sound ..."
  ],
  [
    "Python Neural Networks - Tensorflow 2.0 Tutorial - Creating a Model",
    "This python neural network tutorial covers how to create a model using tensorflow 2.0 and keras. We will then train the model on ..."
  ],
  [
    "Getting Started with TensorFlow 2.0 (Google I/O&#39;19)",
    "TensorFlow 2.0 is here! Understand new user-friendly APIs for beginners and experts through code examples to help you create ..."
  ],
  [
    "What is TensorFlow? | Introduction to TensorFlow | TensorFlow Tutorial for Beginners | Simplilearn",
    "This TensorFlow tutorial will help you in understanding what is TensorFlow and how it is used in Deep Learning. In this tutorial ..."
  ],
  [
    "TensorFlow 2.0 Crash Course",
    "Learn how to use TensorFlow 2.0 in this crash course for beginners. This course will demonstrate how to create neural networks ..."
  ],
  [
    "What is TensorFlow?",
    "machinelearning #tensorflow #distributed In this video we will talk on what tensorflow is and also on some of the key features of ..."
  ],
  [
    "TensorFlow Tutorial 2022",
    "I'll teach a ton about how to use TensorFlow and I'll answer all your questions live. I'll cover all of the following and much more ..."
  ],
  [
    "Simple Explanation of LSTM | Deep Learning Tutorial 36 (Tensorflow, Keras &amp; Python)",
    "LSTM or long short term memory is a special type of RNN that solves traditional RNN's short term memory problem. In this video I ..."
  ],
  [
    "TensorFlow in 5 Minutes (tutorial)",
    "This video is all about building a handwritten digit image classifier in Python in under 40 lines of code (not including spaces and ..."
  ],
  [
    "Decision forests in TensorFlow | Session",
    "Neural networks are everywhere these days, but they're not the only type of model you should consider when you're getting ..."
  ],
  [
    "Tensorflow in Tamil | tensorflow tutorial in tamil | machine learning introduction with tensorflow",
    "Tensorflow In Tamil | In this video we are going to learn about how Python programmers has enhance their skills in machine ..."
  ],
  [
    "Introduction to TF Agents and Deep Q Learning (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, introduces TF Agents and walks through how to use the Deep Q Learning model ..."
  ],
  [
    "TensorFlow Profiler demo (TF Dev Summit &#39;20)",
    "Learn about TensorFlow Profiler: TensorFlow's performance profiler which provides a wide range of tools across GPU/TPU/CPU ..."
  ],
  [
    "TensorFlow: Machine Learning for Everyone",
    "The TensorFlow community is thriving. We're thrilled to see the adoption and the pace of machine learning development by ..."
  ],
  [
    "Introduction à l&#39;apprentissage automatique (Coding TensorFlow en français)",
    "This video is also available in English: https://goo.gle/2O32RHm L'apprentissage automatique représente un nouveau paradigme ..."
  ],
  [
    "Setting Up CUDA, CUDNN, Keras, and TensorFlow on Windows 11 for GPU Deep Learning",
    "Complete walkthrough of installing TensorFlow/Keras with GPU support on Windows 11. We make use of a \"pip install\" rather than ..."
  ],
  [
    "How to Build a Neural Network with TensorFlow and Keras in 10 Minutes",
    "This is a short tutorial on How to build a Neural Network in Python with TensorFlow and Keras in just about 10 minutes Full ..."
  ],
  [
    "M1 Max VS RTX3070 (Tensorflow Performance Tests)",
    "ML with Tensorflow battle on M1 MacBook Air, M1 MacBook Pro, and M1 Max MacBook Pro. Get TG Pro: ..."
  ],
  [
    "How to Install TensorFlow GPU for Mac M1/M2 with Conda",
    "You can now install TensorFlow for GPU support with a Mac M1/M2 using CONDA. It is very important that you install an ARM ..."
  ],
  [
    "TensorFlow Object Detection | Realtime Object Detection with TensorFlow | TensorFlow Python |Edureka",
    "AI & Deep Learning Using TensorFlow (Use Code \"YOUTUBE20\") ..."
  ],
  [
    "1. Introduction to TensorFlow | Tensorflow Tutorial For Beginners I Tensorflow Full Course",
    "This course lays a solid foundation to TensorFlow, a leading machine learning library from Google AI team. You'll see how ..."
  ],
  [
    "How to Install TensorFlow &amp; Keras in Local Computer || GPU &amp; CPU || Deep Learning | Machine Learning",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” If you are really ..."
  ],
  [
    "How to use your trained model - Deep Learning basics with Python, TensorFlow and Keras p.6",
    "In this part, we're going to cover how to actually use your model. We will us our cats vs dogs neural network that we've been ..."
  ],
  [
    "Building a neural network FROM SCRATCH (no Tensorflow/Pytorch, just numpy &amp; math)",
    "Kaggle notebook with all the code: https://www.kaggle.com/wwsalmon/simple-mnist-nn-from-scratch-numpy-no-tf-keras Blog ..."
  ],
  [
    "Basics of TensorFlow - TF Workshop - Session 1",
    "TensorFlow workshop is a three part series instructed by Dr. Ashish Tendulkar in Chennai, India. In session 1, Ashish explains the ..."
  ],
  [
    "Get started with Google Colaboratory (Coding TensorFlow)",
    "Want to get started with Google Colaboratory? In this episode of Coding TensorFlow, Software Engineer, Jake VanderPlas breaks ..."
  ],
  [
    "TensorFlow Developer Certificate Guidance Tamil",
    "TensorFlowDeveloperCertificateGuidanceTamil#TensorFlowtamil #suninfotechnology Technical Contact: ..."
  ],
  [
    "Create Sparse Tensor using TensorFlow 2.0 Python Tutorial | Deep Learning | Machine Learning",
    "In TensorFlow 2.0 Python Tutorial in Hindi, We will Learn about the TensorFlow Programming element to build TensorFlow ..."
  ],
  [
    "Building with TensorFlow Lite for microcontrollers | Workshop",
    "Today, people use TensorFlow to develop large scale machine learning models. But did you know that TensorFlow can now run ..."
  ],
  [
    "TensorFlow &amp; Keras Tutorial 2022 | Deep Learning With TensorFlow &amp; Keras | Simplilearn",
    "Free TensorFlow Course: ..."
  ],
  [
    "TensorFlow Interview Questions and Answers | TensorFlow Interview Preparation | Intellipaat",
    "Intellipaat AI course: https://intellipaat.com/artificial-intelligence-deep-learning-course-with-tensorflow/ In this TensorFlow ..."
  ],
  [
    "PyTorch or TensorFlow?",
    "Become The AI Epiphany Patreon ❤️ ▻ https://www.patreon.com/theaiepiphany ..."
  ],
  [
    "L-3 Tensorflow Basics",
    "Explained how to download and install Tensorflow. And then explained basics of tensorflow - 1- How to build a computational ..."
  ],
  [
    "Powered by TensorFlow: Air Cognizer predicts air quality with machine learning",
    "Machine Learning is helping to solve challenging, real-world problems around the world. Poor air quality is a major obstacle that ..."
  ],
  [
    "TensorFlow for Computer Vision Course - Full Python Tutorial for Beginners",
    "Learn how to use TensorFlow 2 and Python for computer vision in this complete course. The course shows you how to create two ..."
  ],
  [
    "How to use TensorFlow in PyCharm (TensorFlow Tip of the Week)",
    "It doesn't take much to get TensorFlow running in an IDE like PyCharm. In this TensorFlow Tip of the Week, Laurence ..."
  ],
  [
    "Introduction to TensorFlow 2.0: Easier for beginners, and more powerful for experts (TF World &#39;19)",
    "TensorFlow 2.0 is all about ease of use, and there has never been a better time to get started. In this talk, we will introduce ..."
  ],
  [
    "Real-World Python Neural Nets Tutorial (Image Classification w/ CNN) | Tensorflow &amp; Keras",
    "In this video we walk through the process of training a convolutional neural net to classify images of rock, paper, & scissors. We do ..."
  ],
  [
    "How to convert your ML model to TensorFlow Lite (TensorFlow Tip of the Week)",
    "Welcome back to another episode of TensorFlow Tip of the Week! In this short episode, we're going to create a simple machine ..."
  ],
  [
    "Build a Deep Audio Classifier with Python and Tensorflow",
    "In this tutorial, you'll learn how to build a Deep Audio Classification model with Tensorflow and Python! Get the code: ..."
  ],
  [
    "TensorFlow: an ML platform for solving impactful and challenging problems",
    "Machine learning is solving challenging problems that impact everyone around the world. See how researchers at PlantVillage ..."
  ],
  [
    "TensorFlow Tutorial 2 - Tensor Basics",
    "In this video we go through the most basic and essential tensor operations that really build the foundation to TensorFlow 2.0 and ..."
  ],
  [
    "Install Tensorflow GPU on Windows",
    "I show all of the steps needed to install TensorFlow GPU on Windows. I setup an entire Machine Learning development ..."
  ],
  [
    "Reinforcement learning overview (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, kicks off a new series on reinforcement learning where we explore how you can ..."
  ],
  [
    "Natural Language Processing with TensorFlow 2 - Beginner&#39;s Course",
    "This course is a practical introduction to natural language processing with TensorFlow 2.0. In this tutorial you will go from having ..."
  ],
  [
    "TensorFlow high-level APIs: Part 1 - loading data",
    "Welcome to Part 1 of our mini-series on TensorFlow high-level APIs! In this 3 part mini-series, TensorFlow Engineering Manager ..."
  ],
  [
    "Install Tensorflow GPU on Windows",
    "I show all of the steps needed to install TensorFlow GPU on Windows. I setup an entire Machine Learning development ..."
  ],
  [
    "Inside TensorFlow: Quantization aware training",
    "In this episode of Inside TensorFlow, Software Engineer Pulkit Bhuwalka presents quantization aware training. Pulkit will take us ..."
  ],
  [
    "PyTorch Vs Tensorflow: Jobs, Research and Industries. Who is the winner in 2022?",
    "In this video, we discussed the differences between Tensorflow and PyTorch frameworks, considering the latest versions and ..."
  ],
  [
    "I built the same model with TensorFlow and PyTorch | Which Framework is better?",
    "I created the same model with TensorFlow and PyTorch. Which Deep Learning Framework is better? TensorFlow vs. PyTorch!"
  ],
  [
    "Inside TensorFlow: tf.Keras (Part 1)",
    "Take an inside look into the TensorFlow team's own internal training sessions--technical deep dives into TensorFlow by the very ..."
  ],
  [
    "Deploy TensorFlow Keras Model on AWS | 📸8: Horse or Human Prediction Deep Learning Project in Hindi",
    "Course name: “Machine Learning & Data Science – Beginner to Professional Hands-on Python Course in Hindi” In the Machine ..."
  ],
  [
    "Tensorflow và Keras - Hello world trong làng AI",
    "Lần này thử làm AI. cơ bản của cơ bản luôn nhé anh em music: Bensound.com."
  ],
  [
    "Building a neural network FROM SCRATCH (no Tensorflow/Pytorch, just numpy &amp; math)",
    "Kaggle notebook with all the code: https://www.kaggle.com/wwsalmon/simple-mnist-nn-from-scratch-numpy-no-tf-keras Blog ..."
  ],
  [
    "How To Install TensorFlow In Python 3.10 (Windows 10) | TensorFlow 2.8.0",
    "how to install tensorflow in python windows 10 In this video I will show you how to install tensorflow in python 3.10. By the end of ..."
  ],
  [
    "Powered by TensorFlow: Air Cognizer predicts air quality with machine learning",
    "Machine Learning is helping to solve challenging, real-world problems around the world. Poor air quality is a major obstacle that ..."
  ],
  [
    "Text Classification Using BERT &amp; Tensorflow | Deep Learning Tutorial 47 (Tensorflow, Keras &amp; Python)",
    "Using BERT and Tensorflow 2.0, we will write simple code to classify emails as spam or not spam. BERT will be used to generate ..."
  ],
  [
    "Get started with Google Colaboratory (Coding TensorFlow)",
    "Want to get started with Google Colaboratory? In this episode of Coding TensorFlow, Software Engineer, Jake VanderPlas breaks ..."
  ],
  [
    "Convert Tensorflow/Keras model to TensorFlow Lite (TFLite)",
    "In this video, I'll create a simple deep learning model using Keras and convert it to TensorFlow Lite for use on mobile, or IoT ..."
  ],
  [
    "TensorFlow 2.0 Full Course In 5 Hours | TensorFlow Tutorial For Beginners | TensorFlow | Simplilearn",
    "This video on TensorFlow Full Couse will help you learn the basics of TensorFlow library and understand the features of ..."
  ],
  [
    "How TensorFlow Works? | Tensorflow Architecture | #tensorflow",
    "How TensorFlow works internally is the question that many ML and AI developers ask very often. In this video, Detailed ..."
  ],
  [
    "How to convert your ML model to TensorFlow Lite (TensorFlow Tip of the Week)",
    "Welcome back to another episode of TensorFlow Tip of the Week! In this short episode, we're going to create a simple machine ..."
  ],
  [
    "Aleksander Molak: Practical graph neural networks in Python with TensorFlow and Spektral",
    "Speaker:: Aleksander Molak Track: PyData: Deep Learning Graph neural networks (GNNs) have become one of the hottest ..."
  ],
  [
    "DeepLearning.AI TensorFlow Developer Professional Certificate - Coursera Deep Learning Certification",
    "Get Certificate and Details: https://bit.ly/2QiqIIb ------------------------------------ ▻Itronix Solutions Free Certified Courses: ..."
  ],
  [
    "How to Prepare for the TensorFlow Dev Certificate Exam",
    "In this short presentation Kshitiz Rimal, a Google Developers Expert on Machine Learning will go through some of his experience ..."
  ],
  [
    "TensorFlow Tutorial 2 - Tensor Basics",
    "In this video we go through the most basic and essential tensor operations that really build the foundation to TensorFlow 2.0 and ..."
  ],
  [
    "Formation à Tensorflow 2.0",
    ""
  ],
  [
    "How to use TensorFlow in PyCharm (TensorFlow Tip of the Week)",
    "It doesn't take much to get TensorFlow running in an IDE like PyCharm. In this TensorFlow Tip of the Week, Laurence ..."
  ],
  [
    "5.1 Neural Network Training | TensorFlow implementation --[Machine Learning | Andrew Ng]",
    "Second Course: Advanced Learning Algorithms. If you liked the content please subscribe and put a little blue thumb. Take heart!"
  ],
  [
    "Data Augmentation for Image Data | Keras Tensorflow | Python",
    "Content Description ⭐️ In this video, I have explained about data augmentation for image data using keras Image Data ..."
  ],
  [
    "Real Time Sign Language Detection with Tensorflow Object Detection and Python | Deep Learning SSD",
    "Language barriers are very much still a real thing. We can take baby steps to help close that. Speech to text and translators have ..."
  ],
  [
    "Reinforcement learning overview (Reinforcement learning with TensorFlow Agents)",
    "Wei Wei, a Developer Advocate for TensorFlow, kicks off a new series on reinforcement learning where we explore how you can ..."
  ],
  [
    "¿QUÉ ES TENSORFLOW? ¿CÓMO FUNCIONA? | #5 Módulos de Inteligencia Artificial",
    "TensorFlow es una biblioteca de código abierto para la computación numérica y Machine Learning a gran escala. TensorFlow ..."
  ],
  [
    "How to Export a Tensorflow saved model for object detection classifier",
    "No need of retraining,.,.,don't waste your time..,.,it's a just 10 sec of job,.,.,. Jai Hind.,. Just watch me.,.,., Expoter_model.py and ..."
  ],
  [
    "Why TensorFlow is mostly used in Machine Learning?",
    "Tensor flow applications google tensor flow applications."
  ],
  [
    "TensorFlow Test on the M1 MacBook!!",
    "In this episode, I analyze how TensorFlow works on the new M1 MacBook. The package written specifically by Apple to perform ..."
  ],
  [
    "TensorFlow 2.0 Crash Course",
    "Learn how to use TensorFlow 2.0 in this crash course for beginners. This course will demonstrate how to create neural networks ..."
  ],
  [
    "Speed up your TensorFlow code using TFRecords and dataset pipelines",
    "In this video you'll learn how to use TFRecords and dataset pipelines to increase your TensorFlow Training code. A link to my ..."
  ],
  [
    "Deep Learning with TensorFlow - Introduction to TensorFlow",
    "Enroll in the course for free at: https://bigdatauniversity.com/courses/deep-learning-tensorflow/ Deep Learning with TensorFlow ..."
  ],
  [
    "TensorFlow Tutorial in Telugu || Deep Learning Tutorial in Telugu",
    "In this video, I am explaining about TensorFlow in Deep Learning. From Basics to Advance i.e. From NumPy Basics to GAN ..."
  ],
  [
    "Install TensorFlow-GPU with a Single Command in Anaconda",
    "In this video I will show you, how you can install TensorFlow-GPU with a single command in Anaconda. You don't need to install ..."
  ],
  [
    "TensorFlow Models with Functional API, Subclassing and Custom Layers - Full Stack Deep Learning",
    "In this course, we show you how to transform a model built with the sequential api, into one built with the Functional API. The other ..."
  ],
  [
    "Image Classification App  |  Teachable Machine + TensorFlow Lite",
    "We're going to create an image classification Android app from start to finish that can distinguish between bananas, oranges, and ..."
  ],
  [
    "Image Classification using Tensorflow in Hindi | Deep learning model",
    ""
  ],
  [
    "Implementing Canary Releases of TensorFlow Model Deployments with Kubernetes and Istio | GSP778",
    "Join Telegram: https://t.me/TechieZilla Please do like, share and subscribe! Lab Link: ..."
  ],
  [
    "What is Tensorflow 2.0? TensorFlow 2.0 Architecture Explained - DIY#1",
    "What is Tensorflow 2.0? TensorFlow 2.0 Architecture Explained - DIY#1 How to install TensorFlow 2 0? Install Tf 2.0 on Google ..."
  ],
  [
    "TensorFlow Installation in 30 Seconds #shorts #coding #python",
    "TensorFlow Installation in 30 Seconds #shorts #coding #python https://youtu.be/zRzqG_wC2S8 @CodeWithSSquare tensorflow ..."
  ],
  [
    "TensorFlow.js: From prototype to production, what&#39;s new in 2022?",
    "Join the TensorFlow.js team to learn about the latest updates around Web ML. Discover how you can enable Web ML for your ..."
  ],
  [
    "TensorFlow Tutorial 5 - Set up the Neural Network Layers",
    "This is Tutorial 5 of our series of Tensor Flow Tutorials for Machine Learning and Data Science. Tutorial 1 - Setup of Tensorflow ..."
  ],
  [
    "Install TensorFlow in Windows 11 and Python 3 10 using CUDA and CuDNN",
    "Running TensorFlow with GPU is little bit advance and not straightforward. I am demonstrating installation of TensorFlow in ..."
  ],
  [
    "Announcing TensorFlow 2.0 (Coding TensorFlow)",
    "The TensorFlow team has been on a journey to make the training, deployment, managing, and scaling of machine learning ..."
  ],
  [
    "How to Setup System for Tensorflow Developer Certificate",
    "To Access the PPT & Python Script Please Visit the LMS ..."
  ],
  [
    "Machine Learning with Synthetic Data | @Unity  + @TensorFlow",
    "In this augmented reality video we are going to train our own object detection machine learning model with Tensorflow using fully ..."
  ],
  [
    "Try TensorFlow.js in your browser (Coding TensorFlow)",
    "Machine Learning in the Browser? You betcha! In this video, Laurence Moroney (@lmoroney) shows you just how easy it is to get ..."
  ],
  [
    "Swift for TensorFlow (TensorFlow Meets)",
    "It's still the early days for Swift for TensorFlow, but Jeremy Howard is embracing the language for use in high performance numeric ..."
  ],
  [
    "TensorFlow Tutorial in Telugu || Deep Learning Tutorial in Telugu",
    "In this video, I am explaining about TensorFlow in Deep Learning. From Basics to Advance i.e. From NumPy Basics to GAN ..."
  ],
  [
    "Tensorflow Python | Installing TensorFlow on Windows | pip tensorflow | tensorflow python 3.9",
    "shorts #tensorflow #python #machine #tensorflowpython #pip #windowsinstall Hello Everyone! We are starting an exciting course ..."
  ],
  [
    "AI Pong - TensorFlow.js p.3",
    "Welcome everyone to part 3 of the TensorFlow.js series. Leading up to this, we've learned the basics of working with ..."
  ],
  [
    "Build the Same Model with TensorFlow and PyTorch!",
    "Build the Same Model with TensorFlow and PyTorch! Which Deep Learning Framework is Better? Get your Free Token for ..."
  ],
  [
    "TensorFlow Installation in 30 Seconds #shorts #coding #python",
    "TensorFlow Installation in 30 Seconds #shorts #coding #python https://youtu.be/zRzqG_wC2S8 @CodeWithSSquare tensorflow ..."
  ],
  [
    "Machine Learning with Synthetic Data | @Unity  + @TensorFlow",
    "In this augmented reality video we are going to train our own object detection machine learning model with Tensorflow using fully ..."
  ],
  [
    "Tensorflow js tutorial in hindi || Part -1",
    "tensorflow js tensorflow js tutorial tensorflow js sentiment analysis tensorflow js face recognition tensorflow js projects tensorflow js ..."
  ],
  [
    "TensorFlow And Keras Tutorial | Deep Learning With TensorFlow &amp; Keras  | Deep Learning | Simplilearn",
    "This video on TensorFlow and Keras tutorial will help you understand Deep Learning frameworks, what is TensorFlow, ..."
  ],
  [
    "TensorFlow Test on the M1 MacBook!!",
    "In this episode, I analyze how TensorFlow works on the new M1 MacBook. The package written specifically by Apple to perform ..."
  ],
  [
    "Top AI and ML announcements from Google I/O 2022",
    "Catch the top takeaways in AI and ML from Google I/O 2022. Laurence Moroney shares the latest updates, tools, and guidance ..."
  ],
  [
    "Install TensorFlow Hub Anaconda | TensorFlow Hub",
    "In this video, you will learn how to install TensorFlow Hub in Anaconda Other important playlists TensorFlow ..."
  ],
  [
    "Discussing TensorFlow with the founder of Udacity (TensorFlow Meets)",
    "TensorFlow 2.0 makes it easier than ever to get started with deep learning and machine learning. On this episode of TensorFlow ..."
  ],
  [
    "Image Classification using Tensorflow in Hindi | Deep learning model",
    ""
  ],
  [
    "How to Setup System for Tensorflow Developer Certificate",
    "To Access the PPT & Python Script Please Visit the LMS ..."
  ],
  [
    "TensorFlow Tutorial 12: Load TensorFlow Model .h5 | Keras | Python",
    "Save Model .h5 : https://youtu.be/-4Gmux-82-8 In this video, you will learn how to load the .h5 model in tensorflow Other important ..."
  ],
  [
    "What is Tensorflow [hindi]",
    "hello dosto... i hope that you would understand what i want to explain it is an library or an data which we use to train our models if ..."
  ],
  [
    "Why Tensorflow is Awesome for Machine Learning?",
    "DATA ENGINEER RESOURCE - Site devoted to \"BUILDING STRONGER DATA ENGINEERS\" ◅ https://thomashenson.com ..."
  ],
  [
    "Install Tensorflow Latest Version Anaconda 2022| Install Tensorflow 2.5 | No module named Tensorflow",
    "In this video I will show you how to install \" Tensorflow \" in anaconda 2022. File Link ..."
  ],
  [
    "Serving TensorFlow models serveless - Google Cloud Function - Deep Learning model deployment demo",
    "Full course on Udemy https://www.udemy.com/course/machine-learning-deep-learning-model-deployment/?"
  ],
  [
    "Installing TensorFlow on an Ubuntu Server",
    "In this video, Sam Hawley will show you how to install TensorFlow on Ubuntu Server. TensorFlow is an open-source software ..."
  ],
  [
    "Wake Word Detection with Tensorflow | P2",
    "GitHub Source Code:- https://bit.ly/2QrvOSC Part 1: https://youtu.be/NITIefkRae0 Hey guys, In this video, we will create a Wake ..."
  ],
  [
    "TensorFlow Data Pipeline. Practical tutorial.",
    "In this video we are going to see how to build the TensorFlow data pipeline, and how to use different methods of tf.data.dataset, ..."
  ],
  [
    "An introduction to MLOps with TensorFlow Extended (TFX)",
    "Deploying advanced machine learning technology to serve customers and/or business needs requires a rigorous approach and ..."
  ],
  [
    "What is TensorFlow Animated Video",
    "Learn what is TensorFlow in a simple animated 2D video."
  ],
  [
    "What is Tensorflow 2.0? TensorFlow 2.0 Architecture Explained - DIY#1",
    "What is Tensorflow 2.0? TensorFlow 2.0 Architecture Explained - DIY#1 How to install TensorFlow 2 0? Install Tf 2.0 on Google ..."
  ],
  [
    "Pothole detection using Google Tensorflow",
    "Pothole detection using Google Tensorflow."
  ],
  [
    "4.8 TensorFlow implementation | Inference in Code --[Machine Learning | Andrew Ng]",
    "Second Course: Advanced Learning Algorithms. If you liked the content please subscribe and put a little blue thumb. Take heart!"
  ],
  [
    "[Dasar] Belajar Tensorflow.js | 01. Berkenalan dengan TensorFlow.js",
    "Tensorflow.js merupakan Opensource Machine learning library milik Google, dengan Tensorflow kita dapat memanfaatkan ..."
  ],
  [
    "Save &amp; Load Model using Pickle, Joblib and TensorFlow Keras in Hindi | Deep Learning",
    "Video covers - Save & Load Model using Pickle - Joblib and TensorFlow Keras - Saving model architecture by two ways 1."
  ],
  [
    "Tensorflow Tutorial #11 IRIS Dataset Tensorflow/MachineLearning",
    "code https://github.com/soumilshah1995/Tensorflow-on-IRIS-Datset- ..."
  ],
  [
    "How To Install TensorFlow In Python 3.9 (Windows 10)",
    "how to install tensorflow in python windows 10 In this video I will show you how to install tensorflow in python 3.9. By the end of ..."
  ],
  [
    "AttributeError: module &#39;tensorflow&#39; has no attribute &#39;placeholder&#39;",
    "AttributeError Traceback (most recent call last) ipython-input-5-157d9cac347c in module() 19 # damping -- wave damping 20 ..."
  ],
  [
    "Part - 5 | Transfer Learning | Image Classification using Tensorflow | Complete guide | with Code",
    "Hello friends, in this tutorial series we will understand every aspect of Image Classification using Tensorflow. We will understand ..."
  ],
  [
    "Predict Baby Weight with TensorFlow on AI Platform | Qwiklabs [GSP013]",
    "Join Telegram: Telegram Link: https://t.me/TechieZilla Please do like, share and subscribe! Lab Link: ..."
  ],
  [
    "Tensorflow JS installation + getting started with easy example in Browser &amp; Node JS",
    "TensorflowJS #Browser #NodeJS . Link to official page : https://www.tensorflow.org/js/tutorials/setup."
  ],
  [
    "6.1: Introduction to TensorFlow.js - Intelligence and Learning",
    "TensorFlow.js is a WebGL accelerated, browser based JavaScript library for training and deploying ML models. Next Video: ..."
  ],
  [
    "TensorFlow.js Community &quot;Show &amp; Tell&quot; #8",
    "Check out 5 new demos from the #MadeWithTFJS global community. See how they are pushing the boundaries of what's possible ..."
  ],
  [
    "TensorFlow: Qwik Start Qwiklabs",
    "TensorFlow: Qwik Start Qwiklabs Overview In this lab you will learn the basic 'Hello World' of machine learning where, instead of ..."
  ],
  [
    "#16: tf.function in TensorFlow | Tutorial",
    "The video discusses tf.function in TensorFlow. Timeline (Python 3.7.12; TensorFlow 2.8) 00:00 - Begin 00:25 - Create a function: ..."
  ],
  [
    "Google Colaboratory for Tensorflow | Tensorflow firsthand Tutorial Series for Beginners",
    "This video titled \"Google Colaboratory for Tensorflow\" explains the steps to enable Google Colaboratory for training our Deep ..."
  ],
  [
    "LIY#3 install Tensorflow in python  offline and online mode",
    "The video explains the method to install python package such tensorflow in to python for the systems having internet and systems ..."
  ],
  [
    "Install TensorFlow in Windows 11 and Python 3 10 using CUDA and CuDNN",
    "Running TensorFlow with GPU is little bit advance and not straightforward. I am demonstrating installation of TensorFlow in ..."
  ],
  [
    "Machine Learning for developers in a hurry",
    "Forget data science degrees, big datasets, and hours or days spent training humongous machine learning models. Check out ..."
  ],
  [
    "TensorFlow Course - Dataset Generator",
    "In this advanced tutorial, you will learn how to use Python generator functions to create TensorFlow datasets. This approach ..."
  ],
  [
    "Tensorflow keras how to create custom layers",
    "Deep Learning with Tensorflow keras."
  ],
  [
    "TensorFlow Full Course | TensorFlow Tutorial For Beginners| Learn TensorFlow In 5 Hours |Simplilearn",
    "This video on TensorFlow will help you learn about Deep Learning with TensorFlow in detail. You will understand the basics of ..."
  ],
  [
    "Creating a Chess AI with TensorFlow",
    "Learn how to create an AI that plays chess using a convolutional neural network. Link for the colab page: ..."
  ],
  [
    "Installing  TensorFlow GPU on Windows | Latest Way | ALL Error Fixed !!",
    "Discord Link:- https://discord.gg/XJtRWvB Hello World, Welcome to our channel where we talk about tech and programming and ..."
  ],
  [
    "TensorFlow (A Plataforma de Machine Learning da Google) // Dicionário do Programador",
    "HOSTGATOR → https://codft.me/HG2eYLt1NA4Ss Venha conhecer uma das melhores plataformas open source de ..."
  ],
  [
    "TensorFlow Tutorial 14: Linear Regression TensorFlow | TensorFlow",
    "In this video, you will learn about linear regression in TensorFlow Other important playlists TensorFlow ..."
  ],
  [
    "Creating a Chess AI with TensorFlow",
    "Learn how to create an AI that plays chess using a convolutional neural network. Link for the colab page: ..."
  ],
  [
    "Installing  TensorFlow GPU on Windows | Latest Way | ALL Error Fixed !!",
    "Discord Link:- https://discord.gg/XJtRWvB Hello World, Welcome to our channel where we talk about tech and programming and ..."
  ],
  [
    "TensorFlow (A Plataforma de Machine Learning da Google) // Dicionário do Programador",
    "HOSTGATOR → https://codft.me/HG2eYLt1NA4Ss Venha conhecer uma das melhores plataformas open source de ..."
  ],
  [
    "TensorFlow Tutorial 14: Linear Regression TensorFlow | TensorFlow",
    "In this video, you will learn about linear regression in TensorFlow Other important playlists TensorFlow ..."
  ],
  [
    "TensorFlow Federated Tutorial Session",
    "A Google TechTalk, 2020/7/31, presented by Google Research Staff ABSTRACT:"
  ],
  [
    "Installing Tensorflow and Keras in Jupyter Notebook using Anaconda THE RIGHT WAY!",
    "Install Tensorflow and Keras in Jupyter Notebook using Anaconda will allow you to use these Python modules error free in their ..."
  ],
  [
    "Part - 4 | Train a CNN model | Image Classification using Tensorflow | Complete guide | with Code",
    "Hello friends, in this tutorial series we will understand every aspect of Image Classification using Tensorflow. We will understand ..."
  ],
  [
    "TensorFlow Models Accelerated for NVIDIA Jetson",
    "Resources on GitHub: https://github.com/NVIDIA-AI-IOT/tf_trt_models, https://github.com/tensorflow/models, ..."
  ],
  [
    "image classification using Tensorflow | flowers classification cnn",
    "In this video we will learn how run image classification using flowers dataset in Tensorflow. We will use convolutional neural ..."
  ],
  [
    "Install tensorflow gpu without cuda or cudnn",
    "Anaconda installation video - https://www.youtube.com/watch?v=vpcufjvTrKo&list=PL_EsAiTHh5J4ORUGN6xkXJ82AJSwzPDws ..."
  ],
  [
    "Tensorflow: Variable Scopes",
    "tf.variable_scope."
  ],
  [
    "Jak wytrenować prostą sieć neuronową w TensorFlow 2 Keras?",
    "Na instagrama zapraszam, tam obecnie jest dużo wiedzy: https://www.instagram.com/karolmajek/ ---------------------------- Warsaw ..."
  ],
  [
    "Gnuradio &amp; Tensorflow | denoising autoencoder",
    "In this tutorial I will show how you can combine tensorflow block with gnu radio to denoising the signals using autoencoder ..."
  ],
  [
    "Introduction to TensorFlow for Artificial Intelligence, Machine Learning, and Deep Learning",
    "The complete course Introduction to TensorFlow for Artificial Intelligence, Machine Learning, and Deep Learning ..."
  ],
  [
    "Running Distributed TensorFlow using Vertex AI-GSP971-Google Cloud Platform",
    "Overview In this lab, you will use TensorFlow's distribution strategies and the Vertex AI platform to train and deploy a custom ..."
  ],
  [
    "Why Deep Learning Compilers like TensorFlow XLA TVM is needed",
    "Why Deep Learning Compilers like TensorFlow XLA TVM is needed is a short video to discuss that to alleviate the burden of ..."
  ],
  [
    "Tensorflow ImportError: No module named &#39;_pywrap_tensorflow_internal&#39;",
    "Tensorflow ImportError: No module named '_pywrap_tensorflow_internal' ImportError: DLL load failed: The specified module ..."
  ],
  [
    "How to install tensorflow in Anaconda to use Jupyter Notebook in hindi",
    "In this video I have described how you can install tensorflow in Anaconda, So that you can use it in Jupyter notebook in hindi, ..."
  ],
  [
    "Install Tensorflow with #CUDA, #cuDNN, and GPU support - Step by Step Tutorial",
    "Blog Link - https://machinelearningprojects.net/install-tensorflow-with-cuda-and-cudnn/ Hey guys, In this video, we will see how ..."
  ],
  [
    "Coding Tensorflow en Español - Episodio 1",
    "En este episodio de Coding TensorFlow, Martin Aguinis (@MartinAguinis) demuestra cómo hacer funcionar TensorFlow.js en el ..."
  ],
  [
    "How to Access Neural Network Layers of Deep Learning - TensorFlow",
    "In this video, we will learn about Deep Learning and how to create Deep Neural networks using Tensorflow in 10 minutes."
  ],
  [
    "Predict Baby Weight with TensorFlow on AI Platform || [GSP013] || Solution",
    "Track 3 Quest 9 Predict Baby Weight with TensorFlow on AI Platform || [GSP013] || Solution Thanks for Watching Please ..."
  ],
  [
    "Installing Tensorflow on Windows 10 with Python 3.6.8",
    "Installing Tensorflow on Windows 10 with Python 3.6.8 Subscribe to Our Channel: https://www.youtube.com/Life2Coding?s."
  ],
  [
    "Sentiment Analysis in TensorFlow | Python | TensorFlow",
    "JupyterNotebook: https://github.com/siddiquiamir/Transfer-Learning-TensorFlow In this video, you will learn how to do sentiment ..."
  ],
  [
    "Coding ResNet from scratch with TensorFlow - Convolutional Neural Network - Human Emotions Detection",
    "In this section we continue our human emotions detection project. We shall focus on Coding Residual Networks from scratch with ..."
  ],
  [
    "Scaling TensorFlow 2 models to multi-worker GPUs (TF Dev Summit &#39;20)",
    "This talk showcases multiple performance improvements in TensorFlow 2.2 to accelerate and scale users' ML training workload to ..."
  ],
  [
    "How to downgrade TensorFlow to 1.x (for running legacy code)",
    ""
  ],
  [
    "Running Distributed TensorFlow using Vertex AI | Qwiklabs [GSP971]",
    "Join Telegram: https://t.me/TechieZilla Please do like, share and subscribe! Lab Link: ..."
  ],
  [
    "[Deep Learning] Tensorflow CNN implementation",
    "in this video, you will learn how to implement CNN using Tensorflow. you can practice with jupyter notebook below, ..."
  ],
  [
    "How to deploy your custom tensorflow model to the web (Part 1)",
    "This is a short tutorial to teach you how to convert your tensorflow/keras model into web format (convert .h5 to JSON). So that you ..."
  ],
  [
    "TensorFlow Workshop - Image Recognition With Colab",
    "Colab Notebook Link : https://colab.research.google.com/drive/14Xzx7m0H5e1U1sSFfTFwc6G-HG6j25_t This video is part of a ..."
  ],
  [
    "Synthesizing natural voice using Google&#39;s Tacotron open sourced tensorflow implementation",
    "When it comes to AI technologies, Google is top of the line. In 2017, Google published its paper \"Tacotron: Towards End-to-End ..."
  ],
  [
    "AI Facial Recognition with OpenCV and Tensorflow",
    ""
  ],
  [
    "Implement Custom Tensorflow Keras Model on Intel Image Dataset on Kaggle from Scratch",
    "This is a Deep Learning tutorial about implementing Tensorflow Keras Model from beginning to end. The code is written in `.ipynb` ..."
  ],
  [
    "Model Deployment on Production || Tensorflow Serving Tutorial",
    "If you're only doing .fit() and .evaluate(), you're probably wasting your time. Deployment is the essential part of the whole Machine ..."
  ],
  [
    "TensorFlow Tutorial: How to implement Bayesian linear regression",
    "I show how to implement a numerically stable version of Bayesian linear regression using the deep learning library TensorFlow."
  ],
  [
    "How to install Tensorflow with wheel file",
    "How to install Tensorflow with wheel file - Download Tensorflow wheel file from Tensorflow website - In your python site-page ..."
  ],
  [
    "Mitigating the challenges of cold start in TensorFlow Recommenders",
    "Developer Advocate Wei Wei overviews common approaches to tackle 3 kinds of cold start problems. When a recommendation ..."
  ],
  [
    "TF Machine Learning for Programmers (TensorFlow @ O’Reilly AI Conference, San Francisco &#39;18)",
    "In this talk, Laurence Moroney from Google talked about Machine Learning, AI, Deep Learning and more, and how they fit the ..."
  ],
  [
    "Inside TensorFlow: TF-Agents",
    "In this episode of Inside TensorFlow, Software Engineers Oscar Ramirez and Sergio Guadarrama demonstrate to us TF-Agents, ..."
  ],
  [
    "[Course 1] TensorFlow in Practice Quizes + Programming Assignments Answers deeplearning.ai #coursera",
    "Unable to complete this course Let us Give a chance to complete this for you. Contact- techninjasims@gmail.com ..."
  ],
  [
    "Tu primera red neuronal en Python y Tensorflow",
    "Hoy entrenaremos y usaremos una red neuronal desde cero, con Python y Tensorflow. Para ver el código en Colab puedes usar ..."
  ],
  [
    "Deep Learning in 30 Seconds #shorts",
    "Building and training a TensorFlow Keras model is easy, you can do it in 30 seconds. Multi-class classification with TensorFlow ..."
  ],
  [
    "How to install Tensorflow with PyCharm",
    "How to install Tensorflow with PyCharm Written and recorded by Aman Chhina. May 2021. Outline * Installation of python ..."
  ],
  [
    "Natural Language Processing with TensorFlow",
    "Solving natural language processing (NLP) problems is an important skill to master due to the explosive growth of data combined ..."
  ],
  [
    "VGG16 Architecture Large Scale Image Data Classifications Implementation with Tensorflow Python| p1",
    "In this tutorial we are going to learn: 1. How to make a large deep neural network. 2. How to make large model with tensorflow ..."
  ],
  [
    "how to install TensorFlow on Mac ERROR cannot find version or module",
    "python3 -m pip install --upgrade https://storage.googleapis.com/tensorflow/mac/cpu/tensorflow-1.12.0-py3-none-any.whl."
  ],
  [
    "Learn TensorFlow and Deep Learning fundamentals with Python (code-first introduction) Part 2/2",
    "You've made it to part 2 of the longest code-first learn TensorFlow and deep learning fundamentals video series on YouTube!"
  ],
  [
    "How to Install TensorFlow using PIP Install Command in Python3.6 | Windows",
    "This video will show you how to install TensorFlow in python 3.6 using pip install command in windows OS. Command = pip install ..."
  ],
  [
    "React native tensorflow object detection",
    "React native tensorflow object detection We will be creating the app in expo (Managed workflow) Timestamps: 0:00 Intro into ..."
  ],
  [
    "TensorFlow 2.0 Tutorial For Beginners | Introduction To TensorFlow 2 | TensorFlow Training | Edureka",
    "Edureka TensorFlow 2.0 Training: https://www.edureka.co/ai-deep-learning-with-tensorflow This Edureka TensorFlow 2.0 Tutorial ..."
  ],
  [
    "How to install Tensorflow with PyCharm",
    "How to install Tensorflow with PyCharm Written and recorded by Aman Chhina. May 2021. Outline * Installation of python ..."
  ],
  [
    "VGG16 Architecture Large Scale Image Data Classifications Implementation with Tensorflow Python| p1",
    "In this tutorial we are going to learn: 1. How to make a large deep neural network. 2. How to make large model with tensorflow ..."
  ],
  [
    "[Course 1] TensorFlow in Practice Quizes + Programming Assignments Answers deeplearning.ai #coursera",
    "Unable to complete this course Let us Give a chance to complete this for you. Contact- techninjasims@gmail.com ..."
  ],
  [
    "how to install TensorFlow on Mac ERROR cannot find version or module",
    "python3 -m pip install --upgrade https://storage.googleapis.com/tensorflow/mac/cpu/tensorflow-1.12.0-py3-none-any.whl."
  ],
  [
    "React native tensorflow object detection",
    "React native tensorflow object detection We will be creating the app in expo (Managed workflow) Timestamps: 0:00 Intro into ..."
  ],
  [
    "Hunting security vulnerabilities, TensorFlow 2.10,  and more dev news",
    "TL;DR 310 | The Google Developer News Show 0:00 - Introduction 0:11 - Indie Games Festival and Accelerator class of 2022 ..."
  ],
  [
    "Tensorflow.js - Train Neural Network in Browser (For Begineers)",
    "Train your neural network in Javascript and make predictions directly on your browser as begineers with async and await ..."
  ],
  [
    "Construa uma rede neural para executar a classificação (Coding TensorFlow em português)",
    "Na parte 3 desta série do TensorFlow.js, André Lírio analisa os dados processados ​​da parte 2 e constrói uma rede neural ..."
  ],
  [
    "Natural Language Processing with TensorFlow",
    "Solving natural language processing (NLP) problems is an important skill to master due to the explosive growth of data combined ..."
  ],
  [
    "Introduction To TensorFlow | Deep Learning with TensorFlow | TensorFlow For Beginners | Edureka",
    "AI & Deep Learning with Tensorflow Training: https://goo.gl/vDxgi5 ** This Edureka video on \"Introduction to TensorFlow\" provides ..."
  ],
  [
    "Recommendation systems overview (Building recommendation systems with TensorFlow)",
    "In this video we will be discussing what a recommendation system is, why it is valuable and the challenges you may encounter ..."
  ],
  [
    "How to Install TensorFlow using PIP Install Command in Python3.6 | Windows",
    "This video will show you how to install TensorFlow in python 3.6 using pip install command in windows OS. Command = pip install ..."
  ],
  [
    "Part 2 (final) - Deploy TensorFlow Models on AWS SageMaker",
    "Deploy TensorFlow Models on Amazon AWS SageMaker (Managed Machine Learning Service) - Jupyter Notebook/ IPython ..."
  ],
  [
    "Setup Python on Windows (Tensorflow, OpenCV)",
    "In this video I will show how to set up a Python development environment in PyCharm on Windows 10. This process covers ..."
  ],
  [
    "How to Install TensorFlow with pip using Anaconda prompt",
    "How to Install TensorFlow with pip using Anaconda link: pip install tensorflow https://pypi.org/project/tensorflow/ link for installing ..."
  ],
  [
    "Starting Machine Learning with Arduino and TensorFlow",
    "If you want to get started with Machine Learning, but want to embed it into your IoT Device, TensorFlow could be the solution for ..."
  ],
  [
    "Real time motion capture for VTubers  - Made with TensorFlow.js",
    "Meet Richard Yee and his avatar as he explains how he's used TensorFlow.js pose and face models to create real time motion ..."
  ],
  [
    "Deploying Tensorflow 2.0 with REST API",
    "This tutorial describes deploying AI models with Tensorflow 2.0 as REST API. For source code, please visit the GitHub link ..."
  ],
  [
    "TensorFlow for Machine Learning Solutions: Working with Nearest Neighbors| packtpub.com",
    "This playlist/video has been uploaded for Marketing purposes and contains only selective videos. For the entire video course and ..."
  ],
  [
    "Creating an Object Detection Application Using TensorFlow | Qwiklabs [GSP141]",
    "Join Telegram: https://t.me/TechieZilla Please do like, share and subscribe! Lab Link: ..."
  ],
  [
    "Tensorflow: 05 Graph, Session and Nodes in Tensorflow",
    "import tensorflow as tf a = tf.constant(5) b = tf.constant(2) c = tf.constant(3) d = tf.multiply(a, b) e = tf.add(c, b) f = tf.subtract(d, ..."
  ],
  [
    "Tu primera red neuronal en Python y Tensorflow",
    "Hoy entrenaremos y usaremos una red neuronal desde cero, con Python y Tensorflow. Para ver el código en Colab puedes usar ..."
  ],
  [
    "Installing TensorFlow on Mac M1 under Anaconda Environment",
    "Installing TensorFlow on Apple Silicon (M1 Macs) under Conda Environment Guide: #1 Open Terminal and type: xcode-select ..."
  ],
  [
    "Install Tensorflow Latest Version Anaconda 2022 | No module named Tensorflow Install Tensorflow 2022",
    "In this video I will show you how to install \" Tensorflow \" in anaconda 2022. File Link ..."
  ],
  [
    "How To Run TensorFlow Lite on Raspberry Pi for Object Detection",
    "TensorFlow Lite is a framework for running lightweight machine learning models, and it's perfect for low-power devices like the ..."
  ],
  [
    "TensorFlow SP Grupo",
    "Este é um grupo para as pessoas interessadas em TensorFlow e tudo o que envolve Deep Learning e Machine Learning."
  ],
  [
    "Video Classification Tensorflow : Colab Notebook",
    "Notebook : https://github.com/Soumi7/TFNotebooks/blob/master/Video_classsification_tensorflow.ipynb."
  ],
  [
    "网易云课堂《深度学习与TensorFlow 2入门实战》",
    ""
  ],
  [
    "Keras vs Tensorflow vs PyTorch | Deep Learning Frameworks Comparison | INSAID",
    "This INSAID video on \"Keras vs TensorFlow vs PyTorch\" will provide you with a crisp comparison among the top three deep ..."
  ],
  [
    "Pix2Pix tensorflow",
    "Playing with making faces using a tensforflow implementation of pix2pix. Python 3.7, Ubuntu 20.04, Nvidia GTX 1070."
  ],
  [
    "How to install TensorFlow.js - MobileNet",
    "tensorflowjs #installtensorflowjs #mobilenet How to install and Deploy TensorFlow.js on an AWS ec2 instance for production."
  ],
  [
    "visualization heatmaps of images with tensorflow 2021 | Heatmaps of images using pre-trained model",
    "Welcome to the YouTube chsannel, we will be exploring this powerful and fascinating pre-Trained model with Tensorflow while ..."
  ],
  [
    "Tensorflow GPU vs CPU performance comparison | Test your GPU performance for Deep Learning - Tamil",
    "Tensorflow GPU vs CPU performance comparison | Test your GPU performance for Deep Learning - Tamil TensorFlow is a ..."
  ],
  [
    "Install TensorFlow 2.0 and Keras in Anaconda",
    "Install TensorFlow 2.0 and Keras in Anaconda In this video, I will teach you how you can install the latest version of TensorFlow ..."
  ],
  [
    "Getting Started with TensorFlow.",
    "In this video, I show you how to install Google's machine learning framework, TensorFlow, on a Windows PC."
  ],
  [
    "NEW TensorFlow Library on GRAPH Neural Networks released (Nov 2021)",
    "Discover newly released TensorFlow Graph Neural Network library (TF-GNN) in Nov 2021. And watch me fail to install this ..."
  ],
  [
    "[Dasar] Belajar Tensorflow.js | 01. Berkenalan dengan TensorFlow.js",
    "Tensorflow.js merupakan Opensource Machine learning library milik Google, dengan Tensorflow kita dapat memanfaatkan ..."
  ],
  [
    "AttributeError: module &#39;tensorflow&#39; has no attribute &#39;get_default_graph&#39;",
    "AttributeError: module 'tensorflow' has no attribute 'get_default_graph' Thanks for watching video. If you like the video than you ..."
  ],
  [
    "Einführung in Maschinelles Lernen (ML Zero to Hero, Teil 1)",
    "Maschinelles Lernen ist eine neue Art des Programmierens, in welchem man nicht explizite Regeln wie in Java oder der C++ ..."
  ],
  [
    "how to install tensorflow in win 10 without getting any os error",
    "in this video ull see how to install tensor flow in win 10 without any os error link to download gpedit.msc file ..."
  ],
  [
    "Introduction to TensorFlow",
    "In this Python video tutorial, I have explained What is Tensorflow, the Features of Tensorflow, and How to install Tensorflow in ..."
  ],
  [
    "how to natively install tensorflow on windows",
    "This is a walk-through of installing Tensorflow in Windows. TensorFlow is an open source software library for machine learning in ..."
  ],
  [
    "Arduino Nano 33 BLE Sense - TensorFlow Lite - Person Detection",
    "A quick overview of how-to use a Machine Learning Model to detect a person using the Arduino Nano 33 BLE Sense, TensorFlow ..."
  ],
  [
    "TensorFlow In 10 Minutes | TensorFlow Tutorial  | Deep Learning &amp; TensorFlow | Edureka Rewind - 1",
    "Edureka Deep Learning Course with Tensorflow Certification ..."
  ],
  [
    "Installing Tensorflow 2 with Docker for the Raspberry PI 4",
    "In this video I install Tensorflow 2.3 for the Raspberry PI 4 using Docker. I am going through all this pain in order to setup my ..."
  ],
  [
    "Convert pb file to tflite tensorflow lite Tutorial Raspberry pi custom object detection Part - 4",
    "tensorflow.ipynb-- https://drive.google.com/file/d/1vPWLMAaWqYIPowWDh39usDQTgBTkbGcg/view tflite_convert ..."
  ],
  [
    "Machine Learning Web App Project | TensorFlow Model | Django &amp; React | Free Download",
    "In this video, we present an image classification app built using Django, React, and Material UI. The app uses a machine learning ..."
  ],
  [
    "Tensorflow Tutorial  | TensorFlow Training | Edureka Rewind - 6",
    "AI & Deep Learning with TensorFlow (Use Code: YOUTUBE20): https://www.edureka.co/ai-deep-learning-with-tensorflow ** This ..."
  ],
  [
    "How to deploy your custom tensorflow model to react native",
    "Hi all! This is a short tutorial to teach you how to train and deploy your python model to React Native. Python Code: ..."
  ],
  [
    "Install Tensorflow Metal on M1, M1Pro/Max Apple Silicon Macs",
    "Tensorflow & Metal Pluggable device Installation instruction for Apple Silicon M1, M1 Pro/Max Macs #tensorflow #m1pro #m1max ..."
  ],
  [
    "Create Dataset TensorFlow",
    "In this tutorial, u can create your own dataset using python. also, you can create n number of classes. GitHub ..."
  ],
  [
    "Tensorflow tutorial #7 Convert the code to Object Oriented Code DNN Model on Diabetes Dataset",
    "code ..."
  ],
  [
    "Creating an Object Detection Application Using TensorFlow || [GSP141] || Solution",
    "Track 3 Quest 10 Classify Images of Cats and Dogs using Transfer Learning || [GSP141] || Solution Thanks for Watching ..."
  ],
  [
    "Predict Housing Prices with Tensorflow and AI Platform | Qwiklabs [GSP418]",
    "Join Telegram: Telegram Link: https://t.me/TechieZilla Please do like, share and subscribe! Lab Link: ..."
  ],
  [
    "Curso TensorFlow para iniciantes (Aula 1) - O que é TensorFlow e como instalar",
    "Nessa primeira aula, vamos aprender o que é TensorFlow, para que serve e como instalar no seu computador. Cursos ..."
  ],
  [
    "AttributeError: module &#39;tensorflow&#39; has no attribute &#39;initialize_all_variables&#39;",
    "AttributeError Traceback (most recent call last) ipython-input-11-8607f600b55c in module() 34 35 # Initialize state to initial ..."
  ],
  [
    "MirroredStrategy demo for distributed training",
    "Google Cloud Developer Advocate Nikita Namjoshi demonstrates how to get started with distributed training on Google Cloud."
  ],
  [
    "AttributeError: module &#39;tensorflow&#39; has no attribute &#39;app&#39;",
    "Try to use: import tensorflow.compat.v1 as tf AttributeError: module 'tensorflow' has no attribute 'app' AttributeError: module ..."
  ],
  [
    "Easily install tensorflow 2.0 for GPU on Windows using Anaconda",
    "Install tensorflow 2.0 on Windows computer using Anaconda. 1. First go to www.anaconda.com to download Anaconda installer ..."
  ],
  [
    "How to Install Tensorflow with Python 3",
    "How to Install Tensorflow with Python 3 python3 -V sudo apt install python3-pip pip3 -V #sudo pip3 install --upgrade tensorflow ..."
  ],
  [
    "Face mask detector: No Code ML Model (Tensorflow lite &amp; Tensorflow)",
    "Here's a no-code tutorial for face mask detection with 99% accuracy. lobe AI (software) website: https://lobe.ai/ Face mask ..."
  ],
  [
    "Convert Tensorflow Hub models to CoreML in Colab",
    "This video will teach you how to convert a tensorflow hub model into a CoreML model that can be used for iOS development."
  ],
  [
    "TensorFlow Python Tutorial | Image Generator/Multiplier using Augmentation | OneTouchBI",
    "Welcome to the knowledge base portal - WWW.ONETOUCHBI.COM. It's the platform to connect all BI Associates under one ..."
  ],
  [
    "TensorFlow: Qwik Start || Google Cloud Facilator Program #googlecloud #swags #goodies",
    "Google Cloud Facilator Program Syllabus ..."
  ],
  [
    "Optimization with Tensorflow",
    "This video demonstrate how to optimize a function using tensorflow. GitHUb Link for Notebook: ..."
  ],
  [
    "Tensor Flow JavaScript #javascript #tensorflow #machinelearning",
    "Tensor Flow website link:- https://www.tensorflow.org/js/ #tensorflow #machinelearning #javascript #library #html #css #javascript ..."
  ],
  [
    "How to Use MLflow, TensorFlow and Keras with PyCharm",
    "In this short video, I show you how easy it's to use MLflow, TensorFlow, and Keras with PyCharm. Python developers can easily ..."
  ],
  [
    "How to Install TensorFlow on CentOS",
    "In this video, we demonstrate to you how to do install TensorFlow on CentOS. Commands used: yum update -y python3 -m venv ..."
  ],
  [
    "SOLVED| ERROR: tensorflow-1.0.1-py2-none-any.whl is not a supported wheel on this platform",
    "ERROR: tensorflow-1.0.1-py2-none-any.whl is not a supported wheel on this platform solved in Python Command using to install ..."
  ],
  [
    "Run TensorFlow 2 in Amazon AWS SageMaker Notebooks",
    "How to run TensorFlow 2 (or a custom version) in Amazon AWS SageMaker notebooks. Machine Learning Series: ..."
  ],
  [
    "How to install TensorFlow 2 0? Install Tf 2.0 on Google Colab -  DIY#2",
    "What is Tensorflow 2.0? TensorFlow 2.0 Architecture Explained - DIY#1 How to install TensorFlow 2 0? Install Tf 2.0 on Google ..."
  ],
  [
    "Tensorflow 2 for images on Google Drive using Colab",
    "In this video I show you how to use images on your Google Drive in TensorFlow 2.0. A link to the Colab file: ..."
  ],
  [
    "Pose Estimation  with TensorFlow | Using Posenet tflite model |in python|Deep Learning",
    "This is a tutorial on how to use tensorflow posenet model in python and to extract position of joints ,display them on screen ,with ..."
  ],
  [
    "TensorFlow Setup with PyCharm: A Step-by-Step Guide #shorts #coding #python",
    "PyCharm is an amazing IDE for coding in Python. In this TensorFlow Setup with PyCharm: A Step-by-Step Guide, we'll create a ..."
  ],
  [
    "Running Distributed TensorFlow using Vertex AI #CodingBuddies #GoogleCloud #Qwiklabs",
    "The #GoogleCloudReady Facilitator Program enables students to train themselves for industry ready cloud skills. It is the first ..."
  ],
  [
    "Real Time Face Mask Detection with Tensorflow and Python | Custom Object Detection w/ MobileNet SSD",
    "Ever wanted to build your very own custom object detector? Got lost with all the tutorials and installation? Well…I hear you…"
  ],
  [
    "Visualize Convolutions with TensorFlow: Part 1",
    "How to create a simple convolutional model with TensorFlow and visualize convolution filters."
  ],
  [
    "Tensorflow Hello World Program Example",
    "Tensorflow Hello World Program Example $ python Enter the following short program inside the python interactive shell: import ..."
  ],
  [
    "GPU battle with Tensorflow and Apple Silicon",
    "ML with Tensorflow battle on M1 MacBook Air, M1 MacBook Pro, and M1 Max MacBook Pro. ▶️My recent tests of M1 Pro/Max ..."
  ],
  [
    "What is Tensorflow ?? | Tensorflow | Google Brain | MLAIT",
    "tensorflow #tensorflowtutorials #GoogleBrain This is a video on which I have discussed What is Tensorflow? Where it is used and ..."
  ],
  [
    "GPT-2 training and text generation, implemented in Tensorflow 2.0",
    "https://github.com/akanyaani/gpt-2-tensorflow2.0."
  ],
  [
    "TensorFlow Tutorial | Deep Learning with TensorFlow | TensorFlow Tutorial for Beginners |Simplilearn",
    "This TensorFlow tutorial will help you understand what is Deep Learning and it's libraries, why use TensorFlow, what is ..."
  ],
  [
    "One Line Of Python Code That Will Speed Up Your TensorFlow AI by Up To 6X #programming #tensorflow",
    "Here is the article where I talk about the one line of python code that will speed up your artificial intelligence model by up to 6X: ..."
  ],
  [
    "[TensorFlow 2 Deep Learning] Node Training (back propagation)",
    "let's understand training with easy to understand example and practice with colab with single node."
  ],
  [
    "ImportError: cannot import name &#39;set_random_seed&#39; from &#39;tensorflow&#39; (C:\\Users\\HP\\Anaconda3\\",
    "Python error = ImportError: cannot import name 'set_random_seed' from 'tensorflow' ..."
  ],
  [
    "3 Things You Should Know About TensorFlow #shorts",
    "3 Things You Should Know About TensorFlow."
  ],
  [
    "Face Recognition Using Python, Keras, OpenCV &amp; Tensorflow (with Code) [Pranav Sai]",
    "Github Code: https://github.com/psai-github/Facial_Rec_Py."
  ],
  [
    "How to create Constants and Variables using Tensorflow",
    "In this video I have explained how to create Tensorflow constants and Variables using scalar , vectors and matrices. #datascience ..."
  ],
  [
    "Tensorflow, Facenet, Keras, Python- Real Time Face Recognition - Checking Out of Office",
    "Real Time Face Recognition - Checking Out of Office. The system logs in check out times of staff real time and writes into the DB."
  ],
  [
    "Deploying Tensorflow Models using Docker, Tensorflow Serving and Heroku on WSL",
    "Lockdown_effects to the looks :p Disclaimer: The commands are working perfectly on Windows Subsystem for Linux. If commands ..."
  ],
  [
    "Coursera Course Basic Image Classification with TensorFlow All Week Answers",
    "For Coursera Fans Please Subscribe and Share my Channel."
  ],
  [
    "ㄹㅇ쉬운 딥러닝 6강 : Tensorflow 2 기초 빠르게 정리",
    "Tensorflow 2 설치가 안되었다면 https://codingapple.com/unit/tensorflow-2-setting-up-mac-window/?id=4205 이걸 참고해 설치 ..."
  ],
  [
    "AttributeError: module &#39;tensorflow&#39; has no attribute &#39;get_default_graph&#39;",
    "Thanks for watching video. If you like the video than you can subscribe the channel. If anyone facing another error, than you can ..."
  ],
  [
    "Implementation on Automatic Number Plate Recognition in a video| TensorFlow| Explanation with code|",
    "Hi guys, In this video, I've explained how you can create an automatic number/license plate recognition system (ANPR) with ..."
  ],
  [
    "What is TensorFlow | What is TensorFlow in Python |  Machine Learning",
    "What is TensorFlow | What is TensorFlow in Python | Machine Learning."
  ],
  [
    "How to use TensorFlow Datasets? Image classification with EuroSAT dataset with TFDS || Accuracy 98%🔥",
    "Hello Guys Welcome to CodeX for ML In this video, we will learn how to use TensorFlow datasets, how to extract, transform, and ..."
  ],
  [
    "Tensorflow Object Detection on WebCam &amp; Video using CPU [ Full Tutorial ]",
    "Python & Machine learning cheat sheet at just 50 INR Buy from here:- ..."
  ],
  [
    "Tutorial 09: How Neural Network work | What is Keras and Tensorflow in Hindi | Google Colab in Hindi",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Check if Tensorflow Is Built with GPU",
    "In this video we will be reviewing methods to use to make sure your build of Tensorflow is working properly. We will be checking If ..."
  ],
  [
    "Tensorflow Object Detection on WebCam &amp; Video using CPU [ Full Tutorial ]",
    "Python & Machine learning cheat sheet at just 50 INR Buy from here:- ..."
  ],
  [
    "Multi-Class Classification using Tensorflow",
    "This video will solve a multi-class classification problem, where we will deal with the iris dataset having a total of three classes for ..."
  ],
  [
    "TensorFlow Lite in Action with Google Colab",
    ""
  ],
  [
    "Tutorial 09: How Neural Network work | What is Keras and Tensorflow in Hindi | Google Colab in Hindi",
    "For Code, Slides and Notes https://fahadhussaincs.blogspot.com/ Artificial Intelligence, Machine Learning and Deep learning are ..."
  ],
  [
    "Tensorflow Android: Real-time Object Detection in 6 steps",
    "Please LIKE//Subscribe//Share Step 1: Install Android Studio https://developer.android.com/studio/index.html Step 2: Install python ..."
  ],
  [
    "Pedestrian Counting &amp; Vehicle Counting with TensorFlow",
    "source code: https://github.com/ahmetozlu/tensorflow_object_counting_api Pedestrian & Vehicle Counting by TensorFlow Object ..."
  ],
  [
    "Tensorflow Project #6:  Django and Tensorflow Integration",
    "The video demonstrates how to integrate Tensorflow into Django site. It also shows Tensorboard."
  ],
  [
    "Deep Learning in Industrial Robots using TensorFlow, OpenCV and Python",
    "Machine intelligence is integration of robotics, sensors, vision systems and machine learning. Here we demonstrate machine ..."
  ],
  [
    "How install specific version of Tensorflow and Keras in Anaconda | Install Tensorflow| Install Keras",
    "installTensorflow #installKeras #anacondaNaviagator how to install tensorflow specific version on anaconda how to install keras ..."
  ],
  [
    "Introduction aux réseaux neuronaux convolutionnel (Coding TensorFlow en français)",
    "This video is available in English: https://goo.gle/2O8U7Qj Dans la troisième partie de l'apprentissage automatique: \"Zero to Hero\" ..."
  ],
  [
    "How to downgrade Tensorflow and cuda?",
    "In this video, I am going to downgrade TensorFlow 2.5 to 2.2. A key difference is in Tensorflow 2.5 pip package includes GPU ..."
  ],
  [
    "Model Training with TFX Trainer component part 1 #TFX #Tensorflow",
    "The Trainer TFX pipeline component trains a TensorFlow model. TFX Trainer : https://www.tensorflow.org/tfx/guide/trainer Github ..."
  ],
  [
    "Install CUDA for TensorFlow GPU Easily",
    "Learn how to install CUDA for TensorFlow GPU. 0:00 - Introduction 0:48 - Downloading NVIDIA Drivers 1:30 - Downloading ..."
  ],
  [
    "A Newbies Guide To Installing TensorFlow on Windows 10",
    "If you need to get TensorFlow installed but don't know what you are doing, this is likely the video for you. We found a number of ..."
  ],
  [
    "Bringing Machine Learning and Linear Algebra to Node.js with TensorFlow",
    "Bringing Machine Learning and Linear Algebra to Node.js with TensorFlow.js Machine Learning In Node.js With TensorFlow.js ..."
  ],
  [
    "Getting started with Tensorflow 2.0 tutorial",
    "Josh Gordon, Google slides - goo.gle/mbl-slides or CBMM server."
  ],
  [
    "Installing tensorflow and pytorch with gpu support in same conda environment.",
    "100% working method for installing pytorch and tensorflow with cuda accelerated. It is easy method to install both libraries in ..."
  ],
  [
    "Tensorflow Object Recognition project with GUI Desktop App using python | Electron app",
    ""
  ],
  [
    "Neural networks on UE4 using Tensorflow and UE4 plugin for Tensorflow",
    "This is a very basic installation guide for Tensorflow for Windows and a free UE4 plugin for Tensorflow that is made by Getnamo."
  ],
  [
    "TensorFlow.js Experiments",
    "Pose detection Face detection Emotion detection."
  ],
  [
    "How to convert Tensorflow model/tflite models to ONNX for importing it into unity",
    "tf2onnx converts TensorFlow (tf-1.x or tf-2.x), tf.keras and tflite models to ONNX via command line or python api."
  ],
  [
    "text to speech object detection | tensorflow-lite object detection | raspberry pi 4 tensorflow-lite",
    "code for text to speech:- https://github.com/freedomwebtech/raspberrypiAiTF code for install opencv and tflite:- ..."
  ],
  [
    "Sleep as Android: Saying goodnight to snoring with TensorFlow",
    "Sleep as Android is an app that is all about helping people improve their sleeping habits, leading to happier and healthier lives."
  ],
  [
    "Handwritten Text Recognition with TensorFlow",
    "This project explores the ability of recognizing handwritten text using deep neural network, convolutional neural network and ..."
  ],
  [
    "Get started with TensorFlow&#39;s High-Level APIs (Google I/O &#39;18)",
    "High-level APIs like tf.keras enable developers to train models easily and effectively. This session will introduce these APIs, and ..."
  ],
  [
    "Deep Learning Tutorial in Python #1- Installing Tensorflow and Write a Hello World",
    "Join my discord channel for more discussion https://discord.gg/tqe6cd8 Hello, Everyone, this is a Deep Learning/Machine learning ..."
  ],
  [
    "Transformers Tutorial (Paper Explained + Implementation in Tensorflow and Pytorch) - Part1 🤗⚡",
    "The transformer is a deep learning model that adopts the mechanism of self-attention, differentially weighing the significance of ..."
  ],
  [
    "Video Classification with Tensorflow Hub | Action recognition | UCF101",
    "Colab notebook for video classification : https://youtu.be/_Q_7LyAkulA MoVinet Github ..."
  ],
  [
    "TensorFlow to FPGA: DNN for classifying Google&#39;s Quick Draw Dataset using LeFlow (Demo)",
    "Download LeFlow at: https://github.com/danielholanda/LeFlow."
  ],
  [
    "Pose Estimation using Tensorflow Deep learning [ Full Tutorial ]",
    "Python & Machine learning cheat sheet at just 50 INR Buy from here:- ..."
  ],
  [
    "Seq2Seq tutorial (Tensorflow)",
    "Using Dynamic RNNs with LSTMs to do translation. This are the basics of Google Translate. Code: http://www.DeepSchool.io ..."
  ],
  [
    "Qué es TensorFlow: La librería de inteligencia artificial de Google",
    "Google abrió su librería de inteligencia artificial: TensorFlow. Aprende con Sebastián Delmont (@sd), Ophelia Pastrana ..."
  ],
  [
    "3.1 สอนพื้นฐาน Deep learning ด้วย tensorflow (Deep learning concept) ภาษาไทย",
    "สอนพื้นฐาน Deep learning ด้วย tensorflow (Deep learning concept) ภาษาไทย."
  ],
  [
    "Tensorflow Installation | Windows and Mac | No command line",
    ""
  ],
  [
    "الدرس #1 مقدمة عن TensorFlow",
    "Introduction to TensorFlow مقدمة بسيطة يشرح فيها عن مكتبة الموتر tensorflow لشركة كوكل وماهي استخداماتها في حياتنا التعلم العميق ..."
  ],
  [
    "TensorFlow",
    "TensorFlow is an open-source library and API designed for deep learning, written and maintained by Google. TensorFlow ..."
  ],
  [
    "How to install Tensorflow and Keras in Jupyter | Anaconda(python 3.7 and 3.8)",
    "Hello: In this we can learn how to install anaconda? https://www.youtube.com/watch?v=Bw7T7EjKHJE&t=30s This short video ..."
  ],
  [
    "TensorFlow Lite at 24 FPS on bare Raspberry Pi 4",
    "TensorFlow Lite C++ API model MobileNetV1_SSD on a bare Raspberry Pi 4, 64-bits Ubuntu operating system, overclocked to ..."
  ],
  [
    "Qwiklabs - Running Distributed TensorFlow using Vertex AI [GSP971]",
    "qwiklabs #gcp #googlecloud Qwiklabs - Running Distributed TensorFlow using Vertex AI [GSP971]"
  ],
  [
    "How to deploy PyQt, Keras, Tensorflow apps with PyInstaller",
    "This video shows how you can use PyInstaller ( www.pyinstaller.org ) to build standalone python applications in Windows 10 for ..."
  ],
  [
    "Introduction to Tensorflow || Week 1 Quiz Answers || Coursera",
    ""
  ],
  [
    "Siamese Neural Networks: Explanation and Implementation in TensorFlow / Keras",
    "The Colab Notebook created in the video: ..."
  ],
  [
    "DIY Binary Classification in Tensorflow",
    "Subscribe for more ▻ https://bit.ly/2WKYVPj DIY Binary Classification in Tensorflow Feeling stuck on Tensorflow terminology ..."
  ],
  [
    "tensorflow object detection home automation esp8266 micropython",
    "keywords:- nodemcu,esp8266,iot,wifi,home automation,blynk,nodemcu projects,iot projects,internet of things,smart home ..."
  ],
  [
    "Библиотеки Для Машинного Обучения: Scikit-learn, TensorFlow, Keras, PyTorch | В Чём Разница?",
    "Говорить во вступлении о том, что машинное обучение и искусственный интеллект сейчас как никогда актуальны уже ..."
  ],
  [
    "TensorFlow for Computer Vision #1 - Intro to Image Data for Deep Learning | Better Data Science",
    "What is an image exactly? How does it differ from tabular data? How do you adequately prepare image dataset for neural network ..."
  ],
  [
    "Object Detection on Tensorflow Hub #AI #deeplearning #tensorflow",
    ""
  ],
  [
    "OpenCV Kivy Video Classification APP | Python Tensorflow Lite | Computer Vision Project",
    "computer vision project How to make a computer vision app with OpenCV Kivy & Python. Interested in Computer Vision ?"
  ],
  [
    "TensorFlow Interview Questions and Answers",
    "TensorFlow,TensorFlow Interview Questions and Answers,TensorFlow Interview Questions,mostly asked TensorFlow Interview ..."
  ],
  [
    "Raspberry Pi Pico - TensorFlow Lite - Person Detection",
    "A quick overview of how to detect a person using the Raspberry Pi Pico, an Arducam (OV2640 Camera Shield for Arduino), ..."
  ],
  [
    "Installing keras  and tensorflow in anaconda navigator",
    "This video tells how to install tensorflow and keras libraries in anaconda navigator."
  ],
  [
    "TensorFlow Interview Questions and Answers",
    "TensorFlow,TensorFlow Interview Questions and Answers,TensorFlow Interview Questions,mostly asked TensorFlow Interview ..."
  ],
  [
    "Convert Python Machine Learning Model to TensorFlow Lite",
    "Convert a Google Colaboratory (Jupyter Notebook) linear regression model from Python to TF Lite. Learn the basics of NumPy, ..."
  ],
  [
    "OpenCV Kivy Video Classification APP | Python Tensorflow Lite | Computer Vision Project",
    "computer vision project How to make a computer vision app with OpenCV Kivy & Python. Interested in Computer Vision ?"
  ],
  [
    "Motion Gestures Detection using Convolutional Neural Networks and Tensorflow on Android",
    "There are many different ways to interact with smartphones these days: touchscreen, hardware buttons, fingerprint sensor, and so ..."
  ],
  [
    "Fast style transfer (Tensorflow) in/out Touchdesigner",
    "Fast style transfer (https://github.com/lengstrom/fast-style-transfer/) in Tensorflow IN/OUT to TouchDesigner almost in realtime."
  ],
  [
    "Install Keras and tensorflow in RStudio",
    "Before you can run Deep learning on RStudio, you need to install tensorflow and keras if you want. Follow the steps, you will be ..."
  ],
  [
    "Virtual Lunch &amp; Learn: Making recommendations with Rust and Tensorflow",
    "Collaborative Filtering (CF) is one of the algorithms utilized by the recommendations systems. It works by collecting past ..."
  ],
  [
    "Image Localization: Explanation + Code in TensorFlow (And how to make Multi-Output Models!)",
    "The Colab Notebook created in the video: ..."
  ],
  [
    "Raspberry Pi Pico - TensorFlow Lite - Person Detection",
    "A quick overview of how to detect a person using the Raspberry Pi Pico, an Arducam (OV2640 Camera Shield for Arduino), ..."
  ],
  [
    "AI learns to play simple game ( Tensorflow and genetic algo) demo",
    "Github Code : https://github.com/Shivakishore14/Tensorflow-genetic-algo-simple-gamebot This video is a demo showing an AI ..."
  ],
  [
    "Tensorflow/Tensorflow JS install and setup tutorial using Anaconda and Node.js",
    "This video is the second assignment competed for IMD 1005B at Algonquin college. This video details the installation and setup of ..."
  ],
  [
    "#3 Installing TensorFlow on Ubuntu (+ GPU Support) - TensorFlow in Action",
    "TensorFlow 2 in Action: https://www.manning.com/books/tensorflow-in-action Code repository: ..."
  ],
  [
    "TF-Encrypted: Private machine learning in tensorflow with secure computing | AISC Lunch &amp; Learn",
    "For more details including slides, visit: https://aisc.ai.science/events/2019-07-10/"
  ],
  [
    "Facial Emotion Recognition using Keras Tensorflow | Deep Learning | Python",
    "Content Description ⭐️ In this video, I have explained about facial emotion/expression recognition using convolutional neural ..."
  ],
  [
    "Machine Learning with MongoDB Atlas and TensorFlow in 7 Minutes",
    "Learn how you can create a full featured Machine Learning application using MongoDB Atlas, Realm and TensorFlow.js in under ..."
  ],
  [
    "Lesson 2.1 Setup Tensorflow GPU - AWS SageMaker",
    ""
  ],
  [
    "How to install TensorFlow 2 in Linux Mint",
    "How to install TensorFlow 2 in LinuxMint, Ubuntu with python 3. Commands: sudo pip3 install --upgrade pip sudo pip3 install ..."
  ],
  [
    "Custom Training Loops for Multi Headed Tensorflow 2 Models",
    "So this is a bit random (and not a video about python packaging, sorry). I've wanted to make this for a while and it was a good ..."
  ],
  [
    "TensorFlow In 10 Minutes | TensorFlow Tutorial | Deep Learning &amp; TensorFlow | Edureka Rewind - 1",
    "Edureka Deep Learning Course with Tensorflow Certification ..."
  ],
  [
    "Installing tensorflow on a 10+ year old PC!! [without AVX]",
    "If you try to install tensorflow on an old PC, you will get an error like this: \"Your CPU supports instructions that this TensorFlow ..."
  ],
  [
    "Distributed Deep Learning with TensorFlow and R",
    "Learn how to perform distributed training, from scratch, using TensorFlow, Keras and R. Even if you don't have a proper cluster, ..."
  ],
  [
    "Average word vector Text classification TensorFlow(tflite) for Android or iOS",
    "Average word vector Text classification using Tflite for Android or iOS #tflite #android #python #ios #tensorflow #tensorflow2 ..."
  ],
  [
    "Human Pose Estimation using MoveNet with Tensorflow and Python",
    "Human Pose Estimation using MoveNet with Tensorflow and Python. Code: https://pages.visiongeek.io/pose-estimation-movenet/ ..."
  ],
  [
    "Install TensorFlow , Keras &amp; Python in VSCode on Mac بالعربي",
    "Setup macOS environment for machin learning and deep learning using TensorFlow ,Keras, python and jupyter notebook in ..."
  ],
  [
    "Tu primer clasificador de imágenes con Python y Tensorflow",
    "Hoy haremos nuestra primera clasificación de imágenes con Python y Tensorflow. Descubriremos varios conceptos muy ..."
  ],
  [
    "How to install Tensorflow on windows using PIP",
    "How to fix \"ERROR: Could not find a version that satisfies the requirement TensorFlow\" or \"ERROR: No Matching Distribution ..."
  ],
  [
    "Natural Language Processing in TensorFlow Coursera | All Weeks Quiz Answers | Complete Certification",
    "Coursera - Natural Language Processing in TensorFlow | All Weeks Quiz Answers | Complete Certification For FREE ! Subscribe ..."
  ],
  [
    "Complete Tutorial on TensorFlow 2 0 using Keras API [Part 1]",
    "A Complete Guide on TensorFlow 2.0 using Keras API Build Amazing Applications of Deep Learning and Artificial Intelligence in ..."
  ],
  [
    "Tensorflow 2 Object detection  on the Raspberry PI 4",
    "In this video I setup object detection with Tensorflow 2.2 on the Raspberry PI and OpenCV, using a Raspberry PI HQ Camera."
  ],
  [
    "Complete Tutorial on TensorFlow 2 0 using Keras API [Part 2]",
    "A Complete Guide on TensorFlow 2.0 using Keras API Build Amazing Applications of Deep Learning and Artificial Intelligence in ..."
  ],
  [
    "tensorflow tutorial Version 2.3.X || Classification Neural Network | TensorBoard || Deep Learning",
    "RanjanSharma In this video, i have shown you basic neural Network implementation for Classification Problem using TensorFlow ..."
  ],
  [
    "How to Interpret Keras Models with LIME ❌TensorFlow Keras Word Embeddings Explainability with LIME",
    "This is the missing tutorial on how to interpret Keras word embeddings with LIME. If our data is already an array of embeddings we ..."
  ],
  [
    "How a cucumber farmer is using Deep Learning and TensorFlow",
    "Keep updates on Artificial Intelligence use cases at http://www.Welcome.AI."
  ],
  [
    "TensorFlow for Computer Vision #4 - Convolutions From Scratch in Python | Better Data Science",
    "Do you know how convolutions work? They are essentially just a bunch of addition and multiplication operations. This video will ..."
  ],
  [
    "Tensorflow MLP implementaion with MNIST dataset",
    "here I implement MLP for MNIST dataset using Tensorflow. MNIST is hand written digit dataset for data science practice and best ..."
  ],
  [
    "#12: Gradient Tape in TensorFlow - 4 | Tutorial",
    "The video discusses Gradient Tape in TensorFlow. * * * Note: Audio/video lag * * * Timeline (Python 3.7.12; TensorFlow 2.8) 00:00 ..."
  ],
  [
    "TensorFlow Lite C++ ( Image Classification)",
    "This video is part of the Tensorflow Lite C++ series. In this video, I cover TensorFlow Lite C++ Image Classification."
  ],
  [
    "Face Mask Detection using Tensorflow Object Detection API [ Part-1 ]",
    "Python & Machine learning cheat sheet at just 50 INR Buy from here:- ..."
  ],
  [
    "How to fix AVX2 TensorFlow Python",
    "import os os.environ['TF_CPP_MIN_LOG_LEVEL'] = '2' import tensorflow as tf Message = tf.constant(\"Bismillah.... Hello, world!"
  ],
  [
    "Install tensorflow-gpu library in conda with NVDIA RTX 3080 and Windows 10",
    "install python 3.8; tf-nightly-gpu 2.5.0; cudnn 8.0.5; cudatoolkit 11.0.3 to use NVDIA RTX 3080 to accelerate deep learning ..."
  ],
  [
    "Create an object detection angular web application using Tensorflow JS",
    "You can learn how to add machine learning object detection model into your angular or any other web application by using ..."
  ],
  [
    "PYTHON : ImportError: No module named tensorflow",
    "PYTHON : ImportError: No module named tensorflow [ Gift : Animated Search Engine ..."
  ],
  [
    "TensorFlow Developer Certification Course by Hadelin de Ponteves Promo Video",
    "Google's TensorFlow Developer Certificate exam tests a developer's foundational knowledge of integrating machine learning into ..."
  ],
  [
    "Aprenda seu primeiro código TensorFlow (Curso de TensorFlow - Aula 2)",
    "Aprenda como abrir uma sessão no TensorFlow e imprimir uma mensagem na tela. Cursos Didática Tech: ..."
  ],
  [
    "Image Classification | Custom Dataset | Python | Tensorflow | Simple 3 steps | With code...",
    "Hello friends..., #withcode #imageclassification If you want to learn image classification in just 3 simple steps, this video is for you."
  ],
  [
    "Vehicle Detection &amp; Counter using OpenCV and Tensorflow on Raspberry Pi 3B+",
    "Vehicle Detection & Counter with OpenCV and Tensorflow. Machine Learning.When it all comes together @mfiruz76 . This is ..."
  ],
  [
    "MNIST Android with TensorFlow",
    "A TensoFlow classifier running on Android that can recognize handwritten digits. Check the code and a tutorial at ..."
  ],
  [
    "Transfer learning tutorial | how classify weather images using TensorFlow Vgg19",
    "This is a transfer learning tutorial , That enables to classify weather images. This tutorial is based on Python , TensorFlow , And ..."
  ],
  [
    "8/9 Gradient Descent in Tensorflow 2 - tf.GradientTape",
    "This video explain how to use tf.GradientTape function to train any model in tensorflow 2."
  ],
  [
    "8/9 Gradient Descent in Tensorflow 2 - tf.GradientTape",
    "This video explain how to use tf.GradientTape function to train any model in tensorflow 2."
  ],
  [
    "IMDB Sentiment Analysis in Tensorflow",
    "Subscribe for more ▻ https://bit.ly/2WKYVPj IMDB Sentiment Analysis in Tensorflow In depth coding tutorial taking you through ..."
  ],
  [
    "[TensorFlow 2 Deep Learning] Auto Encoder",
    "understand Auto Encoder and implement it using Tensorflow2."
  ],
  [
    "coimbatore deep learning tutorial tamil tensorflow custom object detection colab tamil data science",
    "https://github.com/tensorflow/models https://github.com/protocolbuffers/protobuf/releases ..."
  ],
  [
    "Seq2seq Model on Time-series Data: Training and Serving with TensorFlow - Masood Krohy",
    "Masood Krohy at April 9, 2019 event of montrealml.dev Title: Seq2seq Model on Time-series Data: Training and Serving with ..."
  ],
  [
    "Building Chatbots with Google DialogFlow | TensorFlow UserGroup Coimbatore",
    "This webinar will help you to learn the basic essential terminologies to build intelligent chatbots on the DialogFlow platform."
  ],
  [
    "How to Install Tensorflow and Scikit-Learn",
    "pip install tensorflow tensorflow-gpu scikit-learn."
  ],
  [
    "Image and Video classification with Keras and Tensorflow - Microsoft ML Azure Webinar - Udacity",
    "For video classification resources and code, check this video : https://youtu.be/ic7XcM5JK8k Introduction to image and video ..."
  ],
  [
    "AI Robot: Object detection using TensorFlow Lite and Web Monitoring | Raspberry Pi",
    "This AI Robot is now capable of detecting objects in live video stream. A Machine Learning model 'MobileNet SSD v1 (COCO)' ..."
  ],
  [
    "Lesson 10 Testing TensorFlow Magic Wand",
    "Lesson 10 Testing TensorFlow Magic Wand In this lesson I will show you how to test the TensorFlow Lite Magic Wand codes ..."
  ],
  [
    "Flappy Bird custom environment | writing a Reinforcement Algorithm using TensorFlow|Pygame",
    "Python Flappy Bird Ai tutorial. This is a tutorial on how to create custom pygame environment using python and tensorflow for ..."
  ],
  [
    "Food Item Classifier App (AI/Machine Learning/Deep Learning/CNN/Tensorflow)",
    "You might have seen the app where you type the food item name and the app will show you the micro-nutrients in it like Calories, ..."
  ],
  [
    "Streaming object recognition using Tensorflow and Flutter",
    "A proof-of-concept to see if a reasonably reliable and performant Augmented Reality app can be developed by the average Joe ..."
  ],
  [
    "Real-Time Object Detection on the Raspberry Pi with TensorFlow 2",
    "Written Github Guide: https://github.com/armaanpriyadarshan/Object-Detection-on-Raspberry-Pi Training a Custom TensorFlow ..."
  ],
  [
    "Tensorflow Project - Image classification using CNN - Step by Step",
    "This video will help you create a complete tensorflow project step by step. You will create a tensorflow project of image ..."
  ],
  [
    "#9: Gradient Tape in TensorFlow - 1 | Tutorial",
    "The video discusses Gradient Tape in TensorFlow. Timeline (Python 3.7.12; TensorFlow 2.8) 00:00 - Begin 00:09 - Outline of ..."
  ],
  [
    "React Native TensorFlow.js Realtime Image Classification",
    "Demo React Native + TensorFlow JS. Machine Learning."
  ],
  [
    "Raspberry Pi It took around 2hr, I am using Googles TensorFlow API if anyone was wondering",
    "It took around 2hr, I am using Googles TensorFlow API if anyone was wondering #Shorts."
  ],
  [
    "MNIST with Tensorflow | Part - 2 | One Hot Encoding |",
    "Tensorflow is an open-source framework developed by Google. It is used for Neural Network and Deep Learning Applications."
  ],
  [
    "Visualize Human Poses using PoseNet model in Tensorflow.js",
    "In this video, we will see how to use PoseNet model . PoseNet is a vision model that can be used to estimate the pose of a person ..."
  ],
  [
    "Part - 3 | Create a CNN model | Image Classification using Tensorflow | Complete guide | with Code",
    "Hello friends, in this tutorial series we will understand every aspect of Image Classification using Tensorflow. We will understand ..."
  ],
  [
    "seq2seq lstm encoder decoder model in TensorFlow for mathematical summation",
    "NLP tutorial for beginners in seq2seq lstm encoder decoder model. -we build a sequence to sequence model using LSTM in ..."
  ],
  [
    "Introduction of TensorFlow",
    "Here is Series of the tensorflow Library....... In this Video We cover 1] What is TensorFlow 2] Why TensorFlow 3] What is DataFlow ..."
  ],
  [
    "Yolo v1 from scratch using Tensorflow - Part 1: Preprocessing Data",
    "Hi guys! In this video, I will preprocess the Dog and Cat Detection dataset so that we can use it to train the first version of YOLO ..."
  ],
  [
    "TensorFlow Hands-On - Optimize Learning Rate With Python and TensorFlow 2.5 | Better Data Science",
    "Note: Sorry if I sound a bit sleepy, I've recorded this around 4 AM. Do you want to increase the accuracy of your neural network ..."
  ],
  [
    "TensorFlow in 5 Minutes | Introduction To TensorFlow | Deep Learning Using TensorFlow | Edureka",
    "AI & Deep Learning with Tensorflow Training: https://goo.gl/vDxgi5 ** This Edureka video of \"TensorFlow in 5 minutes\" provides ..."
  ],
  [
    "Tensorflow From Scratch | TensorFlow Tutorial For Beginners | Deep Learning &amp; TensorFlow | AIOC",
    "AIOC #ml #ai #tensorflow #machinelearning #artificialinteligents Tensorflow Official Website: https://www.tensorflow.org/ ..."
  ],
  [
    "Tensorflow pour les débutants",
    "ATTENTION!! LA VIDEO EST PLUS A JOUR. RENDEZ VOUS ICI: https://www.youtube.com/watch?v=hP7Ac8S9Tgs Cette vidéo ..."
  ],
  [
    "Face Recognition Using Tensorflow and OpenCV",
    "Source Code : - https://github.com/rishaldyprisly/tensorflow About TensorFlow https://en.wikipedia.org/wiki/TensorFlow About ..."
  ],
  [
    "Time series forecasting with Python &amp; TensorFlow ~ School of AI NL",
    "Marco on Linkedin: https://www.linkedin.com/in/marco-peixeiro/ 35% discount code for all Manning books: podberil21 Get ..."
  ],
  [
    "TensorFlow ve GTA ile Kendi Kendine Giden Araba, Bölüm 1",
    "https://www.youtube.com/user/sentdex https://www.twitch.tv/sentdex."
  ],
  [
    "たったのこれだけ？！ゼロから作る画像認識AIアプリ【TensorFlow × Gradio】",
    "書籍========== 「Amazon Kindle Unlimited」なら全書籍が無料！ 【初回30日無料】で加入できます！ ▽書籍一覧 ..."
  ],
  [
    "Data in Tensorflow (Neural Network ) Tensorflow part 2 #9  | Andrew Ng",
    "Advanced Learning Algorithms:Neural ..."
  ],
  [
    "Tensorflow Visualize Computational Graph to Add Two Numbers using Tensorboard in Mac",
    "Tensorflow Visualize Computational Graph to Add Two Numbers using Tensorboard display image Visualizing TensorFlow ..."
  ],
  [
    "TensorFlow.js - Bringing ML and Linear Algebra to Node.js - Ping Yu &amp; Sandeep Gupta, Google",
    "TensorFlow.js - Bringing ML and Linear Algebra to Node.js - Ping Yu & Sandeep Gupta, Google No Python required - this session ..."
  ],
  [
    "AI Traffic Monitoring System deep learning Tensorflow PyTorch| +91-9872993883 for query",
    "Hi guys, This is our #PyTorch| #Deep_Learning Breakthrough based Smart Traffic Monitoring System. Keep watching & liking our ..."
  ],
  [
    "Non-Sequential Neural Network with TensorFlow | Functional API",
    "This video demonstrates the usage of Model Function in Functional API of TensorFlow Python library for building simple ..."
  ],
  [
    "Converting TensorFlow 2 Models to TensorFlow Lite and TFLite Object Detection on the Raspberry Pi",
    "Timestamps 0:00 Intro 1:14 TensorFlow Lite Conversion 10:46 Object Detection on the Raspberry Pi. Happy Thanksgiving!"
  ],
  [
    "Object detection using Tensorflow.js and Angular (8)",
    "Image Classification and Object detection by Using Tensorflow.js with Angular."
  ],
  [
    "Makine Öğrenmesi -24- Tensör Nedir? TensorFlow&#39;u ve Yapay Sinir Ağlarını Anlayalım (Yapay Zeka)",
    "https://www.youtube.com/watch?v=f5liqUk0ZTw Tensör nedir videosu? Verisetimiz http://i.hizliresim.com/Lyz7Yj.jpg."
  ],
  [
    "Install TensorFlow-GPU 1.8 on Windows PC",
    "Hassle-free step-by-step guide to install tensorflow-gpu version 1.8 on computer with Windows operating system. Includes steps ..."
  ],
  [
    "Ep-2.2: Linear Regression with Tensorflow || TFK-Deep Learning || Exploring Neurons",
    "This video explains how to implement simple and multiple linear regression in tensorflow. It also explains the visualization of ..."
  ],
  [
    "Image Super Resolution: SRResNet and SRGAN TensorFlow 2 implementation and model intuition",
    "In this video, I talk through a TensorFlow 2 implementation of the Image Super Resolution SRResNet and SRGAN models, ..."
  ],
  [
    "How to start Tensorflow Serving on Windows 10. REST api Example.",
    "In this video we are going to start Tensorflow Serving with Docker example on windows 10. Also, we are solving an issue with the ..."
  ],
  [
    "Custom Models and Training with TensorFlow",
    "Custom Models and Training with TensorFlow Discussion leader: George Zoto This session will provide an overview of ..."
  ],
  [
    "Better ML Engineering with TensorFlow production Pipeline  Project &amp; ML Metadata part-1",
    "Notebook link ..."
  ],
  [
    "¿QUÉ ES TENSORFLOW?",
    "Te contamos que es TensorFlow y como introducirte al mundo de Machine Learning con el software de Google. Accede al curso ..."
  ],
  [
    "(ANN) Artificial Neural Network Using Tensorflow 2 | Deep Learning | Brain Mentors Pvt. Ltd.",
    "This video contains the introduction of TensorFlow 2.0 and its features. Also the implementation of deep learning simple ANN ..."
  ],
  [
    "How to install Tensorflow-GPU on Windows 10",
    "In this video, we'll be installing the tensorflow-gpu along with the components that it requires such as cuDNN, CUDA toolkit, and ..."
  ],
  [
    "텐서 플로우 TensorFlow 기초",
    "딥러닝 프레임워크 Deep Learning Framework 텐서 플로우 TensorFlow 기초 텐서, 넘파이 변환, 타입 변환, 오토그래프, 변수 생성, ..."
  ],
  [
    "TensorFlow Lite Demo apps - 6: Super resolution",
    "The video shows how to run the Super resolution demo that is available on TensorFlow Lite website to work on a mobile device ..."
  ],
  [
    "Sentiment Analysis | BERT tutorial | Transformer | TensorFlow Keras Python | Text Classification NLP",
    "The BERT framework, a new language representation model from Google AI, uses pre-training and fine-tuning to create ..."
  ],
  [
    "Yolo Object Detection tutorial in 5 minutes on Windows | TensorFlow",
    "In this video, the Yolo Object Detection tutorial in 5 minutes on Windows TensorFlow. ⭐Made by: Yaamin Ahmed.⭐ Yolo Object ..."
  ],
  [
    "TensorFlow Meetup tunis - Arabic Natural Language Processing With TF",
    "In this TensorFlow Meetup we explored some of the Natural Language Processing, Automatic Speech Recognition and Text To ..."
  ],
  [
    "Object detection in Android using TensorFlow Lite (2020)",
    "In this video you will learn how to train object detection model on custom data and run the trained model on Android app using ..."
  ],
  [
    "K -01 What is TensorFlow   ما هو التنسر فلو",
    "هذه المحاضرة هي جزء من سلسلة محاضرات علم تعليم الآلة machine learning يمكنك مشاهدة جميع الحلقات هنا ..."
  ],
  [
    "TensorFlow Education Stipend For 50 Percent Off Developer Certificate",
    "TensorFlow #DeepLearning #Stipend Application Form: https://www.tensorflow.org/static/extras/cert/TF_Education_Stipend.pdf ..."
  ],
  [
    "Lesson 32 How To Install TensorFlow on Raspberry Pi",
    "In this lesson I will show you how to install TensorFlow which we will use at a later stage combining with NodeJS and other Java ..."
  ],
  [
    "Practical Machine Learning with TensorFlow 2.0 and Scikit-Learn : Machine Learning | packtpub.com",
    "This video tutorial has been taken from Practical Machine Learning with TensorFlow 2.0 and Scikit-Learn. You can learn more and ..."
  ],
  [
    "Machine Learning using TensorFlow 2 | Machine Learning Basics | P-1  TensorFlow Tutorial",
    "python #python3 #machinelearning #ml #datascience #data #webdevelopment #datascience #datasciencecourse ..."
  ],
  [
    "Video Background Removal Deep learning Python Tensorflow Explained | AI ML DL |+91-9872993883 fr qry",
    "Hello Guys, in this video I have shown you the demo of how background removal work, in video calling software."
  ],
  [
    "Albumentations with TensorFlow 2 and PyTorch for Data augmentation - Full Stack Deep Learning.",
    "Albumentations is a Python library for fast and flexible image augmentations. Albumentations efficiently implements a rich variety ..."
  ],
  [
    "Converting Tensorflow Object Detection model to TFLite model",
    "This is the first video in a series about running crossplatform object detection using Tensorflow Lite on iOS and Android."
  ],
  [
    "Machine Learning And Deep Learning For Biology With Python And Tensorflow",
    "SUBSCRIBE and LIKE for more FREE tutorials. COMMENT your tutorial requests. FULL eDegrees available with: Yearly ..."
  ],
  [
    "Audio Recognition on a Raspberry Pi using TensorFlow Lite",
    "Here we have adapted the official TensorFlow simple audio recognition example to use live audio data from an I2S microphone ..."
  ],
  [
    "Dog face detection for Tensorflow lite",
    "https://medium.com/tensorflow/training-and-serving-a-realtime-mobile-object-detector-in-30-minutes-with-cloud-tpus- ..."
  ],
  [
    "Tensorflow Lite - Flutter #4 - Object Detection using SSD MobileNet",
    "Hi Friends Detect objects using TensorFlow Lite Model i..e, SSD(Single Shot MultiBox Detector) Mobile Net Project Code: ..."
  ],
  [
    "Convert Tensorflow StyleGAN2 model .pkl files to PyTorch .pt files",
    "To use GANspace or the Network bending repos, you'll need to convert your Tensorflow model files (.pkl) to PyTorch files (.pt)."
  ],
  [
    "What Is Global Step In Tensorflow | Machine Learning | Tensorflow #Recipe 12 | All In One Code",
    "Stochasticity To keep optimizers from converging to a local minimum instead of a global minimum, many applications split their ..."
  ],
  [
    "Hands-On Unsupervised Learning with TensorFlow 2.0 : The Course Overview | packtpub.com",
    "This video tutorial has been taken from Hands-On Unsupervised Learning with TensorFlow 2.0. You can learn more and buy the ..."
  ],
  [
    "Flutter Artificial Intelligence with TfLite | Tensorflow",
    "TensorFlow Lite is a mobile library for deploying models on mobile, microcontrollers and other edge devices."
  ],
  [
    "Распознавание объектов на Python | Поиск объектов на изображении | TensorFlow, PixelLib",
    "В данном видео пишем программу для распознавания объектов на изображении с помощью Python. Находим людей ..."
  ],
  [
    "person identification and object detection using tensorflow and tensorflow lite in android device",
    ""
  ],
  [
    "Getting started with TensorFlow 2",
    "Welcome to Getting started with TensorFlow 2! You're joining thousands of learners currently enrolled in the course. I'm excited to ..."
  ],
  [
    "Candy Sorting Machine With Arduino &amp; TensorFlow - Arduino Adventures Part 1",
    "Join the community in learning about Arduino and microcontroller projects! This three-part series focuses on the basics of getting ..."
  ],
  [
    "SFBA_20180823:TensorFlow Probability and how Yelp use ML to identify popular dishes",
    "Talk 1: TensorFlow Probability (Google) TensorFlow Probability (TFP) is a library for probabilistic reasoning and statistical ..."
  ],
  [
    "install opencv tensorflow-lite mediapipe | raspberry pi opencv | opencv 4.6.0",
    "Friends OpenCV 4.6.0 Is Now Available so Video is same NOW you will Have latest opencv version 4.6.0 and i have already ..."
  ],
  [
    "Adding Audio Classification using a yamnet classification TensorFlow lite model,ML Kit &amp; TF Lite 012",
    "In this video we add audio classification to an Android project using a yamnet model downloaded from https://tfhub.dev/."
  ],
  [
    "Deep Q Learning with Tensorflow and Space Invaders 🕹️👾 (tutorial)",
    "We'll implement an Deep Q-learning agent with Tensorflow that learns to play Atari Space Invaders 🕹️   This video is part of the ..."
  ],
  [
    "Stock Market Prediction with TensorFlow - Making Predictions pt. 3",
    "Part 3 of stock market prediction with Tensorflow where we make predictions using our model created with the Tensorflow ..."
  ],
  [
    "Build a Handwriting Recognition App with Python, Tensorflow, and Flask",
    "code: https://github.com/dbusteed/alphabet_quiz."
  ],
  [
    "Javascript Tensorflow.js BodyPix Example to Blur Background of Image and Flip it Horizontally",
    "Download the full source code of application here: ..."
  ],
  [
    "Building a multi-fruit classification computer vision model with TensorFlow and Keras",
    "This video shows you how to split image dataset into train and test and how to split image dataset in python. How to load images ..."
  ],
  [
    "How to Build an Amazing contextual Chatbot using Tensorflow - Part 2 | NLP Concepts",
    "Welcome to \"The AI University\". About this video: This video explains how to build an amazing contextual chatbot using ..."
  ],
  [
    "How to install Tensorflow on M1 Macbook",
    "If this video does not work well, please check the link below."
  ],
  [
    "Train Model in Tensorflow and test in Unity (Android, IOS)",
    "Tutorial on how to train a simple model in Tensorflow using Google Colab and then use the model to predict in Unity (Android, ..."
  ],
  [
    "Martin Hamilton - A Raspberry Pi powered talking TensorFlow AI",
    "In this video I show how a humble Raspberry Pi can be turned into an artificial intelligence that recognises objects you put in front ..."
  ],
  [
    "Building a neural network Using Tensorflow #10 Tensorflow implementation part 3 | Andrew Ng",
    "Advanced Learning Algorithms: Neural ..."
  ],
  [
    "五分钟入门Tensorflow",
    "五分钟学会如何用Tensorflow 识别图片上面的文字 用Google Tensorflow让你的机器学习事半功倍 Tensorflow 官网: ..."
  ],
  [
    "ArmNN delegate for TensorFlow Lite",
    "TFLite monthly user group meeting - 3/24/2022 ArmNN talk by Arm Sr. Product Manger Ronan Naughton. This talk is in English."
  ],
  [
    "Machine Learning for mobile | Keynote",
    "Get ready for mobile, microcontrollers, and other edge devices! Learn how TensorFlow can help you with ML solutions regardless ..."
  ],
  [
    "#10: Gradient Tape in TensorFlow - 2 | Tutorial",
    "The video discusses Gradient Tape in TensorFlow. Timeline (Python 3.7.12; TensorFlow 2.8) 00:00 - Begin 00:12 - Outline of ..."
  ],
  [
    "Raspberry pi custom object detection using tensorflow lite 🔥 | no GPU| PART - 2🔥",
    "Note: use python 3.6 python xml_to_csv.py python generate_tfrecord.py --csv_input=images\\train_labels.csv ..."
  ],
  [
    "TensorFlow implementation of neural networks part 1 Inferencence from code |Andrew Ng #8",
    "Advanced Learning Algorithms:Neural ..."
  ],
  [
    "Machine Learning using Tensorflow.JS with Patty O&#39;Callaghan",
    "In this \"Teach Eddie\" livestream I am joined by Patty O'Callaghan who is a Tech Lead CRiverLabs and Google's Women ..."
  ],
  [
    "TensorFlow Cloud -Fethi Tekyaygil",
    "TensorFlow Cloud -Fethi Tekyaygil."
  ],
  [
    "TensorFlow Basics with Dr.Yunus Serhat Bıçakçı",
    "TensorFlow Nedir ? TensorFlow'a Giriş Kodlama."
  ],
  [
    "Using Machine Learning and AI to serve people and communities",
    "AI is a powerful tool with seemingly unlimited potential, but it must be better understood to be effective for most organizations."
  ],
  [
    "A developer&#39;s guide to responsible AI review processes",
    "From startups to corporations across industries, organizations are creating AI principles and ethics review processes to ..."
  ],
  [
    "Experiment NVIDIA TAO Toolkit and pretrained models on Google Colab",
    "The #NVIDIATAO Toolkit, built on TensorFlow and PyTorch, is a low-code AI solution that abstracts away the AI and deep learning ..."
  ]
]