[
  [
    "Joshua Graham - A Brief Introduction to Algebraic K-theory and why it matters",
    "Talk given by Joshua Graham (University of New South Wales) at the Australian Postgraduate Algebra Colloquium on 12th May ..."
  ],
  [
    "Teena Gerhardt - 1/3 Algebraic K-theory and Trace Methods",
    "Algebraic K-theory is an invariant of rings and ring spectra which illustrates a fascinating interplay between algebra and topology."
  ],
  [
    "Algebraic K-theory, combinatorial K-theory and geometry - Inna Zakharevich",
    "Vladimir Voevodsky Memorial Conference Topic: Algebraic K-theory, combinatorial K-theory and geometry Speaker: Inna ..."
  ],
  [
    "Introduction to Algebraic K-Theory (Lecture 1)",
    "I don't own the rights to this. I'm sharing this because I found no introductions to algebraic k theory on YouTube. These lectures ..."
  ],
  [
    "Andreas Thom: Algebraic vs topological K theory (Lecture 1)",
    "Due to a technical defect the lecture could not be recorded completely.) The lecture was held within the framework of the ..."
  ],
  [
    "What is K-theory and what is it good for?",
    "Paul F. Baum (Penn State University, State College, USA)"
  ],
  [
    "Michael Atiyah - Topology and K-theory (34/93)",
    "To listen to more of Michael Atiyah's stories, go to the playlist: ..."
  ],
  [
    "Algebraic K-theory and the Cyclotomic Trace - Ayelet Lindenstrauss",
    "Members' Colloquium Topic: Algebraic K-theory and the Cyclotomic Trace Speaker: Ayelet Lindenstrauss Affiliation: Member, ..."
  ],
  [
    "Algebraic K-theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Trace methods in algebraic K-theory",
    "David Gepner Cyclic Cohomology at 40: achievements and future prospects September 30/21 Much of our computational ..."
  ],
  [
    "Introduction to Algebraic K-Theory (Lecture 2)",
    "I don't own the rights to this. I'm posting it because I found no introduction to algebraic k theory on YouTube. These lectures were ..."
  ],
  [
    "Algebraic K-theory and arithmetic",
    "2015 KAIST Math. Colloquium Algebraic K-theory and arithmetic/ Rob de Jeu(Vrije Universiteit Amsterdam)/ 2015-06-11."
  ],
  [
    "Teena Gerhardt - 3/3 Algebraic K-theory and Trace Methods",
    "Algebraic K-theory is an invariant of rings and ring spectra which illustrates a fascinating interplay between algebra and topology."
  ],
  [
    "G-Global Algebraic K-Theory, Tobias Lenz",
    "Abstract: Algebraic K-theory is an important invariant encoding at the same time arithmetic, topological, and geometric information."
  ],
  [
    "Teena Gerhardt - 2/3 Algebraic K-theory and Trace Methods",
    "Algebraic K-theory is an invariant of rings and ring spectra which illustrates a fascinating interplay between algebra and topology."
  ],
  [
    "Introduction to Algebraic K-Theory (Lecture 3)",
    "I don't own the rights to this. I'm posting it because I found no introduction to algebraic k theory on YouTube. These lectures were ..."
  ],
  [
    "electronic Algebraic K-Theory Seminar",
    "Here are recordings of the talks from electronic Algebraic K-theory Seminar."
  ],
  [
    "Algebraic K-Theory Via Binary Complexes - Daniel Grayson",
    "Daniel Grayson University of Illinois at Urbana-Champaign; Member, School of Mathematics October 22, 2012 Quillen's higher ..."
  ],
  [
    "Introduction to Algebraic K-Theory (Lecture 4)",
    "I don't own the rights to this. I'm posting it because I found no introduction to algebraic k theory on YouTube. These lectures were ..."
  ],
  [
    "Mona Merling - Algebraic K-theory and group actions",
    ""
  ],
  [
    "Christoph Winges: On the isomorphism conjecture for Waldhausen&#39;s algebraic K-theory of spaces",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: \"The Farrell-Jones conjecture\" I ..."
  ],
  [
    "Descent in algebraic K theory Mathew",
    "https://open.library.ubc.ca/cIRcle/collections/birs/items/1.0308609 ..."
  ],
  [
    "Algebraic K-theory Top # 11 Facts",
    "Algebraic K-theory Top # 11 Facts."
  ],
  [
    "Zakharevich K-Theory and Algebraic K-Theory (talk)",
    "joint work with Michael Groechenig We discuss how to link Zakharevich K-Theory (the thickening of the K-Theory of Varieties ..."
  ],
  [
    "From algebraic K-theory to motivic cohomology and back | Marc Levine | Лекториум",
    "From algebraic K-theory to motivic cohomology and back | Лектор: Marc Levine | Организатор: Математическая лаборатория ..."
  ],
  [
    "Charles Weibel: K-theory of algebraic varieties (Lecture 1)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Charles Weibel: K ..."
  ],
  [
    "BilTop | Akhil Mathew | Descent and vanishing in algebraic K-theory via group actions",
    "Bilkent topology seminar, Dec 14 2020, by Akhil Mathew (University of Chicago) Abstract: I will explain some descent and ..."
  ],
  [
    "Anna Marie Bohmann: Assembly in the Algebraic K-theory of Lawvere Theories",
    "Talk by Anna Marie Bohmann in Global Noncommutative Geometry Seminar (Americas), ..."
  ],
  [
    "Moritz Kerz: Algebraic K-theory and descent for blow-ups (Lecture 1)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Moritz Kerz: ..."
  ],
  [
    "The close relation between K theory and TC theory",
    "Dustin Clausen Cyclic Cohomology at 40: achievements and future prospects September 30/21 Topological cyclic homology is a ..."
  ],
  [
    "Kaif Hilman: Multiplicative norms on equivariant algebraic K-theory",
    "Abstract: An important source of examples of algebraic K-theory spectra are those coming from stable categories equipped with a ..."
  ],
  [
    "Algebraic K-theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Algebraic_K-theory 00:02:23 1 History 00:02:37 1.1 ..."
  ],
  [
    "Charles Weibel: K-theory of algebraic varieties (Lecture 4)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Lecture 4 will survey ..."
  ],
  [
    "Haldun O  Bayindir: &quot;Algebraic K-theory of formal differential graded algebras&quot;",
    "Haldun O Bayindir Institut Galilée Paris 13 University. Francia."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "Michael Atiyah - And topological K-theory was born (36/93)",
    "To listen to more of Michael Atiyah's stories, go to the playlist: ..."
  ],
  [
    "P. Scholze - p-adic K-theory of p-adic rings",
    "The original proof of Grothendieck's purity conjecture in étale cohomology (the Thomason-Gabber theorem) relies on results on ..."
  ],
  [
    "Charles Weibel: K-theory of algebraic varieties (Lecture 3)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Charles Weibel: K ..."
  ],
  [
    "BilTop | Ozgur Bayindir | Algebraic K-theory of THH(Fp)",
    "Bilkent topology seminar, Nov 23 2020, by Ozgur Bayindir (University of Paris 13) Abstract: In this work, we study ..."
  ],
  [
    "Lennart Meier - The chromatic behaviour of algebraic K-theory",
    "There is a classic theorem of Waldhausen stating that algebraic K-theory preserves under certain hypotheses rational ..."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "Andreas Thom: Algebraic vs  topological K theory (Lecture 2)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: Applied and Computational Algebraic Topology."
  ],
  [
    "CIMPA Floripa - Bivariant algebraic K-theory and Leavitt path algebras, part 1",
    "Plenary talk at the CIMPA Floripa School. Lecturer: Guillermo Cortiñas (Universidad de Buenos Aires – Argentina) Abstract: ..."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "Charles Weibel: K-theory of algebraic varieties (Lecture 2)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Charles Weibel: K ..."
  ],
  [
    "VCAS:  Quillen K-Theory:  A reclamation in commutative algebra (Part 2)",
    "Title: Quillen K-Theory: A reclamation in commutative algebra (Part 2) Speaker: Satya Mandal Affiliation: The University of Kansas, ..."
  ],
  [
    "Max Karoubi: Hermitian K theory invariants in Topology and Algebraic Geometry",
    "The lecture was held within the framework of the Hausdorff Trimester Program: Non-commutative Geometry and its Applications ..."
  ],
  [
    "Akhil Mathew (November 6, 2020):  Etale K-theory and motivic cohomology",
    "Two key features of algebraic K-theory are its failure to satisfy etale descent, and its motivic filtration in terms of higher Chow ..."
  ],
  [
    "Tony Feng - The Galois action on symplectic K-theory",
    "The algebraic K-theory of the integers has fascinating connections with number theory; for example, the values of the Riemann ..."
  ],
  [
    "Christian Dahlhausen - Continuous K-theory and K-theory of Zariski-Riemann spaces",
    "Continuous K-theory is a derivative of algebraic K-theory for rigid analytic spaces, it was defined by Morrow and further studied by ..."
  ],
  [
    "Markus Land, “Manifolds, algebraic K-theory, and excision”, GeoTop Opening Symposium 2nd ed.",
    "Markus Land, Universities of Regensburg and Copenhagen, GeoTop member, “Manifolds, algebraic K-theory, and excision”."
  ],
  [
    "P. Scholze - p-adic K-theory of p-adic rings",
    "The original proof of Grothendieck's purity conjecture in étale cohomology (the Thomason-Gabber theorem) relies on results on ..."
  ],
  [
    "CIMPA Floripa - Bivariant algebraic K-theory and Leavitt path algebras, part 2",
    "Plenary talk at the CIMPA Floripa School. Lecturer: Guillermo Cortiñas (Universidad de Buenos Aires – Argentina) Abstract: ..."
  ],
  [
    "K theory",
    ""
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "Algebraic Morava K-theory and algebraic groups - Nikita Semenov",
    "Speaker(s) Nikita Semenov Ludwig-Maximilians-Universität München Date 16 June 2022 – 14:30 to 15:30 Venue INI Seminar ..."
  ],
  [
    "Christoph Winges: On the Farrell Jones conjecture for real algebraic K-theory",
    "I will explain how the setup for real algebraic K-theory established by Calmès, Dotto, Harpaz, Hebestreit, Land, Moi, Nardin, ..."
  ],
  [
    "Jean-François Lafont - An introduction to K-theory and the isomorphism conjectures",
    "Jean-François Lafont (Ohio State University) An introduction to K-theory and the isomorphism conjectures I will give an overview ..."
  ],
  [
    "On the K-theory of Z/p^n",
    "Benjamin Antieau (Northwestern University) Conference on Homotopy Theory with Applications to Arithmetic and Geometry June ..."
  ],
  [
    "Justin Noel: Galois descent and redshift in algebraic K theory",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Justin Noel: Galois ..."
  ],
  [
    "Yosuke Kubota :  Twisted equivariant K-theory and topological phases",
    "Abstract: The classification of topological phases in each Altland-Zirnbauer symmetry class is related to one of 2 complex or 8 real ..."
  ],
  [
    "VCAS:  Quillen K-Theory:  A reclamation in commutative algebra (Part 1)",
    "Title: Quillen K-Theory: A reclamation in commutative algebra (Part 1) Speaker: Satya Mandal Affiliation: The University of Kansas, ..."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "CDH methods in K-theory and Hochschild homology - Charles Weibel",
    "Charles Weibel Rutgers University; Member, School of Mathematics November 11, 2013 This is intended to be a survey talk, ..."
  ],
  [
    "Georg Tamme: Differential algebraic K theory",
    "The lecture was held within the framework of the Hausdorff Trimester Program: Non-commutative Geometry and its Applications ..."
  ],
  [
    "KA2W02",
    ""
  ],
  [
    "Sander Kupers - Algebraic K-theory and the unstable homology of general linear group",
    "The stable homology of general linear groups over a field is well-known to be closely related to its algebraic K-theory."
  ],
  [
    "Cary Malkiewich: The transfer in algebraic K theory and THH",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Cary Malkiewich: ..."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "Applications of topological cyclic homology in algebraic K-theory",
    "Bjorn Dundas, University of Bergen September 27, 2021 Cyclic Cohomology at 40: achievements and future prospects ..."
  ],
  [
    "Lennart Meier - Periodic versions of algebraic K-theory",
    "Talk at the UGC Seminar on 6th April 2021. Lennart's website: https://webspace.science.uu.nl/~meier007/ Website of the seminar: ..."
  ],
  [
    "Guillermo Cortiñas - Bivariant (hermitian) K-theory and applications",
    "Bivariant algebraic K-theory is a functor from a category of associative algebras over a commutative ring to a certain triangulated ..."
  ],
  [
    "Boolean Algebra, Logic Gates &amp; K-Maps",
    "In this Tutorial Playlist we will learn the concept of boolean algebra and understand its rules and laws. We will also understand ..."
  ],
  [
    "Operational K-theory - Sam Payne",
    "Sam Payne March 13, 2015 Workshop on Chow groups, motives and derived categories More videos on http://video.ias.edu."
  ],
  [
    "Takashi Kimura - On stringy algebraic operations in equivariant K-theory",
    "Talk at String-Math 2011 held at University of Pennsylvania, Jun06-11, 2011. Event website: ..."
  ],
  [
    "Moritz Kerz: Algebraic K-theory and descent for blow-ups (Lecture 2)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Moritz Kerz: ..."
  ],
  [
    "Arthur Bartels: K-theory of group rings (Lecture 1)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Arthur Bartels: ..."
  ],
  [
    "Markus Land (Copenhagen) - Hermitian K-theory",
    "I will start by introducing the Grothendieck-Witt group associated to a ring and discuss some examples. I will show how it relates to ..."
  ],
  [
    "Algebraic K-theory, motivic cohomology and motivic homotopy theory",
    "KA2W01."
  ],
  [
    "The Chromatic Behaviour of Algebraic K Theory",
    "Lennart Meier Universiteit Utrecht."
  ],
  [
    "Ben Antieau Algebraic Topology July 2016 Uchicago   K-Theory 3",
    "http://math.uchicago.edu/~chicagotopology2/antieau-lecture1.pdf."
  ],
  [
    "Grigory Garkusha: Algebraic Kasparov K-theory...",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Title: Grigory ..."
  ],
  [
    "Yonatan Harpaz - New perspectives in hermitian K-theory I",
    "For questions and discussions of the lecture please go to our discussion forum: ..."
  ],
  [
    "Decompositions of varieties, birationality, and K theory (Inna Zakharevich)",
    "In this talk we investigate the higher homotopical structure that can be added to the Grothendieck ring of varieties using algebraic ..."
  ],
  [
    "Peter May Algebraic Topology July 2016 Uchicago   K-Theory",
    "http://math.uchicago.edu/~chicagotopology2/BottTalk.pdf."
  ],
  [
    "Theorem || Every finite extension is an algebraic Extension || Field Theory || Abstract Algebra",
    "Abstract Algebra # M.Sc Maths Algebra # Field Extension # Theorem on finite field extension Theorem || Every finite extension is ..."
  ],
  [
    "Algebraic Number Theory, M.Sc. Sem-4(KUK)",
    ""
  ],
  [
    "K-Theory",
    "A channel exploring the wonders of mathematics, generally aimed (though not exclusively) at higher level mathematics. Contents ..."
  ],
  [
    "Alexander Efimov: On the K-theory of large triangulated categories",
    ""
  ],
  [
    "Equivariant K-theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Georg Tamme: On excision in algebraic K-theory",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Georg Tamme: On ..."
  ],
  [
    "Bhargav Bhatt: Algebraic geometry in mixed characteristic",
    "For a fixed prime number p, we report on some recent developments in algebraic geometry (broadly construed) over p-adically ..."
  ],
  [
    "Mikala Ørsnes Jansen- The reductive Borel-Serre compactification and unstable algebraic K-theory",
    ""
  ],
  [
    "Classical introduction to K-theory",
    "Survey talk about K-theory in preparation for the research talk given on 9.01.2017 (see https://youtu.be/8R7O2ae0_Vk)."
  ],
  [
    "K-theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/K-theory 00:02:07 1 Grothendieck completion ..."
  ],
  [
    "Hermitian K-theory of stable infinity categories - Baptiste Calmès",
    "Speaker(s) Baptiste Calmès Université d'Artois Date 17 June 2022 – 10:00 to 11:00 Venue INI Seminar Room 1 Session Title ..."
  ],
  [
    "Algebraic K-theory of monoid algebras - Husney Parvez Sarwar",
    "Speaker(s) Husney Parvez Sarwar Indian Institute of Technology Date 26 July 2022 – 11:00 to 12:00 Venue INI Seminar Room 2 ..."
  ],
  [
    "Algebraic Extension || Algebraic element || Transcendental Extension || Field Theory",
    "Algebraic Extension in Field Theory Advance abstract algebra C is algebraic extension over R Theorem || Every finite extension is ..."
  ],
  [
    "Algebraic topology: Introduction",
    "This lecture is part of an online course on algebraic topology. This is an introductory lecture, where we give a quick overview of ..."
  ],
  [
    "K-Theory 1.1: The Grothendieck Group of a Category and the Group K(X)",
    "HERE IT IS LADIES AND GENTLEMAN ! K-theory, along with a new board are here. I introduce the stuff in the title and the ..."
  ],
  [
    "Kyoto U. &quot;K-theory of group C∗-algebras and applications&quot; Prof. Gennadi Kasparov",
    "Top Global Course Special Lectures \"K-theory of group C∗-algebras and applications\" Gennadi Kasparov Vanderbilt University ..."
  ],
  [
    "Daniel Kasprowski: On the K-theory of groups with finite decomposition complexity",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: \"The Farrell-Jones conjecture\" ..."
  ],
  [
    "Emanuele Dotto: Real topological Hochschild homology and the Hermitian K-theory...",
    "Emanuele Dotto: Real topological Hochschild homology and the Hermitian K theory of Z2 equivariant rin The lecture was held ..."
  ],
  [
    "Thomas Nikolaus Polynomial functors and algebraic K theory",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Algebra Theories",
    "Algebra Theories. Part of the series: Basic and Pre-Algebra. A number of different theories make up the basic framework of ..."
  ],
  [
    "ALGEBRA जिंदगी भर आपका गुलाम होगा। ||ALGEBRA TRICK MATHS MASTI||",
    "Dhurina app link https://dhurina.app.link/gRoG6ra664 maths masti paid course link https://youtu.be/Q94m52kJ1vA."
  ],
  [
    "Homogeneous spaces, algebraic K-theory and cohomological(...) - Izquierdo - Workshop 2 - CEB T2 2019",
    "Diego Izquierdo (MPIM Bonn) / 24.06.2019 Homogeneous spaces, algebraic K-theory and cohomological dimension of fields."
  ],
  [
    "The Nil-Nil theorem in algebraic K-theory",
    "Overview of joint work with J. F. Davis and A. A. Ranicki [2011]. Lecture by Qayum Khan (Saint Louis University, USA) given at the ..."
  ],
  [
    "Rly Group D algebra || Math Unique Best Tricks || Railway/SSC/BANK || KTC By Kapildeo Sir #shorts",
    "shorts ----------KTC Classes By Kapildeo Sir (Kd. Sir)-------------- 🔷 Download our New app :- https://bit.ly/2p5Mnpr 🔷 For pdf My ..."
  ],
  [
    "Higher categories and algebraic K theory Andrew Blumberg (University of Texas)",
    "http://www.msri.org/workshops/685/schedules/17885."
  ],
  [
    "K Theory",
    ""
  ],
  [
    "Arthur Bartels: K-theory of group rings (Lecture 2)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Arthur Bartels: ..."
  ],
  [
    "Scissors Congruence and K-theory - Inna Zakharevich",
    "Inna Zakharevich Massachusetts Institute of Technology; Member, School of Mathematics October 4, 2013 For more videos, visit ..."
  ],
  [
    "Field Theory || Abstract Algebra || Algebraic Extension Field || Lecture-3 || By Mr. Parveen Kumar",
    "This is the 1st Lecture of Field Theory. In This Lecture, we discuss the Algebraic Extension Field and Method How to Find and ..."
  ],
  [
    "Akhil Mathew - On K(1)-local TR",
    "The K(1)-localization of algebraic K-theory was first studied by Thomason, who showed that it is filtered by étale cohomology ..."
  ],
  [
    "Ben Antieau: Negative and homotopy K-theoretic extensions of the theorem of the heart",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Maria Yakerson: Universality of algebraic K-theory",
    "Among various features of algebraic K-theory, there is known to be covariance with respect to finite flat morphisms of schemes."
  ],
  [
    "On negative algebraic K-groups – Moritz Kerz – ICM2018",
    "Algebra Invited Lecture 2.2 On negative algebraic K-groups Moritz Kerz Abstract: We sketch a proof of Weibel's conjecture on the ..."
  ],
  [
    "Magdalena Kedziorek: Uniqueness of rational equivariant K-theory",
    "Abstract: In recent years a lot of attention has been given to the various levels of commutativity in equivariant homotopy theory."
  ],
  [
    "Dustin Clausen - The K-theory of adic spaces",
    "Morrow and Kerz-Saito-Tamme have each proposed a definition for the K-theory of rigid analytic varieties. They start with a ..."
  ],
  [
    "Konstantin Aleshkin &quot;Quantum K-theory LG/CY correspondence&quot;",
    ""
  ],
  [
    "If L/K is algebraic Extension and K/F is also algebraic Extension then L/F is algebraic Extension",
    "Abstract Algebra # M.Sc Maths Algebra # Field Extension # Theorem on finite field extension Theorem- If L/K is algebraic ..."
  ],
  [
    "Oliver Röndigs: The slices of Hermitian K-theory (Lecture 1)",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: Workshop \"Hermitian K-theory ..."
  ],
  [
    "MA524 Algebraic Number Theory Lecture 1",
    "MA524 Algebraic Number Theory Lecture 1 by Professor U.K. Anandavardhanan."
  ],
  [
    "Michael Atiyah - Twisted K theory and physics",
    "Professor Michael Atiyah's talk at Strings 2002 held at the Cavendish Laboratory, University of Cambridge, July15-20, 2002."
  ],
  [
    "Elden Elmanto - On the K-theory of universal homeomorphisms",
    "I will motivate the study of universal homeomorphism (uh)-invariant theories from the perspective of Grothendieck and the (mixed ..."
  ],
  [
    "CIMPA Floripa - Bivariant algebraic K-theory and Leavitt path algebras, surprise talk",
    "Plenary talk at the CIMPA Floripa School. Lecturer: Guillermo Cortiñas (Universidad de Buenos Aires – Argentina) Abstract: ..."
  ],
  [
    "Lecture 2: Motivation",
    "In this video, we give an important motivation for studying Topological Cyclic Homology, so called \"trace methods\". Feel free to ..."
  ],
  [
    "Ozgur Bayindir (Paris 13)- Algebraic K-theory of THH(F_p)",
    ""
  ],
  [
    "Andreas Thom: Algebraic vs topological K theory (Lecture 3)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: Applied and Computational Algebraic Topology."
  ],
  [
    "Algebraic number theory - an illustrated guide | Is 5 a prime number?",
    "This video is an introduction to Algebraic Number Theory, and a subfield of it called Iwasawa Theory. It describes how prime ..."
  ],
  [
    "Abstract Algebra-Group Theory",
    ""
  ],
  [
    "Jesse Wolfson - The Index Map in Algebraic K-Theory",
    ""
  ],
  [
    "Arthur Bartels: K-theory of group rings (Lecture 3)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. The Farrell-Jones ..."
  ],
  [
    "Yonatan Harpaz - New perspectives in hermitian K-theory III",
    "For questions and discussions of the lecture please go to our discussion forum: ..."
  ],
  [
    "🤔How to simplify algebraic expressions??? Algebraic Expressions/Short Tricks #shorts #shortsfeed",
    "How to simplify algebraic expressions??? Algebraic Expressions/Short Tricks/Algebraic Expressions Simplification ..."
  ],
  [
    "Math Talk!  Taylor Dupuy, professor of mathematics, (differential) algebraic geometry and IUTT.",
    "A conversation with Dr. Dupuy about differential algebraic geometry, the abc-conjecture and IUTT, the field with one element, ..."
  ],
  [
    "CAGP: Inna Zakharevich, &quot;Goncharov&#39;s conjectures: Scissors congruence, K-theory, and regulators&quot;",
    ""
  ],
  [
    "Karnaugh Map (K&#39; Map) - Part 1",
    "Digital Electronics: Karnaugh Map (K' Map) Part 1 Contribute: http://www.nesoacademy.org/donate Website ..."
  ],
  [
    "K theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/K-theory 00:01:50 1 Grothendieck completion ..."
  ],
  [
    "Yonatan Harpaz - New perspectives in hermitian K-theory II",
    "Warning: around 32:30 in the video, in the slide entitled \"Karoubi's conjecture\", a small mistake was made - in the third bulleted ..."
  ],
  [
    "Julia Semikina: Cut and paste invariants of manifolds via algebraic K-theory",
    "In this talk I will explain the K-theoretic construction due to Campbell and Zakharevich and its application that will allow us to ..."
  ],
  [
    "Minimal dynamical systems and groupoids with prescribed K-theory",
    "Speaker: Robin Deeley, University of Colorado Boulder Event: The 48th Canadian Operator Symposium ..."
  ],
  [
    "Thomas Nikolaus - On Grothendieck–Witt theory of the integers",
    "We introduce the Grothendieck–Witt groups of the integers and the Grothendieck–Witt spectrum of the integers. Then we explain ..."
  ],
  [
    "Topological K-theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Topological_K-theory 00:00:23 1 Definitions ..."
  ],
  [
    "Mod-01 Lec-01  What is Algebraic Geometry?",
    "Basic Algebraic Geometry : Varieties, Morphisms, Local Rings, Function Fields and Nonsingularity by Dr. T.E. Venkata Balaji ..."
  ],
  [
    "Complex K Theory",
    ""
  ],
  [
    "Arthur Bartels: K-theory of group rings (Lecture 4)",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. The Farrell-Jones ..."
  ],
  [
    "Floer K-theory and exotic Liouville manifolds - Tim Large",
    "Joint IAS/Princeton/Montreal/Paris/Tel-Aviv Symplectic Geometry Topic: Floer K-theory and exotic Liouville manifolds Speaker: ..."
  ],
  [
    "The gamma filtration on K-theory - Matthias Flach",
    "Speaker: Matthias Flach Affiliation: California Institute of Technology Date: June 24, 2021 Abstract: Recently Barwick, Glasman, ..."
  ],
  [
    "The gamma filtration on K-theory - Matthias Flach",
    "Speaker: Matthias Flach Affiliation: California Institute of Technology Date: June 24, 2021 Abstract: Recently Barwick, Glasman, ..."
  ],
  [
    "K Theory - Boundaries (VIP)",
    "Follow our official Spotify playlist ↪︎ http://bit.ly/NB3Spotify 🔥﻿ 💽 Download / Stream ↪︎ https://spoti.fi/2CD60sw Make sure to ..."
  ],
  [
    "K-Theory",
    "K-theory is, roughly speaking, the study of certain kinds of invariants of large matrices.It originated as the study of a ring generated ..."
  ],
  [
    "Huanhuan Li: Graded and filtered K-theory for Leavitt path algebras",
    "Talk by Huanhuan Li in the Global Noncommutative Geometry Seminar (Americas) on December 2, 2022, ..."
  ],
  [
    "Matthew Morrow - p-adic Milnor K-theory of p-adic rings",
    "Joint with Morten Lüders. The Milnor K-theory of a local ring may initially appear to be an ad-hoc invariant, but turns out to be ..."
  ],
  [
    "Nil groups in algebraic K theory (Daniel Juan Pineda)",
    "Nil groups in algebraic K theory Plática dada por Daniel Juan Pineda (Centro de Ciencias Matemáticas de la UNAM, Morelia) en ..."
  ],
  [
    "K Theory - Boundaries (Trap VIP)",
    "Stream - https://lowly.ffm.to/boundaries-vip 🔥 Trap Nation - our Spotify playlist - http://spoti.fi/237iVZi 🌊 Wave Nation - The future ..."
  ],
  [
    "K Theory - Boundaries (Official Audio)",
    "Boundaries” is the triumphant sonic return of the pedigreed triple threat artistic duo K Theory. The single is the embodiment of ..."
  ],
  [
    "Daniel Kasprowski: Shortening binary complexes and commutativity of K-theory with infinite products",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. Grayson gave a ..."
  ],
  [
    "eCHT, Andrew Blumberg, 11 November 2021",
    ""
  ],
  [
    "Field Definition (expanded) - Abstract Algebra",
    "The field is one of the key objects you will learn about in abstract algebra. Fields generalize the real numbers and complex ..."
  ],
  [
    "Ravi Vakil: Algebraic geometry and the ongoing unification of mathematics",
    "Abstract: I will try to share a glimpse of this strange unification of many different ideas. This talk is aimed at a general audience, ..."
  ],
  [
    "CIMPA Floripa - Bivariant algebraic K-theory and Leavitt path algebras, surprise talk",
    "Plenary talk at the CIMPA Floripa School. Lecturer: Guillermo Cortiñas (Universidad de Buenos Aires – Argentina) Abstract: ..."
  ],
  [
    "Marc Levine: Motivic Cohomology: past, present and future",
    "I will give a brief overview of the development of motivic cohomology, its parallels with singular cohomology and its place in ..."
  ],
  [
    "Oliver Röndigs: The slices of Hermitian K-theory (Lecture 2)",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: \"Workshop: Hermitian K-theory ..."
  ],
  [
    "A search for an algebraic equivalence analogue of motivic theories - Eric Friedlander",
    "Vladimir Voevodsky Memorial Conference Topic: A search for an algebraic equivalence analogue of motivic theories Speaker: ..."
  ],
  [
    "Amnon Neeman: Vanishing negative K-theory and bounded t-structures",
    "We will begin with a quick reminder of algebraic K-theory, and a few classical, vanishing results for negative K-theory. The talk will ..."
  ],
  [
    "Ideals in Ring Theory (Abstract Algebra)",
    "An ideal of a ring is the similar to a normal subgroup of a group. Using an ideal, you can partition a ring into cosets, and these ..."
  ],
  [
    "Markus Land: The 2-completion of L-theory for C*-algebras",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: Workshop \"Hermitian K-theory ..."
  ],
  [
    "Baptiste Calmes: Hermitian K-theory of quadratic functors and Karoubi periodicity",
    "Joint work with E. Dotto, Y. Harpaz, F. Hebestreit, M. Land, K. Moi, D. Nardin, T. Nikolaus and W. Steimle In order to classify ..."
  ],
  [
    "Anand Sawant - Central extensions of algebraic groups via cellular A^1-homology",
    "I will outline the computation of the cellular A^1-homology of a split, semisimple, simply connected algebraic group in low degrees ..."
  ],
  [
    "K-theory and actions on Euclidean retracts – Arthur Bartels – ICM2018",
    "Topology Invited Lecture 6.8 K-theory and actions on Euclidean retracts Arthur Bartels Abstract: This note surveys axiomatic ..."
  ],
  [
    "Introduction - Algebraic Combinatorics",
    "Introduction - Algebraic Combinatorics."
  ],
  [
    "Lennart Meier - Chromatic localizations of algebraic K-theory",
    ""
  ],
  [
    "Moritz Kerz - On the vanishing of negative K-theory",
    "Weibel's conjecture predicts that negative algebraic K-theory vanishes in degrees less than minus the dimension of the ring."
  ],
  [
    "Urs Schreiber - TED K-theory of Cohomotopy moduli spaces and Anyonic Topological Order",
    "This talk was part of the Thematic Programme on \"Higher Structures and Field Theory\" held at the ESI August 1 to 26, 2022."
  ],
  [
    "K Theory &amp; Representation Theory Summer School: Hochs  L1 video",
    ""
  ],
  [
    "Algebraic structure in Discrete Mathematics",
    "Full Course of Discrete Mathematics: https://www.youtube.com/playlist?list=PLxCzCOWd7aiH2wwES9vPWsEL6ipTaUSl3 ..."
  ],
  [
    "Commutative algebra 4 (Invariant theory)",
    "This lecture is part of an online course on commutative algebra, following the book \"Commutative algebra with a view toward ..."
  ],
  [
    "K-Theory X Wizard - Turn It [Bass Boosted]",
    "K-THEORY X WIZARD - TURN IT [BASS BOOSTED] Subscribe: ..."
  ],
  [
    "algebra trick for ssc | trick to solve algebra questions | algebra k trick | algebra for railway",
    "algebra trick."
  ],
  [
    "K Theory - When Im Gone (ROYALTY FREE)",
    "K Theory - When Im Gone (ROYALTY FREE) 💰 broke music - for creators, by creators Download - https://s.disco.ac/vjtdumdipuck ..."
  ],
  [
    "Ice Spice - Munch (Feelin’ U) (K Theory Remix)",
    "Trap Nation - our Spotify playlist - http://spoti.fi/237iVZi 🌊 Wave Nation - The future is here - https://trapnation.ffm.to/wavenation ..."
  ],
  [
    "Petr Pushkar/ Baxter Operator and the Transfer Matrix from Enumerative K-theory",
    "Skoltech Summer School on Mathematical Physics. July 1-12 2019. https://crei.skoltech.ru/cas/calendar/conf190701/"
  ],
  [
    "K Theory - Highway Dreaming ft. Portia Nova",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/highway Click \"Show more\" to see important details! ♫ Support Trap Nation ..."
  ],
  [
    "Algebra (बीजगणित) का गुणनखंड और वर्गमूल वाला प्रश्न - Math Tricks || KTC Classes By Kapildeo Sir",
    "rly ntpc & group - D/SSC/Bank & other compt. Exams. ---------KTC Classes By Kapildeo Sir (Kd. Sir)-------------- 🔷 कोई भी ..."
  ],
  [
    "Christian Dahlhausen: Improved Milnor K-theory of valuation rings of local fields",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Algebraic Graph Theory:  Efficient (j,k)-Domination",
    "Talk by Brendan Rooney. A function f from V(G) to {0,...,j} is an efficient (j,k)-dominating function on G if for all vertices v, the sum ..."
  ],
  [
    "Real K-theories",
    "Max Karoubi, Université Paris Diderot September 28th, 2021 Cyclic Cohomology at 40: achievements and future prospects ..."
  ],
  [
    "K Theory 1- Various Interpretations; a Talk Given by Me",
    "In this talk, I delve a bit deeper into topologcial K theory, looking at a homotopical point of view (and computing homotopy groups ..."
  ],
  [
    "Math ncert 4.6 k theory (hindi medium)",
    ""
  ],
  [
    "Charles Weibel: K-theory of line bundles and smooth varieties",
    "The lecture was held within the framework of the Hausdorff Trimester Program: K-Theory and Related Fields. We give a ..."
  ],
  [
    "Algebraic Extension | Transcendental Extension  | Field theory",
    "Field Theory (Playlist) :- https://bit.ly/3v9a5xV Time Stamps 0:00-0:32 Inro 0:33-3:33 Algebraic Element 3:33-6:31 Algebraic ..."
  ],
  [
    "Maru Sarazola (Cornell University)- Cotorsion pairs and a K-theory localization theorem",
    ""
  ],
  [
    "K Theory &amp; Jarvis - Close My Eyes 2.0",
    "Download Link ♫ ➥http://bit.ly/ELY023 Click \"Show more\" to see important details! ♫ Support Trap Nation ♫ ♢https://nations.io ..."
  ],
  [
    "K Theory - Trouble [Official Music Video]",
    "Download Link ♫ ➥https://www.hive.co/l/q Full Song - https://soundcloud.com/ktheory/trouble Click \"Show more\" to see important ..."
  ],
  [
    "Guoliang Yu: Quantitative operator K-theory and its applications",
    "Abstract: In this lecture, I will give an introduction to quantitative operator K-theory and apply it to compute K-theory of operator ..."
  ],
  [
    "Hermann Schulz-Baldes: Computational K-theory via the spectral localizer.",
    "Talk by Hermann Schulz-Baldes in Global Noncommutative Geometry Seminar (Europe) ..."
  ],
  [
    "Non-trivial Hamiltonian fibrations via K-theory quantization - Egor Shelukhin",
    "Egor Shelukhin Member, School of Mathematics October 2, 2015 ..."
  ],
  [
    "p-adic algebraic geometry: Overview - Bhargav Bhatt",
    "Stony Brook Mathematics Simons Lecture Series Bhargav Bhatt April 12, 2021 The last decade has witnessed tremendous ..."
  ],
  [
    "K Theory - Pyramids feat. Katie Sky",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/pyramids-ft-katie-sky Add our Snapchat : trapnation ♫ Support Trap Nation ..."
  ],
  [
    "Algebraic Expressions - Chapter 12 - Introduction - NCERT Class 7th Maths Solutions",
    "Algebraic Expressions - Solution for Class 7th mathematics, NCERT solutions for Class 7th Maths. Get Textbook solutions for ..."
  ],
  [
    "Gaussian Integers | Algebraic Number Theory Part 2 | Mathematise Yourself",
    "The Topics that are covered in this video related to Gaussian Integers (unity,norm,associates of gaussian integers,primes in ..."
  ],
  [
    "Theory of Equation | Transformation Of Equation  | Roots Multiplied By K",
    "Comment Below If This Video Helped You 💯 Like 👍 & Share With Your Classmates - ALL THE BEST 🔥 Do Visit My Second ..."
  ],
  [
    "algebraic geometry 36 The Atiyah flop",
    "This lecture is part of an online algebraic geometry course, based on chapter I of \"Algebraic geometry\" by Hartshorne. It describes ..."
  ],
  [
    "Dylan Wilson - Lichtenbaum-Quillen phenomena in chromatic homotopy theory",
    "We will discuss joint work with Jeremy Hahn proving a version of the Lichtenbaum-Quillen conjecture for K(BP(n)). This gives the ..."
  ],
  [
    "On the motivic cohomology of schemes - Elden Elmanto",
    "Joint Columbia-CUNY-NYU Number Theory Seminar Topic: On the motivic cohomology of schemes Speaker: Elden Elmanto ..."
  ],
  [
    "Math Talk! Nicole Kitt, PhD student, Representation Theory/Algebraic Geometry",
    "Talking about representation theory, algebraic geometry, and the grad student life with Nicole Kitt. PBS Spacetime: ..."
  ],
  [
    "Turn It",
    "Provided to YouTube by Ingrooves Turn It · K Theory Electronic Hiphop ℗ Buygore Released on: 2016-05-13 Writer: K Theory ..."
  ],
  [
    "A field that is a Finitely Generated k-algebra must be a finite dim k-vector space",
    ""
  ],
  [
    "eCHT, Christy Hazel, 25 February 2021",
    ""
  ],
  [
    "p-adic algebraic geometry: Prismatic cohomology  - Bhargav Bhatt",
    "Stony Brook Mathematics Simons Lecture Series Bhargav Bhatt April 13, 2021 The last decade has witnessed tremendous ..."
  ],
  [
    "Joachim Cuntz, Algebraic Approach to KK-tehory",
    ""
  ],
  [
    "K Theory x Wizard - Turn It",
    "Download Link ♫ ➥https://soundcloud.com/buygore/k-theory-x-wizard-turn-it Follow our IG: http://instagram.com/trapnation ..."
  ],
  [
    "K Theory - Worst Behavior Feat. Malcolm Anthony",
    "Download Link ♫ ➥Unavailable Click \"Show more\" to see more links & important details! ♫ Support Rap Nation ..."
  ],
  [
    "Lecture 4 - Integral Closure of a field in algebraic number theory,Q(k) is integrally Closed",
    "Dear All, this video covers the topic \"Integral Closure of a field & its properties\" in algebraic number theory and is helpful for ..."
  ],
  [
    "The mod (p,v1) motivic filtration on the topological cyclic homology of topological K-theory",
    "Jeremy Hahn (Massachusetts Institute of Technology) Conference on Homotopy Theory with Applications to Arithmetic and ..."
  ],
  [
    "Charles Weibel",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Algebraic Geometry #2: Polynomial Rings",
    "In this video, we introduce the concept of a polynomial ring (its definition, and the notation used). This video doesn't go into some ..."
  ],
  [
    "Shuji Saito: Rigid analytic K theory",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Rae Sremmurd - No Type (K Theory Remix)",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/notype Click \"Show more\" to more important details! ♫ Support Trap Nation ..."
  ],
  [
    "Eigenvectors and eigenvalues | Chapter 14, Essence of linear algebra",
    "A visual understanding of eigenvectors, eigenvalues, and the usefulness of an eigenbasis. Help fund future projects: ..."
  ],
  [
    "Group theory II  Binary operation, Algebraic structure &amp; Abelian Group in hindi",
    "This video is useful for students of BTech/BE/Engineering/ BSc/MSc Mathematics students. Also for students preparing IIT-JAM, ..."
  ],
  [
    "Bruno Kahn Bruno -  A rank spectral sequence for algebraic K-theory",
    "Abstract: I will describe a spectral sequence converging to the homology of Quillen's Q-construction on the category of coherent ..."
  ],
  [
    "Relations and functions | Functions and their graphs | Algebra II | Khan Academy",
    "Courses on Khan Academy are always 100% free. Start practicing—and saving your progress—now: ..."
  ],
  [
    "Tom Bachmann - Cellular motivic invariants of Z[1/2]",
    "A cellular motivic invariant is a special type of functor from the category of commutative rings (or the opposite of schemes, say) to ..."
  ],
  [
    "Diagonalising matrices, vector bundles, and K-theory of algebraic singularities II",
    "2nd Westlake Online Math Forum Title: Diagonalising matrices, vector bundles, and K-theory of algebraic singularities Speaker: ..."
  ],
  [
    "Kate Ponto - Traces from K-theory and zeta functions",
    ""
  ],
  [
    "Topological Hochschild homology and topological cyclic homology - from classical to modern  I",
    "Kathryn Hess Topological Hochschild homology and topological cyclic homology are important and much studied approximations ..."
  ],
  [
    "Cary Malkiewich: A Farrell-Jones isomorphism for scissors congruence K-theory",
    "I will describe a new trace map from scissors congruence K-theory to group homology. It turns out that a refinement of this map ..."
  ],
  [
    "Kernel K  is a normal subgroup of G# Algebraic Structures# TAM5A",
    ""
  ],
  [
    "Allen Yuan - Examples of chromatic redshift",
    "One form of the Ausoni-Rognes chromatic redshift philosophy is that algebraic K-theory raises the chromatic complexity of a ring ..."
  ],
  [
    "Tom Bachmann: The generalized slices of hermitian K-theory and applications",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Mikala Ørsnes Jansen - The reductive Borel–Serre compactification as a model for the K-theory space",
    "The reductive Borel–Serre compactification, introduced by Zucker in 1982, is a stratified space which is well suited for the study of ..."
  ],
  [
    "Semi group &amp; Monoid | Algebraic System (Part 1) KTU S3 DCS",
    "Algebraic System (Part 1) Semi group Monoid Homomorphism CS 201 Discrete Computational Structures (DCS) 2nd Module S3 ..."
  ],
  [
    "Soumen Sarkar (Indian Institute of Technology Madras) / Equivariant K-theory of toric orbifolds",
    "2018 KAIST 세미나 2018-06-05."
  ],
  [
    "Richard Thomas - Square root Euler classes and counting sheaves on Calabi-Yau 4-folds",
    "I will explain a nice characteristic class of SO(2n,C) bundles in both Chow cohomology and K-theory, and how to localise it to the ..."
  ],
  [
    "Homotopy theory and algebraic vector bundles",
    "Mike Hopkins (University of Harvard, USA) Homotopy theory and algebraic vector bundles Abstract: This talk will describe joint ..."
  ],
  [
    "Stacks and equivariant cohomology - Adeel Khan",
    "Speaker(s) Adeel Khan Institute of Mathematics, Academia Sinica, Taipei, Taiwan Date 14 June 2022 – 11:30 to 12:30 Venue INI ..."
  ],
  [
    "Euler Phi function # Euler&#39;s theorem # Algebraic Structures # TAM5A",
    ""
  ],
  [
    "K Theory - Watch Me Kill It",
    "If you like my intro/background go check out the artist, DataExe @http://www.youtube.com/user/DataExe Don't forget to hit dat like ..."
  ],
  [
    "Toni Annala - Derived algebraic cobordism — towards bivariant Conner–Floyd theorem",
    "The purpose of this talk is to introduce derived algebraic cobordism, its basic properties, and to list several open problems related ..."
  ],
  [
    "Nicolas Perrin - Quantum K-theory of some homogeneous spaces",
    "Quantum K-theory is as quantum cohomology a generalisation of the classical coho-mology algebra of a variety X. In this talk I will ..."
  ],
  [
    "Video-03| Algebraic Equations|",
    "Theory of Equations and Abstract Algebra |Fifth Semester BSc Mathematics| Module 1| Problems| Algebraic Equations |Roots of ..."
  ],
  [
    "Algebraic Quantum Field Theory | Talk by David E. Evans",
    "Operator Algebras: Impact of AQFT on Subfactors and K-theory Slides used in the ..."
  ],
  [
    "Bjørn Dundas: Consequences for K theory",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: Workshop \"Hermitian K-theory ..."
  ],
  [
    "Group Theory | Cosets | Lagrange Theorem Group Theory | Abstract Algebra",
    "Comment Below If This Video Helped You 💯 Like 👍 & Share With Your Classmates - ALL THE BEST 🔥 Do Visit My Second ..."
  ],
  [
    "Simple Quadratic Field And Euclidean Algorithm |Algebraic Number Theory Part 13 Mathematise Yourself",
    "Simple Quadratic Field And Euclidean Algorithm and Euclidean field for BA/BSc/MA/MSc Mathematics Algebraic Number Theory ..."
  ],
  [
    "Fundamental Theorem Of Arithmetic In Q[i] | Algebraic Number Theory Part 4 | Mathematise Yourself",
    "Fundamental Theorem Of Arithmetic In Q[i] and Basics And Definitions of Q[w] (norm, unity, associates, primes in Q[w] ) for ..."
  ],
  [
    "K-stability and algebraic geometry - Yuji Odaka",
    "Stony Brook University 1st Mini-School in Geometry K-Stability in algebraic geometry Yuji Odaka (Imperial College and Kyoto ..."
  ],
  [
    "K-stability and algebraic geometry - Yuji Odaka",
    "Stony Brook University 1st Mini-School in Geometry K-Stability in algebraic geometry Yuji Odaka (Imperial College and Kyoto ..."
  ],
  [
    "What is a function? | Functions and their graphs | Algebra II | Khan Academy",
    "Courses on Khan Academy are always 100% free. Start practicing—and saving your progress—now: ..."
  ],
  [
    "Diagonalising matrices, vector bundles, and K-theory of algebraic singularities I",
    "2nd Westlake Online Math Forum Title: Diagonalising matrices, vector bundles, and K-theory of algebraic singularities Speaker: ..."
  ],
  [
    "Õmb Jãy730 Algebra K teacher (Diss)",
    ""
  ],
  [
    "Algebraic Structures - UG TRB  &amp; TNPSC COMBINED STATISTICAL EXAM",
    "UG TRB & TNPSC STATISTICAL EXAM."
  ],
  [
    "Algebraic theories",
    "This is an introductory talk on algebraic theories, which are a categorical way of doing universal algebra. I discuss the history of ..."
  ],
  [
    "Reuben Learns: Nikolaus-Scholze &quot;On Topological Cyclic Homology&quot; 1",
    "Hi all! Sorry for the long silence since my last upload. In this series, I'm reading through important papers and learning some math ..."
  ],
  [
    "Video-03| Algebraic Equations|",
    "Theory of Equations and Abstract Algebra |Fifth Semester BSc Mathematics| Module 1| Problems| Algebraic Equations |Roots of ..."
  ],
  [
    "Lana Del Rey - Serial Killer (K Theory Remix)",
    "Check out the makers of this remix! https://soundcloud.com/ktheory http://www.facebook.com/ktheory ..."
  ],
  [
    "Wiz Khalifa - Black And Yellow (K Theory Remix)",
    "Subscribe here: http://trapcity.tv/subscribe Buy the original: http://trapcity.tv/GB85k ➥ Become a fan of Trap City: ..."
  ],
  [
    "On finite presentation for the tame fundamental group - Vasudevan Srinivas",
    "Speaker(s) Vasudevan Srinivas Tata Institute of Fundamental Research Date 17 June 2022 – 11:30 to 12:30 Venue INI Seminar ..."
  ],
  [
    "Michael Atiyah - More on index theorem and K-theory (48/93)",
    "To listen to more of Michael Atiyah's stories, go to the playlist: ..."
  ],
  [
    "BRICS 2021 — Venue SH | Invited Talk by Prof. Amalendu Krishna",
    "Title: Algebraic K-theory, cycles and class field theory. Speaker: Amalendu Krishna, IISc Bangalore. Abstract: In this talk, I shall ..."
  ],
  [
    "Maria Yakerson | Universality of hermitian K-theory (in Russian)",
    "Seminar on A1-topology, motives and K-theory, November 26, 2020 Maria Yakerson (ETH Zürich) Universality of hermitian ..."
  ],
  [
    "Group Theory | Cosets | Lagrange Theorem Group Theory | Abstract Algebra",
    "Comment Below If This Video Helped You 💯 Like 👍 & Share With Your Classmates - ALL THE BEST 🔥 Do Visit My Second ..."
  ],
  [
    "kon king h",
    ""
  ],
  [
    "Niall Taggart - From K-theory to calculus",
    "Talk at the UGC Seminar on 19th October 2021. Niall's website: https://sites.google.com/view/nialltaggartmath/home Website of ..."
  ],
  [
    "Representation theory of reductive algebraic groups-techniques and applications (Donna Testerman) 1",
    "The lectures will serve as an introduction to the representation theory of reductive linear algebraic groups, with the goal of ..."
  ],
  [
    "Federico Binda - GAGA type conjecture for the Brauer group via derived geometry",
    "In Brauer III, Grothendieck considered the problem of comparing the cohomological Brauer group of a scheme X, proper and flat ..."
  ],
  [
    "Frank Calegari: 30 years of modularity: number theory since the proof of Fermat&#39;s Last Theorem",
    ""
  ],
  [
    "CLASSICAL ALGEBRA AND THEORY OF NUMBERS",
    "B.Sc, 2ND YEAR SUBJECT CLASSICAL ALGEBRA."
  ],
  [
    "Henry Liu. Multiplicative vertex algebras and wall-crossing in equivariant K-theory, part II",
    "Informal String-Math Seminar, UC Berkeley, Sept 21, 2022. Henry Liu (University of Oxford). Multiplicative vertex algebras and ..."
  ],
  [
    "Algebra solution | Important questions with tricky solution #gyanyog #algebra",
    "Please like, share and subscribe GYANYOG https://youtube.com/channel/UCrRi97guluuCYEfCcGcbr1A VEDICMATHS MATHS ..."
  ],
  [
    "Tobias Dyckerhoff - S-constructions, Auslander algebras, and wrapped Floer theory",
    "We will explain that, beyond their purpose for defining algebraic K-theory, Waldhausen's S-construction and higher variants have ..."
  ],
  [
    "Algebra theory- I (all formula identities)",
    ""
  ],
  [
    "Australian Postgraduate Algebra Colloquium",
    ""
  ],
  [
    "A Course in Homotopical Topology 1 - Overview",
    "In this video, I give an overview of the lecture series on algebraic topology and homotopy theory that I will be producing over the ..."
  ],
  [
    "Algebra Important Factorial Question // Advance Math #maths #advancemath #algebra #factorial #shorts",
    "Algebra Important Factorial Question // Advance Math Your Queries :- algebra calculator algebra 2 algebra 1 algebraic expression ..."
  ],
  [
    "Flo Rida - GDFR (K Theory Remix)",
    "Download Link ♫ ➥http://apple.co/22FLpJs Click \"Show more\" to see important details! 🎶 More from K Theory 🎶 ○\"Eiffel 65 ..."
  ],
  [
    "K-theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Algebra Part -2 for ssc CGL,chsl,mts,railway and all competative exams",
    "Algebra Part -1 for ssc CGL,chsl,mts,railway and all competative exams algebraic identities algebraic expressions algebraic ..."
  ],
  [
    "Mattia Talpo: Kummer-étale additive invariants of log schemes",
    "Hagihara and Nizioł proved decomposition results for the Kummer-étale (and -flat) algebraic K-theory of some class of nice log ..."
  ],
  [
    "K-theory, motivic cohomology, Chow groups I - Charles Weibel",
    "Date 6 June 2022 – 10:15 to 11:15 Venue INI Seminar Room 2 Session Title K-theory, motivic cohomology, Chow groups I Event ..."
  ],
  [
    "Quadratic Equations 01 | Introduction | Class 11 | JEE | Pace Series",
    "Watch Ad Free Videos ( Completely FREE ) on Physicswallah App(https://bit.ly/2SHIPW6). Download the App from Google Play ..."
  ],
  [
    "Guoliang Yu: Dimension, complexity and K theory",
    "The lecture was held within the framework of Follow-up Workshop TP Rigidity. 29.4.2015."
  ],
  [
    "ALGEBRA (बीजगणित) Unique tricks in hindi || Put Value and Get Answer|| Part-1 SSC-CGL, CHSL",
    "ALGEBRA (बीजगणित) Unique Tricks || Put Value and Get Answer|| Part-1 SSC-CGL, CHSL Unique Tricks Just Put Value ..."
  ],
  [
    "Algebra की नया सवाल नई ट्रिक के साथ चलो देखते हैँ क्या Algebra Concept Easy",
    "algebraclass10 #algebraicexpressions #algebratricks #algebraformula #algebra_trick_ntpc_group_d ..."
  ],
  [
    "Thomas Nikolaus - Polynomial functors and K-theory",
    ""
  ],
  [
    "Strong A^1-invariance of A^1-connected components of a reductive algebraic group - Anand Sawant",
    "Speaker(s) Anand Sawant Tata Institute of Fundamental Research Date 16 June 2022 – 10:00 to 11:00 Venue INI Seminar Room ..."
  ],
  [
    "Ulrich Bunke: Coarse homotopy theory and K-theory",
    "Talke by Ulrich Bundle in Global Noncommutative Geometry Seminar (Americas) on September 30, 2022."
  ],
  [
    "Motivic Verona by Peter Arndt 1/6: A picture of homotopy theory and localization of categories",
    "Minicourse by Peter Arndt (University of Düsseldorf) on abstract and motivic homotopy theory at the University of Verona Lecture ..."
  ],
  [
    "Wild Wild Horses - Ordinary Life (K Theory Remix)",
    "off Royalty Free Footage ♫ ➥http://www.videoblocks.com/x/trapnation_vbbf49_1115 Add our Snapchat: trapnation ♫ Download ..."
  ],
  [
    "ALGEBRAIC STRUCTURES -MODULE 5",
    ""
  ],
  [
    "eCHT, Piotr Pstragowski, 25 March 2021",
    ""
  ],
  [
    "Ulrich Pennig: &quot;Fell bundles, Dixmier-Douady theory and higher twists&quot;",
    "Actions of Tensor Categories on C*-algebras 2021 \"Fell bundles, Dixmier-Douady theory and higher twists\" Ulrich Pennig - Cardiff ..."
  ],
  [
    "Amalendu Krishna - Chow groups and Euler class groups of affine varieties",
    "In this talk, I shall present two results on the Chow group of 0-cycles on affine schemes over algebraically closed fields and give ..."
  ],
  [
    "Motivic Euler characteristics and the Motivic Segal-Becker Theorem - Roy Joshua",
    "Speaker(s) Roy Joshua Ohio State University Date 15 June 2022 – 10:00 to 11:00 Venue INI Seminar Room 1 Session Title ..."
  ],
  [
    "60. Geordie Williamson: Spectra in representation theory - LieJor 17-Jun-2021",
    "Geordie Williamson (University of Sydney, Australia) Spectra in representation theory 17-Jun-2021 LieJor Online Algebra ..."
  ],
  [
    "Projective bundle formula for derived cobordism - Toni Annala",
    "Speaker(s) Toni Annala University of British Columbia Date 16 June 2022 – 11:30 to 12:30 Venue INI Seminar Room 1 Session ..."
  ],
  [
    "What is Algebraic Formulas ?| How to remember easily ? (In Hindi)",
    "In this video I will discuss What is Algebric formula., How to come this type formula and How to remember easily this type formula."
  ],
  [
    "GeNoCAS 2022: Kun Wang",
    "The Farrell-Jones and Baum-Connes conjecture in K-Theory In this talk, I will discuss the intimate Farrell-Jones conjecture in ..."
  ],
  [
    "K-Theory §1.1. Group and its actions",
    "K-Theoryの一人輪講をしていきます. 第1回は, K-Theoryに含まれる概念の定義に必要となる群作用 (Group Action) について解説し ..."
  ],
  [
    "What is Algebraic Formulas ?| How to remember easily ? (In Hindi)",
    "In this video I will discuss What is Algebric formula., How to come this type formula and How to remember easily this type formula."
  ],
  [
    "Algebra Part -4 for ssc CGL,chsl,mts,railway and all competative exams",
    "Algebra Part -4 for ssc CGL,chsl,mts,railway and all competative exams algebraic identities algebraic expressions algebraic ..."
  ],
  [
    "Lecture 1- Integral Closure of a field in algebraic number theory, post-graduation Mathematics",
    "Dear All, this video covers the topic \"Integeal Closure of a field and its properties\" in algebraic number theory and is helpful for ..."
  ],
  [
    "Thomas Nikolaus: Frobenius homomorphisms in higher algebra",
    ""
  ],
  [
    "Claire Voisin | K-theory and characteristic classes in topology and complex geometry",
    "5/25/2021 Mathematical Science Literature Lecture Speaker: Claire Voisin (Collège de France) Title: K-theory and characteristic ..."
  ],
  [
    "Lil&#39; Wayne - A Milli (K Theory Remix)",
    "Download the Original: http://apple.co/25nnxwB Click \"Show more\" to see important details! 🎶 More from K Theory 🎶 ○\"Eiffel 65 ..."
  ],
  [
    "An introduction to spectra",
    "Talk by Matt Booth (Universiteit Antwerpen), at the Antwerp Algebra Colloquium on May 31, 2021. Spectra are objects from ..."
  ],
  [
    "Index Theory I, May 8, 2018",
    "First of four lectures by Stephan Stolz on \"Index Theory\" in the Notre Dame Geometry and Topology Survey series. Abstract: In this ..."
  ],
  [
    "Melanie Martinez - Pity Party (K Theory Remix)",
    "Download Link ♫ iTunes: http://smarturl.it/PityPartyRemixes Spotify: http://smarturl.it/S_PityPartyRemixes Google Play: ..."
  ],
  [
    "Cayley&#39;s theorem # Algebraic Structures # TAM5A",
    "Reference book: Topic in Algebra."
  ],
  [
    "50 Cent - In Da Club (K Theory Remix)",
    "TRACK SUBMISSION ⚡️ qualityoutrecords@gmail.com 🔴 K Theory 🔴 🔸https://soundcloud.com/ktheoryofficial ..."
  ],
  [
    "Algebraic geometry 41:  Completions",
    "This lecture is part of an online algebraic geometry course, based on chapter I of \"Algebraic geometry\" by Hartshorne. It reviews ..."
  ],
  [
    "Vesna Stojanoska - Duals of higher real K-theory spectra",
    "Vesna Stojanoska (University of Illinois Urbana-Champaign): Duals of higher real K-theory spectra Homotopy Theory in the ..."
  ],
  [
    "Cayley&#39;s theorem | Fifth sem BSC mathematics | Abstract Algebra | Calicut University",
    "Cayley's theorem is a part of group theory and it will be helpful for all BSC and MSC mathematics students."
  ],
  [
    "Some aspects of the algebraic theory of quadratic forms (Raman Parimala) 1-4",
    "Notes : http://swc.math.arizona.edu/aws/2009/09ParimalaNotes.pdf."
  ],
  [
    "Naughty Boy - La la la ft. Sam Smith (Official Video)",
    "Check out the official music video for \"La la la\" by Naughty Boy ft. Sam Smith From Naughty Boy's debut album \"Hotel Cabana\" ..."
  ],
  [
    "Introduction to limits | Limits | Differential Calculus | Khan Academy",
    "Courses on Khan Academy are always 100% free. Start practicing—and saving your progress—now: ..."
  ],
  [
    "Algebraic Proof that C(n,r)*C(r, k)=C(n, k)*C(n-r, r-k)",
    "Exercise 22b from section 6.4 in text."
  ],
  [
    "Paul Arne Østvær: The motivic Hopf map and the homotopy limit problem for hermitian K theory",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: \"Workshop: Hermitian K-theory ..."
  ],
  [
    "Lect. 9, norm of Different I.e. N(D) = |d_k|, Algebraic Number Theory, M.Sc sem 4.",
    ""
  ],
  [
    "eCHT mini-course part 2, Oliver Röndigs, 14 November 2019",
    ""
  ],
  [
    "Lect 2(Algebraic Coding Theory)",
    ""
  ],
  [
    "Rich Homie Quan - Flex (K Theory Remix)",
    "PREMIERE: Rich Homie Quan - Flex (K Theory Remix) Subscribe here: http://trapcity.tv/subscribe ➥ Become a fan of Trap City: ..."
  ],
  [
    "Naughty Boy - La La La ft. Sam Smith (K Theory Remix)",
    "Download the Original: http://apple.co/1T6OdwK Please show feedback by liking or disliking the video! 🎶 More from K Theory ..."
  ],
  [
    "Algebraic and Transcendental Elements; Finite Extensions - Field Theory - Lecture 01",
    "In this video we introduce the notion of algebraic and transcendental. We then introduce a notion of \"finite extension\" which will ..."
  ],
  [
    "Some aspects of the algebraic theory of quadratic forms (Raman Parimala) 2-4",
    ""
  ],
  [
    "John Berman Research Summary 2020",
    "Abstract: Deninger proposed using a Weil cohomology theory in Arakelov geometry to prove the Riemann Hypothesis. I describe ..."
  ],
  [
    "Michael Hopkins: Bernoulli numbers, homotopy groups, and Milnor",
    "Abstract: In his address at the 1958 International Congress of Mathematicians Milnor described his joint work with Kervaire, ..."
  ],
  [
    "Algebraic number theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Algebraic_number_theory 00:00:42 1 History of ..."
  ],
  [
    "Algebraic Groups -- Lecture 3",
    "First properties of linear algebraic groups. Jordan decomposition. (Apologies for the late start of the recording.)"
  ],
  [
    "Fetty Wap - Trap Queen (K Theory Remix)",
    "Download the Original ♫ ➥http://apple.co/1MmuyHp Click \"Show more\" to see important details! 🎶 More from K Theory ..."
  ],
  [
    "KAH programme: interview with organisers R de Jeu, R Joshua, JD Lewis, C Doran and M Levine",
    "\"K-theory, algebraic cycles and motivic homotopy theory\" organisers Rob de Jeu (Vrije Universiteit Amsterdam), Roy Joshua (Ohio ..."
  ],
  [
    "The slices of KGL over arbitrary bases - Tom Bachmann",
    "Speaker(s) Tom Bachmann Ludwig-Maximilians-Universität München Date 15 June 2022 – 11:30 to 12:30 Venue INI Seminar ..."
  ],
  [
    "K Theory &amp; Ananaki - Crystal Skull 2.0",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/skull20 Add our Snapchat : trapnation ♫ Support Trap Nation ..."
  ],
  [
    "Arpon Raksit - Hochschild homology and the derived de Rham complex revisited",
    "I will discuss ”filtered circle actions” and ”homotopy-coherent cochain complexes”, and how these notions provide a conceptual ..."
  ],
  [
    "Mechanism of stomatal opening and closing || Sugar Concentration and K+ ion theory || 10th ICSE 2020",
    "Video explains the open mechanism of opening and closing of stomata which is explained by : - sugar concentration theory ..."
  ],
  [
    "Algebraic geometry 42: Resultants",
    "This lecture is part of an online algebraic geometry course, based on chapter I of \"Algebraic geometry\" by Hartshorne. It introduces ..."
  ],
  [
    "Algebraic Graph Theory: Optimizing eigenvalue bounds for k-independence and k-chromatic number",
    "Talk by Sjanne Zeijlemaker. The kth power of a graph G is the graph in which two distinct vertices are adjacent if their distance in ..."
  ],
  [
    "Theory of Equations,Exercise-5A, Solution of S K Mapa Exercise",
    "In this series I have solved some very tough and tricky problems of S.K.Mapa Classical Algebra, Chapter:Theory of Equations ..."
  ],
  [
    "Gabriela Guzman - Rational homotopy theory in A¹-algebraic topology",
    "Rational homotopy theory is a simplification of homotopy theory. Formally, the class of weak equivalences is increased by the ..."
  ],
  [
    "Detecting non-trivial elements in the spaces of Legendrian knots via Algebraic...- Yakov Eliashberg",
    "Joint IAS/Princeton/Montreal/Paris/Tel-Aviv Symplectic Geometry Zoominar Topic: Detecting non-trivial elements in the spaces of ..."
  ],
  [
    "Primes in Quadratic Field | Algebraic Number Theory Part 11 | Mathematise Yourself",
    "Primes in Quadratic Field Algebraic Number Theory Part 11 for BA/BSc/MA/MSc Mathematics Mathematise Yourself UPI ..."
  ],
  [
    "K+ Malate theory || Photosynthesis in plants || NEET || CBSE BIOLOGY",
    "Openingof_stomata#VinayBiology."
  ],
  [
    "Algebraic Quantum Field Theory | Talk by Stephen J. Summers",
    "Yet More Ado About Nothing: The Remarkable Relativistic Vacuum State Slides used in the ..."
  ],
  [
    "Some aspects of the algebraic theory of quadratic forms (Raman Parimala) 3-4",
    ""
  ],
  [
    "Applications of enumerative algebraic geometry (Lecture 2 - Part 2) Mateusz Michalek - REACT",
    "Mateusz Michalek (University of Konstanz) Applications of enumerative algebraic geometry - complete quadrics in statistics ..."
  ],
  [
    "Ryan Grady -  Persistence over the Circle",
    "38th Annual Geometric Topology Workshop (Online), June 15-17, 2021 Ryan Grady, Montana State University Title: Persistence ..."
  ],
  [
    "Ningchuan Zhang Research Summary 2022",
    "Abstract: A major theme in my research is the connections between algebraic K-theory and L-functions. In this video, I will first give ..."
  ],
  [
    "Applications of enumerative algebraic geometry (Lecture 2 - Part 2) Mateusz Michalek - REACT",
    "Mateusz Michalek (University of Konstanz) Applications of enumerative algebraic geometry - complete quadrics in statistics ..."
  ],
  [
    "Ryan Grady -  Persistence over the Circle",
    "38th Annual Geometric Topology Workshop (Online), June 15-17, 2021 Ryan Grady, Montana State University Title: Persistence ..."
  ],
  [
    "Lecture 49 : Algebraic Structures (Contd.)",
    "Group theory."
  ],
  [
    "Ningchuan Zhang Research Summary 2022",
    "Abstract: A major theme in my research is the connections between algebraic K-theory and L-functions. In this video, I will first give ..."
  ],
  [
    "Jintao Deng: The Novikov conjecture and group extensions",
    "Talk by Shintaro Nishikawa in Global Noncommutative Geometry Seminar (Americas) ..."
  ],
  [
    "Recent developments in non-commutative Iwasawa theory I - David Burns",
    "David Burns March 25, 2011 For more videos, visit http://video.ias.edu."
  ],
  [
    "Algebraic Groups -- Lecture 13",
    "Vistas toward geometric representation theory."
  ],
  [
    "big numerical question solve in 2 sec by algebraic expressions 😁 #short #mathtrick",
    ""
  ],
  [
    "Chirantan Chowdhury | Motivic homotopy theory of algebraic stacks",
    "Seminar on A1-topology, motives and K-theory, March 11, 2022 Chirantan Chowdhury (University of Duisburg-Essen) Motivic ..."
  ],
  [
    "Learn how to solve tricky Algebra questions || solve xyz || math algebra #gyanyog",
    "Please like, share and subscribe GYANYOG https://youtube.com/channel/UCrRi97guluuCYEfCcGcbr1A VEDICMATHS MATHS ..."
  ],
  [
    "Unities in Real And Complex Euclidean Field | Algebraic Number Theory Part 12 | Mathematise Yourself",
    "Unities in Real And Complex Euclidean Field is Finite , Simple Quadratic Field Algebraic Number Theory Part 12 for ..."
  ],
  [
    "Pre-Homotopy Theories: Lecture 6, Modern Homotopy Theory",
    "Dual to cylinders, the speaker will introduce path structures in the abstract sense, to formalize the path space construction in ..."
  ],
  [
    "Marc Hoyois - Milnor excision for motivic spectra",
    "It is a classical result of Weibel that homotopy invariant algebraic K-theory satisfies excision, in the sense that for any ring $A$ and ..."
  ],
  [
    "Alexander Kalmynin. C*-algebras and number fields. November 19, 2020",
    "Bost-Connes systems are special quantum statistical dynamical systems, which provide a surprising connection between ..."
  ],
  [
    "Chapter:9 Algebraic Expressions and Identities (Introduction) Ncert Maths Class 8 | Cbse board.",
    "This is the introduction video of chapter:9 Algebraic Expressions and Identities | Ncert Maths Class 8 | Cbse board."
  ],
  [
    "Motivic Verona by Peter Arndt 6/6: Stable computations",
    "Minicourse by Peter Arndt (University of Düsseldorf) on abstract and motivic homotopy theory hosted at the University of Verona ..."
  ],
  [
    "Algebraic Graph Theory: Some open problems related to eigenvalues of graphs",
    "Talk by Sebi Cioabă. The eigenvalues of a graph can reveal important information regarding its structure. For example, its second ..."
  ],
  [
    "Abstract Algebra ll Group Theory ll Analysis of Algebraic Structures (I, +), (I, *)... ll Lecture-4",
    "In you like and benefitted from our videos please fill this google form: https://forms.gle/jvYRCZUYCy74Tep89 # Join me on my ..."
  ],
  [
    "Štefan Gyürki, Minicourse: A not so short introduction into Algebraic Graph Theory. Lecture 1.",
    "Lectorium on algebraic graph theory: http://mca.nsu.ru/lectAGT/ Minicourse by Štefan Gyürki: A not so short introduction into ..."
  ],
  [
    "A version of Vorst&#39;s conjecture in positive and mixed characteristic - Georg Tamme",
    "Speaker(s) Georg Tamme Johannes Gutenberg-Universität Mainz Date 14 June 2022 – 14:30 to 15:30 Venue INI Seminar Room ..."
  ],
  [
    "eCHT, Gabe Angelini-Knoll, 31 January 20192019",
    ""
  ],
  [
    "Completion theorems in equivariant homotopy theory - Saul Glasman",
    "Short Talks by Postdoctoral Members Saul Glasman - September 22, 2015 ..."
  ],
  [
    "Tame class field theory over local fields - Amalendu Krishna",
    "Speaker(s) Amalendu Krishna Indian Institute of Science Date 24 June 2022 – 09:45 to 10:45 Venue INI Seminar Room 1 Session ..."
  ],
  [
    "Magdalena Kedziorek: An algebraic model for rational G-spectra",
    "July 17, 2017 @UIUC."
  ],
  [
    "Techmuller Representatives",
    ""
  ],
  [
    "Marc Hoyois - Milnor excision for motivic spectra",
    "It is a classical result of Weibel that homotopy invariant algebraic K-theory satisfies excision, in the sense that for any ring A and ..."
  ],
  [
    "Stomata Opening &amp; Closening~ K+ Malate Concentration Theory",
    "During daylight the carbon dioxide concentration decreases, followed by the formation of malic acid( Enzyme PEPCase is ..."
  ],
  [
    "Group Theory (Sk mapa) exercise solution",
    ""
  ],
  [
    "Algebraic Topology Lecture 20",
    ""
  ],
  [
    "Algebraic Automata Theory - Lecture 21",
    ""
  ],
  [
    "Introduction to Abstract Algebra - MTS 5 B 05 - THEORY OF EQUATIONS AND ABSTRACT ALGEBRA",
    "Introduction to Abstract Algebra - MTS 5 B 05 - THEORY OF EQUATIONS AND ABSTRACT ALGEBRA This is an introduction to ..."
  ],
  [
    "Zombie Nation - Kernkraft 400 (K Theory Trap Remix)",
    "Follow TrapMusicHD ✖ Facebook: https://www.facebook.com/TrapMusicHD Twitter: https://twitter.com/TrapMusicHD Soundcloud: ..."
  ],
  [
    "BilTop | Cihan Okay | Commutative d-torsion K-theory and its applications",
    "Bilkent topology seminar, Oct 5 2020 Title: Commutative $d$-torsion $K$-theory and its applications Abstract: Commutative ..."
  ],
  [
    "The Mechanics of Kolyvagin systems (Barry Mazur) 1-2",
    "The technique of Kolyvagin used to control the size of arithmetic Selmer groups has, as input, a certain system of cohomological ..."
  ],
  [
    "Session 11: Masterclass in Condensed Mathematics",
    "Masterclass in Condensed Mathematics GeoTop, University of Copenhagen, 9 - 13 November 2020 Session 11: Dustin Clausen ..."
  ],
  [
    "Group Theory(Abstract Algebra)- introduction to sets-3rd sem maths for B.sc Telugu",
    ""
  ],
  [
    "Algebraic topology,  Simplexes.",
    ""
  ],
  [
    "Ulrich Bunke: Bordism, K-theory and eta invariants",
    "Ulrich Bunke, University of Regensburg, Germany Abstract: I will describe and compare homotopy theoretic and analytic ..."
  ],
  [
    "Number Theory: algebraic extensions and degree considerations, 11-17-21 part 1",
    ""
  ],
  [
    "Network Systems - Lecture 4: Elements of Algebraic Graph Theory",
    "Chapter 4 of http://motion.me.ucsb.edu/book-lns, UCSB, Fall 202 0:00 Start 1:10 Outline of Chapter 4 14:53 The adjacency matrix ..."
  ],
  [
    "Theory of Equations || Algebra-Class : 3 (Lecture in Bangla)",
    "Article 7 : (00.20) Example-1 of article 7 : (7.12) Example-2 of article 7: (14.16) Article 8 : (19.36) Example of article 8 : (22.06) ..."
  ],
  [
    "Erik van Erp - Hypoelliptic operators and index theory II",
    "Second part of two lectures given in the Workshop \"A Topological Theory of Tangent Distributions\" held online with the support of ..."
  ],
  [
    "Analytic Number Theory (Part 1)",
    "Graduate level math."
  ],
  [
    "K Theory x Adara - Stadium",
    "Download Link ♫ ➥http://bit.ly/18luULg ♫ Support The Producer ♫ K Theory ○https://soundcloud.com/ktheory ..."
  ],
  [
    "Cyclic Groups| Algebraic Structures | Group Theory | PG TRB | Polytechnic TRB | Maths Board Tamil",
    "CyclicGroups #AlgebraicStructures #Coset #CongruentClass #EquivalenceClass #GroupTheory #PGTRB #PolytechnicTRB ..."
  ],
  [
    "Eiffel 65 - Blue (K Theory Remix)",
    "Purchase The Original ♫ ➥http://apple.co/1Kty2Ab Click \"Show More\" for the free download! ♫ Download Link ..."
  ],
  [
    "Algebraic Extension || m.sc Mathematics Galois Theory unit-1 ||",
    ""
  ],
  [
    "Matthew Morrow: Some recent developments in p-adic motivic cohomology (Part 1)",
    "These talks will present an overview of recent work in p-adic étale motivic cohomology, in finite and mixed characteristic, due to ..."
  ],
  [
    "[KA2W03] Mathematical physics: algebraic cycles, strings and amplitudes - Lawrence Barrott",
    "Speaker(s) Lawrence Barrott Universiteit Leiden Date 21 July 2022 – 13:30 to 14:30 Venue INI Seminar Room 1 Session Title ..."
  ],
  [
    "Theory subject kaise yaad kare | Theory subject study tips || Study Tips in Hindi",
    "commercewaleguruji #StudyTips In this video i was explain a Best tips for study after watching this video you can get a tips for how ..."
  ],
  [
    "Product of #Quadratic|| Algebra | #Solving of #Algebra| Product | #multiplication| #shorts Human Sir",
    "quadratic equation is a polynomial of degree 2. It always has an x2 term, but no larger exponents. Another way to write that, with ..."
  ],
  [
    "Algebraic Number Theory 22: Rings of Integers are Finitely Generated",
    "In this lecture we prove a result we've been working up to for a while. Namely that rings of integers are finitely generated Abelian ..."
  ],
  [
    "San Francisco",
    "Provided to YouTube by Symphonic Distribution San Francisco · K Theory · K Theory San Francisco ℗ 2017 AZID MUZIK ..."
  ],
  [
    "An Intuitive Introduction to Motivic Homotopy Theory - Vladimir Voevodsky [2002]",
    "2002 Annual Meeting Clay Math Institute Vladimir Voevodsky, American Academy of Arts and Sciences, October 2002."
  ],
  [
    "Vladimir Sosnilo | Excision for K-theory with respect to categorical Milnor squares 1/2 (in Russian)",
    "Seminar on A1-topology, motives and K-theory, September 24, 2020 Vladimir Sosnilo (PDMI RAS, SPbU) Excision for algebraic ..."
  ],
  [
    "Valentin Buciumas, Solvable lattice models and special functions appearing in algebraic geometry",
    "A recording of Zoom meeting from Solvable Lattice Models Seminar. http://stanford.edu/~nap/lattice-seminar​ Speaker: Valentin ..."
  ],
  [
    "Burt Totaro - Torus actions, Morse homology,and the Hilbert scheme of points on affine space",
    "We formulate a conjecture on actions of the multiplicative group. In short, if the multiplicative group G_m acts on a quasi-projective ..."
  ],
  [
    "Groups | Algebraic System (Part 2) KTU S3 DCS",
    "Algebraic System (Part 2) Groups Examples Properties of Groups CS 201 DCS Module 3 3rd Semester BTech CSE."
  ],
  [
    "Marc Hoyois: Hilbert schemes in motivic homotopy theory",
    "29 September 2021 Abstract: Hilbert schemes of ane spaces are highly singular schemes with a complicated geometry, but they ..."
  ],
  [
    "Supersingular prime algebraic number theory #Shorts #wikipedia #youtubeshorts #facts #fact",
    "Supersingular prime (algebraic number theory) In algebraic number theory, a supersingular prime for a given elliptic curve is a ..."
  ],
  [
    "Computing the Ring of Integers in a Number Field| Algebraic number Theory| MKR",
    "subscribe this youtube channel for further updates https://youtube.com/channel/UCJXCDNUwttyH7ApTLGUrx0g For #Poetry ..."
  ],
  [
    "Lect. 8- Different of K is an ideal of OK. Algebraic Number Theory, M.Sc. Sem 4.",
    ""
  ],
  [
    "eCHT, Anna Marie Bohmann, 21 April 2022",
    ""
  ],
  [
    "Topics in algebraic groups theory Uri Bader  8",
    ""
  ],
  [
    "Igor Krichever: Algebraic-geometrical methods in the theory of integrable systems...",
    ""
  ],
  [
    "Twisted derived equivalences and string theory dualities with B-field - Jonathan Rosenberg",
    "Speaker(s) Jonathan Rosenberg University of Maryland, College Park Date 20 July 2022 – 13:30 to 14:30 Venue INI Seminar ..."
  ],
  [
    "Valerio Proietti, Noncommutative algebraic topology and hyperbolic dynamics",
    ""
  ],
  [
    "Algebraic System | Homomorphism | Module 5 (Part 1) | MAT 203 DMS | S3(2019) CSE &amp; IT | KTU BTech",
    "Algebraic System Homomorphism Algebraic Structure Module 5 (Part 1) MAT 203 DMS S3(2019) CSE & IT KTU BTech Semi ..."
  ],
  [
    "Denis Nardin - A description of the motive of Hilb(A∞)",
    "The Hilbert scheme of points in infinite affine space is a very complicated algebro-geometric object, whose local structure is ..."
  ],
  [
    "(54+𝑥36+𝑥18+1) | algebra questions | Best Questions of Algebra | #maths #advancemath #algebra shorts",
    "(54+𝑥36+𝑥18+1) | algebra questions | Best Questions of Algebra Your Queries :- algebra calculator algebra 2 algebra 1 ..."
  ],
  [
    "Hossein Movasat: Periods Of Algebraic Cycles",
    "Introduction Video for the book: A Course in Hodge Theory: Periods of Algebraic Cycles."
  ],
  [
    "Introduction to Boolean Algebra (Part 1)",
    "Digital Electronics: Introduction to Boolean Algebra (Part 1) Topics discussed: 1) The definition of Boolean algebra. 2) Use of ..."
  ],
  [
    "How An Infinite Hotel Ran Out Of Room",
    "If there's a hotel with infinite rooms, could it ever be completely full? Could you run out of space to put everyone? The surprising ..."
  ],
  [
    "How to implement the algebraic cycle into an equation (EASY PEEZY) feat. Mathman",
    "This video is the meaning of life. Also; hi, Anka."
  ],
  [
    "Peter Scholze: On topological cyclic homology",
    "The lecture was held within the framework of the Hausdorff Trimester Program : Workshop \"K-theory in algebraic geometry and ..."
  ],
  [
    "Kirsten Wickelgren - Counts of rational curves on del Pezzo surfaces enriched in bilinear forms",
    "Del Pezzo surfaces here are smooth projective surfaces with ample anticanonical bundle, including P^2, P^1 x P^1, and cubic ..."
  ],
  [
    "ALGEBRA BY KIRAN 9100+",
    ""
  ],
  [
    "Differential K-theory and its Characters | D. Sullivan,James H. Simons | Лекториум",
    "Differential K-theory and its Characters | Лектор: D. Sullivan, James H. Simons | Организатор: Математическая лаборатория ..."
  ],
  [
    "Lect10- To compute the Different of algebraic number field K, Algebraic Number Theory,  M.Sc. sem 4",
    ""
  ],
  [
    "Vladimir Sosnilo | Excision for K-theory with respect to categorical Milnor squares 2/2 (in Russian)",
    "Seminar on A1-topology, motives and K-theory, September 24, 2020 Vladimir Sosnilo (PDMI RAS, SPbU) Excision for algebraic ..."
  ],
  [
    "MDS Code || Algebraic Coding Theory || Lect-03",
    ""
  ],
  [
    "Nigel Higson: The Oka principle and Novodvorskii’s theorem",
    "Talk by Jonathan Rosenberg in Global Noncommutative Geometry Seminar (Americas) ..."
  ],
  [
    "Active K+ - H+ ion exchange theory",
    ""
  ],
  [
    "Big Sean - IDFWU (K Theory Remix)",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/big Click \"Show more\" to see important details! Add us on Snapchat: ..."
  ],
  [
    "Emil Prodan | Topological Bulk-Boundary Correspondence via K-Theory",
    "Speaker: Emil Prodan, Yeshiva Title: Topological Bulk-Boundary Correspondence via K-Theory Abstract: I will demonstrate how ..."
  ],
  [
    "Erik Pedersen Bounded K  and L theory",
    "The lecture was held within the framework of Follow-up Workshop TP Rigidity. 29.4.2015."
  ],
  [
    "Dmitry Kaledin - 1/3 Motives from the Non-commutative Point of View",
    "Motives were initially conceived as a way to unify various cohomology theories that appear in algebraic geometry, and these can ..."
  ],
  [
    "Florian Ivorra - Intersection theory and A-infinity-algebra",
    ""
  ],
  [
    "Motivic Verona by Peter Arndt 2/6: Simplicial sets, derived functors and homotopy (co-)limits",
    "Minicourse by Peter Arndt (University of Düsseldorf) on abstract and motivic homotopy theory at the University of Verona Lecture ..."
  ],
  [
    "Calculate the distance AB | Important Geometry and Algebra skills explained",
    "Learn how to find the distance. Important Geometry and Algebra skills are also explained: Pythagorean Theorem, Two-Tangent ..."
  ],
  [
    "Jae-Suk Park - November 14, 2016",
    "Title: Quantization of the Rational Homotopy Theory Abstract: We explain how to associate a \"classical field theory\" to a ..."
  ],
  [
    "KK-theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/KK-theory 00:01:16 1 Definition 00:04:18 2 ..."
  ],
  [
    "Diffeomorphism groups from a homotopical viewpoint III - Ib Madsen",
    "Geometric and Algebraic Structures in Mathematics A Conference to celebrate Dennis Sullivan's 70th birthday Mathematics ..."
  ],
  [
    "eCHT, Gabriel Angelini-Knoll, 24 March 2022",
    ""
  ],
  [
    "Opening and closing of stomata.Levitt theory, proton transfer theory",
    "mechanism of opening and closing of stomata ,levitt theory or proton transfer theory. clear the concept in 10 minutes Hope aapko ..."
  ],
  [
    "20191101 NCTS Mini courses in Algebraic Geometry Kawamata",
    ""
  ],
  [
    "Influx of K+ Ions, Biology Lecture | Sabaq.pk |",
    "Influx of K+ Ions; K+ Ions enters guard cells from surrounding epidermal cells by active transport This video is about: Influx of K+ ..."
  ],
  [
    "Homotopy theory and algebraic vector bundles",
    "Mike Hopkins (University of Harvard, USA) Homotopy theory and algebraic vector bundles Jueves 8 de Diciembre de 2017 ..."
  ],
  [
    "Theory of equations | Fundamental theorem of algebra | B.Sc maths part 1 | part 1 BSc math",
    "Welcome to my channel 🔥for better concept of mathematics Contact us : 9709710882 Join our whatsapp group ..."
  ],
  [
    "Algebra: ring theory. Lecture 6, math 100 b, UCSD",
    "Evaluation map and the first isomorphism, degree of polynomials, D is an integral domain implies D[x] is an integral domain, and ..."
  ],
  [
    "Paul Arne Østvær: The motivic Hopf map and the homotopy limit problem for hermitian K theory",
    "The lecture was held within the framework of the (Junior) Hausdorff Trimester Program Topology: \"Workshop: Hermitian K-theory ..."
  ],
  [
    "eCHT, Thomas Nikolaus, 14 March 2019",
    ""
  ],
  [
    "Naughty Boy - La la la ft. Sam Smith (Official Video)",
    "Check out the official music video for \"La la la\" by Naughty Boy ft. Sam Smith From Naughty Boy's debut album \"Hotel Cabana\" ..."
  ],
  [
    "eCHT, Birgit Richter 22 April 2021",
    ""
  ],
  [
    "Rich Homie Quan - Flex (K Theory Remix)",
    "PREMIERE: Rich Homie Quan - Flex (K Theory Remix) Subscribe here: http://trapcity.tv/subscribe ➥ Become a fan of Trap City: ..."
  ],
  [
    "C*-algebras: C*-algebras and *-morphisms (Lecture 1)",
    "In our first lecture, we introduce the category of C*-algebras, within which our course will take place."
  ],
  [
    "Naughty Boy - La La La ft. Sam Smith (K Theory Remix)",
    "Download the Original: http://apple.co/1T6OdwK Please show feedback by liking or disliking the video! 🎶 More from K Theory ..."
  ],
  [
    "Theory of equations &amp; Algebra - Lecture 1",
    ""
  ],
  [
    "Lect10- To compute the Different of algebraic number field K, Algebraic Number Theory,  M.Sc. sem 4",
    ""
  ],
  [
    "K Theory &amp; Ananaki - Crystal Skull 2.0",
    "Download Link ♫ ➥https://soundcloud.com/ktheory/skull20 Add our Snapchat : trapnation ♫ Support Trap Nation ..."
  ],
  [
    "What is Algebraic Formulas ?| How to remember easily ? (In Hindi)",
    "In this video I will discuss What is Algebric formula., How to come this type formula and How to remember easily this type formula."
  ],
  [
    "Algebraic Graph Theory: Some open problems related to eigenvalues of graphs",
    "Talk by Sebi Cioabă. The eigenvalues of a graph can reveal important information regarding its structure. For example, its second ..."
  ],
  [
    "Fetty Wap - Trap Queen (K Theory Remix)",
    "Download the Original ♫ ➥http://apple.co/1MmuyHp Click \"Show more\" to see important details! 🎶 More from K Theory ..."
  ],
  [
    "Recording #61",
    "96."
  ],
  [
    "(Co)chain complex to (Co)homology LES",
    ""
  ],
  [
    "Lect.11-Computation of Different D of Algebraic number field K,  Algebraic Number Theory, M.Sc.Sem 4",
    ""
  ],
  [
    "Homological Algebra 1: Introduction and Motivation",
    "Welcome all to this homological algebra series. Much like the format of the old homotopy theory series, but hopefully actually ..."
  ],
  [
    "Daniel Álvarez-Gavela: The nearby Lagrangian conjecture from the K-theoretic viewpoint",
    "Daniel Álvarez-Gavela (Princeton): The nearby Lagrangian conjecture from the K-theoretic viewpoint (6/5/20 4pm GMT) In this talk ..."
  ],
  [
    "Mathematics: Proof on p. 16 of Lang&#39;s Algebraic Number Theory (more detail needed)",
    "Mathematics: Proof on p. 16 of Lang's Algebraic Number Theory (more detail needed) Helpful? Please support me on Patreon: ..."
  ],
  [
    "Algebraic number theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Topics in algebraic groups theory Uri Bader 29",
    ""
  ],
  [
    "What is Algebraic Topology? - Ep 53 Clips",
    "Taken from Ep 53 - The Beauty of Mathematics w/ Dr. Trefor Bazett: https://youtu.be/QcuIuMCeLxk To all our listeners out there, we ..."
  ],
  [
    "Lecture 1 - Algebraic Methods in Combinatorial Physics (Structure Theory of Modules).",
    "Modern mathematical physics requires the ability to make symmetry a rigorous concept. In this first video, Dr. Kenigson provides a ..."
  ],
  [
    "Topics in algebraic groups theory Uri Bader 1",
    "introduction to analytic geometry absolute values on local fields Ostrowski's theorem."
  ],
  [
    "Mixed characteristic vanishing theorems and applications I, Bhargav Bhatt",
    "The goal of this series of talks is to explain some recent work on vanishing theorems in mixed characteristic algebraic geometry ..."
  ],
  [
    "Lect. 8- Different of K is an ideal of OK. Algebraic Number Theory, M.Sc. Sem 4.",
    ""
  ],
  [
    "GeNoCas, 2nd Series, Talk 1: Guido Arnone",
    "Nonexistence of graded unital homomorphisms between Leavitt algebras and their Cuntz splices."
  ],
  [
    "Algebraic Graph Theory:  K-fractional revival and approximate K-fractional revival on path graphs",
    "Talk by Whitney Drazen. A continuous-time quantum walk is a process on a network of quantum particles that is governed by the ..."
  ],
  [
    "Quadratic Equations 01 | Introduction | Class 11 | JEE | Pace Series",
    "Watch Ad Free Videos ( Completely FREE ) on Physicswallah App(https://bit.ly/2SHIPW6). Download the App from Google Play ..."
  ],
  [
    "Ningchuan Zhang Research Summary 2022",
    "Abstract: A major theme in my research is the connections between algebraic K-theory and L-functions. In this video, I will first give ..."
  ],
  [
    "Quadratic Equation (द्विघात समीकरण) का गुणनखंड (Factor) और मूल निकालना | By Kapildeo Sir, Ktcclasses",
    "KTC Classes By Kapildeo Sir (Kd. Sir)-------------- 🔷 Download our New app :- https://bit.ly/2p5Mnpr 🔷 For pdf My Telegram ..."
  ],
  [
    "Stomata Opening &amp; Closening~ K+ Malate Concentration Theory",
    "During daylight the carbon dioxide concentration decreases, followed by the formation of malic acid( Enzyme PEPCase is ..."
  ],
  [
    "Topics in algebraic groups theory Uri Bader 4",
    ""
  ],
  [
    "Recent developments in non-commutative Iwasawa theory I - David Burns",
    "David Burns March 25, 2011 For more videos, visit http://video.ias.edu."
  ],
  [
    "Maximilien Péroux: Equivariant variations of topological Hochschild homology",
    "University of Regina Topology Seminar November 2, 2021 Speaker: Maximilien Péroux (University of Pennsylvania) Title: ..."
  ],
  [
    "Ningchuan Zhang: A Quillen-Lichtenbaum Conjecture for Dirichlet L-functions",
    "Abstract: The original version of the Quillen-Lichtenbaum Conjecture, proved by Voevodsky and Rost, connects special values of ..."
  ],
  [
    "Tutorial on Using Sage for Algebraic Number Theory at University of Washington",
    "This is for http://wstein.org/edu/2012/ant/ Temporary offline version: http://wstein.org/tmp/tutorial.mp4."
  ],
  [
    "Algebraic Number Theory 22: Rings of Integers are Finitely Generated",
    "In this lecture we prove a result we've been working up to for a while. Namely that rings of integers are finitely generated Abelian ..."
  ],
  [
    "Mark Behrens: The tmf resolution for Z",
    "July 17, 2017 @UIUC."
  ],
  [
    "Algebraic Extensions-V, Field Theory, M.Sc. Mathematics",
    "Theorems & Results."
  ],
  [
    "Kristin Courtney: &quot;The abstract approach to classifying C*-algebras&quot;",
    "Actions of Tensor Categories on C*-algebras 2021 Mini Course: \"The abstract approach to classifying C*-algebras\" Kristin ..."
  ],
  [
    "Introduction to Boolean Algebra (Part 1)",
    "Digital Electronics: Introduction to Boolean Algebra (Part 1) Topics discussed: 1) The definition of Boolean algebra. 2) Use of ..."
  ],
  [
    "Active K+ - H+ ion exchange theory",
    ""
  ],
  [
    "60. Conjugate subgroup definition and examples | H=x^(-1)Kx for x in G | normal subgroup | AdnanAlig",
    "Normal subgroup of groups: https://www.youtube.com/playlist?list=PLeQWqGRBb3QzjMgoC1AhkUBKqIDKOGYHE Group ..."
  ],
  [
    "FINITE SUBGROUP TEST",
    ""
  ],
  [
    "Diego Izquierdo&#39;s talk at the 14th Brauer Group Meeting",
    "14th Brauer Group Meeting Monday June 27th, morning session Academic College of Tel-Aviv-Yaffo."
  ],
  [
    "Session 11: Masterclass in Condensed Mathematics",
    "Masterclass in Condensed Mathematics GeoTop, University of Copenhagen, 9 - 13 November 2020 Session 11: Dustin Clausen ..."
  ],
  [
    "Robert Steinberg",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Modules over polynomial rings $K[x]$",
    ""
  ],
  [
    "Theory of displays I (W. Messing)",
    "Clay Mathematics Institute Summer School 2006 on \"Arithmetic geometry\""
  ],
  [
    "Štefan Gyürki, Minicourse: A not so short introduction into Algebraic Graph Theory. Lecture 6.",
    "Lectorium on algebraic graph theory: http://mca.nsu.ru/lectAGT/ Minicourse by Štefan Gyürki: A not so short introduction into ..."
  ],
  [
    "Ring of Integers in Algebraic Number Theory| MKR",
    "subscribe this youtube channel for further updates https://youtube.com/channel/UCJXCDNUwttyH7ApTLGUrx0g For #Poetry ..."
  ],
  [
    "Faustus MathLogic",
    "Hi my name is Faustus (Fausto) I am a bookish, intellectually curious university student studying Pure Mathematics and ..."
  ],
  [
    "#lecture 7# .. if an element is algebraic over F, then there exists a unique monic polynomial...",
    "This video describes an important theorem of field extension.. If an element a is algebraic over F ,then there exists a unique ..."
  ],
  [
    "Topics in algebraic groups theory Uri Bader 1",
    "introduction to analytic geometry absolute values on local fields Ostrowski's theorem."
  ],
  [
    "Lect.12- Imp. exercise to compute Different of number Field K. Algebraic Number Theory, M.Sc. sem 4",
    ""
  ],
  [
    "Motivic Verona by Peter Arndt 3/6: (∞,1)-categories and stabilization",
    "Minicourse on abstract and motivic homotopy theories by Peter Arndt (University of Düsseldorf) hosted at the University of Verona ..."
  ],
  [
    "Tashi Walde, Higher Segal spaces via Higher Excision",
    "20/05/2021."
  ],
  [
    "eCHT minicourse part 4, Sander Kupers 11 May 2021",
    ""
  ],
  [
    "Assam TET/CTET 2019 by ksk educare||Algebra part-1",
    "Algebra part-1. Here we have discussed algebra basic part for competitive examination. CTET is so near, let's prepare for it."
  ],
  [
    "Lect.11-Computation of Different D of Algebraic number field K,  Algebraic Number Theory, M.Sc.Sem 4",
    ""
  ],
  [
    "A multiset approach to arithmetic | Math Foundations 227 | N J Wildberger",
    "We introduce a new framework for basic arithmetic and algebra, using the data structure of a multiset, or mset. This is an ..."
  ],
  [
    "Introduction to order of operations",
    ""
  ],
  [
    "Lect. 6-Relation b/w discriminant of n-elements. Algebraic Number Theory, M.Sc Sem 4",
    ""
  ],
  [
    "Stable Homotopy Seminar, 12: The Atiyah-Hirzebruch Spectral Sequence (Caleb Ji)",
    "Caleb Ji gives us an overview of spectral sequences, focusing on the example of the Leray-Serre spectral sequence which is ..."
  ],
  [
    "math || formula | math formula | Algebra formulas || #shorts #viral #trending #formula #math #short",
    "algebraic expressions, algebra class 6, algebra by sahil sir, algebra formulas, algebraic identities, algebraic expressions and ..."
  ],
  [
    "New foundations for functional analysis",
    "Dustin Clausen, Copenhagen University October 29th, 2021 2021 Fields Medal Symposium: Peter Scholze ..."
  ],
  [
    "Simmons PH2011 Online Lecture 18b 2020.4.30",
    "Energy conservation in the presence of non-conservative forces, gravitational PE."
  ],
  [
    "GPRT: Svetlana Makarova",
    "Moduli spaces of stable sheaves over quasipolarized K3 surfaces and Strange Duality."
  ],
  [
    "Quadratic Equations 05 | Theory of Equation | Graph of Quadratic Polynomial | Class 11 | JEE | PACE",
    "Watch Ad Free Videos ( Completely FREE ) on Physicswallah App(https://bit.ly/2SHIPW6). Download the App from Google Play ..."
  ],
  [
    "Special values of Zeta-functions of regular schemes projective over the integers",
    "Speaker(s) Stephen Lichtenbaum Brown University Date 24 June 2022 – 15:00 to 16:00 Venue INI Seminar Room 1 Session Title ..."
  ],
  [
    "Nichol Furey and Mia Hughes - Division algebraic symmetry breaking",
    "Talk given on the 5th of May, 2021 for the University of Edinburgh's department of mathematics seminar series. Abstract: Can the ..."
  ],
  [
    "Structure of Stomata | Opening and closing of stomata",
    "biologysimplifiedtamil #NEET #NCERT #NEETTAMIL #TNSCERT."
  ],
  [
    "BilTop | Ben Williams | A1 homotopy groups of GL_n and a problem of Suslin&#39;s",
    "Bilkent topology seminar, Dec 7 2020, by Ben Williams (University of British Columbia) Abstract: Let $F$ be an infinite field. Andrei ..."
  ],
  [
    "The Subset of Algebraic Elements is a Subfield",
    "In this video, we prove that the subset of all algebraic elements of a field extension is itself a subfield, which is necessarily an ..."
  ],
  [
    "eCHT, Elden Elmanto, 16 September 2021",
    ""
  ],
  [
    "Russian mathematician Andrei Suslin Died at 67",
    "Andrei Suslin was a Russian mathematician who contributed to algebraic K-theory and its connections with algebraic geometry."
  ],
  [
    "Theory of equations &amp; Algebra - Lecture 1",
    ""
  ],
  [
    "Midwest Topology Seminar, J.D. Quigley, 8 October 2020",
    ""
  ],
  [
    "David Gepner &#39;K-theoretic obstructions to bounded t-structures&#39; Penn, April 18, 2019",
    ""
  ],
  [
    "Field Theory  3:  Algebraic Extensions",
    "Here we are discussing about algebraic extensions, minimal polynomial of an algebraic element, proving the existence and ..."
  ],
  [
    "[INTERSECTION THEORY]  VECTOR BUNDLES, LOCALLY FREE SHEAVES &amp; ALL THAT",
    "Broadcasted live on Twitch -- Watch live at https://www.twitch.tv/boringmathprofessor."
  ],
  [
    "Permutations going up and down, and somehow Pi",
    "The percentage of permutations of 1,2,3,...,n which alternatingly go up and down, turns out to be related to Pi."
  ],
  [
    "Class 8th math 6.1...2/5/20.. Algebra Sir faiz rasool jutt ACMA",
    "rrb group d algebra, group d algebra question, wifistudy group d algebra, algebra group d wifi, algebra equations, algebra easy, ..."
  ],
  [
    "Mohit Tyagi",
    "Milestone Results: JEE Adv 2021: 339 IITians JEE Adv 2022: 752 IITians Competishun is the best relevant Online JEE & NEET ..."
  ],
  [
    "Joseph Ayoub -- Rigid analytic motivic sheaves",
    "I will report on recent work concerning motives in rigid analytic geometry. In particular, I would like to discuss a vast generalisation ..."
  ],
  [
    "Chamillionaire - Ridin&#39; (K Theory Remix)",
    "TRACK SUBMISSION ⚡️ https://www.bitsubmit.net/QUALITYOUTRECORDS 🔴 K Theory 🔴 🔸https://soundcloud.com/ktheory ..."
  ],
  [
    "Glenn STEVENS - Modular Symbols, K-theory, and Eisenstein Cohomology",
    "In this talk we will give an adelic construction of an object that we call the Kato-Beilinson modular symbol for GL(2), extending ..."
  ],
  [
    "Salon Gepner",
    ""
  ],
  [
    "Motivic Verona by Peter Arndt 5/6: Working with motivic spectra and a unifying abstract approach",
    "Minicourse by Peter Arndt (University of Düsseldorf) on abstract and motivic homotopy theory at the University of Verona Lecture ..."
  ],
  [
    "Network Theory - Seminar 1",
    "This is the first of a series of graduate math seminars on network theory. After a quick overview, we begin building a category ..."
  ],
  [
    "Lil Wayne - A Milli (K Theory Remix) (BreathlessBeats Release)",
    "hey guys is Breathless here, with today's upload, if you all are noticing the slight muff on the voices when the bass hits, its because ..."
  ],
  [
    "eCHT, Thomas Nikolaus, 14 March 2019",
    ""
  ],
  [
    "Algebraic Extensions- IV, Field Theory, M.Sc. Mathematics",
    "Theorems & Results."
  ],
  [
    "eCHT, Birgit Richter 22 April 2021",
    ""
  ],
  [
    "Matthew Ballard -- Kernels in noncommutative algebraic geometry",
    ""
  ],
  [
    "Lecture-8 Transpiration , K - malate theory",
    "Transport in plants : Plant physiology."
  ],
  [
    "Tournament of Towns 2015: algebraic number theory AGAIN?",
    "The number fields just keep coming back! Broadcasted at https://www.twitch.tv/vEnhance (runs Fridays 8pm EST, schedule at ..."
  ],
  [
    "Homological Algebra 1: Introduction and Motivation",
    "Welcome all to this homological algebra series. Much like the format of the old homotopy theory series, but hopefully actually ..."
  ],
  [
    "Mathematics: Proof on p. 16 of Lang&#39;s Algebraic Number Theory (more detail needed)",
    "Mathematics: Proof on p. 16 of Lang's Algebraic Number Theory (more detail needed) Helpful? Please support me on Patreon: ..."
  ]
]