[
  [
    "Noncommutative Choquet simplices",
    "Speaker: Matthew Kennedy, University of Waterloo Event: The 48th Canadian Operator Symposium ..."
  ],
  [
    "An introduction to the Choquet integral",
    "Overview and example of the Choquet integral - how it fits in with the concept of integrals and some interpretations. It is defined ..."
  ],
  [
    "Learning the weights of a Choquet integral",
    "This video gives an overview of a linear programming based approach to finding the values of a fuzzy measure, which in turn can ..."
  ],
  [
    "Fuzzy Measures and Fuzzy Integrals - Part 1",
    "Aggragating information using fuzzy integrals and fuzzy measures. The Sugeno and Choquet integrals."
  ],
  [
    "Theory of Structure | Ruchin Tejawat",
    ""
  ],
  [
    "Our brain, this black box | Daniel Choquet | TEDxUniversitéDeBordeaux",
    "What happens in your brain when you learn something ? When you store a memory ? In this informative and fascinating talk, ..."
  ],
  [
    "Sachse mohr theory || Stability of higher cycloalkanes || theory of strainless ring || organic",
    "Sachse mohr theory || Stability of higher cycloalkanes || theory of strainless ring || organic chemistry #organic in this video we ..."
  ],
  [
    "Game Theory 7 03  The Shapley Value",
    "This video from Game Theory Online (http://www.game-theory-class.org) defines the Shapley Value, a prominent way of dividing ..."
  ],
  [
    "Lecture: Expected Utility vs. Prospect Theory,  Judgment and Decision Making",
    "Lecture on Judgment and Decision Making by Dr. Lace Padilla, at the University of California Merced in Cognitive and Information ..."
  ],
  [
    "Prospect Theory",
    "Prospect theory part 1 neww with no issues -- Created using PowToon -- Free sign up at http://www.powtoon.com/youtube/ ..."
  ],
  [
    "coulson and moffitt&#39;s modification theory | sachse mohr theory | Part-3,Unit-5| cycloalkanes b pharm",
    "cycloalkanes_b_pharm, In this Video we cover, 1. coulson and moffitt's modification theory 2. sachse mohr theory or sachse mohr ..."
  ],
  [
    "Poet-in-Residence: Marianne Choquet December 10, 2012",
    "The University of Dubuque Poet-in-Residencel Reading Series aims to broaden and enrich the cultural scope of both the campus ..."
  ],
  [
    "(AGT8E14) [Game Theory] Arrow&#39;s Impossibility Theorem and Condorcet Paradox (Cycles)",
    "In this episode I talk about Arrow's impossibility theorem and Condorcet paradox. This video is part of my advanced game theory ..."
  ],
  [
    "Theories in Educational psychology",
    "Theories in Educational psychology."
  ],
  [
    "Measure Theory 1.1 : Definition and Introduction",
    "In this video, I discuss the intuition behind measures, and the definition of a general measure. I also introduce the Lebesgue ..."
  ],
  [
    "What is ergodic theory?",
    "In this episode, I introduce one of the areas I work in: ergodic theory! Probably one of the more technical episodes I've done yet, ..."
  ],
  [
    "Cattell Horn Carroll Theory of Intelligence",
    ""
  ],
  [
    "Music And Measure Theory",
    "A connection between a classical puzzle about rational numbers and what makes music harmonious."
  ],
  [
    "05e Machine Learning: Shapley Value",
    "I extend the discussion on feature ranking and selection with Shapley Value (1953). Adapted from game theory, this is a useful ..."
  ],
  [
    "Navigate Instructor Training: Creating a New Assignment",
    "This video demonstrates how instructors can create a new assignment within Navigate from Jones & Bartlett Learning."
  ],
  [
    "Prospect Theory - Dr. Divya #prospecttheory #DanielKahneman #behavioralfinance #thaler #investing",
    "This video explains expected utility theory, Prospect theory, loss aversion, value function. This video has very nicely explained the ..."
  ],
  [
    "GTO-7-02: Coalitional Game Theory: Definitions",
    "This video from Game Theory Online (http://www.game-theory-class.org) formally defines coalitional games and some of their ..."
  ],
  [
    "(AGT4E10) [Game Theory] Shapley Value",
    "In this episode I define the famous solution concept in cooperative game theory, known as Shapley value. I also provide an ..."
  ],
  [
    "Approximation Theory Part 1",
    "Lecture with Ole Christensen. Kapitler: 00:00 - Intro To Approximation Theory; 10:00 - Remarks On Vectorspaces In Mat4; 13:30 ..."
  ],
  [
    "Measure Theory 2.1 : Lebesgue Outer Measure",
    "In this video, I introduce the Lebesgue outer measure, and prove that it is, in fact, an outer measure."
  ],
  [
    "Rémi Boutonnet: Character rigidity and non-commutative ergodic theory",
    "I will present a recent result in the theory of unitary representations of lattices in semi-simple Lie groups, which can be viewed as ..."
  ],
  [
    "Weiwei Cheng @ LWA 2011",
    "Learning Monotone Nonlinear Models using the Choquet Integral (LWA 2011) Slides available at: ..."
  ],
  [
    "The Black Box Method: How to Learn Hard Concepts Quickly",
    "A method for preliminarily learning difficulty concepts/data structures/algorithms and being able to put them to use very quickly..."
  ],
  [
    "GTO-7-03: The Shapley Value",
    "This video from Game Theory Online (http://www.game-theory-class.org) defines the Shapley Value, a prominent way of dividing ..."
  ],
  [
    "(AGT4E11) [Game Theory] Calculating Shapley Values: An Example",
    "In this episode I solve a numerical example and calculate the Shapley value of a coalitional game. This video is part of my ..."
  ],
  [
    "Game Theory 101 (#46): Condorcet&#39;s Paradox and Social Preferences",
    "gametheory101.com/courses/game-theory-101/ It makes perfect sense for an individual's preferences to be rational. But when we ..."
  ],
  [
    "Graph theory module 1",
    ""
  ],
  [
    "Parcours Recherche",
    ""
  ],
  [
    "Workshop: Mathematical and Numerical Aspects of Gravitation",
    "Learn more online at: ..."
  ],
  [
    "Understand Kaldor Hicks Compensation Criteria Concept In Just One Watch | UGC NET| Amit Chatterjee",
    "\"UGC NET - Watch the live class on Understand Kaldor Hicks Compensation Criteria Concept In Just One Watch for UGC NET ..."
  ],
  [
    "#LEBESGUEmeasuretheory  (part-1) in hindi by GAYATRI education classes",
    "Iss video main Lebesgue measure theory ka introduction btaya h Thanks for watching #GAYATRIeducationclasses GAYATRI ..."
  ],
  [
    "Psychology Class-15/Vygotsky&#39;s theory of cognitive development|വൈഗോട്സ്കിയുടെ വൈജ്ഞാനിക സിദ്ധാന്തം",
    "Psychology Class-15/Vygotsky's theory of cognitive development|വൈഗോട്സ്കിയുടെ വൈജ്ഞാനിക ..."
  ],
  [
    "The Game You Can Win But Cannot Play, Part 1: History",
    "Works Cited Kenderov, P. S. “Banach-Mazur Game.” Encyclopedia of Mathematics ..."
  ],
  [
    "RESEARCH ON WIND ENERGY INVESTMENT DECISION MAKING: A CASE STUDY IN JILIN",
    "As a clean renewable energy, wind energy has been focused on an alternative source of fossil fuels. Evaluating wind energy ..."
  ],
  [
    "Tonecast S1E5: The Music Theory of Karma Police by Radiohead",
    "On episode five of the Tonecast, we're delving into what makes Karma Police by Radiohead a brilliant piece of music; specifically ..."
  ],
  [
    "Conférence - Y  CHOQUET BRUHAT - Rencontres avec Einstein - Académie des sciences",
    "Conférence de Yvonne CHOQUET-BRUHAT intitulée Rencontres avec Einstein © Académie des sciences - Tous droits réservés."
  ],
  [
    "Cooperative Games and the Shapley value",
    "I introduce cooperative games and illustrate an example of calculating the Shapley value. This video corresponds to this Chapter ..."
  ],
  [
    "CA Final SFM (20 Marks) : Theory Lecture &amp; Compiler (50 Pages) - All ICAI Exam, RTP, MTP &amp; PM Qstns",
    "Compiler of All Applicable ICAI Questions from Past Exam Papers, RTPs, MTPs and relevant questions from Old Practice Manual."
  ],
  [
    "Prospect Theory (Yale)",
    "Losses upset Investors more than gains un-upset them."
  ],
  [
    "Schumpeter Theory of Economic Development",
    "Innovation , entrepreneur, circular flow of Economic Development."
  ],
  [
    "Risk Aversion and Expected Utility Basics",
    "An overview of Risk aversion, visualizing gambles, insurance, and Arrow-Pratt measures of risk aversion. A thousand apologies ..."
  ],
  [
    "Scitovsky Paradox|Scitovsky&#39;s Double Criterion of Welfare| Advanced Microeconomics| ECO mania",
    "Compensation Principle Scitovsky Paradox Scitovsky's Double Criterion of Welfare Welfare Economics Advanced ..."
  ],
  [
    "Large data decay of Yang-Mills-Higgs fields on Minkowski and de Sitter backgrounds",
    "Grigalius Taujanskas (University of Oxford) In 1981, Eardley and Moncrief developed their famous $L^\\infty$ estimates to prove ..."
  ],
  [
    "Riemann integral vs. Lebesgue integral",
    "Support the channel on Steady: https://steadyhq.com/en/brightsideofmaths Or support me via PayPal: ..."
  ],
  [
    "UGC NET ECONOMICS -Kaldor Hicks Criteria &amp;Scitovsky paradox  #UGCNET #NTANET #ECONOMICS",
    "This channel helps you to qualify NTA UGC NET ECONOMICS Exam with Self study. For more videos subscribe to our ..."
  ],
  [
    "Prospect Theory: An Overview",
    "This video explains Prospect Theory, one of the foundational contributions of Behavioral Economics. I go over three important ..."
  ],
  [
    "Hayek theory of trade cycle |Type A Learner hayek theory | BUSINESS CYCLE | UGC NET ECONOMICS",
    "NTA NET ECONOMICS Hayek theory of business cycle #businesscycle Hayek's monetary version of over investment Hayek's ..."
  ],
  [
    "SELF THEORY BY CARL ROGERS/KTET,LP UP PSYCHOLOGY SELF THEORY/കാൾ റോജറിന്റെ ആത്മാവബോധ സിദ്ധാന്തം",
    "SELF THEORY BY CARL ROGERS/Real self,Ideal self/KTET,LP UP PEYCHOLOGY SELF THEORY C48 ..."
  ],
  [
    "Expected Values and Prospect Theory",
    ""
  ],
  [
    "Eleanor Roosevelt, Game Theory, and M&amp;A Integration Teams",
    "To build effective M&A integration teams, you have to focus on people first. For more information and links to reference materials ..."
  ],
  [
    "Fuzzy measure theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Preference Reasoning and Aggregation",
    "Preference reasoning and aggregation are the main ingredients of a very active area of research which brings together ..."
  ],
  [
    "International Conference in Number Theory and Physics - Mini Course - Conrey - 03",
    "International Conference in Number Theory and Physics Mini Course - Prof. Brian Conrey AIM and University of Bristol Class 3 ..."
  ],
  [
    "POSSIBILITY THEORY PART 1",
    ""
  ],
  [
    "Introduction to Fuzzy sets- Lecture 01 By Prof S Chakraverty",
    "Fuzzy Set Theory Lecture 01 By Prof S Chakraverty (NIT Rourkela)"
  ],
  [
    "Critical and Cultural Theory Lecture Pooja Rangan, 3/30/2015",
    ""
  ],
  [
    "confirmation of a full bladder in 5 sec withthe Vscan air #VscanAir",
    ""
  ],
  [
    "Probability and Possibility",
    "E.th.ph. makes the first attempt at attacking the theory behind statistics - in this case represented by the concept of probability."
  ],
  [
    "Hicks &amp; Slutsky Subtitution Effect # Malayalam Explanation.",
    "Hicks and Slutsky model of substitution effects."
  ],
  [
    "Sache Mohr Theory for stability of Cycloalkanes | Stability of Cycloalkanes | BP 301T | L~33",
    "In this video we will discuss Sache Mohr Theory for stability of Cycloalkanes with Explanation in easy language, this video is ..."
  ],
  [
    "Game Theory 12.3 Shapley Value",
    ""
  ],
  [
    "Behavioral Economics - Expected Utility Review",
    "This video goes through a review of expected utility as a precursor to discussing prospect theory and its role in behavioral ..."
  ],
  [
    "ST201 - Probability Theory",
    ""
  ],
  [
    "Almgren–Pitts min-max theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Almgren%E2%80%93Pitts_min-max_theory ..."
  ],
  [
    "Psychological Theories// exam oriented// K TET/SET / HSA PSYCHOLOGY/Last minute Preparation",
    "psychologicaltheories #learningtheories #cognitivedevelopment #moraldevelopment #socialtheory."
  ],
  [
    "Measure Theory 3.1 : Lebesgue Integral",
    "In this video, I define the Lebesgue Integral, and give an intuition for such a definition. I also introduce indicator functions, simple ..."
  ],
  [
    "S17 Population Ecology Models and Theory",
    "Session 17: Population Ecology: Models and Theory Location: Room 11C Chair: Ace North Date: Monday 12 December 2016, ..."
  ],
  [
    "Black Box Methodology (Philosophy of Education Part 10, Section 9)",
    "Dr. Stephen Hicks, Professor of Philosophy at Rockford University, presents a series of lectures on the philosophy of education."
  ],
  [
    "Marketing 330.450 Buyer&#39;s Black Box",
    "I had a Hard time with no recording device otherwise i would have uploaded this at 8 pm."
  ],
  [
    "#Cattell&#39;s #16 PF Trait Theory || कैटल का शीलगुण सिद्धान्त ||",
    "Cattell's personality trait theory in hindi || कैटल का शीलगुण सिद्धान्त || Raymond cattell 16 personality factors ..."
  ],
  [
    "Klaus Kröncke, Stable cosmological Kaluza-Klein Spacetimes",
    "Stable cosmological Kaluza-Klein Spacetimes."
  ],
  [
    "Measure Theory - Motivation",
    "Real Analysis: We motivate the idea of measure by considering an example where Riemann integration fails. We save measures ..."
  ],
  [
    "VICIOUS CIRCLE OF POVERTY # Partial theories of economic growth &amp; development. Malayalam explanation",
    "Vicious circle of poverty in MALAYALAM."
  ],
  [
    "Black-hole astronomy as a probe of fundamental physics - Aaron Held",
    "Institute for Advanced Study Astrophysics Seminar Topic: Black-hole astronomy as a probe of fundamental physics Speaker: ..."
  ],
  [
    "Eysenck&#39;s Theory of Personality | Theories of Personality (Type-Trait Approach) | Vidya Venue",
    "Hello Everyone I am a teacher by profession and a life long learner. I am here to inculcate knowledge which i learn throughout my ..."
  ],
  [
    "What is Hawtery&#39;s Monetary Theory? | Macroeconomics | Learn Economics on Ecoholics",
    "Let's discuss Hawtery's Monetary theory in detail. In our previous videos, we discussed the sun spot theory and what a business ..."
  ],
  [
    "Stuart White: Classification of simple amenable C^{∗}-algebras",
    ""
  ],
  [
    "Black Box Brain Theory!",
    "Have you ever not done something because you thought you already had too much going on? Consider this - the more you do, ..."
  ],
  [
    "Amelia Bayo - NPF: planet formation combining theory, observations and instrumentation",
    ""
  ],
  [
    "Dempster Shafer Theory part - 1",
    ""
  ],
  [
    "noc19-mg15 -Lecture 41: MAUT",
    "Multi Attribute Utility Theory (MAUT), Different forms of MAUT, Property of Dominance, Pareto Optimality, Stochastic Dominance."
  ],
  [
    "Shapley value Meaning",
    "English words and its meaning, improve word power and learn english easily."
  ],
  [
    "Analysis of Probabilistic Systems II",
    "Prakash Panangaden, McGill University https://simons.berkeley.edu/talks/prakash-panangaden-2016-08-30 Logical Structures in ..."
  ],
  [
    "Lebesgue integral and Measure theory (LEBS102):  Module 1 Algebra",
    "This video presents a brief introduction of algebra as well as sigma algebra. It is important to differentiate these two concepts."
  ],
  [
    "Differential forms and cohomology",
    "Leibniz differential, tangent vectors in curved space, cotangent (dual) vectors, differential forms, exterior product, interior product, ..."
  ],
  [
    "Which groups have bounded harmonic functions",
    "Yair Hartman (Northwestern University) Abstract: Bounded harmonic functions on groups are closely related to random walks on ..."
  ],
  [
    "Nico Spronk - University of Waterloo",
    "Title: Traces on locally compact groups Abstract: Let G be a locally compact group. There is a natural correspondence between ..."
  ],
  [
    "Yuxin Chen: Near-optimal Adaptive Information Acquisition: Theory and Applications",
    "Yuxin Chen Title: Near-optimal Adaptive Information Acquisition: Theory and Applications -- Abstract: Sequential information ..."
  ],
  [
    "Poet-in-Residence: Marianne Choquet December 10, 2012",
    "The University of Dubuque Poet-in-Residencel Reading Series aims to broaden and enrich the cultural scope of both the campus ..."
  ],
  [
    "Antonin Artaud&#39;s The Theatre and the Plague - Taanteatro (low resolution)",
    "ANTONIN ARTAUD'S THE THEATRE AND THE PLAGUE A Wolfgang Pannek Project - A Taanteatro Production 60 min. English ..."
  ],
  [
    "Inaugural Session of MG14 - Rome, July 2015",
    "Welcoming addresses Remo Ruffini (ICRANet), Yvonne Choquet-Bruhat (French Académie des Sciences), Jose' Funes (Vatican ..."
  ],
  [
    "Why study theory of computation?",
    "What exactly are computers? What are the limits of computing and all its exciting discoveries? Are there problems in the world that ..."
  ],
  [
    "Noncommutative resolutions and intersection cohomology for quotient singularities - Tudor Padurariu",
    "Short Talks by Postdoctoral Members Topic: Noncommutative resolutions and intersection cohomology for quotient singularities ..."
  ],
  [
    "Hawtrey&#39;s Monetary Theory of  Business Cycle",
    "This video describes about Hawtrey's Monetary Theory of Business Cycle #hawtreymonetarytheory #businesscycle ..."
  ],
  [
    "The Kurzweil - henstock Integral (K-H Integral)",
    "Course Name:-Calculus of One Real Variable Subject:-Mathematics keywords:-SwayamPrabha."
  ],
  [
    "The Kurzweil - henstock Integral (K-H Integral)",
    "Course Name:-Calculus of One Real Variable Subject:-Mathematics keywords:-SwayamPrabha."
  ],
  [
    "toune électro",
    ""
  ],
  [
    "Probability and Plausibility",
    ""
  ],
  [
    "CET 301 - Structural Analysis 1 | Truss Analysis &amp; Method of Joints | Mod 1 - Lec 2 | S5 KTU Civil",
    "CET 301 - Structural Analysis 1 | Truss Analysis & Method of Joints | Numerical Problem Mod 1 - Lec 2 | S5 KTU Civil Engineering ..."
  ],
  [
    "Lebesgue Integral and its Properties",
    ""
  ],
  [
    "prospect theory by prof GV Kesava Rao",
    ""
  ],
  [
    "Luca Motto Ros:  Towards the « right » generalization of descriptive set theory to...",
    "Recording during the meeting \"15th International Luminy Workshop in Set Theory\" the September 26, 2019 at the Centre ..."
  ],
  [
    "Lecture 21 - MESFET I-V Characteristics Shockley&#39;s Model",
    "High Speed Devices and Circuits."
  ],
  [
    "Edm",
    ""
  ],
  [
    "John Iliopoulos (LPTENS) SU(N) gauge theories and non-commutative geometry",
    "John Iliopoulos (LPTENS) SU(N) gauge theories and non-commutative geometry."
  ],
  [
    "Special Topics in Audit Analytics- Week 9-(Lecture 1: DS Theory of Belief Functions)",
    "Professor Raj Srivastava Lecture on DS Theory of Belief Functions Applied to Audit Analytics To receive additional updates ..."
  ],
  [
    "Alain Connes: Towards a Weil cohomology",
    "The lecture was held within the framework of the Hausdorff Trimester Program: Non-commutative Geometry and its Applications ..."
  ],
  [
    "Session 3: Ambiguity, the Precautionary Principle and Climate Change",
    "CONFERENCE ON AMBIGUITY, UNCERTAINTY, AND CLIMATE CHANGE http://calclimate.wordpress.com Session 3: Ambiguity, ..."
  ],
  [
    "Chelate effect and it&#39;s Thermodynamic Origin •all in one shot• [ MSc + Bsc ] @its Chemistry time",
    "Chelate Effect and Its Thermodynamic Origin # what are chelate ligands # what is Chelates # what is chelation effect ..."
  ],
  [
    "[2021, July] 2-1. Qualia Structure Symposium at Japan Neuroscience meeting",
    "(recorded on 2021 July 28) Symposium Title: Understanding the relationship between structures of conscious experience (qualia) ..."
  ],
  [
    "HYP2014 - The dynamics of black hole spacetimes in general relativity",
    "XV International Conference on Hyperbolic Problems: Theory, Numerics and Applications - HYP2014 The dynamics of black hole ..."
  ],
  [
    "ICERM Public Lecture: Discovering Black Holes and Gravitational Waves: Algorithms and Simulation",
    "The equations of general relativity, Einstein's field equations, are among the most complicated partial differential equations in ..."
  ],
  [
    "Why study theory of computation?",
    "What exactly are computers? What are the limits of computing and all its exciting discoveries? Are there problems in the world that ..."
  ],
  [
    "BHI Colloquium (May 12, 2020) - Martin Lesourd &amp; Frederick Vincent",
    "Weekly BHI colloquium featuring Martin Lesourd (mathematician/philosopher) from Harvard/BHI and Frederick Vincent ..."
  ],
  [
    "F21 PMath Prof Talk - &quot;Negami&#39;s Planar Cover Conjecture and Quantum Games&quot; by William Slofstra",
    "This talk was given on November 18, 2021 by Professor William Slofstra at the University of Waterloo. Preview: \"A graph (vertices ..."
  ],
  [
    "Hawtrey&#39;s Monetary Theory of  Business Cycle",
    "This video describes about Hawtrey's Monetary Theory of Business Cycle #hawtreymonetarytheory #businesscycle ..."
  ],
  [
    "Belief functions for safety arguments confidence estimation: A comparative study",
    "Work by Yassir Idmessaoud, Didier Dubois and Jérémie Guiochet at SUM 2020."
  ],
  [
    "Mathematical Theories From #SmallBusinessAdvisor.INFO &amp; Review of Kant&#39;s Pure Reason",
    "From #SmallBusinessAdvisor.INFO. Do you love mathematics (commutative law {number operations} or the theories (about 64 in ..."
  ],
  [
    "Expected utility theory I",
    ""
  ],
  [
    "Dempster Shafer Theory  in Artificial Intelligence Numerical Example-1 Part-1",
    "In this video i will try to explain you the method to solve Dempster Shafer Theory question using an example in Artificial ..."
  ],
  [
    "Hick&#39;s Theory of Trade Cycle",
    "Introduction, Assumption, Explanation and criticism."
  ],
  [
    "Formulas for Riesz Kernels",
    "Khazhgali Kozhasov (Max Planck Institute for Mathematics in the Sciences) ..."
  ],
  [
    "2019 MATH + X Symposium: Lydia Bieri",
    "The MATH + X Symposium on Inverse Problems and Deep Learning in Space Exploration took place January 23-25, 2019 at Rice ..."
  ],
  [
    "Leibenstein Critical Minimum Effort Theory",
    "Related Topics : 1.) Leibenstein Critical Minimum Effort Theory : https://youtu.be/_WrZjY9XPDE 2.) Stimulants And Shocks ..."
  ],
  [
    "Dempster-Shafer Theoretic Learning of Indirect Speech Act Comprehension Norms by Ruchen Wen et al.",
    "Ruchen Wen presents a short talk on the paper \"Dempster-Shafer Theoretic Learning of Indirect Speech Act Comprehension ..."
  ],
  [
    "N&amp;C",
    ""
  ],
  [
    "Lydia Bieri: New Structures in Gravitational Waves",
    "Special Colloquium: Lydia Bieri, University of Michigan, May 25, 2021 Topic: New Structures in Gravitational Waves."
  ],
  [
    "Prospect Theory: An Overview",
    "This video explains Prospect Theory, one of the foundational contributions of Behavioral Economics. I go over three important ..."
  ],
  [
    "ICM Public Lecture: Elena Giorgi",
    "Elena Giorgi (Columbia University) gives a lecture on Black Holes: A Mathematical Enlightenment as part of the ICM 2022 Public ..."
  ],
  [
    "Prospect Theory vs Utility Theory",
    "Prospect Theory vs Utility Theory This is a summary of Chapter 26 of Thinking Fast and Slow by Daniel Kahneman Check out a ..."
  ],
  [
    "The Social Mind - Keynote Address by Prof. Louis Cozolino",
    "Professor Louis Cozolino's keynote speech on \"The Social Mind\" at the PTUK Conference 2019."
  ],
  [
    "KTET PSYCHOLOGY || സിദ്ധാന്തങ്ങൾ / ഉപജ്ഞാതാക്കൾ || ഒറ്റ വിഡിയോയിൽ പഠിക്കാം - KTET EXAM 2022",
    "To Join Our Online Course Please Register : https://forms.gle/fRRSBiZ1oojHStYa9 . Follow us on: ✓ Ping us ..."
  ],
  [
    "Artificial Intelligence | Tutorial #19 | The Dempster Shafer Theory (DST)",
    "The Dempster-Shafer theory is a mathematical theory of evidence-based on belief functions and plausible reasoning, which is ..."
  ],
  [
    "[IN HINDI] Queuing Theory in Operation Research With Theocratic Concept Part 1 By JOLLY Coaching",
    "Queuing Theory is a technique which business organisation uses to study the queue of there customers who are coming to avail ..."
  ],
  [
    "Plenary   Basic Notions II",
    "Einstein's Field equations by Peter Hintz (ETH Zurich) - Start time 00:00 N=4 Gauge theory by Niklas Beisert (ETH Zurich) - Start ..."
  ],
  [
    "[4th GAF] Dan Lee 03",
    "Introduction to general relativity and the positive mass theorem."
  ],
  [
    "Joshua Frisch - The Poisson boundary and bounded harmonic functions on groups (Lecture 1)",
    ""
  ],
  [
    "Expected Utility 1",
    "GT-EU."
  ],
  [
    "Theories of Intelligence of Spearman Two Factor, Thorndike and Alfred Binet",
    "In this video we will discuss about Various Theories of Intelligence Such as Spearman Two Factor Theory, Thorndike Multi Factor ..."
  ],
  [
    "Hicks Theory of Trade Cycle",
    "This video describes about hick theory of trade cycle #economics #hicks #hickstheory #tradecycle."
  ],
  [
    "The Kurzweil-Henstock Integral (K-H Integral)",
    ""
  ],
  [
    "Mathematical General Relativity | Lydia Bieri",
    ""
  ],
  [
    "Chelsea Walton, &quot;An Invitation to Noncommutative Algebra,&quot; the 2021 NAM Claytor-Woodard Lecture",
    "Chelsea Walton, Rice University, gives the NAM Claytor-Woodard Lecture on \"An invitation to Noncommutative Algebra,\" on ..."
  ],
  [
    "Andreas Kleiner (ASU) - 24 Jun 2020",
    "Andreas Keliner (Arizona State University) Extreme points and majorization: Economic applications (joint with B. Moldovanu and ..."
  ],
  [
    "Ratchet Effect and Demonstration Effect # MALAYALAM EXPLANATION.",
    ""
  ],
  [
    "The Kurzweil-Henstock Integral (K-H Integral)",
    ""
  ],
  [
    "Mathematical General Relativity | Lydia Bieri",
    ""
  ],
  [
    "Theories of Personality (Cattell, Allport, Eysenck) |M.Ed (Psychology of Learning and Development)|",
    "In this video, Theories of Personality (Cattell, Allport, Eysenck) |M.Ed (Psychology of Learning and Development)| by Anil Kashyap ..."
  ],
  [
    "Andreas Kleiner (ASU) - 24 Jun 2020",
    "Andreas Keliner (Arizona State University) Extreme points and majorization: Economic applications (joint with B. Moldovanu and ..."
  ],
  [
    "Ratchet Effect and Demonstration Effect # MALAYALAM EXPLANATION.",
    ""
  ],
  [
    "Light (OST) | BLANKTONE Studio | Game Soundtrack | HEARTLESS",
    "LIGHT is a music soundtrack composed by Blanktone Studio for Heartless. This video game was developed by COLAS ..."
  ],
  [
    "&quot;An Approximation to the Problem of Information Fusion in...&quot; Dr. Humberto Bustince (IJCCI 2018)",
    "Title: An Approximation to the Problem of Information Fusion in Fuzzy Classification Keynote Lecturer: Humberto Bustince ..."
  ],
  [
    "Lydia Bieri: Gravitational Wave Memory",
    "BHI Second Annual Conference, May 9-11, 2018."
  ],
  [
    "Computational Theory   Automata   Derivation Tree , Ambiguity",
    "Computational Theory Automata Derivation Tree , Ambiguity Dr. Radwan Batyha Irbid National University."
  ],
  [
    "Lebesgue Integration",
    "Note: Typo at 3:56 - Infimum is greatest lower bound, not the greatest upper bound! 0:00 Introduction 0:10 Lebesgue Integral Intro ..."
  ],
  [
    "PGMO days 2020 : Interactive Methods and Preference Elicitation",
    "Title: Interactive Methods and Preference Elicitation for Solving Hard Multi-Objective Combinatorial Optimization Problems Author: ..."
  ],
  [
    "Ep 05 - Semantics of Science (Discovering Religion)",
    "The fifth installment of my original series, \"Discovering Religion\". In this episode I address how certain words found in our ..."
  ],
  [
    "SHAPLEY VALUE IN UNANIMITY GAME",
    "Derivation of two expressions for the Shapley value in unanimity games (with and without Harsanyi dividends)"
  ],
  [
    "Thibault Damour - Analytical Approaches to Coalescing Binary Black Holes",
    "Talk at String-Math 2016 held at Collège de France, Jun27-Jul2, 2016. Event website: https://indico.cern.ch/event/375104 Enjoy!"
  ],
  [
    "Decision Making Under Uncertainty",
    "Douglas Gale, a professor of economics at New York University, speaks at the annual Robert Rosenthal Memorial Lecture on ..."
  ],
  [
    "Scitovsky paradox and Scitovsky double criterion",
    ""
  ],
  [
    "🌍 Climate change : challenges for reinsurers | Replay Reinsurance Hot Topics n°1",
    "Reinsurance Hot Topics aims to bring together recognised experts in our field to debate current topics and themes that impact the ..."
  ],
  [
    "Musique",
    ""
  ],
  [
    "Three Small Steps ... to Reconceiving Machine Learning",
    "I will show by way of three separate illustrations my work on my long term project of reconceiving machine learning. After a brief ..."
  ],
  [
    "PLENARY: Plenary Lecture: Real problems and beast machines - Anil Seth",
    "This plenary lecture took place on 10:20 - 11:20, Monday 12th April, during the BNA2021 Festival of Neuroscience, online ..."
  ],
  [
    "Why you should have your own black box | Matthew Syed | TEDxLondonBusinessSchool",
    "He makes the case for acknowledging failure and confronting our mistakes, a notion he refers to as “Black Box Thinking”. Matthew ..."
  ],
  [
    "ACCELERATOR THEORY OF INVESTMENT # MALAYALAM EXPLANATION.",
    "ACCELERATOR Theory of Investment in MALAYALAM."
  ],
  [
    "Cognitive Neuroscience Society (CNS) 2021 Meeting - Poster F58",
    "Poster narration of \"A causal test of competitive versus cooperative hippocampal-striatal dynamics in human memory\"."
  ],
  [
    "Mini-course on the Dirichlet space Part 1",
    "Thomas Ransford, Université Laval July 13th, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Favourite Authors 📚",
    ""
  ],
  [
    "Hicks Theory of Trade (Business) Cycle in Hindi",
    "This video discusses about the Hicks Theory of Trade/Business Cycle in detail. It would be advisable to study the following before ..."
  ],
  [
    "Sergiu Klainerman - Are Black Holes Real",
    "Sergiu Klainerman (Princeton University) - Are Black Holes Real."
  ],
  [
    "Gordon Belot: The Mach—Einstein Principle of 1917—1918",
    "Oxford Philosophy of Physics Seminar, Trinity Term 2021 20 May: Gordon Belot (Michigan, Ann Arbor) ..."
  ],
  [
    "Positivity aspects of Dirichlet series by Sameer Chavan (IIT K)",
    "In the first half of this talk, we discuss the space D[s] of finite Dirichlet series considered as a subspace of continuous functions on ..."
  ],
  [
    "(Unrated Easy Demon) Theory of Integral by Brink (Legit route)",
    "Over three years ago, I got my second Demon point from a backup bug from this level. For some reason or another, I found this ..."
  ],
  [
    "Session 7 - Information Processing and Climate Change",
    "CONFERENCE ON AMBIGUITY, UNCERTAINTY, AND CLIMATE CHANGE http://calclimate.wordpress.com Session 7 ..."
  ],
  [
    "New Theories of International Trade  || Kravis Theory of Availability",
    "Examines the availability approach to international trade, popularised by Irving B Kravis, which is an extension to Heckscher Ohlin ..."
  ],
  [
    "30 June 2020 - Gustav Holzegel",
    "The non-linear stability of the Schwarzschild family of black holes Abstract available on the seminar webpage: ..."
  ],
  [
    "The Game You Can Win, But Cannot Play, Part 3: The Banach-Mazur Game",
    "Works Cited Kenderov, P. S. “Banach-Mazur Game.” Encyclopedia of Mathematics ..."
  ],
  [
    "Modeling Individual Preferences",
    "In this CLM, Prof. Alexander Smith will give an introduction to Behavioral Economics and its applications/relations to System ..."
  ],
  [
    "[#1] Theory of Probability || Quantitative Techniques calicut university in Malayalam",
    "In this class we are discussed about theory of probability. What is random experiment, sample space, sample point and outcomes."
  ],
  [
    "Convex hull | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Convex_hull 00:01:04 1 Definitions 00:04:31 2 ..."
  ],
  [
    "Your Physics Library 3;  Relativity and Other Books",
    "I was asked why I did not discuss books on Relativity so I will say why and cover that topic a little. I will also introduce a few sundry ..."
  ],
  [
    "Black Box Theory",
    "Provided to YouTube by New State Entertainment Ltd Black Box Theory · EZ Riders Black Box Theory ℗ 2005 Stay Up Forever ..."
  ],
  [
    "Matthew Kennedy: Noncommutative convexity",
    "Talk by Matthew Kennedy in Global Noncommutative Geometry Seminar (Europe) ..."
  ],
  [
    "Michel Grabisch talks on &quot;Opinion dynamics in evolving networks&quot;",
    "Michel Grabisch (Université Paris 1 Panthéon-Sorbonne) talks on \"Opinion dynamics in evolving networks\" at SPiCy (Statistical ..."
  ],
  [
    "Shaw Prize in Mathematical Science 2019 - Feature",
    ""
  ],
  [
    "The Game You Can Win But Cannot Play, Part 2: Topology 101",
    "Works Cited Kenderov, P. S. “Banach-Mazur Game.” Encyclopedia of Mathematics ..."
  ],
  [
    "Business Cycles  Part-2 | Economics Crash Course | UGC NET 2021 Exam | Gradeup | Amit Chatterjee",
    "\"UGC NET: Watch this session on Business Cycles Part-2, for UGC NET Paper. In this session Gradeup expert, would cover ..."
  ],
  [
    "Actuarial Science | CS1 Paper A | Empirical Bayes Credibility Theory (EBCT)",
    "This lecture covers the topic of Empirical Bayes Credibility Theory (EBCT) for students preparing for Actuarial Science Exam CS1 ..."
  ],
  [
    "Alain Connes | Noncommutative Geometry, the Spectral Aspect",
    "11/23/2020 Math Science Literature Lecture Speaker: Alain Connes (Collège de France) Title: Noncommutative Geometry, the ..."
  ],
  [
    "FUZZY LINEAR PROGRAMMING | DR.P. CHANDRA KALA",
    "Fuzzy linear programming concepts with example."
  ],
  [
    "DA2PL&#39;2014 - Preference modeling with Choquet integral - Michel Grabisch",
    "DA2PL'2014 - Preference modeling with Choquet integral - Michel Grabisch - Ecole Centrale Paris - November 20-21, 2014 ..."
  ],
  [
    "Conference: Complexities of Time - Virginie Van Wassenhove",
    "Chair: Saw Vee-Liem Research fellow, School of Physical and Mathematical Sciences, Nanyang Technological University ..."
  ],
  [
    "ICMP Thematic Session 3 - General Relativity (b)",
    "Talks: \"High frequency limit for Einstein equation with U(1) symmetry\" by Cécile Huneau; \"Well-posed formulation of scalar-tensor ..."
  ],
  [
    "[4th GAF] Philippe LeFloch 01",
    "Recent advances on Einstein's constraint equations: asymptotic localization and gravitational singularities."
  ],
  [
    "Expected Utility 1",
    "GT-EU."
  ],
  [
    "KTU-MECHANICS- MODULE 4- PART 4- WEDGE FRICTION",
    "2015 SCHEME - MODULE 4 2019 SCHEME -MODULE 2 NOTE LINK- ..."
  ],
  [
    "Lydia Bieri: Gravitational Wave Memory",
    "BHI Second Annual Conference, May 9-11, 2018."
  ],
  [
    "List of contributors to general relativity | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: List of contributors to general relativity Listening is a more natural way of learning, ..."
  ],
  [
    "Stochastic Integration via Error-Correcting Codes",
    "Dimitris Achlioptas, UC Santa Cruz Random Instances and Phase Transitions ..."
  ],
  [
    "Integration and differentiation of fuzzy functions - Lecture 23 By Prof S Chakraverty",
    "Fuzzy Set Theory Lecture 23 By Prof S Chakraverty NIT Rourkela."
  ],
  [
    "Theories of Failure - 1 | Machine Design | Lec 1 | GATE ME 2021 Crash Course",
    "Click for free access to Educator's best classes: ..."
  ],
  [
    "The Weak Cosmic Censorship Conjecture: Status Report by Pau Figueras",
    "PROGRAM Nonperturbative and Numerical Approaches to Quantum Gravity, String Theory and Holography (ONLINE) ..."
  ],
  [
    "KIRCHHOFF&#39;S CURRENT LAW",
    ""
  ],
  [
    "Decision Making Under Uncertainty",
    "Douglas Gale, a professor of economics at New York University, speaks at the annual Robert Rosenthal Memorial Lecture on ..."
  ],
  [
    "🌍 Climate change : challenges for reinsurers | Replay Reinsurance Hot Topics n°1",
    "Reinsurance Hot Topics aims to bring together recognised experts in our field to debate current topics and themes that impact the ..."
  ],
  [
    "Sergiu Klainerman - Are Black Holes Real",
    "Sergiu Klainerman (Princeton University) - Are Black Holes Real."
  ],
  [
    "PLENARY: Plenary Lecture: Real problems and beast machines - Anil Seth",
    "This plenary lecture took place on 10:20 - 11:20, Monday 12th April, during the BNA2021 Festival of Neuroscience, online ..."
  ],
  [
    "Wicked Game  Chris Isaac by Tequila Rush",
    ""
  ],
  [
    "Lebesgue Integration",
    "Note: Typo at 3:56 - Infimum is greatest lower bound, not the greatest upper bound! 0:00 Introduction 0:10 Lebesgue Integral Intro ..."
  ],
  [
    "Daniel Choquet Society For Neuroscience 2018 Presidential Lecture",
    "The presidential Lecture of Daniel Choquet in San Diego at the 2018 Society for Neuroscience Meeting, introduced by Rick ..."
  ],
  [
    "The Kurzweil-Henstock Integral (K-H Integral)",
    ""
  ],
  [
    "Fuzzy measure theory",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Benoit Daniel (Paris 12) / Constain Mean Curvatrue Surfaces in Homogeneous Manifolds -4",
    "4th KIAS WORKSHOP ON DIFFERENTIAL GEOMETRY 2009-11-14."
  ],
  [
    "نظریه بازی-تصمیم",
    ""
  ],
  [
    "Interpretation of the Integral Problems 10-14",
    "This video is part of the Calculus Success Program found at www.calcsuccess.com Download the workbook and see how easy ..."
  ],
  [
    "Magical U  - Spiral Dynamics and Emotional Intelligence to kids",
    "We made this video to show people who understand and like Spiral Dynamics how Magical U can be used to help us on guiding ..."
  ],
  [
    "Momentum Batch - 11th  Physics :- L-06 - त्रुटि , Error -  by Ashish sir",
    "त्रुटि , Error अधिक जानकारी के लिए 9772416330 per Whatsaapp या Call करे link of our google play ..."
  ],
  [
    "Mini-course on the Dirichlet space Part 1",
    "Thomas Ransford, Université Laval July 13th, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Black Box Theory",
    "Provided to YouTube by New State Entertainment Ltd Black Box Theory · EZ Riders Black Box Theory ℗ 2005 Stay Up Forever ..."
  ],
  [
    "Three Small Steps ... to Reconceiving Machine Learning",
    "I will show by way of three separate illustrations my work on my long term project of reconceiving machine learning. After a brief ..."
  ],
  [
    "Session 7 - Information Processing and Climate Change",
    "CONFERENCE ON AMBIGUITY, UNCERTAINTY, AND CLIMATE CHANGE http://calclimate.wordpress.com Session 7 ..."
  ],
  [
    "Polish space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:52 1 Properties 00:03:55 2 ..."
  ],
  [
    "ICMP Thematic Session 3 - General Relativity (b)",
    "Talks: \"High frequency limit for Einstein equation with U(1) symmetry\" by Cécile Huneau; \"Well-posed formulation of scalar-tensor ..."
  ],
  [
    "Henry Markram at FENS Forum 2012",
    "A glimpse of Henry Markram's talk at FENS Forum 2012 in Barcelona."
  ],
  [
    "The Most Awaited NEET Crash course launching soon | Xylem NEET",
    "neetcrash #neetcrash2023 #neet2023 #xylemxpl NEET latest news today. ✨in this video NEET 2023 crash course. preparation ..."
  ],
  [
    "fuzzy-measure",
    "Upload CSVTU BE/BTECH Results To Get Exciting Offers ..."
  ],
  [
    "JEE 2023 - 100% Success in 1st attempt✍🏻 #shorts #eduniti #physics",
    "30 Days roadmap for 2023 1st attempt - https://www.youtube.com/watch?v=j_uHN4gXa60 👉 400 Most expected Physics ..."
  ],
  [
    "Your Physics Library 3;  Relativity and Other Books",
    "I was asked why I did not discuss books on Relativity so I will say why and cover that topic a little. I will also introduce a few sundry ..."
  ],
  [
    "Suslin space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:25 1 Properties 00:03:00 2 ..."
  ],
  [
    "BCS THEORY OF SUPERCONDUCTIVITY || COOPER PAIR || SOLID STATE PHYSICS || WITH EXAM NOTES ||",
    "LINK OF \" SILVER PLAY BUTTON UNBOXING \" VIDEO ..."
  ],
  [
    "Probability and Possibility",
    "E.th.ph. makes the first attempt at attacking the theory behind statistics - in this case represented by the concept of probability."
  ],
  [
    "XTREME MATH Episode 2. The Most Addicting Math Game Ever???",
    "In this video, I will introduce the Banach Mazur Game, a famous topological game that people played in the 1930s while drinking ..."
  ],
  [
    "Radon space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:17 1 Properties 00:02:44 2 ..."
  ],
  [
    "Ν. Λυγερός: e-Μάθημα: Theory of Relations, Posets and Ramsey. 14/08/2020",
    "Ν. Λυγερός: e-Μάθημα: Theory of Relations, Posets and Ramsey. 14/08/2020 https://lygeros.org/20200814-talks-3/ ..."
  ],
  [
    "Weiwei Cheng @ LWA 2011",
    "Learning Monotone Nonlinear Models using the Choquet Integral (LWA 2011) Slides available at: ..."
  ],
  [
    "Decay of waves in gravitational solitons",
    "Sharmila Gunasekaran Wednesday, September 21, 2022 2022-2023 Low Regularity Physics and Geometry Seminar ..."
  ],
  [
    "Shaw Prize in Mathematical Science 2019 - Feature",
    ""
  ],
  [
    "Introduction to Neuroscience 2: Lecture 19: More on Neural Control of Memory",
    ""
  ],
  [
    "Gustav Holzegel, Peter Hintz: Recent Progress in General Relativity",
    ""
  ],
  [
    "Preference Modeling with Context-Dependent Salient Features - Laura Balzano",
    "Seminar on Theoretical Machine Learning Topic: Preference Modeling with Context-Dependent Salient Features Speaker: Laura ..."
  ],
  [
    "Aritificial Intelligence and Systems Biology",
    "Aritificial Intelligence and Systems Biology, keynote lecture given by Andrei Zinovyev at TranSYS Online Training school: ..."
  ],
  [
    "Mitsuo Kawato - Towards Manipulative Neuroscience based on Brain-Network-Interface",
    "Mitsuo Kawato, ATR Computational Neuroscience Labs, Japan. Keynote lecture at Neuroinformatics 2008 in Stockholm, Sweden."
  ],
  [
    "Introduction to the post-Newtonian expansion of General (1 of 5)",
    "The Sound of Space-time: The Dawn of Gravitational Wave Science Speaker: - Luc Blanchet (IAP Paris, France) Introduction to ..."
  ],
  [
    "Daniel Calderón (University of Toronto)",
    "Title: Generic automorphisms of separable C*-algebras, pure states, and a problem of Naimark. Abstract: It is a result of Kishimoto, ..."
  ],
  [
    "GamesNet Webinar Series: Michel Grabisch",
    ""
  ],
  [
    "Andrey Zinovyev - Reduced Google Matrix approach for exploring biological networks",
    "https://indico.math.cnrs.fr/event/3475/attachments/2180/2566/Zinovyev_GoMaxSlides.pdf."
  ],
  [
    "Dayal Chakrabortty",
    "Hi, my name is Dayal Chakrabortty, teaching English literature and language for 10 years. 🤝Welcome to my channel Pegasus ..."
  ],
  [
    "Wicked Game",
    "Description."
  ],
  [
    "Tabletop Games",
    "Monopoly, ruining friendships since 1935 Check out my new card game 'Can't Catch Harry' ..."
  ],
  [
    "Alexander Kalmynin. C*-algebras and number fields. November 19, 2020",
    "Bost-Connes systems are special quantum statistical dynamical systems, which provide a surprising connection between ..."
  ],
  [
    "math stuff",
    ""
  ],
  [
    "&quot;The Economic Case for a Sustainable Recovery from COVID-19 Pandemic&quot; by Prof. P. Koundouri",
    "Recognizing the global sustainability challenges, European Union leaders have adopted the European Green Deal with ..."
  ],
  [
    "Debye-Huckel theory- for determination of Activity coefficient •Msc PHYSICAL CHEMISTRY • #Notes pdf",
    "Debye-Huckel theory # what is Debye-Huckel theory # postulate of Debye-Huckel theory # mathematical representation of ..."
  ],
  [
    "#Cattell&#39;s #16 PF Trait Theory || कैटल का शीलगुण सिद्धान्त ||",
    "Cattell's personality trait theory in hindi || कैटल का शीलगुण सिद्धान्त || Raymond cattell 16 personality factors ..."
  ],
  [
    "Justin Corvino: Constructing Initial Data for Einstein Equations 1",
    "Summer School »Between Geometry and Relativity«, Part 2: Justin Corvino: Constructing Initial Data for Einstein Equations 1 ..."
  ],
  [
    "Luc Blanchet: Theory of gravitational waves and approximation methods in general relativity",
    "CIRM VIRTUAL EVENT Recorded during the meeting \"Theory of Gravitation and Variation in Cosmology\" the April 15, 2021 by the ..."
  ],
  [
    "Charlo",
    ""
  ],
  [
    "ICMP 2021 Plenary Talk  9 - Peter Hintz",
    "Microlocal Analysis and Stability Problems in General Relativity."
  ],
  [
    "Justin Corvino: Constructing Initial Data for Einstein Equations 3",
    "Summer School »Between Geometry and Relativity«, Part 7: Justin Corvino: Constructing Initial Data for Einstein Equations 2 ..."
  ],
  [
    "Session 2:  Economics of Ambiguity and Ambiguity Aversion",
    "CONFERENCE ON AMBIGUITY, UNCERTAINTY, AND CLIMATE CHANGE http://calclimate.wordpress.com Session 2: ..."
  ],
  [
    "Computational Methods for Numerical Relativity, Part 4 - Frans Pretorius",
    "Computational Methods for Numerical Relativity, Part 4 Frans Pretorius Princeton University July 24, 2009."
  ],
  [
    "Fedcsis 22 Keynote Chris Cornelis",
    "Chris Cornelis Ghent University, Department of Applied Mathematics, Computer Science and Statistics Keynote title: Hybridization ..."
  ],
  [
    "Allen Fang | A new proof for the nonlinear stability of slowly-rotating Kerr-de Sitter",
    "General Relativity Seminar 12/8/2022 Speaker: Allen Fang (Princeton) Title: A new proof for the nonlinear stability of ..."
  ],
  [
    "कठोर दायित्व (Strict Liability) का सिद्धांत , आवश्यक शर्ते  kathor dayitva ka siddhant in hindi....",
    "Tort law all video अपकृत्य विधि ..."
  ],
  [
    "BMC/BAMC2015: Crystallization for systems with Coulomb and Riesz interactions (Prof. Sylvia Serfaty)",
    "Systems of particles with Coulomb, logarithmic and Riesz interactions arise in various settings: an instance is the classical ..."
  ],
  [
    "Hyperbolic geometry and the proof of Morrison-Kawamata... (Lecture - 03) by Misha Verbitsky",
    "20 March 2017 to 25 March 2017 VENUE: Ramanujan Lecture Hall, ICTS, Bengaluru Complex analytic geometry is a very broad ..."
  ],
  [
    "Particles of matter and physical. Change",
    "Particles model and physical change."
  ],
  [
    "Singularities and cosmic censorship in general relativity - Part 1 (Mihalis Dafermos)",
    "Lecture from the mini-series \"Infinities and Cosmology\" from the \"Philosophy of Cosmology\" project. A University of Oxford and ..."
  ],
  [
    "त्वरक का सिद्धांत , theory of accelerator , ugc net Economics, upsc ,up pgt,",
    "ECONOMICFORUPSC # Vishnueconomicsschool #NTANETECONOMICS Website www.vishnueconomicsschool.in NOTES AND ..."
  ],
  [
    "TRAIT THEORIES of PERSONALITY  - Allport, Cattell, Eysenck, Costa &amp; McCrae, Rosenman &amp; Friedman 2021",
    "powerwithinpsychology #psychologyentrance #psychologymagazine Website: https://www.powerwithinpsychology.com/ App ..."
  ],
  [
    "Women in Physics and Mathematics",
    "Professor Rohini Godbole, Centre for High Energy Physics, Indian Institute of Physics, Bangalore, India."
  ],
  [
    "Peter Hintz: Linear stability of slowly rotating Kerr spacetimes",
    "I describe joint work with Dietrich Häfner and András Vasy in which we study the asymptotic behavior of linearized gravitational ..."
  ],
  [
    "Chapter 21 — The Birth of Stars and Detecting Exoplanets",
    ""
  ],
  [
    "Prim&#39;s Algorithm for Minimum Spanning Trees - Design and Analysis of Algorithms",
    "In this video I present the minimum spanning tree problem and Prim's algorithm to solve it. I prove the cut property and use it to ..."
  ],
  [
    "Thibault Damour - Motion of Binary Black Holes (QM90)",
    "Invited talk at the Conference on 90 Years of Quantum Mechanics, Institute of Advanced Studies (IAS), Nanyang Technological ..."
  ],
  [
    "Lebesgue Integration Part 1 - The length function",
    "The Lebesgue Integral."
  ],
  [
    "AT5 - Conformal Dilaton Gravity and Related Issues - July 6",
    "AT5 - Conformal Dilaton Gravity and Related Issues - July 6."
  ],
  [
    "Session 3. Ronald R Yager: Fuzzy sets methods for constructing multi-criteria decision functions",
    "Title: Fuzzy sets methods for constructing multi-criteria decision functions: Mixing words and mathematics Abstract: The multiplicity ..."
  ],
  [
    "On Falling Into Black Holes - Mihalis Dafermos",
    "ABSTRACT The celebrated \"black hole\" spacetimes of Schwarzschild and Kerr play a central role in our current understanding of ..."
  ],
  [
    "Neuroscience Lecture 8",
    "States of mind, emotions."
  ],
  [
    "List of women in mathematics | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/List_of_women_in_mathematics 00:01:01 A 00:02:03 ..."
  ],
  [
    "Optogenetics: Illuminating the Path toward Causal Neuroscience",
    "The Warren Alpert Foundation Prize honors Edward Boyden, Karl Deisseroth, Peter Hegemann and Gero Miesenböck for the ..."
  ],
  [
    "Modern developments in General Relativity: Thibault Damour AND Daniel Kennefick",
    "Conference web page: http://grkcl.org Thibault Damour, Gravitational Waves from Coalescing Black Holes Daniel Kennefick, ..."
  ],
  [
    "Jonathan Luk - High-frequency limit in general relativity and a conjecture of Burnett",
    "This talk was part of the of the online workshop on \"Mathematical Perspectives of Gravitation beyond the Vacuum Regime\" held ..."
  ],
  [
    "Microscopic description of Coulomb-type systems - Sylvia Serfaty",
    "Stony Brook Mathematics Colloquium October 20, 2016 Sylvia Serfaty, NYU Microscopic description of Coulomb-type systems We ..."
  ],
  [
    "The Einstein Equations and Gravitational Radiation | Lydia Bieri",
    ""
  ],
  [
    "Sohrab Shahshahani - The hard phase fluid with free boundary in relativity",
    "This talk was part of the Workshop on \"Mathematical Perspectives of Gravitation beyond the Vacuum Regime\" held at the ESI ..."
  ],
  [
    "Business Cycle Trade Cycle theory in hindi Hayek हायक का व्यापार चक्र अति-निवेश का सिद्धांत",
    "Trade Cycle theory by Hayek over investment theory of Business Cycle over investment theory of trade cycle business cycle ..."
  ],
  [
    "2021.01.14 Thomas Leblé and Sylvia Serfaty.  Coulomb gases",
    ""
  ],
  [
    "The non-commutative analytic Toeplitz algebra and free semigroup algebras",
    "Ken Davidson, University of Waterloo November 26th, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Bob Williamson: Beyond Expectations &amp; Better than Average: Foundations of ML Systems",
    "Bob Williamson is Professor for \"Foundations of Machine Learning Systems\" at the University of Tübingen. This talk was part of the ..."
  ],
  [
    "Trade Cycle theory : Hawtrey हाट्रे का व्यापार चक्र सिद्धांत, Pure Monetary theory of Business Cycle",
    "Pure monetary theory of trade cycle , trade cycle chori by Hawtrey Statistics MCQ ..."
  ],
  [
    "Hawtrey&#39;s Theory of Trade Cycle | Macro Economics |",
    "Do visit my blog for the notes of various concepts in economics. 📚📚📚 Reference: Palmer, G. F. D. (1951). The trade cycle ..."
  ],
  [
    "Justin Corvino: Constructing Initial Data for Einstein Equations 1",
    "Summer School »Between Geometry and Relativity«, Part 2: Justin Corvino: Constructing Initial Data for Einstein Equations 1 ..."
  ],
  [
    "Chapter 21 — The Birth of Stars and Detecting Exoplanets",
    ""
  ],
  [
    "Women in Physics and Mathematics",
    "Professor Rohini Godbole, Centre for High Energy Physics, Indian Institute of Physics, Bangalore, India."
  ],
  [
    "Peter Hintz: Linear stability of slowly rotating Kerr spacetimes",
    "I describe joint work with Dietrich Häfner and András Vasy in which we study the asymptotic behavior of linearized gravitational ..."
  ],
  [
    "Modern developments in General Relativity: Thibault Damour AND Daniel Kennefick",
    "Conference web page: http://grkcl.org Thibault Damour, Gravitational Waves from Coalescing Black Holes Daniel Kennefick, ..."
  ],
  [
    "Lebesgue Integration Part 1 - The length function",
    "The Lebesgue Integral."
  ],
  [
    "Justin Corvino: Constructing Initial Data for Einstein Equations 3",
    "Summer School »Between Geometry and Relativity«, Part 7: Justin Corvino: Constructing Initial Data for Einstein Equations 2 ..."
  ],
  [
    "BMC/BAMC2015: Crystallization for systems with Coulomb and Riesz interactions (Prof. Sylvia Serfaty)",
    "Systems of particles with Coulomb, logarithmic and Riesz interactions arise in various settings: an instance is the classical ..."
  ],
  [
    "Stochastic climate models with Lévy noise by Michael Hoegele (Part 1)",
    "ORGANIZERS: Amit Apte, Soumitro Banerjee, Pranay Goel, Partha Guha, Neelima Gupte, Govindan Rangarajan and Somdatta ..."
  ],
  [
    "List of contributors to general relativity | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: List of contributors to general relativity Listening is a more natural way of learning, ..."
  ],
  [
    "Cell Mechanics",
    "Jeffrey Fredberg, Harvard GEM4 Summer School."
  ],
  [
    "Oral Session 2",
    "NIPS Award Session On Decomposing the Proximal Map - The proximal map is the key step in gradient-type algorithms, which ..."
  ],
  [
    "Microscopic description of Coulomb-type systems - Sylvia Serfaty",
    "Stony Brook Mathematics Colloquium October 20, 2016 Sylvia Serfaty, NYU Microscopic description of Coulomb-type systems We ..."
  ],
  [
    "[4th GAF] Philippe LeFloch 01",
    "Recent advances on Einstein's constraint equations: asymptotic localization and gravitational singularities."
  ],
  [
    "Vincent Moncrief - Reflections on U(1) Invariant Einsteinian Universes",
    "Vincent Moncrief (Dpt of Physics and Mathematics, Yale University) - Reflections on U(1) Invariant Einsteinian Universes."
  ],
  [
    "Prim&#39;s Algorithm for Minimum Spanning Trees - Design and Analysis of Algorithms",
    "In this video I present the minimum spanning tree problem and Prim's algorithm to solve it. I prove the cut property and use it to ..."
  ],
  [
    "Wicked Game  Chris Isaac by Tequila Rush",
    ""
  ],
  [
    "New welfare economics / kaldor - hicks criterion / scitovsky paradox",
    ""
  ],
  [
    "Piotr Chrusciel - The Many Ways of the Characteristic Cauchy Problem",
    "Piotr Chrusciel (University of Vienna) - The Many Ways of the Characteristic Cauchy Problem."
  ],
  [
    "Prof. L. Le Marrec. A discrete application of a continuum model",
    "Title: A discrete application of a continuum model: Riemann-Cartan geometry with uniform torsion density to mimic the wave ..."
  ],
  [
    "[TechTalks 4.0] : Decision Making in Fuzzy Environment with Prof. Ioan Dzitac",
    "Techno India NJR | [TechTalks 4.0] : Decision Making in Fuzzy Environment with Prof. Ioan Dzitac Event Name: TechTalks 4.0 ..."
  ],
  [
    "INCF - Neuroinformatics congress",
    ""
  ],
  [
    "Constraint manifolds with the dominant energy condition | Lan-Hsuan Huang",
    ""
  ],
  [
    "Cryo-EM and development of ketamine-based antidepressants",
    "Presented By: Dr.Shujia Zhu Speaker Biography: Dr.Shujia Zhu graduated from École Normale Supérieure de Paris (France) and ..."
  ],
  [
    "Magical U  - Spiral Dynamics and Emotional Intelligence to kids",
    "We made this video to show people who understand and like Spiral Dynamics how Magical U can be used to help us on guiding ..."
  ],
  [
    "Polish space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:52 1 Properties 00:03:55 2 ..."
  ],
  [
    "SIPTA Seminar by Fabio Cozman: Dealing with Uncertain Arguments in Artificial Intelligence",
    "ABSTRACT: Argumentation techniques have received significant attention in Artificial Intelligence, particularly since 1995, when ..."
  ],
  [
    "Edinburgh Neuroscience Christmas Lecture 2020",
    "Live streamed on 8 Dec 2020, 1800-1900 (UK time) The executive brain: Why concepts matter with Dr Thomas Bak, Human ..."
  ],
  [
    "Interpretation of the Integral Problems 10-14",
    "This video is part of the Calculus Success Program found at www.calcsuccess.com Download the workbook and see how easy ..."
  ],
  [
    "Tilmann Gneiting: Isotonic Distributional Regression (IDR) - Leveraging Monotonicity, Uniquely So!",
    "CIRM VIRTUAL EVENT Recorded during the meeting \"Mathematical Methods of Modern Statistics 2\" the June 02, 2020 by the ..."
  ],
  [
    "Rational multipliers",
    "Speaker: Eli Shamovich, Ben-Gurion University of the Negev Event: The 48th Canadian Operator Symposium, ..."
  ],
  [
    "Bob Williamson: Beyond Expectations &amp; Better than Average: Foundations of ML Systems",
    "Bob Williamson is Professor for \"Foundations of Machine Learning Systems\" at the University of Tübingen. This talk was part of the ..."
  ],
  [
    "Radon space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:17 1 Properties 00:02:44 2 ..."
  ],
  [
    "Suslin space | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Polish_space 00:01:25 1 Properties 00:03:00 2 ..."
  ],
  [
    "Daniell integral",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Huaxin Lin: &quot;Non-unital Simple Z-absorbing C*-algebras&quot;",
    "Actions of Tensor Categories on C*-algebras 2021 \"Non-unital Simple Z-absorbing C*-algebras\" Huaxin Lin - University of ..."
  ],
  [
    "Mihalis DAFERMOS - The stability of the Kerr Cauchy horizon...",
    "The stability of the Kerr Cauchy horizon and the strong cosmic censorship conjecture in general relativity I will discuss recent work ..."
  ],
  [
    "20/11/2015 - Richard Schoen - Localizing Solutions of the Einstein Equations",
    "Abstract. In general it is not possible to localize solutions of the Einstein equations since there are asymptotic conserved quantities ..."
  ],
  [
    "Life and Contributions of Prof C R Rao || By Prof (Dr.) Amarendra Mishra",
    "Life and Contributions of Dr.C.R.Rao || 100th Birth Anniversary of Living Lengend || By Prof (Dr.) Amarendra Mishra Professor (Dr.) ..."
  ],
  [
    "XTREME MATH Episode 2. The Most Addicting Math Game Ever???",
    "In this video, I will introduce the Banach Mazur Game, a famous topological game that people played in the 1930s while drinking ..."
  ],
  [
    "Arthur Van Camp - Choice Functions as a Tool to Model Uncertainty",
    "Arthur Van Camp Carnegie Mellon and Ghent University November 27, 2018 at Rutgers Foundations of Probability Choice ..."
  ],
  [
    "sackur tetrode equation derivation",
    "sackur tetrode equation sackur tetrode equation derivation sackur tetrode equation statistical mechanics full chapter 👇 Statistical ..."
  ],
  [
    "Henry Markram at FENS Forum 2012",
    "A glimpse of Henry Markram's talk at FENS Forum 2012 in Barcelona."
  ],
  [
    "NACFC 2020 | S09: CFTR-Directed Therapy Experiences in Animal Models",
    "This symposium will provide a broad overview of available cystic fibrosis animal models with focus on specific contributions ..."
  ],
  [
    "Vincent Lam (Geneva): Perspectives from GR and QG on laws of nature and causation",
    "Geneva, 20 December 2017 Full title: Perspectives from general relativity and quantum gravity on laws of nature and causation ..."
  ],
  [
    "Stanley Center Primer: Ralda Nehme and Matt Tegtmeyer (2019)",
    "09/26/2019 Broad Institute Stanley Center Primer: ..."
  ],
  [
    "Famous Mathematicians From France 📌",
    "List of notable or famous mathematicians from France, with bios and photos, including the top mathematicians born in France and ..."
  ],
  [
    "Desensitized AMPA Receptors Escape the Synapse to Accelerate Recovery from Depression",
    "AMPA receptors mediate the majority of fast synaptic transmission but their rapid desensitization upon consecutive stimulations ..."
  ],
  [
    "Chris Isaak - Wicked game (cover by Maxim Brovkin)",
    "Шедевр в моем исполнении."
  ],
  [
    "Académie Royale des Sciences | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/French_Academy_of_Sciences 00:00:35 1 History ..."
  ],
  [
    "11/3/16 Info-Metric State of Research: Past, Present, Future Panel 4",
    "AUs Department of Economics: https://www.american.edu/cas/economics/"
  ],
  [
    "Oral Session 2",
    "NIPS Award Session On Decomposing the Proximal Map - The proximal map is the key step in gradient-type algorithms, which ..."
  ],
  [
    "Vincent Moncrief - Reflections on U(1) Invariant Einsteinian Universes",
    "Vincent Moncrief (Dpt of Physics and Mathematics, Yale University) - Reflections on U(1) Invariant Einsteinian Universes."
  ],
  [
    "Justin Corvino: Constructing Initial Data for Einstein Equations 2",
    "Summer School »Between Geometry and Relativity«, Part 3: Justin Corvino: Constructing Initial Data for Einstein Equations 2 ..."
  ],
  [
    "sackur tetrode equation derivation",
    "sackur tetrode equation sackur tetrode equation derivation sackur tetrode equation statistical mechanics full chapter 👇 Statistical ..."
  ],
  [
    "Spectacle &quot;Terres Arbitraires et Illumination(s)&quot;.",
    "Jusqu'au 3 juin 2012 à l'épée de bois (Cartoucherie Vincennes). Du mardi au samedi inclus à 21h et le dimanche à 18h."
  ],
  [
    "Logo Logic: Neuroscience 2021",
    "SfN President Barry Everitt and SfN Senior Marketing and Creative Services Manager Amit Kumar discuss the scientific research ..."
  ],
  [
    "Some aspects of research on the gender gap in science by social scientists",
    "Some aspects of research on the gender gap in science by social scientists Speaker: Catherine Jami (UMR Chine, Corée, Japon ..."
  ],
  [
    "NACFC 2020 | S09: CFTR-Directed Therapy Experiences in Animal Models",
    "This symposium will provide a broad overview of available cystic fibrosis animal models with focus on specific contributions ..."
  ],
  [
    "African Neuroscience: Current Status and Prospects",
    "Date: Friday, 17 July 2020 Abstract: Understanding the function and dysfunction of the brain remains one of the key challenges of ..."
  ],
  [
    "Cryo-EM and development of ketamine-based antidepressants",
    "Presented By: Dr.Shujia Zhu Speaker Biography: Dr.Shujia Zhu graduated from École Normale Supérieure de Paris (France) and ..."
  ],
  [
    "Sensor-Fused Fuzzy Integral 2nd Order Variable Structure Control",
    "Sensor-Fused Fuzzy Integral 2nd Order Variable Structure Control for Partially Known Nonlinear Dynamic Systems and ..."
  ],
  [
    "Constraint manifolds with the dominant energy condition | Lan-Hsuan Huang",
    ""
  ],
  [
    "The Kurzweil Henstock Gauge Integral",
    "In this video, I present an integral that is even better than Riemann and Lebesgue combined: Ladies and gentlement, I present ..."
  ],
  [
    "The Prof performs Wicked Game at the Living Arts Centre",
    "The Prof performs cover song, Wicked Game with Andy Pacheco on electric guitar, Mr. Williams on 2nd guitar and Juan Santos on ..."
  ],
  [
    "Society for Neuroscience (SfN 2018)",
    "UC Santa Barbara labs of Barry Giesbrecht, Scott Grafton, Emily Jacobs, and Michael Miller attend SfN 2018 in San Diego."
  ],
  [
    "Uniformly tracially complete C*-algebras",
    "Speaker: Aaron Tikuisis, University of Ottawa Event: The 48th Canadian Operator Symposium ..."
  ],
  [
    "Stanley Center Primer: Ralda Nehme and Matt Tegtmeyer (2019)",
    "09/26/2019 Broad Institute Stanley Center Primer: ..."
  ],
  [
    "Piotr Chrusciel - The Many Ways of the Characteristic Cauchy Problem",
    "Piotr Chrusciel (University of Vienna) - The Many Ways of the Characteristic Cauchy Problem."
  ],
  [
    "SIPTA Seminar by Fabio Cozman: Dealing with Uncertain Arguments in Artificial Intelligence",
    "ABSTRACT: Argumentation techniques have received significant attention in Artificial Intelligence, particularly since 1995, when ..."
  ],
  [
    "A stochastic program to evaluate disruption mitigation investments in the supply chain",
    "The Japanese earthquake, subsequent tsunami and the September 11 attacks in 2001 are just some of the major disruptions that ..."
  ],
  [
    "COMMENT TIRER?",
    "Salut j'ai 11 ans et je joue au basketball."
  ],
  [
    "Cécile Huneau - Global existence for a system of wave equations on a product space - IPAM at UCLA",
    "Recorded 27 October 2021. Cécile Huneau of the Ecole Polytechnique presents \"Global existence for a system of wave equations ..."
  ],
  [
    "Vincent Lam (Geneva): Perspectives from GR and QG on laws of nature and causation",
    "Geneva, 20 December 2017 Full title: Perspectives from general relativity and quantum gravity on laws of nature and causation ..."
  ],
  [
    "Part II/IV Experimentalists meet theoreticians 2007 (org. D. Holcman)",
    "Calcium signaling in neuronal and photoreceptor microdomains. M. Segal(WIS) U. Ashery(TAU) B. Minke(HU) Theory of diffusion ..."
  ],
  [
    "2014 Workshop POP presentations (Monday PM)",
    "Short presentations by attendees of the 2014 Sagan Summer Workshop on Imaging Planets and Disks. Slides of the ..."
  ],
  [
    "Mike Hawrylycz - Neuroinformatics and digital atlases of the Allen Institute [...] (2014)",
    "Workshop lecture at Neuroinformatics 2014 in Leiden, The Netherlands. Workshop title: The neuroinformatics of neuroanatomy ..."
  ],
  [
    "Wicked game cover",
    "I)$87."
  ],
  [
    "Aula 1 (Parte 1) -  Introdução ao tema;  Conceituação das formas - Helayel",
    "Geometria Diferencial Formas Diferenciais (2013) Física (Pós-Graduação) I - CBPF Conceitos abordados: -Tensores (abordagem ..."
  ],
  [
    "CSEB Webinar - Big Questions in Cancer Epidemiology: &#39;Confounding&#39; Our Future (Dr. Margaret Spitz)",
    "Canadian Society for Epidemiology and Biostatistics (CSEB) Webinar: \"Big Questions in Cancer Epidemiology: 'Confounding' Our ..."
  ],
  [
    "JEE Main 2023 - 8 to 12 Marks🔥 ये Playlist Miss मत करना #shorts #eduniti #physics",
    "Experiments & Instruments Playlist - https://bit.ly/3WHmAxZ Important experiments in jee main physics all instruments in physics ..."
  ],
  [
    "Caller Proposes Way Men Can Help Women After Roe v Wade Is Overturned",
    "Watch the Majority Report live Monday – Friday at 12 p.m. EST at http://www.youtube.com/SamSeder or listen via daily podcast at ..."
  ],
  [
    "BHI Philosophy Forum, October 25th, 2021: Martin Lesourd (BHI)",
    ""
  ],
  [
    "The Cuntz semigroup of the tensor product C*-algebras",
    "Speaker: Cristian Ivanescu, MacEwan University Event: The 48th Canadian Operator Symposium ..."
  ],
  [
    "Serenade (For the left hand) | Piano | John Thompson’s Easiest Piano Course Part 2",
    "Previous Video: ▶️ Next Video: Thank you for watching and don't forget to hit SUBSCRIBE, Like, Share and add this video to ..."
  ],
  [
    "Probability and Plausibility",
    ""
  ],
  [
    "Wojciech Kamiński (University of Warsaw): Conformal Einstein’s equations",
    "Wojciech Kamiński (University of Warsaw). Conformal Einstein's equations. Vanishing of the Fefferman-Graham obstruction tensor ..."
  ],
  [
    "La mauvaise foi des scientifiques athées (Stephen Hawking) with subtitles",
    "On ne peut que remercier E.Klein qui ici reste neutre et ne prends pas parti, pour son honnêteté et sa rationalité."
  ],
  [
    "Mark Machina - Choice under Uncertainty: New Models and Challenges",
    "Mark Machina - Choice under Uncertainty: New Models and Challenges."
  ],
  [
    "Olivier Sarbach - Phase space mixing in an external gravitational potential",
    "This talk was part of the of the online workshop on \"Mathematical Perspectives of Gravitation beyond the Vacuum Regime\" held ..."
  ],
  [
    "Kya Ladkiya Maths Mein Kamzor Hoti Hain?",
    "ऐसा क्यों माना जाता है कि लड़कियाँ maths और science में कमज़ोर होती हैं?"
  ],
  [
    "Pfeffer integral",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Lydia BIERI - The Einstein Equations and  Gravitational Radiation",
    "In Mathematical General Relativity (GR) the Einstein equations describe the laws of the universe. This system of hyperbolic ..."
  ],
  [
    "Concert Rebirth avec Constance 2   septembre 2011",
    ""
  ],
  [
    "प्रतिबल विकृति हुक का नियम प्रत्यास्थता गुणांक |ठोंसो के यांत्रिक गुण| 11th |Physics |Chap 9 |Part 2",
    "प्रतिबल, प्रतिबल के प्रकार, विकृति, हुक का नियम, प्रत्यास्थता गुणांक ..."
  ],
  [
    "Practice your English",
    ""
  ],
  [
    "Co Operators General Insurance",
    ""
  ],
  [
    "[PPT] Neuroscience (Interdisciplinary) #2 - The Chemistry &amp; Physics of Neural Cells",
    "Powerpoint File (before edited timings) for the video: Neuroscience (Interdisciplinary) #2 - The Chemistry & Physics of Neural ..."
  ],
  [
    "Almgren–Pitts min-max theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Almgren%E2%80%93Pitts_min-max_theory ..."
  ],
  [
    "ERS Program 1386: High Contrast Imaging of Exoplanets with JWST",
    "STScI webinar by Sasha Hinkley on “High Contrast Imaging of Exoplanets and Exoplanetary Systems with JWST\" (ERS Program ..."
  ],
  [
    "Concert Rebirth avec Constance 2   septembre 2011",
    ""
  ],
  [
    "Pfeffer integral",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "JWST observes Earendel - the most distant star known - 12.8 billion ly away | Night Sky News Sep &#39;22",
    "For Physics & Chemistry experiments for kids delivered to your door head to https://melscience.com/sBIs/ and use promo code ..."
  ],
  [
    "Co Operators General Insurance",
    ""
  ],
  [
    "Practice your English",
    ""
  ],
  [
    "[PPT] Neuroscience (Interdisciplinary) #2 - The Chemistry &amp; Physics of Neural Cells",
    "Powerpoint File (before edited timings) for the video: Neuroscience (Interdisciplinary) #2 - The Chemistry & Physics of Neural ..."
  ],
  [
    "20. III BSc 5th Sem -MODERN PHYSICS -Superconductivity, Type  I &amp; II  Superconductors &amp; Applications",
    "20. III BSc 5th Sem - MODERN PHYSICS -Superconductivity, Type I & II Superconductors & Applications."
  ],
  [
    "Mechanical signals in development - Lecture 2 by Olivier Hamant",
    "ORGANIZERS : Vidyanand Nanjundiah and Olivier Rivoire DATE & TIME : 16 April 2018 to 26 April 2018 VENUE : Ramanujan ..."
  ],
  [
    "ERS Program 1386: High Contrast Imaging of Exoplanets with JWST",
    "STScI webinar by Sasha Hinkley on “High Contrast Imaging of Exoplanets and Exoplanetary Systems with JWST\" (ERS Program ..."
  ],
  [
    "Concert Rebirth avec Constance 3   septembre 2011",
    ""
  ],
  [
    "Bernhard Schmelzer - Joint distributions of random sets and copulas",
    "In this talk it will be presented how the joint distribution of random sets can be characterized by multivariate set functions."
  ],
  [
    "Probability and Plausibility",
    ""
  ],
  [
    "fuzzy logic in artificial intelligence in hindi | introduction to fuzzy logic example | #28",
    "fuzzy logic in artificial intelligence in hindi | fuzzy logic example | #28 Fuzzy Logic (FL) is a method of reasoning that resembles ..."
  ],
  [
    "Marius nouvel EP &quot;ça tourne&quot;",
    "Marius guitare voix Etienne choquet guitare et très Darcy Gomez basse Ghislain Rivera batterie Enregistré par Jacques Hermet et ..."
  ],
  [
    "Science of Thought | Caroline Leaf | TEDxOaksChristianSchool",
    "Dr. Caroline Leaf describes her \"Science of Thought\" process and how she developed tools and processes that help people ..."
  ],
  [
    "What is TTT Diagram ? | Rajeev Singh | GATE 2023",
    "In this session, Educator Rajeev Singh will be discussing What is TTT Diagram Call Rajeev Singh's team on 7825860216 and ..."
  ],
  [
    "SLS 2014 - 03 - Yue Zhang",
    "Video lecture from the 39th Spring Lecture Series \"Multiparameter Geometry and Analysis\" Invited Speaker, Yue Zhang (Texas ..."
  ],
  [
    "Amateur plays Rachmaninov - Prelude in C# Minor (Self-Taught Pianist)",
    "My name is Chris Vajanyi, and I've been playing classical piano, self-taught for a little over 3 years. I've never used or read any ..."
  ],
  [
    "WELDING TRAINER -- International conference on VWTS - VIRTUAL WELDING TRAINING SYSTEMS",
    "During the conference WELDING TRAINER 2010, more than 80 experts from five continents discussed the use of VIRTUAL ..."
  ],
  [
    "Lecture Series: Prof. Thomas Schwarz NCMLS",
    "Date: 10 April 2013 Time: 16:00 - 18:00 hrs. including drinks Location: Figdor Lecture Theatre, 8th floor NCMLS Building, Geert ..."
  ],
  [
    "Fuzzy Logic: An Introduction",
    "This video introduces fuzzy logic, including the basics of fuzzy sets, fuzzy rules and how these are combined in decision making."
  ],
  [
    "Almgren–Pitts min-max theory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Almgren%E2%80%93Pitts_min-max_theory ..."
  ],
  [
    "Concert Rebirth avec Constance 1   septembre 2011",
    ""
  ],
  [
    "Jonathan Luk: Singularities in general relativity",
    ""
  ],
  [
    "F04 / 4: 4.6.2 Prims algoritm (nivå 3)",
    ""
  ],
  [
    "વિવેક ધૈર્યાશ્રય ભાગ ૧ Vivek Dheryashray Part 1 | Shreenathji Yamunaji Mahaprabhuji",
    "વિવેક ધૈર્યાશ્રય ભાગ ૧ Vivek Dheryashray Part 1 | Shreenathji Yamunaji Mahaprabhuji."
  ],
  [
    "संघट्ट के प्रकार TYPES OF COLLISION ||प्रत्यास्थ टक्कर||अप्रत्यास्थ टक्कर||पूर्णत: अप्रत्यास्थ टक्कर",
    "vyutpatti welcomes you all. About this video - टक्कर के प्रकार दिशा के आधार पर On the basis of direction ..."
  ],
  [
    "Viktor Jirsa - The Virtual Brain: a simulator of large-scale brain network dynamics (2014)",
    "Keynote lecture at Neuroinformatics 2014 in Leiden, The Netherlands Viktor Jirsa, Inserm at Aix-Marseille University, Marseille, ..."
  ],
  [
    "Reflection methods for user-friendly submodular optimization",
    "Recently, it has become evident that submodularity naturally captures widely occurring concepts in machine learning, signal ..."
  ],
  [
    "Your Subconscious Mind - Black Box Analogy - Real Life Example",
    "Your Subconscious Mind - Black Box Analogy The subconscious mind is like a black box. You give it inputs, and you get ..."
  ],
  [
    "Lebesgue Integral Overview",
    "In this video, I present an overview (without proofs) of the Lebesgue integral, which is a more general way of integrating a function."
  ],
  [
    "Lecture 19, Submodular Functions, Optimization, &amp; Applications to Machine Learning",
    "Submodular Functions, Optimization, and Applications to Machine Learning Lecture 19 June 4th, 2014 Prof. Jeff Bilmes ..."
  ],
  [
    "Towards more women scientists at IHES",
    "The 2021 Friends of IHES Gala was dedicated to Women in Fundamental Research. In this video, we hear the voices of women ..."
  ],
  [
    "#04 - Effondrement : nos sociétés vont-elles s&#39;effondrer ? Yves Cochet (Ex-ministre de l&#39;Écologie)",
    "Nos sociétés mondialisées peuvent-elles s'effondrer ? Biodiversité, réchauffement climatique, pénurie des ressources : partout ..."
  ],
  [
    "गोबर गैस प्लांट Best Model, सब्सिडी और लगाने की पूरी जानकारी दी पूसा वैज्ञानिक डॉ. डबास  ने",
    "गोबर गैस प्लांट का कौन सा मॉडल लगाएं, बायोगैस प्लांट के मॉडल लगाने की ..."
  ],
  [
    "The exposome and cancer risk in the EPIC cohort – Results from recent metabolomics studies",
    "Pan-Cohort metabolomics – The future of population health Virtual event 2nd February 2020 The exposome and cancer risk in the ..."
  ],
  [
    "Production Technology 02 | TTT Diagrams (Materials) | ME | GATE Crash Course",
    "Check Our Mechanical Engineering Crash Course Batch: https://bit.ly/GATE_CC_Mechanical 🛑 Check Our Mechanical ..."
  ],
  [
    "(IEEE BDA Tutorial Series) Cyber-Physical Data Analytics to Enable Resilient  Electric Grid",
    "Anurag K Srivastava (Washington State University) Interested audience can register for the real-time talks with Q&A by clicking the ..."
  ],
  [
    "प्रतिबल विकृति हुक का नियम प्रत्यास्थता गुणांक |ठोंसो के यांत्रिक गुण| 11th |Physics |Chap 9 |Part 2",
    "प्रतिबल, प्रतिबल के प्रकार, विकृति, हुक का नियम, प्रत्यास्थता गुणांक ..."
  ],
  [
    "Baire category theorem | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Baire_category_theorem 00:00:21 1 Statement of the ..."
  ],
  [
    "Simplification of Algebraic Fractions Introduction",
    "Simplification of Algebraic Fractions Introduction."
  ],
  [
    "Jim Isenberg - The Conformal Method and Solutions of the Einstein Constraint Equation",
    "Jim Isenberg (University of Oregon) - The Conformal Method and Solutions of the Einstein Constraint Equation : Success, and ..."
  ],
  [
    "Vspeak italiano+Multiplex Royal Evo16",
    "Dimostrazione pratica del funzionamento del modulo voce Vspeak applicato al trasmettitore Royal Evo 16."
  ],
  [
    "DA2PL&#39;2014 - Learning and Indentifying Monotone Boolean Functions - Endre Boros",
    "Presentation of Endre Boros at the DA2PL'2014 workshop (Ecole Centrale Paris, Nov. 20-21, 2014) on Learning and Indentifying ..."
  ],
  [
    "Lecture 18, Submodular Functions, Optimization, &amp; Applications to Machine Learning",
    "Submodular Functions, Optimization, and Applications to Machine Learning Lecture 18 June 2nd, 2014 Prof. Jeff Bilmes ..."
  ],
  [
    "The Kurzweil Henstock Gauge Integral",
    "In this video, I present an integral that is even better than Riemann and Lebesgue combined: Ladies and gentlement, I present ..."
  ],
  [
    "YTTV",
    ""
  ],
  [
    "KIRCHHOFF&#39;S VOLTAGE LAW IN HINDI | SOLVED PROBLEMS OF KVL (PART-5)",
    "Visit Maths Channel : @TIKLESACADEMYOFMATHS TODAY WE WILL STUDY KIRCHHOFF'S VOLTAGE LAW PROBLEM NO.5 ..."
  ],
  [
    "Convex set",
    "In Euclidean space, an object is convex if for every pair of points within the object, every point on the straight line segment that ..."
  ],
  [
    "Basket-adresse et travail du shoot",
    ""
  ],
  [
    "Reflection methods for user-friendly submodular optimization",
    "Recently, it has become evident that submodularity naturally captures widely occurring concepts in machine learning, signal ..."
  ],
  [
    "Towards more women scientists at IHES",
    "The 2021 Friends of IHES Gala was dedicated to Women in Fundamental Research. In this video, we hear the voices of women ..."
  ],
  [
    "Lecture 19, Submodular Functions, Optimization, &amp; Applications to Machine Learning",
    "Submodular Functions, Optimization, and Applications to Machine Learning Lecture 19 June 4th, 2014 Prof. Jeff Bilmes ..."
  ],
  [
    "The exposome and cancer risk in the EPIC cohort – Results from recent metabolomics studies",
    "Pan-Cohort metabolomics – The future of population health Virtual event 2nd February 2020 The exposome and cancer risk in the ..."
  ],
  [
    "Combinatorial Geometry Part 1: Convex Sets and Convex Hulls",
    "Follow me on twitter @abourquemath A definition video."
  ],
  [
    "Baire category theorem | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Baire_category_theorem 00:00:21 1 Statement of the ..."
  ],
  [
    "Postsynaptic interactome profiles &amp; Complex brain disorders",
    "Marcelo P. Coba, University of Southern California, USA will presents his Nature Neuroscience paper: Spatiotemporal profile of ..."
  ],
  [
    "Simplification of Algebraic Fractions Introduction",
    "Simplification of Algebraic Fractions Introduction."
  ],
  [
    "Jim Isenberg - The Conformal Method and Solutions of the Einstein Constraint Equation",
    "Jim Isenberg (University of Oregon) - The Conformal Method and Solutions of the Einstein Constraint Equation : Success, and ..."
  ],
  [
    "Vspeak italiano+Multiplex Royal Evo16",
    "Dimostrazione pratica del funzionamento del modulo voce Vspeak applicato al trasmettitore Royal Evo 16."
  ],
  [
    "The Kurzweil Henstock Gauge Integral",
    "In this video, I present an integral that is even better than Riemann and Lebesgue combined: Ladies and gentlement, I present ..."
  ],
  [
    "DA2PL&#39;2014 - Learning and Indentifying Monotone Boolean Functions - Endre Boros",
    "Presentation of Endre Boros at the DA2PL'2014 workshop (Ecole Centrale Paris, Nov. 20-21, 2014) on Learning and Indentifying ..."
  ],
  [
    "YTTV",
    ""
  ],
  [
    "Lecture 18, Submodular Functions, Optimization, &amp; Applications to Machine Learning",
    "Submodular Functions, Optimization, and Applications to Machine Learning Lecture 18 June 2nd, 2014 Prof. Jeff Bilmes ..."
  ],
  [
    "REET बोर्ड नोटिफिकेशन चर्चा and blueprint 5th unit",
    "assistant professor exam#Reet # REET - 2021 |UPTET #REET#,supertet#HPTET#DSSSB Teacher#CET# REET# kiआप लोग ..."
  ],
  [
    "Convex set",
    "In Euclidean space, an object is convex if for every pair of points within the object, every point on the straight line segment that ..."
  ],
  [
    "Re-constructing Brains in the Lab to Revolutionize Neuroscience",
    "Visit: http://www.uctv.tv) Cerebral organoids, also known as mini-brains, are tridimensional self-organized structures derived from ..."
  ],
  [
    "Ronald Reagan - The Making of a Leader (Full Documentary)",
    "30 years after he left the White House, Reagan continues to put his stamp on American politics. Barack Obama himself didn't ..."
  ],
  [
    "What are Harmonic functions?",
    "Welcome back MechanicaLEi, did you know that the descriptor \"harmonic\" in the name harmonic function originates from a point ..."
  ],
  [
    "Mitigating for Nerve Injury during Regional Anesthesia (ASRA Industry Education Non-CME Webinar)",
    "A panel of highly experienced regional anesthesia practitioners from the United States and Europe deliver this insightful webinar ..."
  ],
  [
    "Raymond Carver",
    "Raymond Clevie Carver, Jr. (May 25, 1938 – August 2, 1988) was an American short story writer and poet. Carver was a notable ..."
  ],
  [
    "Jean Baccelli - Rutgers Foundations of Probability",
    "Jean Baccelli Munich Center for Mathematical Philosophy February 19, 2018 Act-State Dependence, Moral Hazard, and ..."
  ],
  [
    "7.2 Riemann-Stieltjes Integration",
    "A reminder of the Riemann-Stieltjes integral, and discussion of its defects from the point of view of measurable functions."
  ],
  [
    "ADSN Centre Spotlight | Deakin University’s Data to Intelligence (D2I) Research Centre",
    "The aim of the Australian Data Science Network (ADSN) is to connect the concentrations of expertise in data science across ..."
  ],
  [
    "Riemann vs Lebesgue Integral",
    "In this video, I show how to calculate the integral of x^3 from 0 to 1 but using the Lebesgue integral instead of the Riemann ..."
  ],
  [
    "CS1 lecture at MG16 conf.",
    "Lecture on the evidence of cosmic strings. Marcel Grossmann meeting 2021."
  ],
  [
    "Some aspects of research on the gender gap in science by social scientists",
    "Some aspects of research on the gender gap in science by social scientists Speaker: Catherine Jami (UMR Chine, Corée, Japon ..."
  ],
  [
    "[4th GAF] David Lundberg 01",
    "Jang's equation and positive mass theorem in the asymptotically hyperboloidal setting."
  ],
  [
    "11th Phy - तरल यांत्रिकी-Lec 6 :-Numericals के Concepts By Akhil Sir | IIT/JEE,NEET",
    "Join your Batch Now call 97724-16330 88903-76314 08069022500 (इस number से पहले शून्य ज़रूर ..."
  ],
  [
    "Vertex Density Heatmap - 03: VOP/VEX &amp; Counting Vertices",
    "Download Files : https://drive.google.com/file/d/1E78BxbAyF_dv13KN72nbJkT9G_HJ_WaR/view?usp=sharing Download ..."
  ],
  [
    "Wheelerâ€“DeWitt equation Top # 8 Facts",
    "Wheelerâ€“DeWitt equation Top # 8 Facts."
  ],
  [
    "Operations Research 03G: Linear Programming Extreme Points",
    "Textbooks: https://amzn.to/2VgimyJ https://amzn.to/2CHalvx https://amzn.to/2Svk11k In this video, I'll talk about extreme points."
  ],
  [
    "Why I Am a Member of SfN: William Frey, PhD",
    "How can SfN enrich your scientific career? Hear answers directly from our members. Advance member registration for SfN's 48th ..."
  ],
  [
    "ICMP 2021 Plenary Talk 12 - Jeremie Szeftel",
    "On the black hole stability problem."
  ],
  [
    "Gym Class Heroes ft. Patrick Stump - Cupid&#39;s Chokehold (Sub. Español / Lyrics)",
    "\"Échale un vistazo a mi novia, ella es la única que tengo, no es tanto así como una novia, parece que nunca tengo lo suficiente\" ..."
  ],
  [
    "Rushkoff: The Rhythms Of Time  l  Dark Rye - Rhythm  l  Whole Foods Market",
    "We live in a different now than has ever been known. Now is not the now of your grandma's careful attention to detail and rhythm."
  ],
  [
    "Mechanisms to Medicines in Neurodegeneration │ Prof. Giovanna Mallucci",
    "Speaker: Giovanna Mallucci is Professor of Clinical Neurosciences and Associate Director of the UK Dementia Research Institute ..."
  ],
  [
    "Paul Cézanne (French, 1839–1906) - Who was Paul Cézanne? Biography of Paul Cézanne.",
    "Paul Cézanne (French, 1839–1906) - Who was Paul Cézanne? Biography of Paul Cézanne. Paul Cézanne (French, 19 January ..."
  ],
  [
    "Analyse vision schema Image retinenne",
    "Description."
  ],
  [
    "GeneWalk identifies relevant gene functions for a... - Robert Iestwaart - ISCBacademy Posterpalooza",
    "GeneWalk identifies relevant gene functions for a biological context using network representation learning - Robert Iestwaart ..."
  ],
  [
    "Riemann-Integral vs. Lebesgue-Integral",
    "English version here: https://www.youtube.com/watch?v=PGPZ0P1PJfw Unterstützt den Kanal auf Steady: ..."
  ],
  [
    "Séminaire du GDR IA (Intelligence Artificielle) - #6 -  Didier Dubois",
    "00:00 Debut 00:47 Introduction du séminaire de Didier Dubois (Sébastien Destercke) 03:30 Début de l'exposé (Didier Dubois) ..."
  ],
  [
    "S. Druel - A decomposition theorem for singular spaces with trivial canonical class (Part 5)",
    "The Beauville-Bogomolov decomposition theorem asserts that any compact Kähler manifold with numerically trivial canonical ..."
  ],
  [
    "Vector space",
    "A vector space is a mathematical structure formed by a collection of elements called vectors, which may be added together and ..."
  ],
  [
    "4 October 2020 Understanding the Practicality of Faith",
    ""
  ],
  [
    "Science On Tap: Food, Flavor and Feelings",
    "Science on Tap host Steven Reiner, formerly of 60 Minutes and now a Broadcast Journalism professor at Stony Brook, will be ..."
  ],
  [
    "Dialogues Between Neuroscience and Society: Global Mental Health and Neuroscience",
    "Global mental health is slowly but steadily coming out of the shadows. It is benefiting from advances in neuroscience, but not ..."
  ],
  [
    "Metrics and Tools for Measuring Cyber Resiliency of Electric Grids",
    "Resiliency metrics and assessment tools for monitoring microgrid system as proof-of –concept (CyPhyR, CP-SAM) Resiliency ..."
  ],
  [
    "Microscopie de fluorescence : Multiphoton 2.4",
    ""
  ],
  [
    "3514 TEORI INTEGRAL (INTEGRAL-HENSTOCK-KURZWEIL-GAUGE-DELTA-FINE)",
    ""
  ],
  [
    "[4th GAF] David Lundberg 01",
    "Jang's equation and positive mass theorem in the asymptotically hyperboloidal setting."
  ],
  [
    "HOMOGENEOUS EQUATION | S-1 | EULER&#39;S EQUATION | EULER&#39;S THEOREM | ENGINEERING FIRST YEAR | MATHS - 1",
    "A function f(x, y) is said to be homogeneous of degree m if f(tx,ty)=tmf(x,y) for any real number t≠0. ** Euler's theorem states that if ..."
  ],
  [
    "Seminario Mikel Sesma: Directional monotonicity and related concepts in context of data aggregation",
    "Seminario ONLINE CIO, Mikel Sesma (Universidad Pública de Navarra) sobre Directional monotonicity and related concepts in ..."
  ],
  [
    "Lydia Bieri: Gravitational Wave Memory",
    "Lydia Bieri from University of Michigan speaking to the Black Hole Initiative Colloquium."
  ],
  [
    "Real possibilities: does physics say they exist? Tomasz Placek",
    "A lecture of Tomasz Placek delivered during the XIX Kraków Methodological Conference \"On what exists in physics\" in which he ..."
  ],
  [
    "CGR - Bruce Conklin, 1/26/22",
    "Decoding and Repairing Genetic Disease with CRISPR and iPS cells."
  ],
  [
    "Raymond Carver",
    "Raymond Clevie Carver, Jr. (May 25, 1938 – August 2, 1988) was an American short story writer and poet. Carver was a notable ..."
  ],
  [
    "Vertex Density Heatmap - 03: VOP/VEX &amp; Counting Vertices",
    "Download Files : https://drive.google.com/file/d/1E78BxbAyF_dv13KN72nbJkT9G_HJ_WaR/view?usp=sharing Download ..."
  ],
  [
    "Wheelerâ€“DeWitt equation Top # 8 Facts",
    "Wheelerâ€“DeWitt equation Top # 8 Facts."
  ],
  [
    "Sergiu KLAINERMAN - The problem of stabiliy of Kerr under axilly symmetric perturbations",
    "I will talk about a recent result, in collaboration with A. Ionescu, concerning partial nonlinear axisymmetric perturbations of Kerr ..."
  ],
  [
    "Analyse vision schema Image retinenne",
    "Description."
  ],
  [
    "Lebesgue Integral",
    "Bruno Calderon, Diana Herrera, Paulina Maza, Salma Pedro, Valentina Hernández."
  ],
  [
    "TYPES OF QUEUE| Circular Queue| Deque|Priority Queue| Applications of Queue",
    "data structure playlist QUEUE operations in data structure QUEUE using C data structure data structure malayalam Datastructure ..."
  ],
  [
    "Vector space",
    "A vector space is a mathematical structure formed by a collection of elements called vectors, which may be added together and ..."
  ],
  [
    "4 October 2020 Understanding the Practicality of Faith",
    ""
  ],
  [
    "Paul Cézanne (French, 1839–1906) - Who was Paul Cézanne? Biography of Paul Cézanne.",
    "Paul Cézanne (French, 1839–1906) - Who was Paul Cézanne? Biography of Paul Cézanne. Paul Cézanne (French, 19 January ..."
  ],
  [
    "JDG 2017: Richard Schoen: The Einstein Constraint Equations",
    "This talk of Richard Schoen was delivered on Saturday, April 29, 2017."
  ],
  [
    "Computational Encoding of Function Spaces",
    "For the latest information, please visit: http://www.wolfram.com Speakers: Lin Cong & Eric Weisstein Wolfram developers and ..."
  ],
  [
    "Metrics and Tools for Measuring Cyber Resiliency of Electric Grids",
    "Resiliency metrics and assessment tools for monitoring microgrid system as proof-of –concept (CyPhyR, CP-SAM) Resiliency ..."
  ],
  [
    "Alain Connes: Quanta of Geometry",
    "Find this video and other talks given by worldwide mathematicians on CIRM's Audiovisual Mathematics Library: ..."
  ],
  [
    "Patricia Melin: Type-2 Fuzzy Logic in Image Processing and Pattern Recognition",
    "Symposium of Fuzzy Logic and Fuzzy Sets: A Tribute to Lotfi Zadeh February 5, 2018 Captions available upon request."
  ],
  [
    "Imade Latest Yoruba Movie 2021 Drama Starring Ronke Odusanya | Yinka Quadri | Bolanle Abdulsalam",
    "Shortly after a married man is gifted a flower to nurture, his livelihood moved from grass to grace but what comes after the ..."
  ],
  [
    "Lecture 16, Submodular Functions, Optimization, &amp; Applications to Machine Learning",
    "Submodular Functions, Optimization, and Applications to Machine Learning Lecture 16 May 21st, 2014 Prof. Jeff Bilmes ..."
  ],
  [
    "3514 TEORI INTEGRAL (INTEGRAL-HENSTOCK-KURZWEIL-GAUGE-DELTA-FINE)",
    ""
  ],
  [
    "17/11/2015 - Qian Wang - Global Existence for the Einstein Equations with Massive Scalar Fields",
    "Abstract. I will present the small data global existence result for the (3+1) Einstein equations with massive scalar fields. The proof ..."
  ],
  [
    "Microscopie de fluorescence : Multiphoton 2.4",
    ""
  ],
  [
    "What is the best habit that I have formed recently? | AskPatrick | Patrick Dsouza",
    "preparation #competitiveexams #mba #cat #cat2022 #cat2023 #askpatrick #iim #xat #iift #cet #cmat #patrick100 #strategy ..."
  ],
  [
    "ICM2014 VideoSeries PL5: Demetrios Christodoulou on Aug15Fri",
    "The International Congress of Mathematicians (ICM) in Seoul, http://www.icm2014.org/ Plenary Lecture Speaker: Demetrios ..."
  ],
  [
    "Valiant Hearts wins the BAFTA for Original Property",
    "The British Academy Games Awards celebrates the best games of the year in the UK and beyond. Find out more about the British ..."
  ],
  [
    "L&#39;élancement - Julien Bruhat",
    ""
  ],
  [
    "Chemistry I Rules for filling of Electron | ICAR JET CUET NEET I Best JET ICAR Coaching in Udaipur",
    "Download Our App 🤳🤳 Click Here 👉👉 https://play.google.com/store/apps/details?id=co.thor.pbkqd Chemistry I Rules for filling ..."
  ],
  [
    "Bad At Love (Halsey) Piano Cover Lesson with Chords/Lyrics - F G C - Arpeggios",
    "CHART AT: https://www.pinterest.com/pin/461267186828615207/ ....MUNSON BRIGADE SHOUTOUT! ....This video brought to ..."
  ],
  [
    "Wlodzimierz Zwonek-Workshop INDAM 2021 &quot;Gromov hyperbolicity and negative curvature in complex analy",
    ""
  ],
  [
    "James Webb Telescope, Nakitaan daw ang PROXIMA B ng Artificial Lights",
    "Kung totoong nakitaan ang Proxima B ng artificial lights ng James Webb Space Telescope, nangangahulugang may intelligent ..."
  ],
  [
    "An alternative to Power Measure for Fuzzy Rule Based Classification Systems",
    "Hello, my name is Frederico Bender Tiggemann, and i'm here to presentate our paper... I'm from Brazil, and study computer ..."
  ],
  [
    "MUSA-028 : les voix de l&#39;extinction | #01 A space odyssey",
    "Épisode 1 : A space odyssey. \"MUSA-028 : Les voix de l'extinction\" est une série audio de science-fiction réalisée par Guillaume ..."
  ],
  [
    "Tommaso Ruggeri - Recent Mathematical Results in Classical and Relativistic Extended Thermodynamics",
    "Tommaso Ruggeri (University of Bologna) - Recent Mathematical Results in Classical and Relativistic Extended ..."
  ],
  [
    "Henstock–Kurzweil integral",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Mamuphi",
    "Séminaire mathématiques-musique-philosophie (Ircam-Ens) http://www.entretemps.asso.fr/2022-2023/"
  ],
  [
    "Les altérations",
    "Daniel Jurquet présente les différentes altérations."
  ],
  [
    "Shihab Chottur || Pakistan visa update 🇵🇰 || 205 Day 23 December 👍 || Islamic bate",
    "Shihab Chottur || Pakistan visa update 🇵🇰 || 205 Day 23 December 👍 || Islamic bate #islamicbate #shihabchattur ..."
  ],
  [
    "Cheops Pyramid, Giza",
    "Size does matter.....these things put me in awe in all day. Every glimpse I catch my jaw just drops... The Cheops Pyramid in Giza."
  ],
  [
    "Conférence chimiométrie 2019 - Keynote 02 - Sébastien Gourvenec",
    "From Chemometrics towards data driven approaches - Sébastien Gourvenec, TOTAL Raffinage-Chimie."
  ],
  [
    "New drugs acting on AMPA receptors - breaking the rules of Medicinal Chemistry? | СПбГУ | Лекториум",
    "New drugs acting on AMPA receptors - breaking the rules of Medicinal Chemistry? | Курс: Цикл лекций «Novartis Lectures» ..."
  ],
  [
    "Will Kymlicka, Les théorie de la justice une introduction.",
    "\"Avec Rawls la justice est la première vertu des institutions sociales.\" Merci de vous abonner à ma chaîne et de partager cette ..."
  ],
  [
    "Discrete Mathematics 11 | Combinatorics Episode 1 | CS &amp; IT | GATE Crash Course",
    "PW is here for your GATE 2023/2024/2025 Preparation💪 For GATE 2024/2025 Computer Science Aspirants - Enrollment Link for ..."
  ],
  [
    "Séminaire Bourbaki - 21/06/2014 - 2/4 - Jacques SMULEVICI",
    "La conjecture de courbure L2 , d'après S. Klainer man, I. Rodnianski et J. Szeftel La relativité générale est l'un des piliers de la ..."
  ],
  [
    "SEXE RACE et COLONIES",
    "Sexe, races et colonies | C'est une autre histoire & Axolot | Le Vortex#21 ,Sexe, race et colonies : choquer pour déconstruire ..."
  ],
  [
    "2019-03-25 黃皓瑋 教授 (國立中山大學)",
    "Title: Limit Theorems in non-commutative probability theory Speaker: 黃皓瑋教授(國立中山大學) Time: 2019.3.25 (Mon.) 16:00 ..."
  ],
  [
    "Raymond Carver | derniers poèmes",
    "Lecture de quatre poèmes de Raymond Carver #Lectube #Carver #poésie."
  ]
]