[
  [
    "The Game Theorists",
    "Hello Internet! I'm MatPat and welcome to GAME THEORY! Do you ever wonder what secrets could be hiding in your favorite ..."
  ],
  [
    "Can Minecraft Bees ACTUALLY Fly? | The Science Of... Minecraft",
    "Snuggle up With Holiday TheoryWear! ▻ https://theorywear.com/ Friends, today Austin is here to RUIN your favorite video games ..."
  ],
  [
    "Game Theory: This is Not My Channel",
    "Friends, today is a BIG day! I am so excited to finally be sharing this news with you all and letting you in on what Steph and I have ..."
  ],
  [
    "Game Theory: FNAF, The Origins Of EVIL",
    "Special thanks to air up for sponsoring this episode! Give the gift of air up this holiday season & enjoy 10% off your entire order w/ ..."
  ],
  [
    "Game Theory: Minecraft, The FROZEN Nether",
    "Be As Warm As The Nether With NEW Holiday TheoryWear! ▻ https://theorywear.com/ Loyal Theorists, today I'm serving up some ..."
  ],
  [
    "Game Theory: FNAF, You&#39;re Going To Hate This (FNAF Security Breach)",
    "Special thanks to Displate for sponsoring this episode! Enjoy big savings on your prints for a LIMITED TIME!"
  ],
  [
    "Game Theory: The Secret Lore of Rainbow Friends SOLVED! (Roblox)",
    "Special thanks to Rocket Learn for sponsoring this episode! Check out all Home Lore episodes here!"
  ],
  [
    "Game Theory: You Are Being LIED To! (Bendy and The Dark Revival)",
    "Stay Warm This Winter With TheoryWear ▻ https://theorywear.com Friends, after 5 years of silence the Bendy franchise has ..."
  ],
  [
    "Game Theory: FNAF, Golden Freddy NEVER Existed!",
    "Our NEW Holiday TheoryWear Makes The PERFECT Gift! ▻ https://theorywear.com/ Theorists, FNAF has gone and made its lore ..."
  ],
  [
    "Game Theory Explained in One Minute",
    "You can't be good at economics if you aren't capable of putting yourself in the position of other people and seeing things from ..."
  ],
  [
    "Game Theory: Dream is my SON? (Dream Face Reveal)",
    "SUBSCRIBE to NEVER Miss a Game Theory! ▻ https://goo.gl/kQWHkJ Theorist, it FINALLY happened! The Dream face reveal ..."
  ],
  [
    "Film Theory: Don’t Be D̴̬̙̾Ë̶̹̩̜́̿C̴̲͓̓Ė̷̼̜͒̀͝I̸͓̟̿̚V̶̺͉̘̑͊̏͌Ȅ̴͔̌̍D̶̓̄͋̇! (The Mandela Catalogue)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH Since my last theory on The Mandela Catalogue A LOT has happened in this ..."
  ],
  [
    "Game Theory | Saddle Point In Game Theory | Pure Strategy Game Theory | Operation Research",
    "Comment Below If This Video Helped You Like & Share With Your Classmates - ALL THE BEST Do Visit My Second ..."
  ],
  [
    "Game Theory: This Cat KILLED The Human Race! (Stray)",
    "Get Your BRAND NEW Theory Wear! ▻ https://theorywear.com/ Have you played the cat game yet? I'm amazed it took this long, ..."
  ],
  [
    "Game Theory: Minecraft&#39;s FALSE Hero! (Minecraft Legends)",
    "SUBSCRIBE to NEVER Miss a Game Theory! ▻ https://goo.gl/kQWHkJ Theorists, it's been a while since we've had a brand new ..."
  ],
  [
    "Game Theory: Don’t Feed The M̶̂͂̑̀͆̏͝U̴̠̿͒̂̏s̸̽̐̏͒͒̐̚Ḛ̴̜͙̠̘͌̽̎̕͝ (Alex Bale ARG)",
    "Special thanks to Public for sponsoring this episode! Get your FREE stock worth up to $300! ▻ https://public.com/MATPAT Plus a ..."
  ],
  [
    "Game Theory: The Scariest Game That Doesn&#39;t Exist! (Evertale)",
    "SUBSCRIBE to NEVER miss a Game Theory! ▻ https://goo.gl/kQWHkJ A while ago, I made a video about how mobile game ads ..."
  ],
  [
    "Game Theory: The SECRET Family of Waluigi?! (Mario)",
    "Snuggle up With New Holiday TheoryWear ▻ https://theorywear.com/ Theorists, if you're anything like me I'm sure the many ..."
  ],
  [
    "Food Theory: What Everyone MISSED About The Krabby Patty (SpongeBob)",
    "Special thanks to SimpliSafe for sponsoring this episode! Get up to 40% off SimpliSafe for a limited time!"
  ],
  [
    "Game Theory: Winning the Game of Life",
    "Game Theory: Winning the Game of Life - Game Theory Explained Sign up and start learning today for FREE: ..."
  ],
  [
    "Game Theory | Graphical Method Game Theory | Operation Research",
    "Comment Below If This Video Helped You Like & Share With Your Classmates - ALL THE BEST Do Visit My Second ..."
  ],
  [
    "Game Theory and Oligopoly: Crash Course Economics #26",
    "Would you like to play a game, Dr. Falken? Actually, this episode isn't really about games, or Matthew Broderick, ..."
  ],
  [
    "Game Theory 101 Full Course",
    "A online course on game theory, covering everything from pure strategy and mixed Nash equilibrium, to subgame perfect ..."
  ],
  [
    "Game Theory | Game Theory Dominance Rule | Operation Research",
    "Comment Below If This Video Helped You Like & Share With Your Classmates - ALL THE BEST Do Visit My Second ..."
  ],
  [
    "Food Theory: You’ll NEVER Eat Vanilla Again!",
    "New Holiday TheoryWear available! ▻ https://theorywear.com/ Loyal Theorist, I want you to think about the last vanilla treat you ..."
  ],
  [
    "Game Theory: Don&#39;t BREATHE! (Poppy Playtime Chapter 3)",
    "Get Your NEW TheoryWear Before It's Gone ▻ https://theorywear.com/ The new trailer for Poppy Playtime Chapter 3 released so ..."
  ],
  [
    "Film Theory: Rick&#39;s REVENGE? (Rick and Morty Season 6)",
    "Flex on Your Friends in Your New Holiday TheoryWear ▻ https://theorywear.com/ Fellow Theorists, we are midway through ..."
  ],
  [
    "Game Theory: The Tortured Ghosts of Minecraft (Minecraft Allay)",
    "Special thanks to GEICO for sponsoring this episode! See how much money you could save on your car insurance NOW!"
  ],
  [
    "How Much LORE Is Important for the Timeline? | FNAF Theory",
    "Thanks to Manscaped for sponsoring today's video! Get 20% Off + Free Shipping + 2 Free Gifts with promo code “RYETOAST” at ..."
  ],
  [
    "Video Game Theories That Will RUIN Your Childhood - Part 2",
    "Level up with these videogame theories that will ruin your childhood! Suggest a topic here to be turned into a video: ..."
  ],
  [
    "Game Theory: FNAF, The Final Security Breach Mystery SOLVED!",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Look out Theorists! The Blob is coming! Well, it's been here and ..."
  ],
  [
    "Game Theory in Hindi",
    "This video, Game Theory, discusses about how a firm can take the optimal decision. Further in this video, Nash Equilibrium and ..."
  ],
  [
    "Game Theory | Two Person Zero Sum Game | Mixed Strategy Game Theory | Operation Research",
    "Comment Below If This Video Helped You Like & Share With Your Classmates - ALL THE BEST Do Visit My Second ..."
  ],
  [
    "Game Theory | Prisoner&#39;s Dilemma | Nash Equilibrium | by Vidhi Kalra",
    "The video talks about one of the most interesting topics under the study of Economics which is 'Game Theory'. I shall explain you ..."
  ],
  [
    "Game Theory: Turn It Off It̵̰̹͂͘ O̷̒̆f̶̝͒f̶͑ i̶͕̝͗T̷̔͘ Ṑ̵̗̝̪͗ͅF̴̛̍͐͊ḟ̶̭͕̾ (Amanda The Adventurer)",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Well, it is about time I talk about the Dora the Explorer inspired ..."
  ],
  [
    "Game theory #1||Pure &amp; Mixed Strategy||in Operations research||Solved problem||By:- Kauserwise",
    "Here is the video about Game theory with Pure Strategy and Mixed Strategy, in this video we have solved separate numerical ..."
  ],
  [
    "What Actually Is Game Theory?",
    "What really is game theory and how can it be explained? MAKE VIDEOS LIKE OURS We use Envato Elements for vectors, ..."
  ],
  [
    "Food Theory: The SECRET Language of Water",
    "Special thanks to air up for sponsoring this episode! Give the gift of air up this holiday season & enjoy Free Shipping w/ code ..."
  ],
  [
    "More Backrooms LORE!! | Matpat Reacts to The Backrooms (Reunion)",
    "Grab Some New TheoryWear Before It's Gone! ▻ https://theorywear.com/ Friends, today we're venturing out into The Backrooms ..."
  ],
  [
    "Game Theory #2||Dominance Property||Pure &amp; Mixed Strategy||in Operations Research||by Kauserwise",
    "Here is the video about Game theory - Dominance property with Pure strategy and Mixed strategy In operations research, in this ..."
  ],
  [
    "Game Theory: The Science of Decision-Making",
    "With up to ten years in prison at stake, will Wanda rat Fred out? Game theory is looking at human interactions through the lens of ..."
  ],
  [
    "FuhNaff Proves Me WRONG About Security Breach! |  Matpat Reacts To “I Solved FNAF Security Breach”",
    "Be A Part Of Our Research By Taking Our UPDATED Survey On Faces ▻ https://forms.gle/WsJLx7te34x9tLcu8 Friends, today I'm ..."
  ],
  [
    "What game theory teaches us about war | Simon Sinek",
    "What would happen if 'win' and 'lose' are no longer the only options when fighting a war? What if a third, more abstract ideal ..."
  ],
  [
    "Film Theory: Sonic is Dying... of HUNGER! (Sonic The Hedgehog)",
    "New Holiday TheoryWear available! ▻ https://theorywear.com/ Okay Theorists, I have to ask: how can Sonic keep his super speed ..."
  ],
  [
    "Game Theory: You KILLED the Planet! (Subnautica) #TeamSeas",
    "Donate to help Clean our Oceans ▻ https://teamseas.org/ Get your new Holiday Theory Wear! ▻ https://creatorink.co/4wj Well ..."
  ],
  [
    "Game Theory: Mario Odyssey&#39;s Big LIE.. Power Moons have NO POWER!",
    "Special thanks to TikTok for sponsoring this video! Download the app NOW! ▻▻ https://httpslink.com/GTYT1 In Super Mario ..."
  ],
  [
    "Game Theory: The HORROR That Threatens SCP",
    "SUBSCRIBE to never miss a Theory! ▻ http://bit.ly/1qV8fd6In is beloved my many, whether it's through the SCP Foundation and ..."
  ],
  [
    "Game Theory: This Place Is NOT Happy... (Happy Meat Farm ARG)",
    "SUBSCRIBE to NEVER Miss a Game Theory! ▻ https://goo.gl/kQWHkJ Theorists, we all know to NEVER eat the mystery meat ..."
  ],
  [
    "Food Theory: Bees are Fish",
    "Special thanks to HelloFresh for sponsoring this episode! Use code FOODTHEORY18 at https://bit.ly/3UOZZ2d for 18 FREE meals ..."
  ],
  [
    "Game Theory 101: What Is a Nash Equilibrium? (Stoplight Game)",
    "Game Theory 101: The Complete Textbook on Amazon (paid link): ..."
  ],
  [
    "Game Theory: Minecraft, STOP Punching Trees!",
    "SUBSCRIBE to never miss a Theory! ▻ http://bit.ly/1qV8fd6 There are a ton of interesting things in Minecraft, but one that stands ..."
  ],
  [
    "Game Theory: The Science of Decision-Making",
    "With up to ten years in prison at stake, will Wanda rat Fred out? Game theory is looking at human interactions through the lens of ..."
  ],
  [
    "Game Theory: The Forgotten War of Minecraft (Minecraft 1.19 Update)",
    "Special thanks to Squarespace for sponsoring a portion of this episode! Start creating your website TODAY!"
  ],
  [
    "Game Theory: You KILLED the Planet! (Subnautica) #TeamSeas",
    "Donate to help Clean our Oceans ▻ https://teamseas.org/ Get your new Holiday Theory Wear! ▻ https://creatorink.co/4wj Well ..."
  ],
  [
    "Game Theory: The Pokedex is FULL OF LIES! (Pokemon)",
    "The TRUTH Behind Fire Pokemon! ▻▻ https://goo.gl/ayrokB Sonic is LYING! | Sonic Mania ▻▻ https://goo.gl/28cjf3 SUBSCRIBE ..."
  ],
  [
    "Intro to Game Theory and the Dominant Strategy Equilibrium",
    "http://economicsdetective.com/ Game theory is the study of human behaviour in strategic settings. It is used to solve some of the ..."
  ],
  [
    "Game Theory: The Tortured Ghosts of Minecraft (Minecraft Allay)",
    "Special thanks to GEICO for sponsoring this episode! See how much money you could save on your car insurance NOW!"
  ],
  [
    "Film Theory: You Are Being Erased...",
    "Special thanks to Google Pixel for sponsoring this episode! Check out the Google Pixel 7 Pro! ▻ https://goo.gle/3RKxSyQ Theorist ..."
  ],
  [
    "Game Theory: The Disturbing Lore Of Lily&#39;s Garden",
    "Get yourself some BRAND NEW Food Theory Merch! ▻ https://bit.ly/3vu8MJs Want more WEIRD lore?"
  ],
  [
    "Video Game Theories That’ll RUIN Your Childhood",
    "Coming up are some creepy video game theories that'll RUIN your childhood! Suggest a topic here to be turned into a video: ..."
  ],
  [
    "Game Theory: Death by NIGHTMARE! (Try To Fall Asleep)",
    "Get yourself some NEW Theory Wear!! ▻ https://bit.ly/2N1m7V7 Try To Fall Asleep is an indie horror game that has taken my ..."
  ],
  [
    "Game Theory: Pokemon - Why Pikachu is SHOCKINGLY Terrible! (Pokemon Sword and Shield)",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/matpat My subscribers have already saved over ..."
  ],
  [
    "FuhNaff Proves Me WRONG About Security Breach! |  Matpat Reacts To “I Solved FNAF Security Breach”",
    "Be A Part Of Our Research By Taking Our UPDATED Survey On Faces ▻ https://forms.gle/WsJLx7te34x9tLcu8 Friends, today I'm ..."
  ],
  [
    "Game theory and what ails Hindu society",
    "If the clash of civilizations is a game, how are Hindus (and India) playing it? A look at our civilizational struggle in the framework of ..."
  ],
  [
    "The Tragic Mystery of Pokemon&#39;s Ghost Girl (Pokemon) | Game Theory",
    "One of the most mysterious, unanswered questions in the Pokemon games is \"Who is the Ghost Girl\"? Throughout some of the ..."
  ],
  [
    "Game Theory",
    "In this lecture during the 2013 Yale Presidential Inauguration Symposia, University Provost Polak offers a sample of his popular ..."
  ],
  [
    "Game Theory Is CRAZY (And Right) | FNAF Theory",
    "GAME THEORY VIDEO: https://www.youtube.com/watch?v=GxnlPU1_QX8 I honestly think he's on to something. It's worth noting ..."
  ],
  [
    "Game Theory: Friend or FOOD? (Cooking Companions DLC)",
    "Special thanks to Public for sponsoring this episode! Go to http://public.com/matpat and you'll receive a free stock once you open ..."
  ],
  [
    "Game Theory: FNAF 6, No More Secrets (FNAF 6, Freddy Fazbear&#39;s Pizzeria Simulator)",
    "Get Your Game Theory Merch Now! ▻ https://creatormash.com/ SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Duck ..."
  ],
  [
    "Food Theory: Bees are Fish",
    "Special thanks to HelloFresh for sponsoring this episode! Use code FOODTHEORY18 at https://bit.ly/3UOZZ2d for 18 FREE meals ..."
  ],
  [
    "Film Theory: One of us is DEAD! (DHMIS)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH The long awaited tv series of Don't Hug Me, I'm Scared is here! I was so excited ..."
  ],
  [
    "Game Theory: The Bloody History of Poppy Playtime",
    "Get your new Holiday Theory Wear! ▻ https://creatorink.co/4wj What would you do if you were trapped in a toy factory and the toys ..."
  ],
  [
    "Game Theory: Minecraft, The Secret Desert Origin of Creepers",
    "Special thanks to Raycon for sponsoring this video! Get 15% off your order! ▻ https://buyraycon.com/matpat DON'T FORGET to ..."
  ],
  [
    "Game Theory: The Disturbing Lore of Merge Mansion",
    "Get your new SPOOKY Theory Wear! ▻ https://creatorink.co/hbn Theorists, mobile games are at it again! First we covered the ..."
  ],
  [
    "Game Theory: The Unsolved Lore of The Sims (Bella Goth Mystery)",
    "Check if you're registered to vote to win a chance to hang out in LA with ME! ▻ https://headcount.org/MATPAT Can you believe ..."
  ],
  [
    "Game Theory: The HORROR That Threatens SCP",
    "SUBSCRIBE to never miss a Theory! ▻ http://bit.ly/1qV8fd6In is beloved my many, whether it's through the SCP Foundation and ..."
  ],
  [
    "Game Theory in Operation research USING mini max principle,odds method,dominance method in HINDI",
    "Game Theory Of Operation Research, You will get the answers of all your important questions for solving Game Theory problem."
  ],
  [
    "Game Theory: Why Flying Pokemon CAN&#39;T FLY!",
    "Special thanks to GEICO for sponsoring this episode! See how much money you could save on your car insurance NOW!"
  ],
  [
    "Game Theory: You Have NO Choice! (Octopath Traveler CotC)",
    "Special thanks to Google Play for sponsoring this episode! Download Octopath Traveler: Champions of the Continent NOW on ..."
  ],
  [
    "Game Theory: The Forgotten History of Minecraft Villagers",
    "Special thanks to NordVPN for sponsoring this video! Go to https://NordVPN.com/matpat and use code MATPAT to get 68% off a 2 ..."
  ],
  [
    "Game Theory: The Dirty Secrets of PowerWash Simulator",
    "Special thanks to Free Fire for sponsoring this episode! Download Free Fire now! ▻ https://freefire.onelink.me/Io8U/5eb03c33 ..."
  ],
  [
    "Y2 24) Oligopoly - Game Theory",
    "Y2 24) Oligopoly - Game Theory. Full theory of oligopoly using game theory analysis For Products, Services and Bookings visit ..."
  ],
  [
    "Game Theory: I&#39;m So Hungry SO̶̍̅͘͜ H̵͂̑̃͊u̴N̴͓̉̃̈́̑G̴̎r̴Y̶̏ s̶͂O̶̞̍̅͘͜ ȟ̵̌̑U̷͑͒̒͠nG̴͊̈́̅͑̚R̶͝y̴̾͑͌̀̔̽",
    "SUBSCRIBE for every TASTY Theory! ▻ https://goo.gl/kQWHkJ Welcome back to our analysis of the lore of Cooking Companions."
  ],
  [
    "Game Theory: The Murky History of Minecraft&#39;s Underwater Gods",
    "Get Your NEW Holiday Theory Wear NOW! ▻ http://creatorink.co/theory-wear SUBSCRIBE to never miss a Theory!"
  ],
  [
    "Game Theory: DRINK ME Dri̹̣̇̏n̲͙̒͒K͈̥̎̌̄͘ ṃ̛͊͗̒̋Ė̼̦̝̩̀͛̍ ̡̘͓̑͐͋D̐̀̀rIN̩͎̂͞k ḿ̖̰̒ē̛̗͒̂ (OnlyCans)",
    "Watch the rest of Cannibalism Weekend! The Disturbing Lore of M&Ms ▻ https://youtu.be/6ennbi0E-0Q Wall-E's Secret ..."
  ],
  [
    "Game Theory: Real Tips for SURVIVING a Zombie Apocalypse (7 Days to Die)",
    "This video was sponsored by TellTale games. Check out 7 Days to Die here: http://bit.ly/2bd2e8U Rated M for Mature. Zombies ..."
  ],
  [
    "Film Theory: They Missed the Point (Try Guys Drama)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH Theorists, we need to talk about @tryguys situation and by that I mean the ..."
  ],
  [
    "CRAZIEST THEORY YET? Game Theory: FNAF, The Origins Of EVIL (FIRST REACTION!)",
    "Hot Sauce Beats is Here! MatPat over at @GameTheory just dropped a new FNAF video and OMG! He is still giving us spicy lore ..."
  ],
  [
    "Game Theory, Saddle Point, Value of Game, Pure Strategy, Mixed Strategy, Operation Research, QTM",
    "Operation Resarch (Playlist) : https://youtube.com/playlist?list=PLsh2FvSr3n7dpUbg1BxYcuSCM2J4LNIl6 In this video we have ..."
  ],
  [
    "Game Theory: Sonic is TOO Powerful! (Sonic the Hedgehog)",
    "Thanks to GEICO for sponsoring this episode! See if you could save 15% or more on your insurance NOW!"
  ],
  [
    "How Much LORE Is Important for the Timeline? | FNAF Theory",
    "Thanks to Manscaped for sponsoring today's video! Get 20% Off + Free Shipping + 2 Free Gifts with promo code “RYETOAST” at ..."
  ],
  [
    "Game Theory: Minecraft, Stop Using Diamonds!",
    "Thanks Honey for sponsoring! Get the best deals while shopping online ▸ http://joinhoney.com/matpat Honey is FREE and finds ..."
  ],
  [
    "Game Theory| Theory of Games definitions| Operation Research",
    "In this video I have explained Game Theory definitions Playlist Game Theory: ..."
  ],
  [
    "Game Theory: You&#39;re WRONG About Ash&#39;s Pikachu! (Pokemon)",
    "SUBSCRIBE to Never Miss A Game Theory! ▻ https://goo.gl/kQWHkJ Today is the day, Theorists! The day that I, once and for all, ..."
  ],
  [
    "Game Theory: Among Us Lore, You Will ALWAYS Lose!",
    "Check out Food Theory! ▻ https://bit.ly/2CdCooV Become a Game Theorist! ▻http://bit.ly/1qV8fd6 Among Us has been ruling the ..."
  ],
  [
    "Game Theory: Did Dream FAKE His Speedrun? A Final Analysis.",
    "Special thanks to Skillshare for sponsoring this episode! The first 1000 Theorists get a FREE trial of Skillshare Premium ..."
  ],
  [
    "Game Theory: The Minecraft Warden... SOLVED! w/ Dream",
    "Special thanks to Dream & the Dream Team for being in this episode! Subscribe to Dream! ▻ https://www.youtube.com/c/dream ..."
  ],
  [
    "Food Theory: We Need To Talk About The Green M&amp;M",
    "SUBSCRIBE for Every Tasty Theory! ▻▻ https://bit.ly/2CdCooV There is a lot of talk out there about the Green M&M. She's gone ..."
  ],
  [
    "Game Theory: Are Your Mobile Games ILLEGAL?",
    "SUBSCRIBE to Never Miss a Theory! ▻ https://goo.gl/kQWHkJ I'm sure you've been playing a game or watching a video on your ..."
  ],
  [
    "Game Theory: DANGER! Don&#39;t Play This Game! (Inscryption)",
    "Special thanks to Honey for sponsoring this episode! Get Honey for FREE today ▻ https://joinhoney.com/matpat Listen, I would ..."
  ],
  [
    "GAME THEORY # Social interaction # Science of Strategy # Malayalam Explanation.",
    "GAME THEORY # SOCIAL INTERACTION # SCIENCE OF STRATEGY IN MALAYALAM."
  ],
  [
    "Game Theory: Nurse Joy is a Pokemon!",
    "Help me host Jeopardy by signing the petition! ▻ https://www.change.org/p/jeopardy-make-matpat-the-next-jeopardy-host Check ..."
  ],
  [
    "Game theory operations research dominance method | QTM Numerical | Important Numerical Question",
    "Game theory operations research dominance method | QTM Numerical | Important Numerical Question #or #qtm #dranandvyas ..."
  ],
  [
    "Film Theory: One of us is DEAD! (DHMIS)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH The long awaited tv series of Don't Hug Me, I'm Scared is here! I was so excited ..."
  ],
  [
    "Game Theory: Duck Season&#39;s KILLER DOG... Unmasked! (Duck Season)",
    "Special Thanks to Oculus Rift for Sponsoring this video. Get your Oculus Rift today! ▻▻ http://bit.ly/2jdHe7Q Scariest Game You ..."
  ],
  [
    "Game Theory: Real Tips for SURVIVING a Zombie Apocalypse (7 Days to Die)",
    "This video was sponsored by TellTale games. Check out 7 Days to Die here: http://bit.ly/2bd2e8U Rated M for Mature. Zombies ..."
  ],
  [
    "Game Theory: Among Us Lore, You Will ALWAYS Lose!",
    "Check out Food Theory! ▻ https://bit.ly/2CdCooV Become a Game Theorist! ▻http://bit.ly/1qV8fd6 Among Us has been ruling the ..."
  ],
  [
    "Game Theory: Spiderman is a CRIMINAL! (Spider Man PS4)",
    "Subscribe to never miss a theory! ▻ http://bit.ly/1qV8fd6 SuperHot.exe is a VIRUS! ▻ https://bit.ly/2O2YsT5 The CORRUPTION of ..."
  ],
  [
    "SCARIEST Train Ride Ever! | Choo Choo Charles",
    "Stay Warm This Winter With New Cozy TheoryWear ▻ https://theorywear.com/ Friends, today we're going ALL ABOARD the crazy ..."
  ],
  [
    "Game Theory: FNAF, The Clue That ALMOST Solves Everything! (FNAF Security Breach)",
    "Get yourself The Quest Jacket and SOLVE our mystery! ▻ https://theorywear.com/products/quest-jacket Theorists, I am finally ..."
  ],
  [
    "Food Theory: Bees are Fish",
    "Special thanks to HelloFresh for sponsoring this episode! Use code FOODTHEORY18 at https://bit.ly/3UOZZ2d for 18 FREE meals ..."
  ],
  [
    "Game Theory | Theory of games in operation research",
    ""
  ],
  [
    "Game Theory: Spiderman DESTROYED New York! (Spider-Man: Miles Morales)",
    "Special thanks to NordVPN for sponsoring this episode! Get a 2 Year Plan + an extra 1 month FREE w/ code MATPAT ..."
  ],
  [
    "Can I ESCAPE Mommy Long Legs? | Project Playtime (Poppy Playtime)",
    "Stay Warm This Winter With TheoryWear ▻ https://theorywear.com/ Theorists, today we are venturing BACK into Playtime Co. and ..."
  ],
  [
    "Game Theory: Are Your Mobile Games ILLEGAL?",
    "SUBSCRIBE to Never Miss a Theory! ▻ https://goo.gl/kQWHkJ I'm sure you've been playing a game or watching a video on your ..."
  ],
  [
    "Game Theory: The Forgotten History of Minecraft Villagers",
    "Special thanks to NordVPN for sponsoring this video! Go to https://NordVPN.com/matpat and use code MATPAT to get 68% off a 2 ..."
  ],
  [
    "Game Theory: Minecraft, Stop Using Diamonds!",
    "Thanks Honey for sponsoring! Get the best deals while shopping online ▸ http://joinhoney.com/matpat Honey is FREE and finds ..."
  ],
  [
    "Game Theory: DRINK ME Dri̹̣̇̏n̲͙̒͒K͈̥̎̌̄͘ ṃ̛͊͗̒̋Ė̼̦̝̩̀͛̍ ̡̘͓̑͐͋D̐̀̀rIN̩͎̂͞k ḿ̖̰̒ē̛̗͒̂ (OnlyCans)",
    "Watch the rest of Cannibalism Weekend! The Disturbing Lore of M&Ms ▻ https://youtu.be/6ennbi0E-0Q Wall-E's Secret ..."
  ],
  [
    "Game Theory: Why Mario is Mental, Part 2",
    "Check out more bizarre facts about Mario with MatPat on DYKGaming! ▻ http://www.youtube.com/watch?v=KaOdvEaKTew Help ..."
  ],
  [
    "Game Theory Practice Session Part 1 in Hindi of Operations Research by JOLLY Coaching",
    "game theory practice session will help you to understand the types of problem students faces while solving questions based on ..."
  ],
  [
    "Game Theory: Pokemon Are Going EXTINCT! (Pokemon Sun and Moon)",
    "The Pokedex is FULL OF LIES! ▻▻ https://goo.gl/1sGoXL The TRUTH Behind Fire Pokemon! ▻▻ https://goo.gl/ayrokB ..."
  ],
  [
    "Food Theory: Your Neighbors HATE You! (Halloween Candy)",
    "Special thanks to HelloFresh for sponsoring this episode! Get 65% off + FREE shipping w/ code FOODTHEORY65 ..."
  ],
  [
    "Game Theory: 3 New FNAF Timeline Theories!",
    "Special thanks to NordVPN for sponsoring this episode! Get a HUGE discount on a 2 year plan + 4 months FREE!"
  ],
  [
    "#47 Game Theory (part-01) by Hardev Thakur",
    "Subscribe to this channel here: https://bit.ly/3hPwiMj Share this video on WhatsApp: https://bit.ly/2XZxzKc Share this video ..."
  ],
  [
    "The LORE Behind the Monster Train! | Choo-Choo Charles",
    "Stay Warm This Winter With New Cozy TheoryWear ▻ https://theorywear.com/ Hey Theorists, today we're jumping BACK into ..."
  ],
  [
    "Game Theory: Minecraft. The Secrets of the Undead Ender Dragon",
    "Special thanks to GEICO for sponsoring this episode! See how much money you could save on your car insurance NOW!"
  ],
  [
    "Game Theory: Please Come Home... (Andy&#39;s Apple Farm)",
    "Special thanks to Opera for sponsoring this episode! Download Opera GX FREE! ▻ https://operagx.gg/TheGameTheorists & get ..."
  ],
  [
    "Playlist Game Theory Collections - By kauserwise",
    "See this PlayList to watch Game theory video collections in English List of videos: Game theory [Pure & Mixed strategy] Game ..."
  ],
  [
    "Film Theory: They Missed the Point (Try Guys Drama)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH Theorists, we need to talk about @tryguys situation and by that I mean the ..."
  ],
  [
    "Game Theory: Are Theories KILLING Video Games?",
    "Thanks to Capital One Shopping for sponsoring a portion of this video! Get Capital One Shopping for FREE!"
  ],
  [
    "Game Theory in Operation research USING mini max principle,odds method,dominance method in HINDI",
    "Game Theory Of Operation Research, You will get the answers of all your important questions for solving Game Theory problem."
  ],
  [
    "PowerWash Pals: MatPat from Game Theory",
    "I sit down and have a lengthy wash n' chat (for the first time I might add) with MatPat from Game Theory (and Film Theory (and ..."
  ],
  [
    "Video Game Theories That’ll RUIN Your Childhood",
    "Coming up are some creepy video game theories that'll RUIN your childhood! Suggest a topic here to be turned into a video: ..."
  ],
  [
    "It&#39;s NOT Just a Theory",
    "MatPat SOLD Game Theory, and Film Theory, and Theorist Media? Game Theory dropped a new video today in which MatPat ..."
  ],
  [
    "game theory hindi",
    "game theory, lpp,operation research."
  ],
  [
    "Film Theory: This Is The Scariest YouTube Channel (Boisvert)",
    "Get Your TheoryWear Before It's Gone ▻ https://theorywear.com/ You know I am always looking for a new analog horror series to ..."
  ],
  [
    "Game Theory: The Disturbing Lore of Merge Mansion Just Got Darker!",
    "Get yourself The Quest Jacket and SOLVE our mystery! ▻ https://theorywear.com/ Yes Theorists, I have more to say about Merge ..."
  ],
  [
    "Game Theory: FNF, The Bob Mod SOLVED! (Friday Night Funkin)",
    "Special thanks to Raycon for sponsoring this episode! Get 15% off your Raycon purchase! ▻ https://buyraycon.com/matpat Help ..."
  ],
  [
    "Game Theory: FNAF STUMPED Me... Again!",
    "There has been a lot going on surrounding this episode. I am sorry to anyone who was contacted because of this. For all of my ..."
  ],
  [
    "Game Theory: Minecraft and The Power of The Dead",
    "Special thanks to Raycon for sponsoring this video! Get 15% off your order! ▻ https://buyraycon.com/matpat LAST CHANCE to ..."
  ],
  [
    "THE FUTURE OF FNAF!! Reacting to &quot;Game Theory FNAF 7 The Untold Story of Sister Location&quot;",
    "Original video: https://www.youtube.com/watch?v=yJTo3HnV8V0 P.O. Box 77614 Greensboro, NC 27417 I ate a banana for the ..."
  ],
  [
    "Game Theory: FNAF, The New Breed",
    "Get our NEW Holiday & Official FNAF Merch! ▻ https://bit.ly/2UkxCv0 Don't forget to Subscribe to Food Theory!"
  ],
  [
    "Game Theory: You Give Them Life (Hello Puppets Scary VR Game)",
    "Get yourself our BRAND NEW Theory Wear!! ▻ http://creatorink.co/theorywear1 As a fan of scary indie games, I like to investigate ..."
  ],
  [
    "Game Theory Practical Questios with Different Methods of Operation Research in Hindi By JOLLY Coaching",
    "This video include all method of solving game theory in detailed manner which will help you to understand the each method easily ..."
  ],
  [
    "Game Theory - Level 3",
    ""
  ],
  [
    "Food Theory: DON&#39;T TRUST Your School Lunch!",
    "Special thanks to Ritual Vitamins for sponsoring this video! Get 20% off your 1st Month! ▻ Go to https://ritual.com/FOOD20 ..."
  ],
  [
    "Your Job Is Killing You! | The SCIENCE of... The Mortuary Assistant",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Theorists, would you ever work in a mortuary? That is EXACTLY ..."
  ],
  [
    "Game Theory: The Animals in Animal Crossing Aren&#39;t Animals! (Animal Crossing: New Horizons)",
    "Get yourself some Theory Wear!! ▻ http://creatorink.co/theorywear1 SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 ..."
  ],
  [
    "Game Theory: Your Shiny Pokemon is DOOMED to Die!",
    "Special thanks to Audible for sponsoring this video! Get a FREE 30 Day trial of Audible! ▻ http://audible.com/matpat Or text matpat ..."
  ],
  [
    "Game Theory: Dear Nintendo, I FIXED Your Timeline! (Zelda)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 I've been theorizing about Zelda for a LONG time! Since the beginning of ..."
  ],
  [
    "Film Theory: Paw Patrol, Ryder is EVIL!",
    "Get Your BRAND NEW TheoryWear Before It's Gone ▻ https://theorywear.com/ Theorists, the last time I covered Paw Patrol I ..."
  ],
  [
    "Can You Make A FNAF Timeline ONLY Using the Games? | FNAF Theory",
    "Thank you again to Morgan and Morgan for Sponsoring today's video. If you'd like to check out their services, go ahead and click ..."
  ],
  [
    "Game theory operations research dominance method | QTM Numerical | Important Numerical Question",
    "Game theory operations research dominance method | QTM Numerical | Important Numerical Question #or #qtm #dranandvyas ..."
  ],
  [
    "Game Theory: The SECRET Game You Didn&#39;t Find...(Inscryption)",
    "SUBSCRIBE to Never Miss A Theory! ▻ https://goo.gl/kQWHkJ In my last episode on Inscryption, we covered the main game..."
  ],
  [
    "THE MAGIC SCHOOL BUS: Doppelgänger Theory",
    "Install Raid for Free ✓ Mobile and PC: https://clik.cc/AvLOO and get a special starter pack ❄️ Celebrate Christmas with RAID ..."
  ],
  [
    "Game Theory: Dear Nintendo, I FIXED Your Timeline! (Zelda)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 I've been theorizing about Zelda for a LONG time! Since the beginning of ..."
  ],
  [
    "Game Theory: FNAF, You Were Meant To Lose (FNAF VR Help Wanted)",
    "Get Your NEW Theory Wear Here!! ▻ http://bit.ly/2R1gyIc FNAF is back with it's first official VR game \"Five Nights at Freddy's VR: ..."
  ],
  [
    "Game Theory: KFC Just WON The Console Wars",
    "Watch our other KFC Videos! I SOLVED KFC's Secret Recipe! ▻ https://youtu.be/KTABK8Il4Ko This Movie Exposed KFC's ..."
  ],
  [
    "Game Theory: Minecraft Has A Zombie Virus INFECTING the Overworld!",
    "Set your reminder for our Dec. 1st St. Jude Charity Livestream ▻ https://youtu.be/an4pHcye2Mc Use the blue Donate Button to ..."
  ],
  [
    "Game Theory: FNAF, Don&#39;t Trust Gregory (FNAF Security Breach)",
    "SUBSCRIBE to NEVER miss a Theory! ▻ https://goo.gl/kQWHkJ Theorists, it's finally time for a Five Nights At Freddy's Security ..."
  ],
  [
    "Game Theory: The Pinnacle of Decision Making",
    "Game theory, despite its innate complexity, constitutes an incredibly powerful body of knowledge that can allow a person to be ..."
  ],
  [
    "Game Theory: Minecraft&#39;s DARKEST Timeline! (Hermitcraft SMP)",
    "Special thanks to Audible for sponsoring this episode! Get a FREE 30 Day trial of Audible! ▻ http://audible.com/matpat Or text ..."
  ],
  [
    "Minecraft&#39;s Impossible World EXPLAINED! | The SCIENCE of... Minecraft",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Theorists, on this channel we have talked about a LOT of ..."
  ],
  [
    "Game Theory: The Secret Lore of Friday Night Funkin&#39;...",
    "Special thanks to Audible for sponsoring this episode! Get a FREE 30 Day trial of Audible! ▻ http://audible.com/matpat Or text ..."
  ],
  [
    "Dominance Method of Game Theory(Problems in solving game theory using dominance method)",
    "Prepare your self for any competitive exam from this books:- 1. Quantitative aptitude : http://amzn.to/2sDwYdi 2. Reasoning ..."
  ],
  [
    "Game Theory: Minecraft&#39;s Ending, DECODED!",
    "What's Diamond Armor Worth IRL? ▻▻ http://bit.ly/1Q5xhmM Setting a Minecraft RECORD on GTLive ▻▻ http://bit.ly/1n99BER ..."
  ],
  [
    "I Miss The OLD Game Theory! | MatPat Reacts to the Game Theory Partner Shows",
    "Watch the latest episode of The SCIENCE ▻https://youtu.be/oKMV75fY2is Theorists, it's time for a BLAST to the PAST! Today, I'm ..."
  ],
  [
    "Film Theory: What Everyone Got WRONG About Squid Game! (오징어 게임)",
    "Get your new SPOOKY Theory Wear! ▻ https://creatorink.co/rtp It feels like EVERYONE is talking about Squid Game, the Korean ..."
  ],
  [
    "Game Theory: FNAF, The Clue that SOLVES Five Nights at Freddy&#39;s!",
    "Join the Theorists! ▻▻ http://bit.ly/1qV8fd6 Watch pt. 2 of this theory RIGHT NOW! ▻ http://bit.ly/1ZjhWDA With the FNAF ..."
  ],
  [
    "PowerWash Pals: MatPat from Game Theory",
    "I sit down and have a lengthy wash n' chat (for the first time I might add) with MatPat from Game Theory (and Film Theory (and ..."
  ],
  [
    "Game Theory: Monika Has ESCAPED! (Doki Doki Literature Club Plus)",
    "Get Your BRAND NEW Back to School Theory Wear! ▻ https://bit.ly/3loC36U When Team Salvato announced there Doki Doki ..."
  ],
  [
    "Game Theory: Luigi, the RICHEST Man in the Mushroom Kingdom? (Super Mario Bros)",
    "Don't Miss The Next Video! Subscribe! ▻▻ http://bit.ly/1qV8fd6 Can Bullet Bill kill you? ▻▻ http://bit.ly/1lu41Lo Luigi's SECRET ..."
  ],
  [
    "The INTRUDER Found Us! | MatPat Reacts to The Mandela Catalogue Vol. 4 (Analog Horror)",
    "Grab Some TheoryWear This Winter To Stay Warm ▻ https://theorywear.com/ Loyal Theorists, today we are diving back into the ..."
  ],
  [
    "Game Theory: 3 New FNAF Timeline Theories!",
    "Special thanks to NordVPN for sponsoring this episode! Get a HUGE discount on a 2 year plan + 4 months FREE!"
  ],
  [
    "Do NOT Watch This Video! | MatPat Reacts to The Mandela Catalogue Vol. 4 (Analog Horror)",
    "Stay Warm With Some New Holiday TheoryWear ▻ https://theorywear.com/ Friends, today marks the return of The Mandela ..."
  ],
  [
    "Game theory lessons - Historical example: Tobacco companies",
    "On Facebook: https://www.facebook.com/365careers/ On the web: http://www.365careers.com/ On Twitter: ..."
  ],
  [
    "Game Theory: FNAF, Your Pain Fuels Us",
    "Special thanks to NordVPN for sponsoring this episode! Visit https://NordVPN.com/matpat & use code MATPAT to get 70% off a 3 ..."
  ],
  [
    "Game Theory: Who is W.D. Gaster? (Undertale)",
    "Don't Miss Part 2, Subscribe! ▻▻ http://bit.ly/1qV8fd6 Why I Gave the Pope Undertale ▻▻ http://bit.ly/2l4NceU Watch us Fight ..."
  ],
  [
    "Film Theory: How To SURVIVE The Backrooms!",
    "Special thanks to Established Titles for sponsoring this episode! Get an extra 10% off you purchase w/ code filmtheorists ..."
  ],
  [
    "Game Theory: The Stolen Souls of Minecraft",
    "Special thanks to SimpliSafe for sponsoring this episode! Get SimpliSafe, the award-winning, easy to use home security system w/ ..."
  ],
  [
    "Game theory fnaf (in order)",
    "List of every Game Theory FNAF theory/video in order. Does not include Livestreams, reviews or reacts."
  ],
  [
    "#1 Game Theory Operations Research in Hindi | Pure &amp; Mixed Strategy | Saddle Point | JOLLY Coaching",
    "1 Game Theory Operations Research in Hindi | Pure & Mixed Strategy | Saddle Point | JOLLY Coaching Complete Playlist of ..."
  ],
  [
    "Game Theory: The Frozen Level You Will NEVER Play! (Kingdom Hearts 3)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Watch our Frozen 2 Film Theory! ▻ https://bit.ly/2CpRR1N Remember ..."
  ],
  [
    "Game Theory: Super Smash Bros Ultimate Ending EXPLAINED | World of Light True Ending",
    "Special thanks to NordVPN for partnering with us on this episode! Protect yourself & save 75% for 3 years!"
  ],
  [
    "Film Theory: Follow The Rabbit... Decoding The Walten Files.",
    "Special thanks to Google One for sponsoring a portion of this episode! Download the Google One app or visit ..."
  ],
  [
    "THE FUTURE OF FNAF!! Reacting to &quot;Game Theory FNAF 7 The Untold Story of Sister Location&quot;",
    "Original video: https://www.youtube.com/watch?v=yJTo3HnV8V0 P.O. Box 77614 Greensboro, NC 27417 I ate a banana for the ..."
  ],
  [
    "Game Theory: The End of Markiplier (In Space With Markiplier)",
    "Get Your Core Theory Wear! ▻ https://theorywear.com/ @Markiplier is BACK with another of his choose your own adventure style ..."
  ],
  [
    "#1, Introduction to Game Theory (Hindi)",
    "Subscribe https://www.youtube.com/channel/UCyq1iofNDouBhl1adenGgRw For video in English ..."
  ],
  [
    "Game Theory: You&#39;re Fighting The WRONG Person! (Genshin Impact)",
    "Special thanks to Genshin Impact for sponsoring this episode! Download Genshin Impact v2.5 here ▻ https://hoyo.link/8ecvRNA6 ..."
  ],
  [
    "Film Theory: Does This Backrooms Fan Theory Solve EVERYTHING?",
    "Special thanks to @Google for sponsoring a portion of this episode! Find out more about Google Belonging here!"
  ],
  [
    "Game Theory: Super Mario...BETRAYED!",
    "Luigi Is INSANELY RICH! ▻▻ https://goo.gl/d532Tk Vote: He is PURE EVIL! ▻▻ http://bit.ly/2bIx6nu Vote: He is a HERO!"
  ],
  [
    "Game Theory: FNAF Security Breach, I Know the BIG TWIST... I think",
    "Get our NEW Holiday & Official Theorist x FNAF Merch! ▻ https://bit.ly/2UkxCv0 We have brand new Holiday Theory Wear + a ..."
  ],
  [
    "This Roblox Game Has LORE?! | Rainbow Friends by Fragment Games",
    "Get Your TheoryWear! ▻ https://theorywear.com/ Theorists, we're back with another ROBLOX game! I'm playing Rainbow Friends ..."
  ],
  [
    "THIS THEORY IS INSANE! Game Theory: Minecraft, The FROZEN Nether (FIRST REACTION!)",
    "Hot Sauce Beats is Here! Today we got a new @GameTheory MINECRAFT LORE VIDEO! OMG this one was such a stretch but ..."
  ],
  [
    "Game Theory: Why FNAF Will Never End",
    "Join the Theorists! ▻▻ http://bit.ly/1qV8fd6 See MORE FNAF Game Theories! ▻ http://bit.ly/1eDfdlE FNAF 4 has been pretty much ..."
  ],
  [
    "Film Theory: One Punch Man Must Be STOPPED!",
    "Special thanks to Moonton for sponsoring this video! Join me in One Punch Man - The Strongest ▻ https://bit.ly/OPMTFT Use code ..."
  ],
  [
    "This Hammer Would DESTROY The World! | The SCIENCE of... Overwatch 2",
    "Snuggle up With Holiday TheoryWear! ▻ https://theorywear.com/ Loyal Theorists, could you imagine being so strong that you ..."
  ],
  [
    "Game Theory: You Give Them Life (Hello Puppets Scary VR Game)",
    "Get yourself our BRAND NEW Theory Wear!! ▻ http://creatorink.co/theorywear1 As a fan of scary indie games, I like to investigate ..."
  ],
  [
    "The LORE Behind the Monster Train! | Choo-Choo Charles",
    "Stay Warm This Winter With New Cozy TheoryWear ▻ https://theorywear.com/ Hey Theorists, today we're jumping BACK into ..."
  ],
  [
    "Game Theory Solved Examples| Minimax Principle| Saddle Point| Optimal Strategies |Value Of Game",
    "In this video I have explained Game Theory concepts. Few questions covered: 1.What is game theory? 2.Define minimax ..."
  ],
  [
    "Game Theory: The Hidden HORRORS Behind Petscop",
    "How DEADLY Is Super Mario's Bob-Omb? ▻ http://bit.ly/2FwGpRw Petscop- The Scariest Game You'll NEVER Play!"
  ],
  [
    "Game Theory: Does Luigi MEASURE Up? (Super Mario)",
    "STARTER SET!! ▻ http://www.dollarshaveclub.com/matpat Special thanks to The Dollar Shave Club for sponsoring this video!"
  ],
  [
    "Game Theory: What is a Kirby? The SCIENTIFIC PROOF!",
    "Special thanks to Honey for sponsoring this video! SAVE MONEY with Honey ▻▻ http://joinhoney.com/matpat With Kirby Star ..."
  ],
  [
    "Game Theory: Friday Night Funkin Just BROKE Its Own Lore!",
    "Special thanks to Raycon for sponsoring this episode! Get 15% off your Raycon purchase! ▻ https://buyraycon.com/matpat ..."
  ],
  [
    "Game Theory: You ARE Your Character! (Super Smash Bros Ultimate)",
    "Get Your NEW Holiday Theory Wear! ▻ http://bit.ly/2Taok30 Why You CAN'T Beat Smash Bros!▻ https://bit.ly/2PGYx0g Super ..."
  ],
  [
    "Game Theory: Listen and OBEY! The Mystery of Dislyte&#39;s Music",
    "Special thanks to Dislyte for sponsoring this episode! Start your adventure today for FREE! ▻ https://click.fan/Dislyte_TGT Plus get ..."
  ],
  [
    "I Miss The OLD Game Theory! | MatPat Reacts to the Game Theory Partner Shows",
    "Watch the latest episode of The SCIENCE ▻https://youtu.be/oKMV75fY2is Theorists, it's time for a BLAST to the PAST! Today, I'm ..."
  ],
  [
    "Game Theory: Pokemon Are Going EXTINCT! (Pokemon Sun and Moon)",
    "The Pokedex is FULL OF LIES! ▻▻ https://goo.gl/1sGoXL The TRUTH Behind Fire Pokemon! ▻▻ https://goo.gl/ayrokB ..."
  ],
  [
    "Game Theory Be Like",
    "matpat moment   discord: https://discord.gg/Va8yZcBMxC a throwback to how this channel blew up thumbnail inspired heavily by ..."
  ],
  [
    "Film Theory: The Breaking Bad Ending&#39;s HIDDEN Truth",
    "Visit our friends at Wisecrack! ▻▻ http://wscrk.com/1l4jt1o Watch their 'Breaking Bad' Special ▻▻ http://wscrk.com/1N9X49p ..."
  ],
  [
    "Game Theory: How WoW Almost Prevented the Coronavirus Crisis! (World of Warcraft)",
    "Get yourself some Theory Wear!! ▻ https://bit.ly/2N1m7V7 SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 Years ago now, ..."
  ],
  [
    "Security Breach&#39;s Post-It Room SOLVED - FNAF Theory",
    "Make sure to like and subscribe for more theories! Join the Guilded server if you're interested! (Like Discord, but fancy) ..."
  ],
  [
    "Game Theory: Luigi&#39;s SECRET Identity (Super Paper Mario)",
    "Join the Theorists! ▻▻ http://bit.ly/1qV8fd6 Mario Is MENTAL! ▻▻ http://bit.ly/23Wgqrf Peach IS DEAD ▻▻ http://bit.ly/1w3ofMl ..."
  ],
  [
    "Game Theory: Petscop - The Scariest Game You&#39;ll NEVER Play!",
    "SUBSCRIBE to Catch all the Theories ▻▻ http://bit.ly/1qV8fd6 SOLVING Raticate's DEATH! Pokemon ▻ http://bit.ly/2fWTiwj ..."
  ],
  [
    "Game Theory: The Dark Lore of Brawl Stars (ft KairosTime)",
    "Special thanks to Raycon for sponsoring this episode! Buy Now and Get 20% off! https://buyraycon.com/matpat Get your new ..."
  ],
  [
    "Film Theory: Someone PLEASE Help Elmo! (Sesame Street)",
    "Don't miss a Film Theory! ▻ http://bit.ly/1dI8VBH Do you remember when the battle of the century stormed every social media post ..."
  ],
  [
    "What is Game Theory in Operations Reasearch ? | Operational Research",
    "Support Simple Snippets by Donations - Google Pay UPI ID - tanmaysakpal11@okicici PayPal - paypal.me/tanmaysakpal11 ..."
  ],
  [
    "Game Theory: The Lost Cult of Minecraft Illagers",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 In my last Minecraft episode, I peeled back the mysterious layers of the ..."
  ],
  [
    "Game Theory: Mommy&#39;s Secret Army (Poppy Playtime)",
    "Special thanks to Public for sponsoring this episode! Sign up today and get your FREE stock! ▻ https://Public.com/MatPat ..."
  ],
  [
    "Game Theory: Duck Season&#39;s KILLER DOG... Unmasked! (Duck Season)",
    "Special Thanks to Oculus Rift for Sponsoring this video. Get your Oculus Rift today! ▻▻ http://bit.ly/2jdHe7Q Scariest Game You ..."
  ],
  [
    "Game Theory: FNAF, The New Breed",
    "Get our NEW Holiday & Official FNAF Merch! ▻ https://bit.ly/2UkxCv0 Don't forget to Subscribe to Food Theory!"
  ],
  [
    "Game Theory: Who Would Win -- Samurai, Knight, or Viking? (For Honor)",
    "Special thanks to Ubisoft for sponsoring this video! Check out For Honor ▻▻ http://ubi.li/hcbne VOTE: Samurai slay!"
  ],
  [
    "Game Theory: These 25 Pokemon are DEAD Because of YOU!",
    "Get Your BRAND NEW Theory Wear! ▻ https://theorywear.com/ Pokémon Legends: Arceus raised a LOT of questions about the ..."
  ],
  [
    "Game Theory: What is Ash Ketchum&#39;s REAL Age? (Pokemon)",
    "Subscribe to never miss a theory! ▻ http://bit.ly/1qV8fd6 How RICH is a Pokemon Master? ▻▻ https://bit.ly/2JlD4do The ..."
  ],
  [
    "Game Theory: The Animals in Animal Crossing Aren&#39;t Animals! (Animal Crossing: New Horizons)",
    "Get yourself some Theory Wear!! ▻ http://creatorink.co/theorywear1 SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 ..."
  ],
  [
    "Game Theory: How Bendy EXPOSES Disney&#39;s Cartoon CONSPIRACY (Bendy and the Ink Machine)",
    "Get VRV ad-free for 30 days ▻ http://bit.ly/2rg6RIR Special thanks to VRV for partnering with us for this episode! Wanna be a ..."
  ],
  [
    "Game Theory: Rosalina UNMASKED pt. 1 (Super Mario Galaxy)",
    "PART 2: THE EPIC CONCLUSION ▻ http://bit.ly/1AE62Wv Can Bullet Bill kill you? ▻▻ http://bit.ly/1lu41Lo Mario is a Psychopath!"
  ],
  [
    "Game theory worked example from A P  Microeconomics",
    "Keep going! Check out the next lesson and practice what you're learning: ..."
  ],
  [
    "Game Theory: FNAF 7,  The Untold Story of Sister Location",
    "Special thanks to Honey for sponsoring this episode! Join Honey for FREE! ▻ https://joinhoney.com/matpat And for a limited time, ..."
  ],
  [
    "D. Microeconomics - Game Theory",
    ""
  ],
  [
    "Patterrz Reacts to &quot;You&#39;re WRONG About Ash&#39;s Pikachu! (Game Theory)&quot;",
    "You're WRONG About Ash's Pikachu! https://www.youtube.com/watch?v=Ow3bMlScrzs by @GameTheory Main channel ..."
  ],
  [
    "Game Theory: We Let Them Out (Boneworks / Duck Season)",
    "SUBSCRIBE to never miss a Theory! ▻ http://bit.ly/1qV8fd6In Watch part 1! ▻ https://youtu.be/bqY0_ZeHs8k Last episode, we ..."
  ],
  [
    "Game Theory: Is This Video Game HAUNTED? (Petscop)",
    "Get yourself some NEW Spring Theory Wear!! ▻ http://bit.ly/2VtMR7Q The Petscop series has concluded... so we think. Now, the ..."
  ],
  [
    "Game Theory: FNAF, The Answer was RIGHT IN FRONT OF US (Five Nights at Freddys Sister Location)",
    "Special thanks to The Dollar Shave Club for sponsoring this video! ONLY $5 ▻▻ http://www.dollarshaveclub.com/matpat We ..."
  ],
  [
    "Game Theory: Bowser&#39;s LOST Child...Yoshi!",
    "Special thanks to NHTSA for sponsoring a portion of this video! Learn more NOW! ▻ https://bit.ly/ClickIt2022T Theorists, I have ..."
  ],
  [
    "Do NOT Watch This Video! | MatPat Reacts to The Mandela Catalogue Vol. 4 (Analog Horror)",
    "Stay Warm With Some New Holiday TheoryWear ▻ https://theorywear.com/ Friends, today marks the return of The Mandela ..."
  ],
  [
    "Game Theory: Solving Raticate&#39;s &quot;DEATH&quot; (Pokemon Red and Blue)",
    "Get a free 30 day trial of Audible ▻ http://bit.ly/MatPatAudible2016 Special thanks to Audible for partnering with us for this episode ..."
  ],
  [
    "Film Theory: Don&#39;t Trust A RAT! (Ratatouille)",
    "Thanks to Epic Games for sponsoring this video! Fortnite \"Nexus War\" is here with the Lore, Legends, Heroes and Villains from ..."
  ],
  [
    "Roblox&#39;s SCARIEST Game EVER!!! | Roblox DOORS",
    "Get Your TheoryWear! ▻ https://theorywear.com/ In today's episode, I'm doing my first run of Roblox's biggest horror game, ..."
  ],
  [
    "Film Theory: Paw Patrol Is DARKER Than You Think!",
    "Get Your BRAND NEW TheoryWear Before It's Gone ▻ https://theorywear.com/ Welcome back to MatPat ruins your childhood."
  ],
  [
    "Game Theory: Why You CAN&#39;T Beat Super Smash Bros Ultimate!",
    "Take Our Survey! ▻ http://sgiz.mobi/s3/9732b3f419a2 2 FREE Months of Skillshare! ▻ http://skl.sh/gametheorists2 Thanks to ..."
  ],
  [
    "Game Theory: The Dead Will RISE! (Andy&#39;s Apple Farm / Rabbit Knight)",
    "Special thanks to SeatGeek for sponsoring this episode: Get 20 off your first SeatGeek order w/ code GAMETHEORY ..."
  ],
  [
    "Game Theory 101: The Basics",
    "New to game theory? Start here. All the basics fully explained, including pure strategy Nash equilibrium, mixed strategy Nash ..."
  ],
  [
    "Game Theory: Pokemon GO&#39;s TRAGIC END!",
    "FREE 30 day trial of Audible ▻ http://bit.ly/MatPatAudible2016 Special thanks to Audible for partnering with us for this episode!"
  ],
  [
    "Game Theory: Please Come Home... (Andy&#39;s Apple Farm)",
    "Special thanks to Opera for sponsoring this episode! Download Opera GX FREE! ▻ https://operagx.gg/TheGameTheorists & get ..."
  ],
  [
    "Film Theory videos be like...",
    "Film Theory videos be like. This is a meme about film theory."
  ],
  [
    "Pokemon&#39;s Biggest Scandal SOLVED! Who&#39;s Ash&#39;s Father? | The SCIENCE of... Pokemon",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ It's happening. Theorists, today Austin is going to uncover the ..."
  ],
  [
    "Game Theory: Meet The NEW Monika! (Doki Doki Literature Club Plus)",
    "Get Your BRAND NEW Back to School Theory Wear! ▻ https://bit.ly/3loC36U Watch part 1! ▻ https://youtu.be/iFonEHwC65Q ..."
  ],
  [
    "Algebraic Method of Game theory in Hindi {3×3 Matrix} By JOLLY Coaching",
    "This video contains The most Complex method of game theory i.e. ALGEBRAIC METHOD which creates a lot of confusion in the ..."
  ],
  [
    "Oligopoly and Game Theory- Micro Topic 4.5",
    "My 90 second explanation of oligopolies and game theory. Understanding how to read the chart is the first step. The numbers in ..."
  ],
  [
    "D. Microeconomics - Game Theory",
    ""
  ],
  [
    "Game Theory: The Mario Timeline&#39;s SHOCKING Reveal",
    "Learn like a BOSS! FREE TRIAL ▻▻ http://bit.ly/lyndamatpat Special thanks to Lynda for partnering with us for this episode!"
  ],
  [
    "Game Theory: What is Ash Ketchum&#39;s REAL Age? (Pokemon)",
    "Subscribe to never miss a theory! ▻ http://bit.ly/1qV8fd6 How RICH is a Pokemon Master? ▻▻ https://bit.ly/2JlD4do The ..."
  ],
  [
    "Game Theory: Why Ridley is Smash&#39;s Deadliest Fighter! (Super Smash Bros Ultimate)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 The Super Smash Bros franchise has so many characters with so many ..."
  ],
  [
    "Game Theory: Why You CAN&#39;T Beat Super Smash Bros Ultimate!",
    "Take Our Survey! ▻ http://sgiz.mobi/s3/9732b3f419a2 2 FREE Months of Skillshare! ▻ http://skl.sh/gametheorists2 Thanks to ..."
  ],
  [
    "Game Theory: The SECRET Game You Didn&#39;t Find...(Inscryption)",
    "SUBSCRIBE to Never Miss A Theory! ▻ https://goo.gl/kQWHkJ In my last episode on Inscryption, we covered the main game..."
  ],
  [
    "Game Theory: Peach&#39;s Castle of LIES! (Super Mario Maker 2)",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/matpat My subscribers have already saved over ..."
  ],
  [
    "Game Theory: Minecraft and The Power of The Dead",
    "Special thanks to Raycon for sponsoring this video! Get 15% off your order! ▻ https://buyraycon.com/matpat LAST CHANCE to ..."
  ],
  [
    "Game Theory: The End of an Era",
    "Help me host Jeopardy by signing the petition! ▻ https://www.change.org/p/jeopardy-make-matpat-the-next-jeopardy-host ..."
  ],
  [
    "Game Theory: Solving Inscryption&#39;s FINAL Secret! (Inscryption)",
    "SUBSCRIBE to Never Miss A Theory! ▻ https://goo.gl/kQWHkJ Theorists, we've dived DEEP into this game and there is even ..."
  ],
  [
    "Film Theory: Follow The Rabbit... Decoding The Walten Files.",
    "Special thanks to Google One for sponsoring a portion of this episode! Download the Google One app or visit ..."
  ],
  [
    "Game Theory: How Mario BEATS Sonic at The Olympics!",
    "Special thanks to GEICO for sponsoring this episode! See how much money you could save on your car insurance NOW!"
  ],
  [
    "Film Theory: Don&#39;t Trust A RAT! (Ratatouille)",
    "Thanks to Epic Games for sponsoring this video! Fortnite \"Nexus War\" is here with the Lore, Legends, Heroes and Villains from ..."
  ],
  [
    "Game Theory: We Were TOTALLY WRONG! What Bendy&#39;s Ending REALLY Meant (Bendy and the Ink Machine)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Bendy FOOLED Us! ▻ https://bit.ly/2JaTzWi Bendy's Tragic Ending ..."
  ],
  [
    "Game Theory: FNAF, The Origins Of EVIL REACTION",
    "Game Theory: FNAF, The Origins Of EVIL REACTION Subscribe: https://bit.ly/3Lt0vyp | Twitch: https://twitch.tv/cistdostuffz Watch ..."
  ],
  [
    "Game Theory: Ellie Is NOT Immune! (The Last of Us Part 2)",
    "Special thanks to Raycon for sponsoring this episode! Go to https://buyraycon.com/matpat for 15% off your order! The Last of Us ..."
  ],
  [
    "Game Theory: Bowser&#39;s LOST Child...Yoshi!",
    "Special thanks to NHTSA for sponsoring a portion of this video! Learn more NOW! ▻ https://bit.ly/ClickIt2022T Theorists, I have ..."
  ],
  [
    "Game Theory: FNF, The Bob Mod SOLVED! (Friday Night Funkin)",
    "Special thanks to Raycon for sponsoring this episode! Get 15% off your Raycon purchase! ▻ https://buyraycon.com/matpat Help ..."
  ],
  [
    "Game Theory 101: The Basics",
    "New to game theory? Start here. All the basics fully explained, including pure strategy Nash equilibrium, mixed strategy Nash ..."
  ],
  [
    "Game Theory: Why Mario is Mental, Part 2",
    "Check out more bizarre facts about Mario with MatPat on DYKGaming! ▻ http://www.youtube.com/watch?v=KaOdvEaKTew Help ..."
  ],
  [
    "Game Theory: FNAF, We Solved Golden Freddy! (Five Nights At Freddy&#39;s)",
    "Special thanks to Audible for sponsoring this episode! Get get a 30-day trial of Audible today! ▻ https://audible.com/matpat or text ..."
  ],
  [
    "Game Theory: Cuphead&#39;s SINFUL SECRET Business!",
    "The Cuphead CONTROVERSY! ▻ http://bit.ly/2BUzx1J How Bendy Will END! ▻▻▻ https://goo.gl/hGeBMo SUBSCRIBE to Catch ..."
  ],
  [
    "Game Theory: Would YOU Stay Blind? (Close Your Eyes)",
    "Petscop: The Ghost Inside a Game ▻ https://bit.ly/2GmoZux Feeling ALONE? How Fortnite can HELP! ▻ https://bit.ly/2vLhd9z ..."
  ],
  [
    "Oligopoly and Game Theory- Micro Topic 4.5",
    "My 90 second explanation of oligopolies and game theory. Understanding how to read the chart is the first step. The numbers in ..."
  ],
  [
    "Game Theory: Did Dream FAKE His Speedrun? A Final Analysis.",
    "Special thanks to Skillshare for sponsoring this episode! The first 1000 Theorists get a FREE trial of Skillshare Premium ..."
  ],
  [
    "Game Theory: MatPat, I STOLE Your Channel!",
    "Today's very secret Game Theory is a special MatPat-Tastic tribute to the last 10 years of Stephanie and Matt, on and off of ..."
  ],
  [
    "Game Theory: Bowser&#39;s BROKEN HOME in Super Mario",
    "Hang out with us on our NEW CHANNEL GTLive! ▻▻ http://bit.ly/1LkSBnz Check out our friends at Wisecrack!"
  ],
  [
    "Game Theory: Portal 2, Does Chell DIE?",
    "Special thanks to Raycon for sponsoring this episode! Go to https://buyraycon.com/matpat for 15% off your order! The endings of ..."
  ],
  [
    "Film Theory: Why Musicians Will ALWAYS Survive A Quiet Place",
    "Get your CORE Theory Wear! ▻ https://theorywear.com/ When you watch A Quiet Place and A Quiet Place 2, we are shown how ..."
  ],
  [
    "Game Theory Online",
    "Game Theory Online is a joint project by Matt Jackson (Stanford University), Kevin Leyton-Brown (University of British Columbia) ..."
  ],
  [
    "Game Theory: The Dark Future of the Dream SMP (Minecraft)",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Dream has made Minecraft history with his SMP, or Survival ..."
  ],
  [
    "Game Theory: Is Link the STRONGEST Video Game Character? (Legend of Zelda)",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 It's been a while since I talked about Legend of Zelda, and since Nintendo ..."
  ],
  [
    "Food Theory: What Disney Is HIDING About The Grey Stuff! (Beauty and the Beast)",
    "SUBSCRIBE for Every Tasty Theory! ▻▻ https://bit.ly/2CdCooV Theorists, when was the last time you watched Disney's Beauty ..."
  ],
  [
    "Roblox&#39;s SCARIEST Game EVER!!! | Roblox DOORS",
    "Get Your TheoryWear! ▻ https://theorywear.com/ In today's episode, I'm doing my first run of Roblox's biggest horror game, ..."
  ],
  [
    "Security Breach&#39;s Post-It Room SOLVED - FNAF Theory",
    "Make sure to like and subscribe for more theories! Join the Guilded server if you're interested! (Like Discord, but fancy) ..."
  ],
  [
    "Game Theory: FNAF Just Got A Reboot... (FNAF VR Help Wanted)",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 FNAF is back... but not in the way you may be thinking. Oh, we are getting ..."
  ],
  [
    "Game Theory: The Lost History of Minecraft&#39;s Wither",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/matpat My subscribers have already saved over ..."
  ],
  [
    "Game Theory: FNAF, Another Mystery SOLVED!",
    "Check out Food Theory! ▻ https://bit.ly/3eSc5l6 Pizza is a SANDWICH?! ▻ https://youtu.be/TxhrZBO4jY0 Today Loyal Theorists ..."
  ],
  [
    "Game Theory: KFC Just WON The Console Wars",
    "Watch our other KFC Videos! I SOLVED KFC's Secret Recipe! ▻ https://youtu.be/KTABK8Il4Ko This Movie Exposed KFC's ..."
  ],
  [
    "Game Theory: The Tragedy of Deltarune (Undertale)",
    "Get your NEW Holiday Theory Wear! ▻▻ http://bit.ly/2Taok30 Use the Donate Button to support a future of better mental health!"
  ],
  [
    "Game Theory: How Deadly is Super Mario&#39;s Bullet Bill?",
    "Try 50% off NatureBox! ▻▻ https://naturebox.com/matpat Special thanks to NatureBox for partnering with us for this episode."
  ],
  [
    "Game Theory: I Made Markiplier&#39;s PERFECT Pokemon! (Markiplier Smash or Pass)",
    "Get yourself The Quest Jacket and SOLVE our mystery! ▻ https://theorywear.com/ Theorists, sometimes my job gets weird."
  ],
  [
    "FNAF Needs to START OVER",
    "Yesterday, Game Theory host (and the world's foremost FNAF expert) MatPat dropped the STEVE THEORY; the latest entry in his ..."
  ],
  [
    "Game Theory: Mario&#39;s Secret Fire Power is... Rocket Fuel!",
    "Special thanks to Honey for sponsoring this episode! Get Honey for FREE! ▻ http://joinhoney.com/matpat One of Mario's most ..."
  ],
  [
    "Game Theory: Until Dawn&#39;s TRAGIC Hero",
    "Join the Theorists! ▻▻ http://bit.ly/1qV8fd6 Like Until Dawn? Watch me PLAY IT! ▻▻ http://bit.ly/1XdnvWm Until Dawn is all about ..."
  ],
  [
    "Poppy Playtime Ch-2 reacts to Game Theory: You are the villian of Poppy Playtime || Gacha || 🥀",
    "Credit: https://youtu.be/_tB153oukBA."
  ],
  [
    "Game Theory: FNAF, The Cult of Glitchtrap (FNAF VR Curse of Dreadbear DLC)",
    "Get your NEW Holiday Theory Wear NOW! ▻ http://creatorink.co/theory-wear SUBSCRIBE for Every Theory!"
  ],
  [
    "This Roblox Game Has LORE?! | Rainbow Friends by Fragment Games",
    "Get Your TheoryWear! ▻ https://theorywear.com/ Theorists, we're back with another ROBLOX game! I'm playing Rainbow Friends ..."
  ],
  [
    "Game Theory: Are Video Games Anti-LGBT?",
    "Become a Theorist! ▻ http://bit.ly/1qV8fd6 Check out Jirard's FFVII Series ▻▻ http://bit.ly/1hsVZuh More Game Theory!"
  ],
  [
    "Game Theory: FNAF, The Faceless Puppet Master",
    "SUBSCRIBE to never miss a Theory! ▻▻ http://bit.ly/1qV8fd6 In my previous FNAF episode that dived into the new Fazbear ..."
  ],
  [
    "Game Theory: The Tragic Story of Minecraft&#39;s Zombie Pigmen (Piglins)",
    "Donate and get involved now! ▻ https://teamtrees.org/ SUBSCRIBE to never miss a Theory! ▻ http://bit.ly/1qV8fd6 Minecraft ..."
  ],
  [
    "Game Theory: FNAF, We Solved Golden Freddy! (Five Nights At Freddy&#39;s)",
    "Special thanks to Audible for sponsoring this episode! Get get a 30-day trial of Audible today! ▻ https://audible.com/matpat or text ..."
  ],
  [
    "Game Theory: FNAF, Goodbye Father (FNAF Security Breach Predictions)",
    "Special thanks to Displate for sponsoring this video! Enjoy big savings on your prints for a LIMITED TIME!"
  ],
  [
    "glamrocks react to&quot;their all aftons&quot;theory • tw in desc • og ✋😩",
    "swearing lazyness."
  ],
  [
    "Game Theory: SuperHot.exe is a VIRUS! SuperHot SUpeErHo̵̝̓̈ͅt̷̡̢͒̕  S̴̏ͅư̵̜p̶̺̍E̸̟̊ṟ̸̓Ĥ̸͖o̸̊͜t̴̯̎",
    "This video is sponsored by Oculus. Click here to learn more about the Oculus Quest! ▻ https://ocul.us/2JcWbUB Petscop: The ..."
  ],
  [
    "Food Theory: Do NOT Eat NyQuil Chicken!",
    "SUBSCRIBE for Every Tasty Theory! ▻▻ https://bit.ly/2CdCooV I can't believe I need to say this but DON'T EAT chicken cooked in ..."
  ],
  [
    "Game Theory: What ARE Minecraft Creepers?!?",
    "Become a Theorist! ▻▻ http://bit.ly/1qV8fd6 How much would Minecraft Diamond Armor cost?"
  ],
  [
    "Film Theory: Did Thor&#39;s Post Credit Scene Just Set Up [SPOILER]?! (Thor Love and Thunder)",
    "Special thanks to Displate for sponsoring this episode! Enjoy big savings on your prints for a LIMITED TIME!"
  ],
  [
    "The END of Afton... On Tape?! | Battington FNAF VHS Tapes Reaction",
    "Get Your TheoryWear! ▻ https://theorywear.com/ Want to participate in an upcoming Food Theory? Take our survey!"
  ],
  [
    "FNAF&#39;s Most TERRIFYING Fan Game! | JRs Five Nights at Freddy&#39;s Fan-Game (Scary Game)",
    "Get Your TheoryWear! ▻ https://theorywear.com/ The newest, and by far the SCARIEST FNAF fangame has finally been released."
  ],
  [
    "Game Theory: FNAF, The FINAL Theory! (Five Nights at Freddy’s) - pt 2",
    "Missed Part 1? Here it is! ▻▻ http://bit.ly/2lIYJRX How Bendy Will END! ▻▻▻ https://goo.gl/hGeBMo SUBSCRIBE for no ..."
  ],
  [
    "Game Theory | Mixed strategy in game theory | Notes of Game theory in operation Research",
    "HEY EVERYONE, THIS IS SACHIN HERE. WELCOME TO MY YOUTUBE CHANNEL - SACHIN EDUCATION HUB."
  ],
  [
    "Game Theory: FNAF Just Got A Reboot... (FNAF VR Help Wanted)",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 FNAF is back... but not in the way you may be thinking. Oh, we are getting ..."
  ],
  [
    "Losing the Battle",
    "If you are in need of help, please reach out: US: 1-800-784-2433, 1-800-273-8255, 1-866-4-U-TREVOR Canada: +1 ..."
  ],
  [
    "Game Theory: I Made Markiplier&#39;s PERFECT Pokemon! (Markiplier Smash or Pass)",
    "Get yourself The Quest Jacket and SOLVE our mystery! ▻ https://theorywear.com/ Theorists, sometimes my job gets weird."
  ],
  [
    "Episode 9 of Game Theory Thursday - extensive form games 🎲",
    "In today's episode, we teach you about extensive form games, what they are and what games in real life are extensive form."
  ],
  [
    "Game Theory: FNAF, The Monster We MISSED! (FNAF VR Help Wanted)",
    "SUBSCRIBE for Every Theory! ▻ ▻ http://bit.ly/1qV8fd6 What if we rethink the ENTIRE lore of FNAF? I'm talking taking it back to ..."
  ],
  [
    "Game Theory: Hello Neighbor - The DEVIL is in the Details!",
    "SUBSCRIBE to Catch all the Theories ▻▻ http://bit.ly/1qV8fd6 This is TRAGIC! | Petscop ▻▻ https://goo.gl/mVDSkD The ..."
  ],
  [
    "Game theory be like",
    "Idk anymore #gametheory #matpat #fnaf."
  ],
  [
    "HE SOLD HIS CHANNEL - reaction to game theory this is not my channel",
    "My REACTION to Game Theory: This is Not My Channel! MatPat and his team deserve every little ounce of success they are ..."
  ],
  [
    "Game Theory: FNAF, We were WRONG about the Bite (Five Nights at Freddy&#39;s)",
    "Subscribe for more FNAF! ▻▻ http://bit.ly/1qV8fd6 My 1st FNAF Theory! ▻▻ http://bit.ly/1Waxf2U All this time, I've been doing ..."
  ],
  [
    "Film Theory: Could Squid Game Be LEGAL? (오징어 게임)",
    "Get your new Holiday Theory Wear! ▻ https://creatorink.co/u7o The legality of Squid Game may seem like an easy question to ..."
  ],
  [
    "The (strange) Mathematics of Game Theory | Are optimal decisions also the most logical?",
    "Create your own website for free at Wix: https://www.wix.com/go/majorprep STEMerch Store: https://stemerch.com/ Support the ..."
  ],
  [
    "Minecraft&#39;s SCARIEST Theory #shorts",
    "The Minecraft community comes up with some pretty terrifying stuff.. Subcribe for more CONTENT =) Edited by me (= #shorts ..."
  ],
  [
    "Game Theory: FNAF, The Clue That ALMOST Solves Everything! (FNAF Security Breach)",
    "Get yourself The Quest Jacket and SOLVE our mystery! ▻ https://theorywear.com/products/quest-jacket Theorists, I am finally ..."
  ],
  [
    "Game Theory: Halo Armor&#39;s FATAL Flaw!",
    "Thanks to Microsoft for loaning us the real life Halo Armor and for sponsoring the episode, allowing us to bring in an armor ..."
  ],
  [
    "Film Theory: Joker Is The Hero of Gotham (Batman The Dark Knight)",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/filmtheorists My subscribers have already saved over ..."
  ],
  [
    "Game Theory: Portal&#39;s Companion Cube has a Dark Secret",
    "Portal's Companion Cube is perhaps one of gaming's most memorable and lovable characters (items?). But is the Companion ..."
  ],
  [
    "Game Theory: FNAF, The SECRET Afton (FNAF Security Breach)",
    "Special thanks to Displate for sponsoring this video! Enjoy big savings on your prints for a LIMITED TIME!"
  ],
  [
    "Game Theory: The Hidden Code of Unus Annus (Markiplier &amp; CrankGamePlays)",
    "Special thanks to Audible for sponsoring this video! Get a 30 Day FREE Trial ▻ http://audible.com/matpat Or text matpat to ..."
  ],
  [
    "Game Theory videos be like",
    "BENBROS channel membership https://bit.ly/2HHWSIz ◅ ▻ Join my Discord Server https://discord.gg/X3RvzVwVew ..."
  ],
  [
    "The Darkest Cartoon &amp; Video Game Theories",
    "Thanks to Bespoke Post for sponsoring this video! New subscribers get 20% off their first box — go to https://bspk.me/tuv20 and ..."
  ],
  [
    "Game Theory: The LOST History of Minecraft&#39;s Enderman",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Minecraft is a GIANT game full of many mysteries. So many that I could do ..."
  ],
  [
    "Oligopoly and Game Theory- Micro Topic 4.5",
    "My 90 second explanation of oligopolies and game theory. Understanding how to read the chart is the first step. The numbers in ..."
  ],
  [
    "Game Theory: We Need To Talk About FNAF",
    "Get yourself some BRAND NEW Theory Wear! ▻ https://bit.ly/3vu8MJs SUBSCRIBE to NEVER miss a Theory!"
  ],
  [
    "Game Theory: 3 NEW FNAF Security Breach Theories!",
    "Special thanks to NordVPN for sponsoring this episode! Go to https://NordVPN.com/matpat and use code MATPAT to get a 2-year ..."
  ],
  [
    "Game Theory: Sonic is Lying...AGAIN! (Sonic Mania)",
    "Visit Natalie's Channel For More on GEMS! ▻ https://goo.gl/zpcrsG We SOLVED Zelda's Timeline! ▻▻ https://goo.gl/8UdEmL ..."
  ],
  [
    "Game Theory: Gaming&#39;s Biggest Mystery SOLVED! | Half Life G MAN Theory",
    "SUBSCRIBE to Catch all the Theories ▻▻ http://bit.ly/1qV8fd6 Super Mario Maker DWARFS Our UNIVERSE!"
  ],
  [
    "Game Theory: Can Sonic SURVIVE His Own Speed? (Sonic the Hedgehog)",
    "How Fast is Sonic the Hedgehog?▻ https://bit.ly/1ecAfUX Sonic is Lying...AGAIN! ▻ https://youtu.be/zJm0AKZzlQY Subscribe to ..."
  ],
  [
    "Game Theory: Rosalina UNMASKED pt. 2 (Super Mario Galaxy)",
    "MISSED PART 1? ▻▻ http://bit.ly/Zg1DgQ Was Mario 3 staged? ▻▻ http://bit.ly/YADYaY So based on genetics and in-game lore ..."
  ],
  [
    "Game Theory: FNAF, The Faceless Puppet Master",
    "SUBSCRIBE to never miss a Theory! ▻▻ http://bit.ly/1qV8fd6 In my previous FNAF episode that dived into the new Fazbear ..."
  ],
  [
    "Game Theory: Trapped in the Machine (Petscop)",
    "Get yourself some NEW Spring Theory Wear!! ▻ http://bit.ly/2VtMR7Q Last episode we dove into the deeper world of Petscop."
  ],
  [
    "Game Theory: Kirby...Dream Land&#39;s Biggest THREAT! pt 1",
    "Special thanks to NordVPN for sponsoring this video! Go to https://NordVPN.com/MATPAT to get 75% off a 3 year plan and use ..."
  ],
  [
    "#4 Games without saddle point - Solving problem by Algebraic method and Dominance principle",
    ""
  ],
  [
    "WHEN YOU &amp; MATPAT HAVE SAME THEORY! #Shorts",
    "WHEN YOU AND MATPAT HAVE THE SAME THEORY FOR MOMMY LONG LEGS! LET'S GO! Subscribe ..."
  ],
  [
    "Game Theory Duck Season &amp; Boneworks",
    ""
  ],
  [
    "Game Theory: FNAF, Return To The Pit (3 New FNAF Theories)",
    "SUBSCRIBE to Never Miss A Game Theory! ▻ https://goo.gl/kQWHkJ Check out Rhett & Link's podcast 'Ronstadt' FREE on ..."
  ],
  [
    "Game Theory: The Tragedy of Minecraft&#39;s Sunken Tomb (The Drowned)",
    "Get Your NEW Holiday Theory Wear NOW! ▻ http://creatorink.co/theory-wear SUBSCRIBE to never miss a Theory!"
  ],
  [
    "Game Theory: FNAF, The Origins Of EVIL | Reaction",
    "A new Game Theory from MatPat about FNAF The Origins Of EVIL let's check it out Subsribe! The original link to the videos ..."
  ],
  [
    "Game Theory: A Boy and His D̴̬̝͖͍̋͋͛̊͆͑̄͋̄͐̏̔̚͠ő̵͔̦̭͉̟̬͌͊̽g̶̹̀̈́̈́͆̃͌́͆̈́́̎͝ (Boneworks / Duck Season)",
    "Special thanks to Raycon for sponsoring this episode! Get 15% off your order here! ▻ https://buyraycon.com/matpat There are so ..."
  ],
  [
    "Game Theory: Are Video Games Anti-LGBT?",
    "Become a Theorist! ▻ http://bit.ly/1qV8fd6 Check out Jirard's FFVII Series ▻▻ http://bit.ly/1hsVZuh More Game Theory!"
  ],
  [
    "Film Theory: Are Video Games the FUTURE of Movies?",
    "Subscribe to become a Film Theorist! ▻▻ http://bit.ly/1dI8VBH More Film Theories RIGHT NOW ▻ http://bit.ly/1dHmIsk Harry ..."
  ],
  [
    "Game Theory: Kirby...Dream Land&#39;s Biggest THREAT! pt 1",
    "Special thanks to NordVPN for sponsoring this video! Go to https://NordVPN.com/MATPAT to get 75% off a 3 year plan and use ..."
  ],
  [
    "WHEN YOU &amp; MATPAT HAVE SAME THEORY! #Shorts",
    "WHEN YOU AND MATPAT HAVE THE SAME THEORY FOR MOMMY LONG LEGS! LET'S GO! Subscribe ..."
  ],
  [
    "Game Theory Duck Season &amp; Boneworks",
    ""
  ],
  [
    "Game Theory: FNAF, Return To The Pit (3 New FNAF Theories)",
    "SUBSCRIBE to Never Miss A Game Theory! ▻ https://goo.gl/kQWHkJ Check out Rhett & Link's podcast 'Ronstadt' FREE on ..."
  ],
  [
    "Game Theory: The Tragedy of Minecraft&#39;s Sunken Tomb (The Drowned)",
    "Get Your NEW Holiday Theory Wear NOW! ▻ http://creatorink.co/theory-wear SUBSCRIBE to never miss a Theory!"
  ],
  [
    "Game Theory - Topic",
    ""
  ],
  [
    "Strongwill Game Theory",
    "This channel is dedicated to teaching Mobile Legends aspiring gamer's and hobbyist how to itemize properly. Regardless of what ..."
  ],
  [
    "Game Theory: FNAF, The Origins Of EVIL | Reaction",
    "A new Game Theory from MatPat about FNAF The Origins Of EVIL let's check it out Subsribe! The original link to the videos ..."
  ],
  [
    "Film Theory: The Tragic Secret of The Walten Files",
    "Special thanks to Google Security for sponsoring a portion of this episode! Visit https://G.CO/SAFERPASSWORDS to get started ..."
  ],
  [
    "Game Theory: A Boy and His D̴̬̝͖͍̋͋͛̊͆͑̄͋̄͐̏̔̚͠ő̵͔̦̭͉̟̬͌͊̽g̶̹̀̈́̈́͆̃͌́͆̈́́̎͝ (Boneworks / Duck Season)",
    "Special thanks to Raycon for sponsoring this episode! Get 15% off your order here! ▻ https://buyraycon.com/matpat There are so ..."
  ],
  [
    "Game Theory: Is Minecraft Netherite From SPACE?",
    "Get Your Holiday Theory Wear NOW! ▻ https://creatorink.co/4wj Welcome back to our series about the secret lore of Minecraft."
  ],
  [
    "Game Theory: Ellie Is NOT Immune! (The Last of Us Part 2)",
    "Special thanks to Raycon for sponsoring this episode! Go to https://buyraycon.com/matpat for 15% off your order! The Last of Us ..."
  ],
  [
    "THEORY - Wicked Game [VISUALIZER]",
    "THEORY's visualizer for 'Wicked Game', off the album \"Wake Up Call\", available now: http://theoryofadeadman.com Subscribe: ..."
  ],
  [
    "It finally happened.. Lily&#39;s Garden Game theory reaction AND IM IN IT",
    "The mad lad finally did it. The @GameTheory finally made a Lily's Garden game theory video. Will we find out more secrets?"
  ],
  [
    "Dumbest Mistake When Starting YouTube Channel: Advice from Game Theory’s MatPat #Shorts #MatPat",
    "See full interview here: https://youtu.be/MBQYIgsbSAY After starting 4 channels with over 31M subscribers, Game Theory's MatPat ..."
  ],
  [
    "Game Theory: Dear MatPat, I Fixed Your Theory (First Episode Remastered)",
    "SUBSCRIBE to Never Miss a Theory! ▻ https://goo.gl/kQWHkJ Watch the original episode! ▻ https://youtu.be/tgLSUuKqH4w ..."
  ],
  [
    "Game Theory: The Lost History of Minecraft&#39;s Wither",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/matpat My subscribers have already saved over ..."
  ],
  [
    "Game Theory: Can Chicken Nuggets SAVE YOUR LIFE?! | Kindergarten",
    "Subscribe to the Game Theorists! ▻▻ http://bit.ly/1qV8fd6 How LOGAN PAUL Conquered YouTube! ▻ https://goo.gl/wU5yVZ ..."
  ],
  [
    "Game Theory: Hard Mode is a LIE! (Sekiro Easy Mode Controversy)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Lately, gamers have been up in arms about whether or not all games ..."
  ],
  [
    "1. Finitely Repeated Games: Introduction (Game Theory Playlist 8)",
    "In this episode we describe finitely repeated games. Key takeaway concepts are stage games and discounted game payoffs."
  ],
  [
    "Game Theory: The Kindergarten Family Secret (Kindergarten 2)",
    "Special thanks to The Dollar Shave Club for partnering with us! $5 STARTER SET!! ▻ http://www.dollarshaveclub.com/matpat ..."
  ],
  [
    "Game Theory: FNAF 2, Gaming&#39;s Scariest Story SOLVED!",
    "UNLIMITED TV! ▻▻ http://www.huluplus.com/matpat Special thanks to Hulu for partnering with us for this episode! Join the ..."
  ],
  [
    "Science Blaster (Song Remix created by Nirre &amp; Acid Usagi) Game Theory Audio Spectrum Tribute",
    "Awesome job Nirre and Acid Usagi. And keep on Theorizing Mat Pat. You both are extremely awesome! =D Original Creators: ..."
  ],
  [
    "Game Theory 101: Terrorists at an Airport",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "Liv Boeree: Poker, Game Theory, AI, Simulation, Aliens &amp; Existential Risk | Lex Fridman Podcast #314",
    "Liv Boeree is a poker champion and science educator on topics of game theory, physics, complexity, and life. Please support this ..."
  ],
  [
    "Game Theory: You Are WRONG About Toad!",
    "Get Your Core Theory Wear! ▻ https://theorywear.com/ What is up with Toads? It's been a while since we talked about our ..."
  ],
  [
    "Food Theory: MrBeast Is WRONG About Wonka&#39;s Chocolate River! (Willy Wonka&#39;s Chocolate Factory)",
    "Get Your BRAND NEW TheoryWear Before It's Gone ▻ https://theorywear.com/ Listen, you know by now that when @MrBeast ..."
  ],
  [
    "Would Minecraft Steve STARVE to Death? | The SCIENCE of... Minecraft",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ Today Theorists, we are once again diving stomach first into ..."
  ],
  [
    "Game Theory: Ash&#39;s Age FINALLY Solved! (Pokemon)",
    "Subscribe to never miss a theory! ▻ http://bit.ly/1qV8fd6 What is Ash Ketchum's REAL Age? ▻ https://bit.ly/2KSmJKx How RICH is ..."
  ],
  [
    "Game Theory:  Does Isaac DIE?!? Binding of Isaac Rebirth&#39;s Endings EXPLAINED.",
    "Join the Theorists ▻▻ http://bit.ly/1qV8fd6 Check out DEADLOCK, SNES vs. SEGA! ▻▻ http://bit.ly/1zYUiMU VOTE: Indie Games ..."
  ],
  [
    "Dominance method of game theory (incase of pure strategy)",
    ""
  ],
  [
    "Game Theory: The End of an Era",
    "Help me host Jeopardy by signing the petition! ▻ https://www.change.org/p/jeopardy-make-matpat-the-next-jeopardy-host ..."
  ],
  [
    "How Game Theory Explains Putin&#39;s Aggression: Why Russia Might Invade Ukraine - TLDR News",
    "Tensions between Russia, Ukraine and the West are still ongoing and this story appears to be far from over. But in this video, we ..."
  ],
  [
    "Game Theory: The Mario Timeline&#39;s SHOCKING Reveal",
    "Learn like a BOSS! FREE TRIAL ▻▻ http://bit.ly/lyndamatpat Special thanks to Lynda for partnering with us for this episode!"
  ],
  [
    "Game Theory: FNAF, The Cult of Glitchtrap (FNAF VR Curse of Dreadbear DLC)",
    "Get your NEW Holiday Theory Wear NOW! ▻ http://creatorink.co/theory-wear SUBSCRIBE for Every Theory!"
  ],
  [
    "Game Theory: Follow the EYES! | FNAF Sister Location",
    "Subscribe for more Theories! ▻▻ http://bit.ly/1qV8fd6 FNAF Sister Location DECODED! ▻ http://bit.ly/2dE4NEZ Watch Us Beat ..."
  ],
  [
    "#7 mxn game | game theory | linear programming | Simplex method | Dr. Ruchi Khandelwal",
    "We have covered all the concepts of game theory using past years examination questions in our videos Other videos related to ..."
  ],
  [
    "CRAZIEST LORE EVER? Game Theory: FNAF, Golden Freddy NEVER Existed! (REACTION!)",
    "Hot Sauce Beats is Here! Today we are finally jumping into FNAF LORE with @GameTheory newest video GOLDEN FREDDY ..."
  ],
  [
    "Game Theory: FNAF STUMPED Me! (FNAF 6 Ultimate Custom Night)",
    "Bendy FOOLED Us! ▻ https://bit.ly/2JaTzWi FNAF 6, What was in the BOX? ▻ https://bit.ly/2JiFDwT Subscribe to never miss a ..."
  ],
  [
    "Game Theory 101: The Mixed Strategy Algorithm",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "Game Theory: Peach&#39;s Castle of LIES! (Super Mario Maker 2)",
    "Get Honey for FREE and start saving money today ▻ https://joinhoney.com/matpat My subscribers have already saved over ..."
  ],
  [
    "Game Theory: FNAF, Golden Freddy... NOT What We Thought!",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 There's a new FNAF book, which means it's time for Game Theory to ..."
  ],
  [
    "Choo Choo Charles - The Story Explained",
    "The Story and Ending of Choo Choo Charles Explained. Check out Choo Choo Charles on Steam: ..."
  ],
  [
    "Game Theory: Doki Doki&#39;s SCARIEST Monster is Hiding in Plain Sight (Doki Doki Literature Club)",
    "The Firestorm of Battlefront 2! ▻▻ https://goo.gl/Rmv4Zs Gaming Is BROKEN! What's Next? ▻▻ https://goo.gl/5Nf7uU ..."
  ],
  [
    "Game Theory: FNAF, The Theory That Changed EVERYTHING!! (FNAF 6 Ultimate Custom Night)",
    "FNAF STUMPED Me! ▻ https://bit.ly/2stBsVj FNAF 6, What was in the BOX? ▻ https://bit.ly/2JiFDwT Subscribe to never miss a ..."
  ],
  [
    "Game Theory... What Happened To You?",
    "Get Your 10th Anniversary Game Theory Merch! ▻ https://bit.ly/3fx9W2C SUBSCRIBE for 10 More Years of Theories!"
  ],
  [
    "Game Theory: FNAF Sister Location DECODED! (FNAF 5)",
    "Don't Miss a Jumpscare…SUBSCRIBE! ▻▻ http://bit.ly/1qV8fd6 I played FNAF In REAL LIFE ▻▻ http://bit.ly/29LeuPh MORE ..."
  ],
  [
    "Game Theory: FNAF, Four Games. One Story. And FNAF Theory Talkback!",
    "Video STARTS at 0:27. It's the first LIVE episode of Game Theory, where we outline the FINAL timeline for Five Nights at Freddy's ..."
  ],
  [
    "Game Theory: Resident Evil&#39;s Zombie Outbreak is Closer than You Think (Resident Evil 2)",
    "Special thanks to Capcom for sponsoring this episode! Get Your Copy Now!"
  ],
  [
    "Game Theory: Minecraft, The FROZEN Nether | Reaction",
    "A new Game Theory episode from MatPat Minecraft, The FROZEN Nether but HOW!? let's check it out Subscribe! The original link ..."
  ],
  [
    "Game Theory: Call of Duty, Modern War Crimes",
    "Are the heroes in the Call of Duty franchise really war criminals? The Red Cross seems to think so and they want them tried for ..."
  ],
  [
    "Game Theory: Doki Doki Decoded! (Doki Doki Literature Club)",
    "Missed Doki Doki Part 1? Watch it Here! ▻ http://bit.ly/2zdlS3M Scariest Game You Won't Play | Petscop ▻ http://bit.ly/2ksowKB ..."
  ],
  [
    "Andy&#39;s apple farm react to Game theory: Please Come Home...",
    "Well, I promised a video on this fandom a long time ago. But, to be honest, at that time I lost any motivation to finish it to the end ..."
  ],
  [
    "Game Theory 101 (#75): Screening Games",
    "http://gametheory101.com/courses/game-theory-101/ This lecture introduces screening games and solves for our first perfect ..."
  ],
  [
    "The Greatest Game Theorist Ever #Shorts",
    "visualizations of unreleased game characters = theory right @JakeFellman ? Subscribe ..."
  ],
  [
    "Game Theory: The KILLER&#39;S Promise | FNAF Sister Location",
    "Subscribe for more Theories! ▻▻ http://bit.ly/1qV8fd6 Missed Pt 1? HORRIFYING! ▻▻http://bit.ly/2eRN5wI Watch Us Beat Sister ..."
  ],
  [
    "An Interesting Game Theory Challenge | Circle of Truth | Israel National Math Olympiad | Cheenta",
    "Learn Advanced Mathematics with Cheenta: https://www.cheenta.com/matholympiad/ In this video, we will solve Israel National ..."
  ],
  [
    "MatPat the HOMEWRECKER?! (Game Theory Response)",
    "Here's yet another Game Theory response to MatPat's latest video Original Game Theory episode, “Game Theory: The SECRET ..."
  ],
  [
    "The FNAF-clone that went TOO FAR",
    "Scott is generally pretty easygoing when it comes to FNAF-inspired games, but in this case, he wasn't messing around."
  ],
  [
    "Game Theory FNAF Mysteries SOLVED Pt 2 (SECOND HALF)",
    "WATCH THE FIRST HALF ▻▻http://bit.ly/1EiQ31j Become a Theorist! ▻▻ http://bit.ly/1qV8fd6 Catch up on FNAF Game Theories ..."
  ],
  [
    "Game Theory: Animal Crossing&#39;s Scary Bunny unZIPPED! (Animal Crossing New Horizons)",
    "Start listening with a 30-day Audible trial. Get 1 audiobook & 10 Audible Originals absolutely free. Visit http://audible.com/matpat ..."
  ],
  [
    "#4 Games without saddle point - Solving problem by Algebraic method and Dominance principle",
    ""
  ],
  [
    "Game Theory: FNAF&#39;s True Villain... LITERATURE. [Highlights]",
    "SUPPORT THE STREAM: https://streamlabs.com/phisnom/tip ˃ Stream highlights for: https://youtu.be/BaTZdp82hLc - how to ..."
  ],
  [
    "Game Theory 101: Safety in Numbers and Best Responses",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "Game Theory: Did Reddit Just SOLVE FNAF?",
    "Get Yourself Some BRAND NEW Theory Wear! ▻ http://bit.ly/3qwx0AW You may be thinking, \"Hey MatPat, don't we already know ..."
  ],
  [
    "Game Theory: Super Mario Odyssey&#39;s GIANT Problem (Nintendo)",
    "TheoryWear! Get it BEFORE IT'S GONE! ▻▻ http://bit.ly/2rPBPK6 Subscribe to the Game Theorists! ▻▻ http://bit.ly/1qV8fd6 ..."
  ],
  [
    "FNAF Game Theory but every time he says &quot;BOOK&quot; we take a shot &amp; skip the video🍺",
    "SUPPORT THE STREAM: https://streamlabs.com/phisnom/tip ˃ BECOME A MEMBER: https://www.youtube.com/c/Phisnom/join ..."
  ],
  [
    "Game Theory: How Loot Boxes HACK YOUR BRAIN!",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Cuphead's SINFUL SECRET! ▻▻ https://goo.gl/xCGBNW Duck Season's ..."
  ],
  [
    "Game Theory: Nintendo’s SECRET PLAN for the SWITCH!",
    "Should Nintendo STOP the Switch? ▻▻ https://goo.gl/wtquUX I milk it HARD in 1-2-Switch ▻▻ https://goo.gl/WHiyzF Subscribe ..."
  ],
  [
    "Game Theory 101 (#46): Condorcet&#39;s Paradox and Social Preferences",
    "gametheory101.com/courses/game-theory-101/ It makes perfect sense for an individual's preferences to be rational. But when we ..."
  ],
  [
    "Game Theory: FNAF, The Grave Robber (Five Nights At Freddy&#39;s)",
    "Thanks to Honey for sponsoring this episode! Get the best deals while shopping online ▸ http://joinhoney.com/matpat Honey is ..."
  ],
  [
    "If Game Theory logo was a monster",
    "five nights at freddy's#fnaf theory#game theory#Game theory fnaf#3 scary games#markiplier scary games#horror games#Scary ..."
  ],
  [
    "Game Theory: The END of Princess Peach! (New Super Mario Bros U Deluxe Peachette / Bowsette)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Super Mario's BIGGEST Secret... Literally ▻ http://bit.ly/2wUj8px How to ..."
  ],
  [
    "Game Theory 101 (#21): Punishment Strategies",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "(AGT4E8) [Game Theory] Epsilon Core",
    "In this episode I define epsilon-core, which is a useful concept when core is empty. This video is part of my advanced game theory ..."
  ],
  [
    "Vapor Reacts to FNAF SB GAME THEORY The Final Security Breach Mystery SOLVED REACTION!",
    "Vapor Reacts to FNAF SB GAME THEORY The Final Security Breach Mystery SOLVED by The Game Theorists REACTION!"
  ],
  [
    "Chapter 3 Is Darker Than We Thought... (Poppy Playtime Theory)",
    "FOLLOW ME ON INSTAGRAM: https://www.instagram.com/sheeprampageyt/ JOIN DISCORD https://discord.gg/3H8TfNMEzq ..."
  ],
  [
    "Game Theory 101: Rock, Paper, Scissors",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "Film Theory: 3 Thor Love And Thunder Theories (Thor Trailer)",
    "Special thanks to Hello Fresh for sponsoring this episode! Get up to 16 FREE MEALS + 3 Surprise Gifts w/ code FILMTHEORY16 ..."
  ],
  [
    "GTLive",
    "Hello Internet and welcome to GTLive - our gaming talk show! From FNAF and Bendy, to Doki Doki and Hello Neighbor - we will ..."
  ],
  [
    "Finding the value of the game| Game theory",
    ""
  ],
  [
    "This YouTuber is OFFICIALLY Banned | MatPat Sells His Channel, LowTierGod, Coffezilla, TheQuartering",
    "MERCH ➧ https://www.WearItOmni.com/ My Twitter ➧ https://www.twitter.com/InfernoOmni My Twitch ..."
  ],
  [
    "Game Theory Podcast w/ Sam Vecenie",
    "This is the Game Theory Podcast. Hosted by Sam Vecenie (often with Adam Spinella and Mark Schindler), we chat about the NBA ..."
  ],
  [
    "DEATH THEORY | DEATH TOLL But Its A GAME THEORY COVER",
    "so very wacky and crazy like and subscrib credit where credit is due art: ..."
  ],
  [
    "Game Theory: The Tragedy of Deltarune (Undertale)",
    "Get your NEW Holiday Theory Wear! ▻▻ http://bit.ly/2Taok30 Use the Donate Button to support a future of better mental health!"
  ],
  [
    "Can Gamers SURVIVE the Real Mirror&#39;s Edge? - Game Lab",
    "Watch the 360 Episode! ▻▻ [INSERT LINK] Want More NOW? Check Out Game Theory! ▻▻http://bit.ly/1jPOmPJ Become a ..."
  ],
  [
    "Token Economics is more than just Game Theory. #shorts",
    "Game Theory is traditionally classified under the field of economics. But economics, especially in digital tokens and ..."
  ],
  [
    "Game Theory: Are Humans Obsolete? (Ghost Recon Breakpoint)",
    "Check out Ghost Recon Breakpoint. Pre-order the game and get guaranteed access to the beta here: https://ubi.li/QYMjm Special ..."
  ],
  [
    "What&#39;s the LEAST popular Pokémon game?",
    "There are many Pokémon games, split into 9 generations. But which generation is the most popular? And which one is the least ..."
  ],
  [
    "Game Theory: Mario&#39;s Secret Fire Power is... Rocket Fuel!",
    "Special thanks to Honey for sponsoring this episode! Get Honey for FREE! ▻ http://joinhoney.com/matpat One of Mario's most ..."
  ],
  [
    "I solved Among Us! | Game Theory | 9/11 Confirmed!",
    "AAAAAAAAAAAA I STOLE THIS BTW LMFAO."
  ],
  [
    "Episode 10 of Game Theory Thursday - Nash equilibrium ⚖️",
    "In today's episode, we teach you about Nash equilibrium, what it is and how you can identify it in a payoff table. Stay tuned folks ..."
  ],
  [
    "Cell By Cell Inspection Game Theory : How to Find the Nash Equilibrium.",
    "cell by cell inspection game theory: How to find the Nash equilibrium. Website www.vishnueconomicsschool.in Download my app ..."
  ],
  [
    "Game Theory: Five Nights at Freddy&#39;s SCARIEST Monster is You!",
    "FREE FOOD!! ▻▻ https://naturebox.com/matpat Special thanks to NatureBox for partnering with us for this episode! Join the ..."
  ],
  [
    "POV: game theory whenever a new FNAF game comes out",
    ""
  ],
  [
    "Jellybean Game Theory #shorts #gametheory #jellybean",
    ""
  ],
  [
    "Game Theory Equilibrium Calculator (Free Download!)",
    "http://wjspaniel.wordpress.com/game-theory-calculator/ That links you to my blog, where you can download an Excel spreadsheet ..."
  ],
  [
    "Game Theory 101: The Murder of Kitty Genovese (Volunteer&#39;s Dilemma)",
    "Someone is stabbed across the street from your apartment building. Is there a rational reason why nice people would end up not ..."
  ],
  [
    "Friday Night Funkin&#39; Matpat Vs Michael Afton FULL WEEK | Lore Expanded (FNF Mod) (Game Theory FNAF)",
    "Friday Night Funkin' Matpat Vs Michael Afton for the PC in 2160p Ultra HD. Matpat is from Game Theory and he is explaining the ..."
  ],
  [
    "Token Economics is more than just Game Theory. #shorts",
    "Game Theory is traditionally classified under the field of economics. But economics, especially in digital tokens and ..."
  ],
  [
    "L 09 Introduction to Game Theory | Game Theory | Operations Research | Mechanical",
    "Operations Research #MechanicalEngineering #OperationsManagement Online Lecture series of Operations Research by Mr ..."
  ],
  [
    "The Secret Horror Behind Carrion&#39;s Monster | The SCIENCE of... Carrion",
    "SUBSCRIBE to Catch all the Theories! ▻ https://goo.gl/kQWHkJ What's more fun than playing as a monster bent on eating ..."
  ],
  [
    "The Game Theory $1,000,000 Challenge for St. Jude! ft. MrBeast, Markiplier, Dream, Pokimane, &amp; more!",
    "Donate with the blue donate button! Special thanks to our title sponsors: State Farm®, for being such a good neighbor; and ..."
  ],
  [
    "Game Theory - Part 1 - Best Book to use for Intro to Game Theory",
    "This is the first in a series of videos on Game Theory."
  ],
  [
    "Game Theory: Are Humans Obsolete? (Ghost Recon Breakpoint)",
    "Check out Ghost Recon Breakpoint. Pre-order the game and get guaranteed access to the beta here: https://ubi.li/QYMjm Special ..."
  ],
  [
    "PulseChain Update | Game Theory Gang #40",
    "https://allmylinks.com/markwildofficial Daily updates: https://t.me/SmartVaultMe Mati's Chain 101 Course: https://PLS.academy ..."
  ],
  [
    "Game theory drawing",
    ""
  ],
  [
    "Episode 10 of Game Theory Thursday - Nash equilibrium ⚖️",
    "In today's episode, we teach you about Nash equilibrium, what it is and how you can identify it in a payoff table. Stay tuned folks ..."
  ],
  [
    "Game Theory: Five Nights at Freddy&#39;s SCARIEST Monster is You!",
    "FREE FOOD!! ▻▻ https://naturebox.com/matpat Special thanks to NatureBox for partnering with us for this episode! Join the ..."
  ],
  [
    "Game Theory: Nintendo’s SECRET PLAN for the SWITCH!",
    "Should Nintendo STOP the Switch? ▻▻ https://goo.gl/wtquUX I milk it HARD in 1-2-Switch ▻▻ https://goo.gl/WHiyzF Subscribe ..."
  ],
  [
    "Game Theory: How Loot Boxes HACK YOUR BRAIN!",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Cuphead's SINFUL SECRET! ▻▻ https://goo.gl/xCGBNW Duck Season's ..."
  ],
  [
    "Cade Cunningham out for the year; Killian Hayes resurgence! PLUS, some Hornets, Maxi Kleber injury",
    "James Edwards from The Athletic is here to break down a few different things across the NBA. First, we start with the Maxi Kleber ..."
  ],
  [
    "Game Theory: Dante&#39;s Age SOLVED (Fan-Made)",
    "I wanted to make a Game Theory-style video of my own and this subject seemed right at home with the kinds of videos MatPat's ..."
  ],
  [
    "Why did He &quot;Specifically&quot; ONLY Murder that Girl First?… Game Theory: FNAF, The Origins Of EVIL React",
    "Please CONSIDER SUBSCRIBING ..."
  ],
  [
    "Game Theory for DSE, ISI, IGIDR Exams || By Samikon",
    "Game Theory for DSE, ISI, IGIDR Exams || By Samikon Hey Guys there is a special batch for 2022-2023 Exams. For Special Batch ..."
  ],
  [
    "Film Theory: Is SAO the MOST EXPENSIVE GAME EVER? (Sword Art Online)",
    "SUBSCRIBE for More Film Theories! ▻ http://bit.ly/1dI8VBH Your SOUL'S Price? (Fullmetal Alchemist) ▻ https://goo.gl/KwMAeL ..."
  ],
  [
    "Game Theory: Is the Lost Level of Accounting+ Real? (Zoo Level Mystery)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Watch The 1st ACCOUNTING+ Theory ▻ https://bit.ly/2SAPejL Fortnite is ..."
  ],
  [
    "Game Theory: FNAF, the Origins Of EVIL - My Reaction",
    "OK OK OK LAST REACTION VIDEO BEFORE CIRCUS BABY VILLANY VIDEO I PROMISE."
  ],
  [
    "Game Theory: Gaster&#39;s Identity REVEALED! (Undertale)",
    "Flowey in MINECRAFT! ▻ http://bit.ly/2kU8eJl Part 1 - Who is W.D. Gaster?! ▻▻ http://bit.ly/2kT33t4 It's part 3 of my Undertale ..."
  ],
  [
    "Game Theory: Why Mario Kart 8 is Mario&#39;s DEADLIEST Game!",
    "Help us reach 10 million theorists! ▻ http://tinyurl.com/mrd2ntg Can Bullet Bill KILL?!? ▻ http://bit.ly/2rFgEHC I've done PLENTY ..."
  ],
  [
    "Security Breach reacts to Game Theory Part 2 ||Gacha Club|| 2nd. FNAF AU",
    "Original Video: https://youtu.be/WH_ugKNCKlQ Characters: Glamrock Freddy, Montgomery Gator, Glamrock Chica, Roxanne Wolf ..."
  ],
  [
    "Graphical Method In Game Theory | Game Theory Operation Research |  Hindi",
    "Hi guys, In this video we solve the problems of game theory by using Graphical Method , we try to explain the deep concept ..."
  ],
  [
    "Will Hogwarts Legacy Be CANON? | Harry Potter Game Theory",
    "This episode of Super Carlin Brothers is sponsored by BetterHelp — go to http://betterhelp.com/super to get 10% off your first ..."
  ],
  [
    "Little Nightmares 2: The Story &amp; All Endings Explained (Horror Game Theories)",
    "Little Nightmares 2 - what exactly is this game all about? How does it tie into the original Little Nightmares? What about that ..."
  ],
  [
    "Inside: The Story &amp; its Meaning Explained (Horror Game Theories)",
    "In today's game theory we take a look at creepy platform game Inside. Inside is a game full of mystery and a story that confuses at ..."
  ],
  [
    "Can YOU Survive FNAF IRL? | Free Episode Game Lab FNAF",
    "Get ready for intense 360 FNAC horror! ▻▻ http://bit.ly/28YFQ2o Want More NOW? Check Out Game Theory ..."
  ],
  [
    "Game Theory 101: The Murder of Kitty Genovese (Volunteer&#39;s Dilemma)",
    "Someone is stabbed across the street from your apartment building. Is there a rational reason why nice people would end up not ..."
  ],
  [
    "Game Theory: PROVING Mass Effect&#39;s Indoctrination Theory! | Mass Effect 3",
    "Special Thanks to The Dollar Shave Club for Sponsoring this video! Get 1st Month of Razors for Only $1 ..."
  ],
  [
    "The Greatest Game Theorist Ever #Shorts",
    "visualizations of unreleased game characters = theory right @JakeFellman ? Subscribe ..."
  ],
  [
    "Game Theory: Bendy 2, Return to the Ink Machine (Bendy and the Dark Revival)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 Thanks to Spence for letting us use his Joey Drew art!"
  ],
  [
    "OPEC Game Theory &amp; Oil",
    "Malcolm Graham-Wood talks to Nick Batsford about the impact of the recent OPEC meeting on oil prices."
  ],
  [
    "Game Theory: Why You Can&#39;t Save Aerith With a Phoenix Down! (Final Fantasy 7)",
    "SUBSCRIBE for Every Theory! ▻▻ http://bit.ly/1qV8fd6 Get yourself some NEW Theory Wear!! ▻ https://bit.ly/2N1m7V7 One of ..."
  ],
  [
    "The Pat McAfee Show Picks &amp; Predicts Every Game For NFL&#39;s Week 16 Weekend",
    "This is a conversation from The Pat McAfee Show LIVE from Noon-3PM EST Mon-Fri. If you aren't on FanDuel, what are you doing ..."
  ],
  [
    "Game theory#03:Questions on Maximin-minimax principle and Rule of Dominance| In operations research",
    "This is third video on game theory in which we practice questions on Maximin-minimax principle and Rule of Dominance."
  ],
  [
    "Game Theory | Knox Hill (Kxng Crooked feature)",
    "Extended version with Kxng Crooked out now!! Available on all streaming platforms: ..."
  ],
  [
    "Game Theory: Mario&#39;s Secret Fire Power is... Rocket Fuel!",
    "Special thanks to Honey for sponsoring this episode! Get Honey for FREE! ▻ http://joinhoney.com/matpat One of Mario's most ..."
  ],
  [
    "Poppy Playtime Ch-2 react to Game Theory: The Monster In The Shadows || Poppy Playtime || Gacha || 🥀",
    "Credit: https://youtu.be/DduGAca6hZU I just realised that I made the player's Grabpack red instead of blue jdsjajajsjdbshsjf I'm so ..."
  ],
  [
    "Game Theory: FNAF Mysteries SOLVED pt. 1",
    "WATCH PART 2 NOW ▻▻ http://bit.ly/1HDf3HW HUNGRY? Click for a FREE trial! ▻▻ https://naturebox.com/matpat Special ..."
  ],
  [
    "Security breach react to Game theory // Don&#39;t trust Gregory! // Fnaf/Security breach",
    "This was a rush video, and I'm still gonna post about the Vengeful spirit Deku au but I still don't have any ideas. Also sorry if ..."
  ],
  [
    "Every FNAF Game Theory: (Lego Blender Animation)",
    ""
  ],
  [
    "How I Saved Eugene in Choo Choo Charles",
    "In Choo-Choo Charles, Eugene unfortunately is lost to the spider train Charles right at the start of the game. But is it possible to ..."
  ],
  [
    "Game theory || Cooperative and Non-Cooperative Game || NTA UGC NET",
    "What Is Game Theory? Game theory is a theoretical framework for conceiving social situations among competing players. In some ..."
  ],
  [
    "Game Theory: World of Warcraft will SAVE the Economy",
    "Free HuluPlus Trial! ▻▻ http://www.huluplus.com/matpat Special thanks to Hulu for partnering with us for this episode! Become a ..."
  ],
  [
    "Game Theory: FNAF 4 got it ALL WRONG!",
    "Join the Theorists! ▻▻ http://bit.ly/1qV8fd6 See MORE FNAF Game Theories! ▻ http://bit.ly/1eDfdlE FNAF 4 is here and this time ..."
  ],
  [
    "Game Theory: Why Ridley is Smash&#39;s Deadliest Fighter! (Super Smash Bros Ultimate)",
    "SUBSCRIBE for More Theories! ▻ http://bit.ly/1qV8fd6 The Super Smash Bros franchise has so many characters with so many ..."
  ],
  [
    "Application and Limitation of Games Theory",
    "Dr. Vishal Saxena Associate Professor (Mathematics) Faculty of Agriculture & Veterinary Science Jayoti Vidyapeeth Women's ..."
  ],
  [
    "Video Game Theory!",
    "shorts."
  ],
  [
    "Game Theory: Every Team&#39;s Chance To Make The Playoffs Week 9, 2022",
    "Check out our other channels: NFL Tuesday Night Gaming https://www.youtube.com/c/NFLTNG NFL Mundo ..."
  ],
  [
    "Game Theory: Dante&#39;s Age SOLVED (Fan-Made)",
    "I wanted to make a Game Theory-style video of my own and this subject seemed right at home with the kinds of videos MatPat's ..."
  ],
  [
    "Video Game Theory!",
    "shorts."
  ],
  [
    "The Mario Crew + Bowser React to Bowser&#39;s Broken Home Game theory",
    "Welp this was Hell to make but here it is please enjoy original link:https://youtu.be/RlegP4oaFDY music ..."
  ],
  [
    "PulseChain Update | Game Theory Gang #40",
    "https://allmylinks.com/markwildofficial Daily updates: https://t.me/SmartVaultMe Mati's Chain 101 Course: https://PLS.academy ..."
  ],
  [
    "Little Nightmares 2: The Story &amp; All Endings Explained (Horror Game Theories)",
    "Little Nightmares 2 - what exactly is this game all about? How does it tie into the original Little Nightmares? What about that ..."
  ],
  [
    "Game Theory: FNAF, the Origins Of EVIL - My Reaction",
    "OK OK OK LAST REACTION VIDEO BEFORE CIRCUS BABY VILLANY VIDEO I PROMISE."
  ],
  [
    "Stop the FNAF ARG hunt",
    "Hey guys, it's time to get real for a moment. When I made the last video about the theoretical FNAF ARG, I did not expect the ..."
  ],
  [
    "Can YOU Survive FNAF IRL? | Free Episode Game Lab FNAF",
    "Get ready for intense 360 FNAC horror! ▻▻ http://bit.ly/28YFQ2o Want More NOW? Check Out Game Theory ..."
  ],
  [
    "Graphical Method In Game Theory | Game Theory Operation Research |  Hindi",
    "Hi guys, In this video we solve the problems of game theory by using Graphical Method , we try to explain the deep concept ..."
  ],
  [
    "Security Breach reacts to Game Theory Part 2 ||Gacha Club|| 2nd. FNAF AU",
    "Original Video: https://youtu.be/WH_ugKNCKlQ Characters: Glamrock Freddy, Montgomery Gator, Glamrock Chica, Roxanne Wolf ..."
  ],
  [
    "Every FNAF Game Theory: (Lego Blender Animation)",
    ""
  ],
  [
    "Game Theory FNAF Mysteries SOLVED Pt 2 (FIRST HALF)",
    "WATCH THE SECOND HALF ▻▻http://bit.ly/1zNFQOX Become a Theorist! ▻▻ http://bit.ly/1qV8fd6 Catch up on FNAF Game ..."
  ],
  [
    "Poppy Playtime Ch-2 react to Game Theory: The Monster In The Shadows || Poppy Playtime || Gacha || 🥀",
    "Credit: https://youtu.be/DduGAca6hZU I just realised that I made the player's Grabpack red instead of blue jdsjajajsjdbshsjf I'm so ..."
  ],
  [
    "Game Theory for DSE, ISI, IGIDR Exams || By Samikon",
    "Game Theory for DSE, ISI, IGIDR Exams || By Samikon Hey Guys there is a special batch for 2022-2023 Exams. For Special Batch ..."
  ],
  [
    "Game theory: Math marvels: The value of information in a real life decision game",
    "Game theory: Math marvels: The value (cost) of information Imagine that you have been working after college and now face the ..."
  ],
  [
    "Game Theory: Bendy&#39;s Tragic Ending EXPLAINED (Bendy and the Ink Machine Chapter 5)",
    "Special thanks to Honey for partnering with us for this episode! Get Honey for FREE ▻ https://joinhoney.com/matpat Save $ this ..."
  ],
  [
    "Game Theory: FNAF 6, What was in the BOX? (FNAF 6, Freddy Fazbear&#39;s Pizzeria Simulator)",
    "GT Shirts: ONLY A FEW LEFT!!! ▻ https://creatormash.com/ Announcement about MORE HOODIES coming NEXT WEEK! For two ..."
  ],
  [
    "Security breach react to Game theory // Don&#39;t trust Gregory! // Fnaf/Security breach",
    "This was a rush video, and I'm still gonna post about the Vengeful spirit Deku au but I still don't have any ideas. Also sorry if ..."
  ],
  [
    "MatPat sells Game Theory and channels #shorts #gametheory #news",
    "The Game Theorist gets acquired: “Steph and I just sold Theorist. We sold our business.” - Theorist Media has a new owner."
  ],
  [
    "How I Saved Eugene in Choo Choo Charles",
    "In Choo-Choo Charles, Eugene unfortunately is lost to the spider train Charles right at the start of the game. But is it possible to ..."
  ],
  [
    "Game theory || Cooperative and Non-Cooperative Game || NTA UGC NET",
    "What Is Game Theory? Game theory is a theoretical framework for conceiving social situations among competing players. In some ..."
  ],
  [
    "Expert-Level Pirate Problem: A Game Theory Puzzle",
    "Check out my books on Amazon (paid link): https://amzn.to/2SiQjlp It's the classic pirate problem with a twist. The Dread Pirate ..."
  ],
  [
    "Seems like I had the right mentality- Game Theory: FNAF The Origin of Evil reaction",
    "Read Description Hey everyone here is a new reaction video for you all to enjoy, now as always be sure to give some love and ..."
  ],
  [
    "Pop Culture Chaos on the Internet ft. @The Game Theorists and Christiano Hermoso",
    "In this episode of Capturing the Internet, we sit down with the YouTube trailblazing duo The Theorists and star photographer ..."
  ],
  [
    "proving why you get 0 bitches ft. game theory",
    ""
  ],
  [
    "Application and Limitation of Games Theory",
    "Dr. Vishal Saxena Associate Professor (Mathematics) Faculty of Agriculture & Veterinary Science Jayoti Vidyapeeth Women's ..."
  ],
  [
    "Game Theory 101: Battle of the Sexes in General Form",
    "Game Theory 101: The Complete Textbook on Amazon: ..."
  ],
  [
    "[FNaF] Security Breach react to Game theory[]Is Golden Freddy REALLY in Security Breach[]Part 30[]",
    "welcome~•~ ==================================== ※App Used: •Kinemaster •Gacha Club ..."
  ],
  [
    "Gone Golfing All Endings &amp; the Secret Story Explained (Horror Game Theories)",
    "Gone Golfing seems like a nonsensical horror game on the surface. A jumble of random ideas and concepts which don't make a ..."
  ],
  [
    "Gate 1 - How to Solve Each Key | Game Theory&#39;s ARG",
    "This video goes through all the evidence and how we get each clue and solve said clues to each key of the first gate of the Game ..."
  ],
  [
    "Testing Scary Minecraft Theory that is Actually Real",
    "I Tried Minecraft's Most Terrifying Haunted Mysteries! Will We Catch Cursed \"Long Legged Steve\" on Camera? Play Minecraft ..."
  ],
  [
    "The Game Theory $1,000,000 Challenge for St. Jude! ft. MrBeast, Dream, Markiplier &amp; more!",
    "Donate to St. Jude with us with the blue DONATE BUTTON! Special thanks to our title sponsor, YouTube Originals, for making this ..."
  ],
  [
    "Symmetry in Game Theory",
    "Talking about one of the most common ideas in Game Theory - symmetric response principal."
  ],
  [
    "(*Flash warning*)My OC version fnaf reacts to game theory (he must burn!)",
    "If these are not the version you see on fear but I wanted to twist things up :)"
  ],
  [
    "MatPat and Game Theorists make this much money...",
    "Today I'm looking at how much MatPat makes per month. This is their net worth. Join our Discord! https://discord.gg/rZbGpYM ..."
  ],
  [
    "Phân Tích Game: PROJECT PLAYTIME - Cuộc Chiến Tại Nhà Máy Đồ Chơi",
    "Video này phân tích game Project Playtime. ta sẽ nhập vai vào một nhân viên của công ty Playtime, tìm và giải mã các máy câu đố ..."
  ],
  [
    "Game Theory",
    "Professors Matthew Jackson and Yoav Shoham are offering a free online class on Game Theory starting January 2012."
  ],
  [
    "49. HOW TO SOLVE GAME WITHOUT GAME | Mathematical Economics | Game Theory [with Examples] | Eco Hons",
    "mixedstrategy #gametheory #mathematicaleconomics #examples Contact us: Mail us at:ecopedia02@gmail.com Whatsapp us: ..."
  ],
  [
    "Game Theory - Algorithm Games",
    "Game theory(Algorithm Games) questions are pretty commonly asked in Directi, Codenation, Adobe interviews. These have also ..."
  ],
  [
    "(AGT11E9) [Game Theory] Gibbard - Satterthwaite Impossibility Theorem Revisited",
    "In this episode I revisit the famous Gibbard-Satterthwaite impossibility result. This video is part of my advanced game theory ..."
  ],
  [
    "Game Theory: FNAF, The Final Security Breach Mystery SOLVED! @The Game Theorists REACTION!",
    "What's up YouTube!! Here is my reaction to Game Theory: FNAF, The Final Security Breach Mystery SOLVED! 0:00 Leave A Like!"
  ],
  [
    "10. Beliefs &amp; Mixed Strategies - Part 1 (Game Theory Playlist 1)",
    "This and the next episodes introduce the idea of beliefs and mixed strategies in games. Important Note for Navigating Lecture ..."
  ],
  [
    "FNAF 1 Reacts to game theory (GLamrock bonnie and Golden freddy)",
    ""
  ],
  [
    "NFL DFS Picks for Week 15 - Game Theory Thursday",
    "Welcome to Game Theory Thursday - NFL DFS Picks and Advice for Week 15 of the season. Our analysts, Ben and Sam break ..."
  ],
  [
    "The Film Theorists",
    "Hello Internet! I'm MatPat and welcome to FILM THEORY! Do you ever wonder what secrets could be hiding in your favorite ..."
  ],
  [
    "Economics Game Theory with a Principal Examiner for A Level Economics AQA, Edexcel and OCR",
    "Marwan Mikdadi, a former senior examiner for one of the main exam boards, explains game theory- one of the most poorly ..."
  ],
  [
    "ALICE IN BORDERLAND Season 2 Ending Explained | Season 3 Predictions And Joker Card Meaning",
    "ALICE IN BORDERLAND Season 2 Ending Explained | Season 3 Predictions And Joker Card Meaning. We review, recap and ..."
  ],
  [
    "Kendrick Lamar Type Beat - &#39;Game Theory&#39; | Prod. By Tellingbeatzz",
    "Download or Buy this beat at http://tellingbeatzz.com For exclusive inquiries or any general questions contact ..."
  ],
  [
    "Game Theory on The Children in Caves #shorts #pokemonshiningpearl",
    ""
  ],
  [
    "Game theory week one",
    ""
  ]
]