[
  [
    "National Webinar on &quot;NEVANLINNA THEORY AND ITS APPLICATIONS&quot;",
    "Organized by, Post Graduate & Research Department of Mathematics DWARAKA DOSS GOVERDHAN DOSS VAISHNAV ..."
  ],
  [
    "Nevanlinna Theory, Normal Families, and Algebraic Differential Equations",
    "Learn more at: http://www.springer.com/978-3-319-59799-7. Provides a self-contained introduction to Nevanlinna theory and ..."
  ],
  [
    "Nevanlinna Prize — Constantinos Daskalakis — ICM2018",
    "A film made by Simons Foundation. ICM 2018 - Rio de Janeiro | http://www.icm2018.org © 2018 International Mathematical Union ..."
  ],
  [
    "Nevanlinna Prize: Subhash Khot",
    ""
  ],
  [
    "Kazuya Kato - Height functions for motives, Hodge analogues, and Nevanlinna analogues",
    "We compare height functions for (1) points of an algebraic variety over a number field, (2) motives over a number field, ..."
  ],
  [
    "Nevanlinna Prize Lecture: Equilibria and fixed points — Constantinos Daskalakis — ICM2018",
    "Equilibria, fixed points, and computational complexity Constantinos Daskalakis Abstract: The concept of equilibrium, in its various ..."
  ],
  [
    "Emanuel Gull: &quot;Nevanlinna Analytical Continuation&quot;",
    "Simulations of finite temperature quantum systems provide imaginary frequency Green's functions that correspond one-to-one to ..."
  ],
  [
    "THEORY CONCEPTS You will never forget them | Free Course On Literary Theory",
    "This free course on literary theory will help you get a clear idea on concepts and theories."
  ],
  [
    "Analytic Ax Schanuel for Semi Abelian Varieties and Nevanlinna Theory (Professor Junjiro Noguchi)",
    ""
  ],
  [
    "Teaching New Theories: Brain functions and learner | By Navdeep Kaur",
    "Book and all-important links: https://linktr.ee/navclasses Enroll DI 10 PM Classes Unlock Code: NAVCLASSES 26 March ..."
  ],
  [
    "How Literary Theory Came Into Being",
    "This video will help students of English literature immensely."
  ],
  [
    "Commutant lifting and Nevanlinna-Pick interpolation in several variables",
    "Jaydeb Sarkar, Indian Statistical Institute, Bangalore November 23rd, 2021 Focus Program on Analytic Function Spaces and their ..."
  ],
  [
    "A. Srakar | Solution to stochastic partial Loewner eq with several comp. var using Nevanlinna theory",
    "O.A. Ladyzhenskaya centennial conference on PDE's, St. Petersburg, July 16 – July 22, 2022 Andrej Srakar (Institute for ..."
  ],
  [
    "Manjul Bhargava: The Musical, Magical Number Theorist",
    "A video profile of the 2014 Fields medalist Manjul Bhargava, whose search for artistic truth and beauty has led to some of the most ..."
  ],
  [
    "Mats Gustafsson: Bandwidth bounds based on Herglotz-Nevanlinna functions and optimization",
    "CONFERENCE Recorded during the meeting \" ​ Herglotz-Nevanlinna Functions and their Applications to Dispersive Systems ..."
  ],
  [
    "Clark Hull | Drive Reduction theory | Teaching Aptitude| NET/ JRF/ KVS/ Bed/ CTET By Navdeep Kaur",
    "Concept book Paper 1: https://amzn.to/3uYworO Commerce Complete Concepts with Charts, PYQs, Expected MCQs ..."
  ],
  [
    "Gelfand Transformations and Boundary Representations of Complete Nevanlinna-Pick Quotients",
    "Edward Timko, University of Manitoba November 23rd, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "2022 Spring Conference - Deformations of Geometric Structures in Current Mathematics: &quot;A Celebration of the works of  Masatake Kuranishi&quot;",
    ""
  ],
  [
    "Complex Analysis - The Pick Interpolation Theorem",
    "In this video we prove the Nevanlinna Pick Interpolation Theorem from Complex Analysis and H Infinity Control Theory."
  ],
  [
    "Campus 2015: Event opening by Professor Olavi Nevanlinna and Dean Helena Hyvönen",
    "Campus 2015 competition results were announced at 27.9.2013."
  ],
  [
    "Learning Theories | Skinner,Pavlov, Bloom taxanomy etc | UGC NET 2022 | Simranjit Kaur",
    "In this session, Educator Simranjit Kaur will be discussing the Skinner, Pavlov, Bloom taxonomy etc for NTA UGC NET Exam."
  ],
  [
    "Double Grassmannians and Coulomb branches of 3d 𝒩=4 quiver gauge theories – M. Finkelberg – ICM2018",
    "Lie Theory and Generalizations Invited Lecture 7.7 Double affine Grassmannians and Coulomb branches of 3d 𝒩=4 quiver ..."
  ],
  [
    "The most important operator",
    "In this video we look at the most important operator in all of operator theory, and this operator is the multiplication operator."
  ],
  [
    "5. september 2020",
    ""
  ],
  [
    "Science",
    ""
  ],
  [
    "The Eighth Israel CS Theory Day  21/12/2015",
    "Sanjeev Arora, Princeton University, Linear Algebraic Structure of Word Meanings."
  ],
  [
    "Evolution | Halden Oparin Theory - Part 1 | Life Science | Sneha Tailor | CSIR UGC NET",
    "In this session our Educator Sneha Tailor will be discussing Halden Oparin Theory in Life Science which will be hugely beneficial ..."
  ],
  [
    "National Conference on Analysis and its Applications - DAY 2 (AN Session )",
    "National Conference on Analysis and its Applications FOCUSED ON FIXED POINT THEORY NCAAFFPT - 2021 24th & 25th ..."
  ],
  [
    "The Nevanlinna-Pick Interpolation Problem",
    "Title: The Nevanlinna-Pick Interpolation Problem Speaker: John Kyei Date: Thursday, July 2nd 2020 Time: 2:00pm Abstract: In this ..."
  ],
  [
    "Professor Avi Wigderson on a computational theory of randomness",
    "Avi Wigderson is a professor of Mathematics at the Institute for Advanced Study in Princeton. After studying Computer Science at ..."
  ],
  [
    "NTA UGC NET 2020 (Paper-2) | Psychology by BL Rewar Sir | Theories of Learning",
    "NTA UGC NET 2020 (Paper-2) | Psychology by BL Rewar Sir | Theories of Learning In this video, we have compiled for you the ..."
  ],
  [
    "Abacus Medal 2022 Mark Braverman",
    "Mark Braverman is awarded the IMU Abacus Medal 2022 for his path-breaking research developing the theory of information ..."
  ],
  [
    "NTA UGC NET 2020 (Paper-2) | Psychology by BL Rewar Sir | Freud&#39;s Psychoanalytic Theories",
    "NTA UGC NET 2020 (Paper-2) | Psychology by BL Rewar Sir | Freud's Psychoanalytic Theories (फ्रायड का ..."
  ],
  [
    "Theoretical Computer Scientist Subhash Khot | 2016 MacArthur Fellow",
    "Subhash Khot is a theoretical computer scientist whose work is providing critical insight into unresolved problems in the field of ..."
  ],
  [
    "Fundamentals of Set Theory",
    ""
  ],
  [
    "Halden Oparin theory Part 1 | CSIR UGC NET 2022 | Sneha Tailor",
    "In this session, Sneha Tailor will be discussing about Halden Oparin theory . Watch the entire video about the Halden Oparin ..."
  ],
  [
    "Evolution - Theories of Evolution - Neo Darwinism",
    "Download the app for Live interactive classes at the lowest price possible. The courses contain Live classes, recorded videos of ..."
  ],
  [
    "The Unbounded Denominator Conjecture - Vesselin Dimitrov, University of Toronto.",
    "Chair for the Talk: B. Sury, ISI Bangalore. Abstract: Atkin and Swinnerton-Dyer conjectured a modularity characterization for Belyi ..."
  ],
  [
    "Arithmetic Statistics and Iwasawa Theory",
    "Speaker: Dr. Debanjana Kundu, University of British Columbia Date: January 31st, 2022 Fields Number Theory Seminar ..."
  ],
  [
    "2014 Fields Medalist : Maryam Mirzakhani",
    ""
  ],
  [
    "L02 3 Counting measure",
    "MS-E1600 Probability Theory 2021 Counting measures provide a bridge between discrete mathematics and probability theory."
  ],
  [
    "Literacy Criticism | National webinar | Dept of English |   Ms. NANNI V K Gfgc Halebeedu",
    ""
  ],
  [
    "Constantinos Daskalakis on Tackling High-Dimensional Data",
    "The 2018 Nevanlinna Prize winner describes his interest in economics, statistics, machine learning and the application of game ..."
  ],
  [
    "International Webinar on &quot;Recent Trends in Mathematics and Its Application in Computer Science&quot;",
    "An International Webinar entitled \"Recent Trends in Mathematics and Its Application in Computer Science\", organized by the ..."
  ],
  [
    "Mathematics International Webinar",
    ""
  ],
  [
    "Erikson&#39;s 8  Stages of Psychosocial Development, Identity Statuses of Marcia | By Navdeep Kaur",
    "10 PM Class https://unacademy.com/class/mcqs-on-paper-1-code-navclasses/1VIACKJY Unlock Code: NAVCLASSES Concept ..."
  ],
  [
    "ICSTC 2020 International Workshop on Distribution Theory and its Applications",
    "Day (2), Session-1 by Professor Kozubowski, University of Nevada, Reno, USA. For more details please visit: ..."
  ],
  [
    "Constantinos Daskalakis: A Poet of Computation Who Uncovers Distant Truths",
    "Constantinos Daskalakis on why he studies the interface between theoretical computer science and human behavior. Read the ..."
  ],
  [
    "Introduction to Control Theory",
    "This is an introductory course for Control Theory that has a rigorous mathematical leaning. We are going to talk about Laplace ..."
  ],
  [
    "O.A. Ladyzhenskaya centennial conference on PDE’s",
    ""
  ],
  [
    "NTA NET Crash Course Day 25 Psychoanalysis &amp; Feminism",
    "To help you pass NTA UGC NET English. Crash Course Schedule Oct 24 Brit Lit 1: Up to 17th C Oct 25 Brit Lit 2: 17th C to High ..."
  ],
  [
    "MCA 2021 - Herglotz-Nevanlinna functions and fluid permeability tensors - Miao-jung Yvonne Ou",
    "Miao-jung Yvonne Ou - University of Delaware, USA MCA 2021 - Day 1 - Diverse Aspects of Elliptic PDEs and Related Problems."
  ],
  [
    "Neo Darwinism The Modern Evolutionary Synthesis | Class 12 Biology",
    "Hi Everyone! Welcome To My Channel \"Ali Academy Biology Lectures\" About This Video ........................ In This Video Lecture You ..."
  ],
  [
    "Dennis Sullivan -  the 2022 Abel Prize Laureate",
    "A short film about the 2022 Abel Prize Laureate Dennis Sullivan. Produced by: Ekaterina Eremenko / EEFilms."
  ],
  [
    "6th Biennial International Group Theory Conference – 2021",
    "6th Biennial International Group Theory Conference – 2021 (6BIGTC–2021) is organized by the Department of Mathematics, ..."
  ],
  [
    "Short trip to Kalimpong ||sunny day☀️|| Lamahatta view point 😊",
    ""
  ],
  [
    "A Peek into Pick-Nevanlinna Interpolation | Dr. Deepak Kumar Pradhan",
    "Dr. Deepak Kumar Pradhan, Post Doctoral Fellow, Indian Statistical Institute, Bangalore Topic: A Peek into Pick-Nevanlinna ..."
  ],
  [
    "Ryoichi Kobayashi - Probabilistic Riemann–Hurwitz formula and measure concentration phenomenon",
    "Geoquant 2021 - Conference Abstract: Let (X,D) be a pair of an n-dimensional smooth projective variety X and a very ample ..."
  ],
  [
    "Brunner theory || Discovery learning theory || B. Ed 1st year ||  Naveen dahiya",
    "Brunner theory || Discovery learning theory || B. Ed 1st year || Naveen dahiya Brunner theory pdf file ..."
  ],
  [
    "New Theories Reveal the Nature of Numbers",
    "Follow us on Facebook: http://www.Facebook.com/EmoryUniversity Follow us on Twitter: http://www.Twitter.com/EmoryUniversity ..."
  ],
  [
    "U-M physics undergraduate proposes solution to quantum field theory problem",
    "When physicists need to understand the quantum mechanics that describe how atomic clocks work, how your magnet sticks to ..."
  ],
  [
    "Two Day International Webinar on Futuristic Trends in Mathematics 2021 || International Webinar",
    "Free Registration link: https://forms.gle/yzjKJ8C7vhzad1218 Resource person: Dr. Sankar Kumar Roy Professor Department of ..."
  ],
  [
    "MKJC-Applications of Mathematics in Current Scenario-23-07-2021 Session 1",
    ""
  ],
  [
    "Leibniz | Theory of Monads | Theory of Pre-established Harmony | Philosophy Simplified",
    "A detailed video on Leibniz, which includes his views on substance, the theory of monads as well as the theory of pre-established ..."
  ],
  [
    "Class-48 | Network/Theory of Communication/Mnemonics | UGC NET Paper-1 | Ravina @InculcateLearning",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UClEV2WmLx-PwDiWGaub2Kmw/join NTA UGC NET ..."
  ],
  [
    "Takuro Mochizuki - Non-abelian Hodge Theory for Monopoles with Periodicity",
    "Recently, we obtained equivalences between monopoles with periodicity and difference modules of various types, i.e., periodic ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Edward Witten",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Edward Witten; Fields Medal, 1990 Recipients of the the ..."
  ],
  [
    "Day-5: 6 Days National Webinar on &quot;Recent Trends in Mathematics&quot;",
    ""
  ],
  [
    "DIFFERENCE BETWEEN MEROMORPHIC AND ENTIRE FUNCTIONS",
    ""
  ],
  [
    "TWO DAYS INTERNATIONAL WEBINAR ORGANISED BY DEPT OF MATH (DAY-1)",
    ""
  ],
  [
    "Eveliina Peltola - Towards a conformal field theory for Schramm-Loewner evolutions?",
    "Presented on Tuesday, November 8, 2022, at 2 p.m. (Paris time) Within the framework of Seed Seminar of Mathematics and ..."
  ],
  [
    "Kantian theory (non consequentialist theories @NAISHA  ACADEMY )",
    "topic two business Ethics (@NAISHA ACADEMY )"
  ],
  [
    "Fields Medals 2022 James Maynard",
    "James Maynard is awarded the Fields Medal 2022 for contributions to analytic number theory, which have led to major advances ..."
  ],
  [
    "Neoliberalism (in Hindi)",
    ""
  ],
  [
    "Realism and Reality by Meenakshi Mukherjee / summary in tamil",
    ""
  ],
  [
    "An introduction to higher Teichmuller Theory - D. Canary",
    ""
  ],
  [
    "National Webinar on &quot;International Day of Persons with Disabilities&quot; - 03/12/2021",
    "PG & Research Department of Zoology, The New College, Chennai organized National webinar on \"International Day of Persons ..."
  ],
  [
    "Pluripotential theory and complex dynamics in higher dimension – Tien-Cuong Dinh – ICM2018",
    "Analysis and Operator Algebras Invited Lecture 8.13 Pluripotential theory and complex dynamics in higher dimension Tien-Cuong ..."
  ],
  [
    "DART 8 - James Freitag",
    "The algebraic relations between solutions of Painleve equations."
  ],
  [
    "COVID-19 : Quest for Scientific Solution",
    "Kalimpong College West Bengal."
  ],
  [
    "Communicating Computers and Computing Communicators: A need for a new unifying theory",
    "Madhu Sudan, Computer Science, MIT, MA This lecture has been videocast from the Computer Science Department at UNC."
  ],
  [
    "L11 Control Theory (Linearization of Nonlinear Models)",
    "This lecture video is about the Linearization of Nonlinear Models using Taylor's series expansion, also discuss about the principle ..."
  ],
  [
    "National Science Day 2021 Celebration: Webinar by Prof. P. K. Basu",
    "National Science Day 2021 organized by IETE Varanasi Sub-center and IEEE Photonics Society Student Branch Chapter IIT BHU ..."
  ],
  [
    "Costis Daskalakis - Meaning of Life - Game Theory and Philosophy",
    "Meaning of Life Symposium Playlist: https://www.youtube.com/playlist?list=PLypiXJdtIca7i8IrNye4IenjnUCP9LF35."
  ],
  [
    "Computational Insights and the Theory of Evolution - Dr. Christos Papadimitriou",
    "CSE 25th Anniversary Dr. Christos Papadimitriou Computational Insights and the Theory of Evolution Covertly computational ..."
  ],
  [
    "Kanickai Raj Live Stream: CSIR Problem Solving Techniques in Algebra and Analysis",
    ""
  ],
  [
    "HLFF Shortcuts: Avi Wigderson",
    "The Heidelberg Laureate Forum Foundation presents the Shortcuts – a series that highlights moments borrowed from the ..."
  ],
  [
    "One Day National-level Webinar on “Application of Mathematics in Different Fields”",
    "Organised by the Department of Mathematics in collaboration with IQAC , Sabang Sajanikanta Mahavidyalaya. Distinguished ..."
  ],
  [
    "2018 Fields Medal Akshay Venkatesh",
    "At the 2018 International Mathematical Congress we talk to the Professor at Stanford University about his unsusual approach to ..."
  ],
  [
    "Covid 19 &amp; Social Values",
    "Kalimpong College West Bengal."
  ],
  [
    "Annemarie Luger: Herglotz-Nevanlinna functions: realizations and generalizations",
    "CONFERENCE Recorded during the meeting \" ​Herglotz-Nevanlinna Functions and their Applications to Dispersive Systems and ..."
  ],
  [
    "Webinar on  &quot;Literary Theory : Challenges and Implications &quot;",
    "Webinar on \"Literary Theory: Challenges and Implications\" by Dr. G.V. Naresh Organized by Department of M.A. English, Dwaraka ..."
  ],
  [
    "Dan Spielman | Discrepancy Theory and Randomized Controlled Trials",
    "1/27/2021 Mathematical Science Literature Lecture Speaker: Dan Spielman (Yale University) Title: Discrepancy Theory and ..."
  ],
  [
    "Webinar by Department of Mathematics | SMC",
    "This video is brought to you by Marian Webisode an initiative by IQAC of St. Mary's College, Thrissur. Featured' Platinum Jubilee ..."
  ],
  [
    "Closed 3 forms in Five Dimensions and Embedding Problems (Professor Simon Donaldson)",
    ""
  ],
  [
    "Dhvani Theory",
    "Dhvani Theory explained in simple way for students of English literature preparing for competitive exams."
  ],
  [
    "W. H. Hudson: Taine&#39;s Formula / W. H. Hudson",
    "Hypollite_Taine_as_a_critic #Taine's_formula #Race_Milieu_Moment Dr. Vipul V. Kapoor, Associate Professor (MA, MPhil, PhD) ..."
  ],
  [
    "Normal familes",
    "We prove a special case of Arzelà–Ascoli theorem then use this to show that a uniformly bounded family of holomorphic functions ..."
  ],
  [
    "NATIONAL WEBINAR",
    "മലയാള വിഭാഗം ദേശീയ വെബിനാർ സമകാലീക മലയാള ഭാഷ വ്യവഹാരങ്ങളിലെ നൂതന ..."
  ],
  [
    "Live of Prof Hajiaghayi &amp; Prof Madhu Sudan of Harvard on Communication, Coding, Hardness, Randomness",
    "Glad to announce that this Sun Jul 31, 11AM ET, we, Prof. Madhu Sudan of Harvard and previously of MIT (also previously a ..."
  ],
  [
    "Covid 19 &amp; Social Values",
    "Kalimpong College West Bengal."
  ],
  [
    "NATIONAL WEBINAR",
    "മലയാള വിഭാഗം ദേശീയ വെബിനാർ സമകാലീക മലയാള ഭാഷ വ്യവഹാരങ്ങളിലെ നൂതന ..."
  ],
  [
    "Dan Spielman | Discrepancy Theory and Randomized Controlled Trials",
    "1/27/2021 Mathematical Science Literature Lecture Speaker: Dan Spielman (Yale University) Title: Discrepancy Theory and ..."
  ],
  [
    "Normal familes",
    "We prove a special case of Arzelà–Ascoli theorem then use this to show that a uniformly bounded family of holomorphic functions ..."
  ],
  [
    "W. H. Hudson: Taine&#39;s Formula / W. H. Hudson",
    "Hypollite_Taine_as_a_critic #Taine's_formula #Race_Milieu_Moment Dr. Vipul V. Kapoor, Associate Professor (MA, MPhil, PhD) ..."
  ],
  [
    "Fields Medal — Akshay Venkatesh — ICM2018",
    "A film made by Simons Foundation. ICM 2018 - Rio de Janeiro | http://www.icm2018.org © 2018 International Mathematical Union ..."
  ],
  [
    "Live of Prof Hajiaghayi &amp; Prof Madhu Sudan of Harvard on Communication, Coding, Hardness, Randomness",
    "Glad to announce that this Sun Jul 31, 11AM ET, we, Prof. Madhu Sudan of Harvard and previously of MIT (also previously a ..."
  ],
  [
    "MATHEMATICS MODEL MAKING WEBINAR",
    ""
  ],
  [
    "Webinar by Department of Mathematics | SMC",
    "This video is brought to you by Marian Webisode an initiative by IQAC of St. Mary's College, Thrissur. Featured' Platinum Jubilee ..."
  ],
  [
    "Ronnie Nagloo 9/19/14 Part 2",
    "Title: Model Theory and the Painlevé Equations."
  ],
  [
    "Probabilistic Approximation Theorems in Game Theory; The Theory of Crowdsourcing",
    "Talk 1: 3:30 to 4:15 Title: Probabilistic Approximation Theorems in Game Theory and Stochastic Optimization Speaker: Costis ..."
  ],
  [
    "CSIR Foundation Day + First Virtual Open Week",
    "Director's address."
  ],
  [
    "Complexity and Algorithmic Game Theory II",
    "Constantinos Daskalakis, Massachusetts Institute of Technology Economics and Computation Boot Camp ..."
  ],
  [
    "International webinar on &quot;STEM EDUCATION AND KNOWLEDGE INTEGRATION&quot;.",
    "Alagappa University College of Education, Karaikudi. Date: 15-06-2020 Time: 02:00 PM."
  ],
  [
    "Webinar on &quot;Foundations of Mathematics&quot;",
    "Organized by the Department of Mathematics in association with Department of Computer Studies of Government College of ..."
  ],
  [
    "Annemarie Luger: Herglotz-Nevanlinna functions: realizations and generalizations",
    "CONFERENCE Recorded during the meeting \" ​Herglotz-Nevanlinna Functions and their Applications to Dispersive Systems and ..."
  ],
  [
    "2018-06-13 Beyond Dynamical Mean Field Theory  - Emanuel Gull",
    "2018 Emergent Phenomena in Quantum Materials Summer School - Emanuel Gull."
  ],
  [
    "Webinar on Career avenues in Mathematics",
    ""
  ],
  [
    "Education Webinar I-EMC 2021: Modern Technology Would Be Unthinkable Without Mathematics",
    "website : https://i-emc.com 👉 Question via WA : +6282286000132 (Eduversal Indonesia) 👉 Instagram ..."
  ],
  [
    "COVID-19 : Quest for Scientific Solution",
    "Kalimpong College West Bengal."
  ],
  [
    "Fireside Chat with Eva Tardos",
    "Fireside Chat between Adith Swaminathan and Eva Tardos. See more at ..."
  ],
  [
    "Webinar on  &quot;Literary Theory : Challenges and Implications &quot;",
    "Webinar on \"Literary Theory: Challenges and Implications\" by Dr. G.V. Naresh Organized by Department of M.A. English, Dwaraka ..."
  ],
  [
    "SummerSchool 20060807 1130 Chai - Serre-Tate theory",
    ""
  ],
  [
    "Dhvani Theory",
    "Dhvani Theory explained in simple way for students of English literature preparing for competitive exams."
  ],
  [
    "Model Matching in Control Theory and Neuroscience",
    "Bode plots, Bode's sensitivity integral, and H infinity control are all tied together in this video, where we present one of the most ..."
  ],
  [
    "होयल तथा लिटिलटन का नवतारा सिद्धान्त",
    "पृथ्वी की उत्पत्ति भाग-7."
  ],
  [
    "Lecture: Avi Wigderson | September 20",
    "Imitation Games One of Alan Turing's most influential papers is his 1950 Computing machinery and intelligence, in which he ..."
  ],
  [
    "International Webinar on Disaster Management in times of Covid 19",
    "International webinar conducted by the Department of Geography, Nirmala College for Women, Coimbatore."
  ],
  [
    "Innovation in Interdisciplinary Research by Dr. Nidhi Sandal",
    "Innovation in Interdisciplinary Research by Dr. Nidhi Sandal Joint Director, DRDO, India."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Avi Wigderson",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Avi Wigderson; Nevanlinna Prize, 1994 Recipients of the ..."
  ],
  [
    "National Webinar on  &quot;An Introduction to Queuing Systems&quot;",
    "Organized by, Post Graduate & Research Department of Mathematics DWARAKA DOSS GOVERDHAN DOSS VAISHNAV ..."
  ],
  [
    "National Mathematics Day| Prof. Safoora Ansari| 22/12/2021",
    ""
  ],
  [
    "C.Gasbarri 03-01-2011.mp4",
    "Arithmetic of number fields, the geometry of algebraic curves and Nevanlinna theory."
  ],
  [
    "ONLINE NATIONAL MATHEMATICAL WEBINAR 2021- DAY 04 (Slot 01) (Organized by TMA)",
    "National Mathematical webinar organized by TMA on the occasion of National Mathematics day Celebrations. Title of Talk ..."
  ],
  [
    "Semi-infinite Hodge structure: from BCOV theory to Seiberg-Witten geometry - Si Li",
    "Prof. Si Li from Tsinghua University gave a talk entitled “Semi-infinite Hodge structure: from BCOV theory to Seiberg-Witten ..."
  ],
  [
    "NATIONAL WEBINAR  on Recent Advances in  Mathematical Sciences",
    "Department of Mathematics, Andhra Loyola College, Vijayawada."
  ],
  [
    "GIS &amp; Remote Sensing solutions for post Covid-19 New world order - Webinar Recording",
    "Episode 1., International webinar lecture series organised by Dept of Geography, Nirmala College for Women, Coimbatore, TN on ..."
  ],
  [
    "2018 Nevanlinna Prize  Constantinos Daskalakis",
    "At the 2018 International Mathematical Congress we talk to the MIT Professor about his work in algorithmic game theory, where he ..."
  ],
  [
    "Ornella Mattei: On the response of lossy two-phase composites subject to time-varying fields",
    "CONFERENCE Recorded during the meeting \" ​Herglotz-Nevanlinna Functions and their Applications to Dispersive Systems and ..."
  ],
  [
    "Chern Medal Award 2022 Barry Mazur",
    "Barry Mazur is awarded the 2022 Chern Medal for his profound discoveries in topology, arithmetic geometry and number theory, ..."
  ],
  [
    "Virtual HLF – Laureate Discussion: Where can computer science and mathematics interact fruitfully?",
    "Where can computer science and mathematics interact fruitfully? Laureate discussion with Alessio Figalli, Jon Kleinberg, Madhu ..."
  ],
  [
    "National Webinar on “Fractional and Discrete Fractional Calculus with Application”",
    "Organized by Post Graduate & Research Department of Mathematics DWARAKA DOSS GOVERDHAN DOSS VAISHNAV ..."
  ],
  [
    "Robert Nozick | Entitlement Theory | Libertarian Theory | Minimal state | For NET/SET | UPSC | WBCS",
    "robert_nozick #entitlement_theory #libertarian_theory #minimal_state #nozick_theory_of_justice #nozick ..."
  ],
  [
    "Eva Tardos: Theory and practice",
    "Six groups (teams Babbage, Boole, Gödel, Turing, Shannon, and Simon), composed of Microsoft Research computer scientists ..."
  ],
  [
    "“Pioneering Emerging Opportunities and Exploring New Realm in Chemical Sciences”.",
    "NIRMALA COLLEGE FOR WOMEN cordially invites you for the Two Days International Conference on \"PIONEERING EMERGING ..."
  ],
  [
    "nevanlinna",
    ""
  ],
  [
    "Introduction to Point Theory | Point Theory",
    "This lesson pertains the beginning of explanation in understanding the concept of \"one equals infinity\" AKA Point Theory. Marcus ..."
  ],
  [
    "Webinar on &quot; Corporate Readiness&quot; on 24th September #Corporate #Sourashtra College#BBA #Webinar",
    "National Webinar speech by Dr. Jins George. He focused on how to make the students equipped to be corporate ready. He also ..."
  ],
  [
    "Two-Day National Webinar on Film, Literature and Research",
    ""
  ],
  [
    "National Webinar on  Surprising Sequences",
    "Organized by Post Graduate & Research Department of Mathematics DWARAKA DOSS GOVERDHAN DOSS VAISHNAV ..."
  ],
  [
    "Structural Theory I: Trusses",
    ""
  ],
  [
    "#congruence #number_theory #new_era_maths_classes #linear_congruence B.A./B.Sc 1st year maths",
    "Download Our Application Today! 👉https://1lzl.short.gy/iWaOAf How to find Remainder by congruences . Definition of ..."
  ],
  [
    "Unitary Theory/Monarchic Theory  of Intelligence ഏക ഘടക സിദ്ധാന്തം",
    "theteachereducator #unitarytheory #MonarchicTheory of Intelligence #ഏകഘടകസിദ്ധാന്തം Unitary theory/Monarchic ..."
  ],
  [
    "Dennis Sullivan -  the 2022 Abel Prize Laureate",
    "A short film about the 2022 Abel Prize Laureate Dennis Sullivan. Produced by: Ekaterina Eremenko / EEFilms."
  ],
  [
    "National Webinar on Scaling the IoT with Edge Computing, Block Chain and Industry 4.0",
    "Greetings from Dr.M.G.R.Educational and Research Institute!!! Title: National Webinar on Scaling the IoT with Edge Computing, ..."
  ],
  [
    "Takuro Mochizuki - Non-abelian Hodge Theory for Monopoles with Periodicity",
    "Recently, we obtained equivalences between monopoles with periodicity and difference modules of various types, i.e., periodic ..."
  ],
  [
    "International Webinar on Innovations in Science and Technology IWIST-2021",
    ""
  ],
  [
    "Russian Formalism Part One - Advanced Lecture",
    "This video Formalism Part One will help students of English literature to prepare for BA and MA university exams and NTA ..."
  ],
  [
    "Topology and Geometry 09 -  Slit Map",
    "Topology and Geometry 09 - Slit Map."
  ],
  [
    "NAAC RAF FDP  - Session 5",
    "NAAC RAF FDP - Session 5."
  ],
  [
    "Diophantine Equations | Quickly Solving Method | Number Theory | Tamil | GS",
    "In this video we'll see HOW TO SOLVE LINEAR DIOPHANTINE EQUATIONS in very quickly. NOTE: In 08:11 we have to divide ..."
  ],
  [
    "Neuman- Morgenstern Hypothesis # Malayalam Explanation.",
    ""
  ],
  [
    "Fermat&#39;s Theorem (Malayalam) /CS 409 Cryptography &amp; Network Security",
    "Fermat's Theorem and problems."
  ],
  [
    "How Will Covid-19 Transform The State of Education For Future Generations? | International Webinar",
    "Day one of the two days international Webinar Department of Education North India Group of Colleges Najibabad, District Bijnor ..."
  ],
  [
    "U-M physics undergraduate proposes solution to quantum field theory problem",
    "When physicists need to understand the quantum mechanics that describe how atomic clocks work, how your magnet sticks to ..."
  ],
  [
    "Presidency College Mathematics  Webinar",
    "Graphs from Commutative Rings."
  ],
  [
    "Akshay Venkatesh: A Number Theorist Who Bridges Math and Time",
    "Akshay Venkatesh on his mathematical working style, which took him many years to discover. Read the full profile here: ..."
  ],
  [
    "Sexual Dysfunction in Women || VVIO Times || 19.02.2021 || TOG Webinar || Science Integra",
    ""
  ],
  [
    "Webinar on National Science Day",
    "Theme: Raman Effect Organized by: APC Roy Eco Club in association with IQAC, Raja Peary Mohan College."
  ],
  [
    "Leibniz | Theory of Monads | Theory of Pre-established Harmony | Philosophy Simplified",
    "A detailed video on Leibniz, which includes his views on substance, the theory of monads as well as the theory of pre-established ..."
  ],
  [
    "An introduction to higher Teichmuller Theory - D. Canary",
    ""
  ],
  [
    "National Webinar on Impact of Tales and Stories on the Psychology of a Child 20200817 0529 1",
    "Resource person: Rashmi Narzary, She is an Author, Columnist and Freelance Editor. She created a niche for her poetry at the ..."
  ],
  [
    "ASSE Seminar 2021 | Department of Mathematics | BIT Mesra | Day-1 Morning Session",
    "The Department of Mathematics is going to organize a two day seminar on \"Applications of Statistics in Sciences ..."
  ],
  [
    "Wlodzimierz Zwonek &quot;Function theory on special domains symmetrized polydisc, tetrablock&quot;",
    "complex analysis seminar https://sites.google.com/view/complex-analysis-seminar/home-page."
  ],
  [
    "Constantinos Daskalakis on Tackling High-Dimensional Data",
    "The 2018 Nevanlinna Prize winner describes his interest in economics, statistics, machine learning and the application of game ..."
  ],
  [
    "Game Theory - lecture 4",
    "game situation & Equilibrium."
  ],
  [
    "ICSTC 2020 International Workshop on Distribution Theory and its Applications",
    "Day (2), Session-1 by Professor Kozubowski, University of Nevada, Reno, USA. For more details please visit: ..."
  ],
  [
    "Complexity and Algorithmic Game Theory I",
    "Constantinos Daskalakis, Massachusetts Institute of Technology Economics and Computation Boot Camp ..."
  ],
  [
    "IDWGS technical  session on 15.02.2022",
    "The Undergraduate Department of Physics in association with IQAC conducted the Technical Session on Day 2 of the Two Week ..."
  ],
  [
    "Minkowski inequality theorem ( measure theory)",
    "real #msc #minkowski Hlw gus , Welcome to my Youtube chanel Nb creator😇🙏 Holder theorem 👉https://youtu.be/L9MxewCI7DU"
  ],
  [
    "Representation theory of W-algebras and Higgs branch conjecture – Tomoyuki Arakawa – ICM2018",
    "Lie Theory and Generalizations Invited Lecture 7.2 Representation theory of W-algebras and Higgs branch conjecture Tomoyuki ..."
  ],
  [
    "Prof. Konstantinos Katsikopoulos: David Blockley lectures in Systems",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Edward Witten",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Edward Witten; Fields Medal, 1990 Recipients of the the ..."
  ],
  [
    "L-44: Complex Analysis (Singularity at infinity, Entire, Meromorphic and Rational functions)",
    "Singularity at infinity, Definition of Entire, Meromorphic and Rational functions."
  ],
  [
    "Fields Medals 2022 James Maynard",
    "James Maynard is awarded the Fields Medal 2022 for contributions to analytic number theory, which have led to major advances ..."
  ],
  [
    "THE ENDURING JOURNEY OF TAMIL NADU OVER THE AGES",
    "WEBINAR ON \"THE ENDURING JOURNEY OF TAMIL NADU OVER THE AGES\" DEPARTMENT OF HISTORY AND TTM ..."
  ],
  [
    "Mathematics Webinar by Dr. Rajat Subhra Hazra",
    "Topic - Sandpile, Odometers, Membrane & Random Forests. Date - 17th October, 2020 Organized by: Department of Mathematics ..."
  ],
  [
    "Money Fintech 2018 / Hanno Nevanlinna / Futurice",
    ""
  ],
  [
    "Term symbol by Gopal Reddy N B",
    "Derivation of term symbol and mulliken symbol for dn system."
  ],
  [
    "Seminar on Applied Geometry and Algebra (SIAM SAGA): Jan Draisma",
    "Date: Tuesday, April 13 at 11:00am Eastern time zone Speaker: Jan Draisma, Bern University / Eindhoven University of ..."
  ],
  [
    "What Do Smart Entrepreneurs Spend Their Time On?",
    "virtualassistantjobs #outsourcing #philippinesoutsourcing #femaleentrepreneurs #successmotivation #successmindset ..."
  ],
  [
    "Advanced Course I: Schramm Loewner Evolution and Lattice Models Lecture 1: Part 1",
    "Ilia Binder - University of Toronto September 13, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Two-Day National Webinar on Film, Literature and Research",
    ""
  ],
  [
    "IMU Awards",
    ""
  ],
  [
    "9. Examples on Linear Diophantine Equation | Number Theory | Ravina Tutorial | in Hindi",
    "Hi Everyone !!! My name is Ravina , welcome to \"Ravina Tutorial\". Here you will find video lectures related to Bsc/Msc (Higher ..."
  ],
  [
    "What are Neutrinos? (Neutrino Hypothesis, Properties, Handedness)",
    "Neutrino Hypothesis - 02:47 | Neutrinos - 11:27 | Neutrino Properties - 16:00 | Left-handed Neutrinos & Right-handed ..."
  ],
  [
    "Xin Fang - Tropical flag varieties - a Lie theoretic approach - TGiZ December 4th, 2020",
    "Speaker: Xin Fang (Universität Köln) Title: Tropical flag varieties - a Lie theoretic approach Abstract: In this talk I will explain how ..."
  ],
  [
    "Euler&#39;s Theorem",
    "Network Security: Euler's Theorem Topics discussed: 1) Euler's Theorem – Statement and Explanation. 2) Explanation on finding ..."
  ],
  [
    "Probabilistic Approximation Theorems in Game Theory; The Theory of Crowdsourcing",
    "Talk 1: 3:30 to 4:15 Title: Probabilistic Approximation Theorems in Game Theory and Stochastic Optimization Speaker: Costis ..."
  ],
  [
    "Communicating Computers and Computing Communicators: A need for a new unifying theory",
    "Madhu Sudan, Computer Science, MIT, MA This lecture has been videocast from the Computer Science Department at UNC."
  ],
  [
    "Fields Medal Winner 2014 Martin Hairer",
    "Martin Hairer is awarded a Fields Medal for his outstanding contributions to the theory of stochastic partial differential equations, ..."
  ],
  [
    "SDSCon 2022 - Michael Jordan, UC Berkeley",
    "On Dynamics-Informed Blending of Machine Learning and Game Theory."
  ],
  [
    "SXIE Mathematics Webinar 30 June,2020",
    ""
  ],
  [
    "The Story of Complexity - Christos Papadimitriou",
    "A free public lecture by Christos H. Papadimitriou on The story of complexity, as part of the Symposium on 50 Years of Complexity ..."
  ],
  [
    "Math Input tools Day 1 Math webinar series ICT TOOLS IN MATHEMATICS",
    "Math input tools USing Word Google docs voice typing MAthcast Mathpix Unicodeit Math webinar series By karkandukanitham ..."
  ],
  [
    "Game Theory CH00 Welcome to the course",
    "A video describing the course and the course site."
  ],
  [
    "A Webinar on E-Learning facilities",
    "Organized by Bangalore Institute of Technology."
  ],
  [
    "Day 3: Mathematics National Webinar on Emerging Trends in Applied Mathematics",
    ""
  ],
  [
    "A national webinar series on “Current trends in Mathematical Applications in Engineering” Day-3",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Subhash Khot",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Subhash Khot; Nevanlinna Prize, 2014 Recipients of the ..."
  ],
  [
    "Day-5 Session of Five Day Online Workshop on &quot;Intellectual Property Rights&quot;.",
    "Day-5 Topic:- \" Patenting Strategies\". by \"Mr. Ravindranadh Kacharam\", Senior Manager, Sci-Tech Patent Art Services Pvt Ltd, ..."
  ],
  [
    "Applications Of Mittag-Lefflers Expension Theorem (Q#4,5,6) Remaining Parts Complete Solutions",
    "Lecture#32 : Date 08-07-2020 \" Complex Analysis-II \" Like , Comments and subscribes my Channel for updating next Lectures ..."
  ],
  [
    "Two Day National Webinar on Advn. in Math &amp; its Application - 2 - Mathematics Department Live Stream",
    ""
  ],
  [
    "WOMEN&#39;S DAY-2021 PANEL DISCUSSION",
    "LIVE DISCUSSION ON WOMEN EMPOWERMENT AND POSH."
  ],
  [
    "National level webinar on  Mathematics The language of Science",
    "Queens College of Arts and Science for Women, Punalkulam, Near Thanjavur, Pudukkottai(Dt)."
  ],
  [
    "Akshay Venkatesh: A Number Theorist Who Bridges Math and Time",
    "Akshay Venkatesh on his mathematical working style, which took him many years to discover. Read the full profile here: ..."
  ],
  [
    "Masaki Kashiwara - 2018 Chern Medal",
    "We sat down with Kyoto University's Masaki Kashiwara to discuss winning the award, his groundbreaking career working in ..."
  ],
  [
    "2021 - Webinar - History of Mathematics   2",
    "By : Dr. V. Prakash, IFP, Pondicherry, On Muttukanakku."
  ],
  [
    "International Conference on Number Theory and Algebra 23 Dec 2020",
    "International Conference on Number Theory and Algebra December 22-23, 2020, IIT (BHU) Varanasi Organized jointly by: ..."
  ],
  [
    "Webinar on &quot;Application of Mathematics in Engineering&quot; by Prof. (Dr.) Kiran Kumar R. Hiremath",
    "Department of Applied Sciences, Jodhpur Institute of Engineering & Technology, has organized a National level Webinar for ..."
  ],
  [
    "Talk on log curves (incl. introduction to log geometry) by Prof. Fumiharu Kato (Oct. 7, 2020)",
    "This is my lecture at the RIMS online seminar \"Homotopical Arithmetic Geometry Seminar\" ..."
  ],
  [
    "IDSS Distinguished Speaker Seminar: Sanjeev Arora | March 5, 2019",
    "Title: A Theory for Representation Learning via Contrastive Objectives Abstract: Representation learning seeks to represent ..."
  ],
  [
    "Spectral theory for non-self-adjoint Lévy operators in the half-line",
    "Mateusz Kwasnicki, Wrocław University of Science and Technology October 14th, 2021 Focus Program on Analytic Function ..."
  ],
  [
    "Jaydeb Sarkar Talk  RKMVERI Math 2021",
    "Colloquium talk on Operator theory."
  ],
  [
    "Zeros of polynomials via matrix theory and continued fractions - Olga Holtz",
    "Olga Holtz University of California, Berkeley; Member, School of Mathematics February 24, 2014 After a brief review of various ..."
  ],
  [
    "Fields Medals 2022 June Huh",
    "June Huh is awarded the Fields Medal 2022 for bringing the ideas of Hodge theory to combinatorics, the proof of the ..."
  ],
  [
    "ANDHRA LOYOLA COLLEGE, DEPARTMENT OF ENGLISH, NATIONAL WEBINAR @2021",
    "ALC #DOE #NW@21."
  ],
  [
    "Money Fintech 2018 / Hanno Nevanlinna / Futurice",
    ""
  ],
  [
    "Pick Interpolation in MATLAB",
    "Here we code up Nevanlinna Pick interpolation from H infinity control in MATLAB, from scratch. The Nevanlinna Pick Interpolation ..."
  ],
  [
    "National webinar on four paths of yoga",
    "Madurai Kamarajar university Madurai. Department of Saiva Siddhanta Philosophy, School of Religions, Philosophy and ..."
  ],
  [
    "National Level Webinar on , &quot;Recent Trends &amp; Application of Mathematics in Daily Life&quot;",
    ""
  ],
  [
    "The Sea and the Skylark by G M Hopkins |   National webinar| Dept of English| Ms. Nanni V K",
    ""
  ],
  [
    "FDP on Emerging Areas of Research in Science and Environment",
    "On World Environment Day-2021, K. C. College of Engineering & Management Studies and Research, Thane (East) under the ..."
  ],
  [
    "The 3-point spectral Pick interpolation problem  by  Vikramjeet Singh Chandel",
    "PROGRAM CAUCHY-RIEMANN EQUATIONS IN HIGHER DIMENSIONS ORGANIZERS: Sivaguru, Diganta Borah and Debraj ..."
  ],
  [
    "Structural Theory I: Trusses",
    ""
  ],
  [
    "Equilibrium Computation and Machine Learning",
    "Constantinos Daskalakis (MIT) https://simons.berkeley.edu/events/rmklectures2022-spring-4 Richard M. Karp Distinguished ..."
  ],
  [
    "The Computational Universe - Leslie Valiant",
    "Lens of Computation on the Sciences - November 22, 2014 The Computational Universe - Leslie Valiant, Harvard University The ..."
  ],
  [
    "International Webinar on Innovations in Science and Technology IWIST-2021",
    ""
  ],
  [
    "National Webinar on Scaling the IoT with Edge Computing, Block Chain and Industry 4.0",
    "Greetings from Dr.M.G.R.Educational and Research Institute!!! Title: National Webinar on Scaling the IoT with Edge Computing, ..."
  ],
  [
    "Great Ideas in Theoretical Computer Science: Random Walks and Markov Chains (Spring 2016)",
    "CMU 15-251: Great Ideas in Theoretical Computer Science Spring 2016 Lecture #20: Random Walks and Markov Chains ..."
  ],
  [
    "Topology and Geometry 09 -  Slit Map",
    "Topology and Geometry 09 - Slit Map."
  ],
  [
    "NAAC RAF FDP  - Session 5",
    "NAAC RAF FDP - Session 5."
  ],
  [
    "Graeme Milton: What effective tensors, and effective tensor functions, can one obtain through...",
    "CONFERENCE Recorded during the meeting \" ​Herglotz-Nevanlinna Functions and their Applications to Dispersive Systems and ..."
  ],
  [
    "Control Theory and Optimization",
    ""
  ],
  [
    "How Will Covid-19 Transform The State of Education For Future Generations? | International Webinar",
    "Day one of the two days international Webinar Department of Education North India Group of Colleges Najibabad, District Bijnor ..."
  ],
  [
    "Even spaces and motivic resolutions - Michael Hopkins",
    "Vladimir Voevodsky Memorial Conference Topic: Even spaces and motivic resolutions Speaker: Michael Hopkins Affiliation: ..."
  ],
  [
    "Presidency College Mathematics  Webinar",
    "Graphs from Commutative Rings."
  ],
  [
    "Sanjeev Arora: Why do deep nets generalize, that is, predict well on unseen data",
    "Sanjeev Arora (Princeton University, Institute for Advanced Study): \"Why do deep nets generalize, that is, predict well on unseen ..."
  ],
  [
    "Sexual Dysfunction in Women || VVIO Times || 19.02.2021 || TOG Webinar || Science Integra",
    ""
  ],
  [
    "TEDxAthens 2011 - Konstantinos Daskalakis - Searching for Equilibrium",
    "http://www.tedxathens.com/ 720p HD mode available. About the speaker: Constantinos Daskalakis is a professor of Computer ..."
  ],
  [
    "TEDxAthens 2011 - Konstantinos Daskalakis - Searching for Equilibrium",
    "http://www.tedxathens.com/ 720p HD mode available. About the speaker: Constantinos Daskalakis is a professor of Computer ..."
  ],
  [
    "BIT FDP Dr P Senthil Kumar, Bannari Amman Institute of Tech, Neural Networks in MATLAB",
    ""
  ],
  [
    "National Webinar on Impact of Tales and Stories on the Psychology of a Child 20200817 0529 1",
    "Resource person: Rashmi Narzary, She is an Author, Columnist and Freelance Editor. She created a niche for her poetry at the ..."
  ],
  [
    "Wlodzimierz Zwonek &quot;Function theory on special domains symmetrized polydisc, tetrablock&quot;",
    "complex analysis seminar https://sites.google.com/view/complex-analysis-seminar/home-page."
  ],
  [
    "Manjul Bhargava, Fields Medal Symposium 2016: Patterns in Numbers and Nature",
    "Lecture Manjul Bhargava, Princeton University and Fields Medal 2014 Talk Title: Patterns in Numbers and Nature."
  ],
  [
    "ASSE Seminar 2021 | Department of Mathematics | BIT Mesra | Day-1 Morning Session",
    "The Department of Mathematics is going to organize a two day seminar on \"Applications of Statistics in Sciences ..."
  ],
  [
    "Game Theory - lecture 4",
    "game situation & Equilibrium."
  ],
  [
    "National Webinar on Mathematics of Fractals",
    "Post Graduate and Research department of Mathematics, Dwaraka Doss Goverdhan Doss Vaishnav College, Arumbakkam, ..."
  ],
  [
    "Introduction to works of Takuro Mochizuki - Pierre Deligne",
    "Special Seminar Topic: Introduction to works of Takuro Mochizuki Speaker: Pierre Deligne Affiliation: Professor Emeritus, School ..."
  ],
  [
    "IDWGS technical  session on 15.02.2022",
    "The Undergraduate Department of Physics in association with IQAC conducted the Technical Session on Day 2 of the Two Week ..."
  ],
  [
    "The Herglotz&#39;s Theorems &amp; Some Applications",
    "We first recall two classical theorems of Gustav Herglotz on integral representations of positive harmonic functions and of ..."
  ],
  [
    "Costis Daskalakis (MIT) -- Improving GANs using Game Theory and Statistics",
    "MIFODS - ToC joint seminar. Cambridge, US September 18, 2018 Full title: Improving Generative Adversarial Networks using ..."
  ],
  [
    "Making Math Notation Accessible",
    "Learn about the latest technologies for making math accessible to diverse learners. Math is its own language, and the ability to ..."
  ],
  [
    "MetaMAT’s 36th webinar S2 - 19.07.2022 - Q&amp;A - Aaron Welters",
    "Seminar 36th S2, Tuesday 19th July 2022, 14:00 (London Time) Title: Bessmertny ̆ı Realizations, Representations, and Related ..."
  ],
  [
    "Prof. Konstantinos Katsikopoulos: David Blockley lectures in Systems",
    ""
  ],
  [
    "John Coates: (3/4) Classical algebraic Iwasawa theory [AWS 2018]",
    "slides for this lecture: http://swc-alpha.math.arizona.edu/video/2018/2018CoatesLecture3Slides.pdf lecture notes: ..."
  ],
  [
    "Costis Daskalakis on Foundation of Data Science Series (Feb 18, 2021)",
    "Title: Equilibrium Computation and the Foundations of Deep Learning Abstract: Deep Learning has recently yielded important ..."
  ],
  [
    "THE ENDURING JOURNEY OF TAMIL NADU OVER THE AGES",
    "WEBINAR ON \"THE ENDURING JOURNEY OF TAMIL NADU OVER THE AGES\" DEPARTMENT OF HISTORY AND TTM ..."
  ],
  [
    "1.Meromorphic function in complex analysis|Theorem based on meromorphic function| run by Manoj Kumar",
    "bessel function video link https://www.youtube.com/playlist?list=PL5Xv9SnZb7HdVSjfUgxydn1B3nAuahWhf Gauss's ..."
  ],
  [
    "O-minimality and its applications (2) (after Pila--Zannier, Bakker--Brunebarbe--Klingler--Tsimerman)",
    "Speaker: Jiaming Chen (Paris Diderot) Abstract: O-minimal structures, originally developed by model-theorists, provide an ..."
  ],
  [
    "Two-Day National Webinar on Film, Literature and Research",
    ""
  ],
  [
    "Laureate Dialogue: Robert Endre Tarjan, Alfred Vaino Aho, Jeffrey David Ullman | September 21",
    "ACM A.M. Turing Award and Nevanlinna Prize recipient Robert Endre Tarjan sat down for an informal discussion with Alfred ..."
  ],
  [
    "Convergence Theory for Iterative Eigensolvers",
    "Mark Embree (Virginia Tech University) https://simons.berkeley.edu/talks/convergence-theory-iterative-eigensolvers Randomized ..."
  ],
  [
    "Xin Fang - Tropical flag varieties - a Lie theoretic approach - TGiZ December 4th, 2020",
    "Speaker: Xin Fang (Universität Köln) Title: Tropical flag varieties - a Lie theoretic approach Abstract: In this talk I will explain how ..."
  ],
  [
    "A One week  Online Mathematics FDP on Role Of Mathematics in latest Engineering trends video",
    "Video from Mohammed Irshad Ali."
  ],
  [
    "International Mathematical Union",
    ""
  ],
  [
    "Poster Flash | September 19",
    "30 pre-selected young researchers have the opportunity to present their research in a condensed poster format. While the posters ..."
  ],
  [
    "IMU Awards",
    ""
  ],
  [
    "Game Theory Class Tic Tac Toe Prototype",
    "Game prototype for Game theory class."
  ],
  [
    "6th HLF – Laureate interview: Constantinos Daskalakis",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "CCI Talk: 2008-10-3 Assaf Naor, part 1",
    "The Center for Computational Intractability invited Assaf Naor of the Courant Institute of Mathematical Sciences and New York ..."
  ],
  [
    "Imitation Games - Avi Wigderson",
    "Dr. F.C. Kohli Centre of Excellence Perspectives in Mathematical Sciences January 10–February 4, 2022 Monday, 10 January ..."
  ],
  [
    "Webinar on National Science Day",
    "Theme: Raman Effect Organized by: APC Roy Eco Club in association with IQAC, Raja Peary Mohan College."
  ],
  [
    "INTERNATIONAL WEBINAR on &quot;ECONOMIC PREDICAMENT AND PANACEA for COVID-19&quot; : DAY 2",
    ""
  ],
  [
    "John Coates: (1/4) Classical algebraic Iwasawa theory [AWS 2018]",
    "slides for this lecture: http://swc-alpha.math.arizona.edu/video/2018/2018CoatesLecture1Slides.pdf lecture notes: ..."
  ],
  [
    "22. PPAD",
    "MIT 6.890 Algorithmic Lower Bounds: Fun with Hardness Proofs, Fall 2014 View the complete course: http://ocw.mit.edu/6-890F14 ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Yakov G. Sinai",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Yakov G. Sinai; Abel Prize, 2014 Recipients of the the ..."
  ],
  [
    "Workshop 1 &quot;Operator Algebras and Quantum Information Theory&quot; - CEB T3 2017 - H.Osaka",
    "Hiroyuki Osaka (Ritsumeikan) / 14.09.17 Title: Operator means and application to generalized entropies Abstract: In this talk we ..."
  ],
  [
    "Congratulations Costis!",
    "Congratulations to our advisor Constantinos Daskalakis on winning the 2018 Nevanlinna Prize!"
  ],
  [
    "ACM Grace Murray Hopper Award 2018: Constantinos Daskalakis and Michael J. Freedman",
    "The Grace Murray Hopper Award is presented to Constantinos Daskalakis for his seminal contributions to the theory of ..."
  ],
  [
    "John Coates: (4/4) Classical algebraic Iwasawa theory [AWS 2018]",
    "slides for this lecture: http://swc-alpha.math.arizona.edu/video/2018/2018CoatesLecture4Slides.pdf lecture notes: ..."
  ],
  [
    "Artur Nicolau  &quot;A Central Limit Theorem for iterates of an inner function&quot;",
    "complex analysis seminar online https://sites.google.com/view/complex-analysis-seminar/home-page."
  ],
  [
    "Seven Basic Digital Skills for Employment",
    ""
  ],
  [
    "What is Literature? By HUDSON//Some ways of Studying Literature in മലയാളം",
    "nuances full chapter videos 👇👇👇👇 https://youtube.com/playlist?list=PLh6TsrmEiXaUpOivjf6LHNDVE4-vdOkiX ..."
  ],
  [
    "2014 09 10 COL",
    "Life over finite fields ICTP Colloquium Nicholas Katz, Princeton University September 10, 2014."
  ],
  [
    "Action Plan &amp; Feed Back &amp; Valedictory session of 12 days FDP.",
    "Chief Guest: Prof. P.Murali Krishna, Head, SKIM, SKU, ATP Guest of Honor: Dr. J. Surya Kumar, CEO,SPMVV-TBI, Tirupati Chief ..."
  ],
  [
    "&quot;Equilibrium Computation and the Foundations of Deep Learning&quot; — Constantinos Daskalakis (MIT)",
    "Constantinos Daskalakis (MIT): Equilibrium Computation and the Foundations of Deep Learning Deep Learning has recently ..."
  ],
  [
    "International Webinar in Mathematics Organised by  KLE&#39;s G I B College, Nipani - Prof. Rod. Halburd.",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Bob Tarjan",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Bob Tarjan; Nevanlinna Prize, 1982 & ACM A.M. Turing ..."
  ],
  [
    "Mathematics Webinar by Dr. Rajat Subhra Hazra",
    "Topic - Sandpile, Odometers, Membrane & Random Forests. Date - 17th October, 2020 Organized by: Department of Mathematics ..."
  ],
  [
    "Matsubara Formalism and Superconductivity",
    "Slenderman talks about nonrelativistic thermal QFT and superconductivity, deriving the path integral form of the density matrix, ..."
  ],
  [
    "Raimar Wulkenhaar: Exact solution of a four-dimensional field theory",
    "Together with Harald Grosse we showed that the quartic matrix model with an external matrix is exactly solvable in terms of the ..."
  ],
  [
    "Equilibrium Computation and the Foundations of Deep Learning",
    "The 32nd International Conference on Algorithmic Learning Theory (ALT 2021) Keynote Speaker: Constantinos Daskalakis Title: ..."
  ],
  [
    "Public Lecture 1 : James H. Simons - My Life in Mathematics",
    "Seoul ICM 2014 Public Lecture 1 by Dr. James H. Simons - My Life in Mathematics."
  ],
  [
    "Feminist theory (contemporary theories, Business Ethics @naisha academy)",
    "ethical theories in business Ethics (@naisha academy)"
  ],
  [
    "The Shaw Prize Lecture in Mathematical Sciences 2021",
    "Established under the auspices of Sir Run Run Shaw, the Prize honours individuals who are currently active in their respective ..."
  ],
  [
    "What Do Smart Entrepreneurs Spend Their Time On?",
    "virtualassistantjobs #outsourcing #philippinesoutsourcing #femaleentrepreneurs #successmotivation #successmindset ..."
  ],
  [
    "Three problems on univalent functions in model spaces",
    "Konstantin Fedorovskiy, Lomonosov Moscow State University July 27, 2021 Focus Program on Analytic Function Spaces and their ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Efim Zelmanov",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Efim Zelmanov; Fields Medal, 1994 Recipients of the the ..."
  ],
  [
    "Ο Κωνσταντίνος Δασκαλάκης Έλληνας καθηγητης του ΜΙΤ μιλαει στη Τσαπανιδου",
    "Ο Κωνσταντίνος Δασκαλάκης μιλάει για πολλά θέματα που απασχολούν: -Οι διαδρομές του νου είναι πολλές φορές τυχαίες -Αυτό ..."
  ],
  [
    "Live of Profs. Hajiaghayi &amp; Peter Shor of MIT on Quantum and its Future, Shor’s Algorithm",
    "Glad to announce that this Sun Aug 7, 11AM ET, we, Prof. Peter Shor of MIT, recipient of prestigious Nevanlinna prize (Fields ..."
  ],
  [
    "One Day Webinar on “Introduction to Data Science&quot;",
    "One Day Webinar on “Introduction to Data Science\" organized by Department of Computer Science, K. R. College of Arts ..."
  ],
  [
    "Nicholas Katz: Life Over Finite Fields",
    "Abstract: We will discuss some of Deligne's work and its diophantine applications. This lecture was given at The University of Oslo, ..."
  ],
  [
    "Day 2 :: National Webinar on Real Analysis",
    "Two day National Webinar on Real Analysis, 19th - 20th January 2021, Organized by Department of Mathematics Resource ..."
  ],
  [
    "Yuri Yatagawa - Singular support and characteristic cycle of a rank one sheaf in codimension two",
    "Title : Singular support and characteristic cycle of a rank one sheaf in codimension two Abstract : The singular support and the ..."
  ],
  [
    "7th HLF Laureate interviews: Shwetak Patel",
    "Laureates at the 7th HLF sat down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "HLFF Shortcuts: Leslie G. Valiant",
    "The Heidelberg Laureate Forum Foundation presents the Shortcuts – a series that highlights moments borrowed from the ..."
  ],
  [
    "WEBINAR - &quot;How to Unlock the lockdown for Employees - Through the lens of Positivity&quot;",
    "As the COVID-19 crisis progresses towards the recovery and reshaping phases, many organizations look at new ways of ..."
  ],
  [
    "Constantinos Daskalakis: When will machines truly be intelligent?",
    "The Hellenic-American Cultural Foundation welcomed award-winning MIT professor and computer scientist, Constantinos ..."
  ],
  [
    "Barry Simon | Tales of Our Forefathers",
    "Speaker: Prof. Barry Simon (CalTech) Event: The talk was given as the first lecture of the 2019-2020 DeLong Lecture Series at the ..."
  ],
  [
    "National Webinar on Customer Intelligence | Senthi Research Advocacy Forum | V.H.N.S.N.C |",
    "V.H.N.S.N.College (Autonomous), Virudhunagar, Tamil Nadu, India."
  ],
  [
    "ICMS Seminar - 14.09.2021",
    "The congruence property in two-dimensional rational conformal field theory, revisited A talk by Vesselin Dimitrov, University of ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Judea Pearl",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Judea Pearl; ACM A.M. Turing Award, 2011 Recipients of ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Leonard Adleman",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Leonard Adleman; ACM A.M. Turing Award, 2002 ..."
  ],
  [
    "Dan Spielman: Algorithmic Discrepancy Theory for Randomized Controlled Trials",
    "EECS Colloquium Wednesday, March 31, 2021 4:00​​ - 5:00 pm Dan Spielman Professor of Computer Science, Statistics and ..."
  ],
  [
    "Eveliina Peltola: Towards a conformal field theory for Schramm-Loewner evolutions?",
    ""
  ],
  [
    "One Day Webinar on &quot;Cosets and Lagrange&#39;s Theorem&quot;",
    "One Day Webinar on \"Cosets and Lagrange's Theorem\" organized by the Department of Mathematics on , K. R. College of Arts ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Stephen A. Cook",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Stephen A. Cook; ACM A.M. Turing Award, 1982 ..."
  ],
  [
    "5th HLF – Laureate interview: Manuel Blum",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "National Webinar on &quot;World of Mathematics&quot;",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: John Torrence Tate",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: John Torrence Tate, Abel Prize, 2010 Recipients of the ..."
  ],
  [
    "The trifecta of Hilbert spaces on the unit disc",
    "Hilbert spaces are common. Connection among them is rare. With this spirit, we will see the connection among the three classical ..."
  ],
  [
    "Back to the Future: Going Beyond Worst Case Analysis",
    "Sanjeev Arora, Princeton University KARPfest80 https://simons.berkeley.edu/karpfest/sanjeev-arora-2015-10-17."
  ],
  [
    "Maurice Herlihy receives 2013 W. Wallace McDowell Award",
    "The IEEE Computer Society presented its 2013 W. Wallace McDowell Award to Maurice Herlihy for fundamental contributions to ..."
  ],
  [
    "Homotopy theory and algebraic vector bundles",
    "Mike Hopkins (University of Harvard, USA) Homotopy theory and algebraic vector bundles Abstract: This talk will describe joint ..."
  ],
  [
    "Session 1: Pitching Events for PoCs Scouted and Linkage with IA for Mentorship Support",
    "Mentor-Mentee Program: Resource person: Prof. V. Agalya, Innovation Ambassador, MoE's Innovation Cell, CMRIT Bangalore, ..."
  ],
  [
    "Gauss Prize — David Donoho — ICM2018",
    "A film made by Simons Foundation. ICM 2018 - Rio de Janeiro | http://www.icm2018.org © 2018 International Mathematical Union ..."
  ],
  [
    "ICSSR sponsored ,Two days International Conference NFRCI-2022 - DAY -2",
    "Nirmala College For Women Coimbatore ,Tamil Nadu Organized ICSSR sponsored ,Two days International Conference ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Karen Keskulla Uhlenbeck",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Karen Keskulla Uhlenbeck; Abel Prize, 2019 Recipients ..."
  ],
  [
    "7th HLF Laureate interviews: Gregory Margulis",
    "Laureates at the 7th HLF sat down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Higher Quantum Teichmüller theory - Alexander Goncharov",
    "Simons Center for Geometry and Physics/Mathematics Department Stony Brook University Perspectives, Open Problems ..."
  ],
  [
    "6th HLF – Laureate interview: Richard Manning Karp",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "National Conference on Analysis and its Applications ( NCAAFFPT - 2021) DAY 1 (AN Session)",
    "National Conference on Analysis and its Applications FOCUSED ON FIXED POINT THEORY NCAAFFPT - 2021 24th & 25th ..."
  ],
  [
    "CNQM2021: Marcel Klett - A center focused approach to cellular dynamical mean field theory",
    "Workshop “Correlations in Novel Quantum Materials CNQM2021” Held online at Max-Planck Institute for Solid State Research, ..."
  ],
  [
    "Hodge Theory, Higgs Bundles on Moduli Spaces of Manifolds and Hyperbolicity II",
    "Speaker: Kang Zuo Affiliation: Johannes Gutenberg Universität Mainz 03/30/21 Given a complex quasi-projective manifold $U$ ..."
  ],
  [
    "The Nevanlinna Prize, Gauss Prize and Chern Medal awards 2010",
    "Mathematics prizes awarded in Hyderbad, India 19th August 2010."
  ],
  [
    "6th HLF – Laureate interview: Srinivasa S. R. Varadhan",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "New Conference on Information Theoretic Cryptography (ITC)",
    "Presentation at Crypto 2019 rump session. Organizers are Benny Applebaum, Ivan Damgård, Yevgeniy Dodis, Yuval Ishai, Ueli ..."
  ],
  [
    "Theory",
    "Theory is a contemplative and rational type of abstract or generalizing thinking, or the results of such thinking. Depending on the ..."
  ],
  [
    "HLFF Shortcuts: Robert Tarjan",
    "The Heidelberg Laureate Forum Foundation presents the Shortcuts – a series that highlights moments borrowed from the ..."
  ],
  [
    "Hodge Theory, Higgs Bundles on Moduli Spaces of Manifolds and Hyperbolicity II",
    "Speaker: Kang Zuo Affiliation: Johannes Gutenberg Universität Mainz 03/30/21 Given a complex quasi-projective manifold $U$ ..."
  ],
  [
    "The Nevanlinna Prize, Gauss Prize and Chern Medal awards 2010",
    "Mathematics prizes awarded in Hyderbad, India 19th August 2010."
  ],
  [
    "Theory",
    "Theory is a contemplative and rational type of abstract or generalizing thinking, or the results of such thinking. Depending on the ..."
  ],
  [
    "HLFF Shortcuts: Robert Tarjan",
    "The Heidelberg Laureate Forum Foundation presents the Shortcuts – a series that highlights moments borrowed from the ..."
  ],
  [
    "Fields Medal Winner 2018 Peter Scholze",
    "The Fields Medal is awarded every four years on the occasion of the International Congress of Mathematicians to recognize ..."
  ],
  [
    "Theo Papazachariou",
    ""
  ],
  [
    "Xin Fang: Gröbner cones from quantum groups, 09.02.2021",
    ""
  ],
  [
    "Annual Conference of Indian Women and Mathematics (IWM)",
    ""
  ],
  [
    "OTTER: Ryan Tully-Doyle, Studying analytic functions in two variables",
    "Operator Theory Talks for Early Researchers (OTTER) is a seminar geared towards graduate students. Learn more here: ..."
  ],
  [
    "Colin + Shirline | Wedding Film | #Filmsbyweddingtheory",
    "Contemporary weddings & films by @prathishm | @nithishayyod | 📩- limesodatime@gmail.com | ☎️-9008442220 ..."
  ],
  [
    "MOTHER OF MODERN NURSING 👩🏻‍⚕️ NIGHTINGALE  👩🏻‍⚕️ THEORETICAL FOUNDATION OF NURSING",
    "Kilalanin ang ina ng nursing profession at alamin kung paano niya napagtagumpayan ang mga pagsubok upang maitaguyod ang ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Yann LeCun",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Yann LeCun; ACM A.M. Turing Award, 2018 Recipients of ..."
  ],
  [
    "Pseudorandomness and Regularity in Graphs II",
    "Jacob Fox, Stanford University https://simons.berkeley.edu/talks/pseudorandomness-and-regularity-in-graphs-II ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Leslie Lamport",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Leslie Lamport; ACM A.M. Turing Award, 2013 Recipients ..."
  ],
  [
    "5. september 2020",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Mikhail Leonidovich Gromov",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Mikhail Leonidovich Gromov, Abel Prize, 2009 Recipients ..."
  ],
  [
    "Total positivity: history, basics, and modern connections || Prof. Apoorva Khare  || WOTOA",
    "Prof. Apoorva Khare (IISc Bangalore) For more information visit https://sites.google.com/view/wotoa/home."
  ],
  [
    "The Abel Prize 2010 announcement",
    "The Announcement of the 2010 Abel Prize Laureate John Torrence Tate at the Norwegian Academy of Science and Letters 24 ..."
  ],
  [
    "Royal Statistical Society Awards Ceremony",
    "It was great to commemorate these statisticians at the RSS Conference Belfast. Recipients: Jouni Kuha Jonas Peters Marian Scott ..."
  ],
  [
    "Constantinos Daskalakis: &quot;Computational Complexity in Games and Auctions&quot; Part II",
    "Constantinos Daskalakis: \"Computational Complexity in Games and Auctions\" Part II."
  ],
  [
    "Commutant lifting in the Schur-Agler class by Bata Krishna Das IITB (18/02/20)",
    "D. Sarason (1967) first introduced commutant lifting theorem to provide an operator theoretic approach to the classical function ..."
  ],
  [
    "Homotopy theory and algebraic vector bundles",
    "Mike Hopkins (University of Harvard, USA) Homotopy theory and algebraic vector bundles Jueves 8 de Diciembre de 2017 ..."
  ],
  [
    "Fields Medal Winner 2018 Caucher Birkar",
    "The Fields Medal is awarded every four years on the occasion of the International Congress of Mathematicians to recognize ..."
  ],
  [
    "Laurens Vanderstraeten: &quot;Evaluating spectral functions with matrix product states&quot;",
    "The spectral function is one of the most important quantities that link theory and experiment in the field of strongly-correlated ..."
  ],
  [
    "Naoki Koseki at the NSF FRG Workshop on Moduli Spaces and Stability",
    "Bridgeland stability on algebraic surfaces in positive characteristic Abstract: I will explain my recent work constructing Bridgeland ..."
  ],
  [
    "Sanjeev Arora | Provable Bounds for Machine Learning",
    "Many tasks in machine learning (especially unsupervised learning) are provably intractable: NP-complete or worse. Can we ..."
  ],
  [
    "A family of Mobius invariant function spaces",
    "Guanlong Bao, Shantou University October 27th, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Dierk Schleicher (Aix-Marseille Université), &quot;Postsingularly finite entire functions (...)&quot;",
    "\"Postsingularly finite entire functions: combinatorics, complexity, Thurston theory\". We describe the dynamics of post-singularly ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Andrei Okounkov",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Andrei Okounkov; Fields Medal, 2006 Recipients of the ..."
  ],
  [
    "Applications of Tail Bounds - Routing in Sparse Networks",
    ""
  ],
  [
    "5th HLF – Laureate interview: Joseph Sifakis",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Optimization",
    ""
  ],
  [
    "Math",
    ""
  ],
  [
    "David Eisenbud, MSRI + Constantinos Daskalakis, MIT - Reducing AI Bias Using Truncated Statistics",
    "H2OWorld This session was recorded in NYC on October 22nd, 2019. Slides from the session can be viewed here: David ..."
  ],
  [
    "List of Russian scientists | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: List of Russian scientists Listening is a more natural way of learning, when ..."
  ],
  [
    "86th Annual Conference of The Indian Mathematical Society  – An International Meet",
    ""
  ],
  [
    "NCCR SwissMAP - Random Growth Loewner Evolution",
    "NCCR SwissMAP - Master Class in Mathematical Physics Random Growth Loewner Evolution by Prof. S. Smirnov / A. Turner (19 ..."
  ],
  [
    "Doosung Park - Triangulated categories of logarithmic motives over a field",
    "There are many non A¹-invariant cohomology theories like Hodge cohomology theories. To incorporate these in the framework of ..."
  ],
  [
    "Kristian Seip:  Hankel and composition operators on spaces of Dirichlet series",
    "Find this video and other talks given by worldwide mathematicians on CIRM's Audiovisual Mathematics Library: ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Srinivasa S. R. Varadhan",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Srinivasa S. R. Varadhan; Abel Prize, 2007 Recipients of ..."
  ],
  [
    "Lab",
    ""
  ],
  [
    "Abacus Medal 2022 #MarkBraverman #shorts #mathematician #viral #shortsfeed #viralvideo #mathtel",
    "abacus #abacusmedal2022 #MarkBraverman #mathematician #shorts The IMU Abacus Medal is awarded once every 4 years at ..."
  ],
  [
    "6th HLF – Laureate interview: Silvio Micali",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Math motivation",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Dana S. Scott",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Dana S. Scott; ACM A.M. Turing Award, 1976 Recipients ..."
  ],
  [
    "National Webinar:  Indonesia&#39;s Role in Solving Investment Problems Through Participation in Regional",
    ""
  ],
  [
    "Yourong Zang: &quot;Conformal Maps, Liouville&#39;s Theorem and Random Stuffs in Lean&quot;",
    "Yourong formalised many things, including the theory of conformal maps, as part of his summer project. Some of his work became ..."
  ],
  [
    "List of Russian mathematicians | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/List_of_Russian_mathematicians 00:00:12 ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Caucher Birkar",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Caucher Birkar; Fields Medal, 2018 Recipients of the the ..."
  ],
  [
    "5th HLF – Laureate interview: Robert Endre Tarjan",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Subhash Khot (NYU):  Hardness of Approximation: From the PCP Theorem to the 2-to-2 Games Theorem",
    "D2T4 Theory-Fest 2019-2020."
  ],
  [
    "Science videos",
    ""
  ],
  [
    "Homotopy theory and algebraic vector bundles",
    "Mike Hopkins (University of Harvard, USA) Homotopy theory and algebraic vector bundles Jueves 8 de Diciembre de 2017 ..."
  ],
  [
    "ICM Opening1, Aug 2010",
    ""
  ],
  [
    "Noetherian and Artinian Module | Noetherian and Artinian Ring",
    "Noetherian and Artinian Module | Noetherian and Artinian Ring definition of Noetherian and artinian module Basis of R-module ..."
  ],
  [
    "Nilanjana Datta |June 23, 2022| Universal proofs of entropic continuity bounds via majorization flow",
    "Speaker: Nilanjana Datta, University of Cambridge Title: Universal proofs of entropic continuity bounds via majorization flow ..."
  ],
  [
    "Completions of Period Mappings",
    "Speaker: Philip Griffiths Affiliation: IAS/IMSA 10/05/20 We will define and discuss some properties of and results about the objects ..."
  ],
  [
    "The Lasting Impact of Turing&#39;s Work",
    "Science On Screen® brings you to the Jacob Burns Film Center in Pleasantville, NY for a screening of The Imitation Game."
  ],
  [
    "Jonathan Luk: Singularities in general relativity",
    ""
  ],
  [
    "A Guide to Variations of Mixed Hodge Structure: Generalities and Examples",
    "Speaker: Richard Hain Affiliation: Duke University 04/02/21 In this talk I will recall some basic facts about (admissible) variations of ..."
  ],
  [
    "Feelin it",
    ""
  ],
  [
    "Extraction and verification of turbulent structures",
    "Advances in Complex Analysis and Applications Online Course ..."
  ],
  [
    "Shiing-Shen Chern | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: Shiing-Shen Chern Listening is a more natural way of learning, when compared ..."
  ],
  [
    "David Eisenbud, MSRI + Constantinos Daskalakis, MIT - Reducing AI Bias Using Truncated Statistics",
    "H2OWorld This session was recorded in NYC on October 22nd, 2019. Slides from the session can be viewed here: David ..."
  ],
  [
    "Yukiko Konishi (Kyoto University) / Local B-model and Mixed Hodge Structure / 2010-01-14",
    "International Conference on Mirror Symmetry and Gromov-Witten Theory."
  ],
  [
    "Congruences between motives and congruences between values of LL-functions - Olivier Fouquet",
    "Joint IAS/Princeton University Number Theory Seminar Topic: Congruences between motives and congruences between values ..."
  ],
  [
    "Evolution - Hardy Weinberg&#39;s Principle",
    "Download the app for Live interactive classes at the lowest price possible. The courses contain Live classes, recorded videos of ..."
  ],
  [
    "Which prize is called the Nobel of mathematics -ABEL PRIZE (Awards &amp; honours).",
    "Abelprize #nobleofmathematics #norwegiangovernment #SrinivasaSRVaradhan #firstindianwinner #firstwomantowinabelprize ..."
  ],
  [
    "Yourong Zang: &quot;Conformal Maps, Liouville&#39;s Theorem and Random Stuffs in Lean&quot;",
    "Yourong formalised many things, including the theory of conformal maps, as part of his summer project. Some of his work became ..."
  ],
  [
    "Eva Tardos: &quot;Econometrics for Learning Agents&quot; - 3/7/16 - Ford ITW",
    ""
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Srinivasa S. R. Varadhan",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Srinivasa S. R. Varadhan; Abel Prize, 2007 Recipients of ..."
  ],
  [
    "Chern Medal",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "6th HLF – Laureate interview: Silvio Micali",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Barry Simon: Tales of Our Forefathers",
    "Lecture at the Alfréd Rényi Institute of Mathematics, January 5, 2016."
  ],
  [
    "Cole Prize",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Dana S. Scott",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Dana S. Scott; ACM A.M. Turing Award, 1976 Recipients ..."
  ],
  [
    "Carl Friedrich Gauss Prize 2018 David L. Donoho",
    "The Gauss Prize is to honor scientists whose mathematical research has had an impact outside mathematics – either in ..."
  ],
  [
    "Spring 2021 LIDS Seminar — Daniel Spielman (Yale)",
    "Spring 2021 LIDS Seminars Series Speaker: Daniel Spielman (Yale) Talk Title: Balancing Covariates In Randomized ..."
  ],
  [
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Caucher Birkar",
    "The Heidelberg Laureate Forum Foundation presents the HLF Portraits: Caucher Birkar; Fields Medal, 2018 Recipients of the the ..."
  ],
  [
    "Yoichi Mieda (Kyushu University) / Rigid spaces and their etale cohomology / 2012-01-02",
    "KIAS Intensive Lecture Series on Rigid Geometry and the Local Langlands Correspondence."
  ],
  [
    "5th HLF – Laureate interview: Robert Endre Tarjan",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Kazuya Kato - Function field analogues of compactifications of period domains",
    "For a function field in one variable over a finite field, we will consider analogues of compactifications of period domains."
  ],
  [
    "Panel Computing and the Brain",
    "Shafi Goldwasser Yann Lecun Pietro Perona Leslie Valiant Moderator: Sanjeev Arora."
  ],
  [
    "Subhash Khot",
    "Video: Simons Foundation and International Mathematical Union."
  ],
  [
    "| Archimedean Property, Interior Point, Limit Point -L7 | Real Analysis Practice Series | CSIR NET |",
    "helpful for all aspirants preparing for IIT JAM / CSIR NET) Link to access the NOTES : -https://rzp.io/l/tripbohemia ..."
  ],
  [
    "Yoichi Mieda (Kyushu University) / Rigid spaces and their etale cohomology / 2012-01-03",
    "KIAS Intensive Lecture Series on Rigid Geometry and the Local Langlands Correspondence."
  ],
  [
    "Professor Avi Wigderson on cryptography",
    "Avi Wigderson is a professor of Mathematics at the Institute for Advanced Study in Princeton. After studying Computer Science at ..."
  ],
  [
    "Ο Πρόεδρος της Δημοκρατίας συνεχάρη τον Κ. Δασκαλάκη για το βραβείο Nevanlinna 2018 I ΕΡΤ",
    "Subscribe στην ΕΡΤ: http://bit.ly/ERTYT Τον Καθηγητή του ΜΙΤ, Κωνσταντίνο Δασκαλάκη, ο οποίος τιμήθηκε με ένα από τα ..."
  ],
  [
    "6th HLF – Laureate interview: Ngô Bảo Châu",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Computation and Society Initiative @Yale Colloquium by Jon Kleinberg, Cornell",
    "Speaker: Jon Kleinberg Title: Fairness and Bias in Algorithmic Decision-Making Abstract: As algorithms trained via machine ..."
  ],
  [
    "6th HLF – Laureate interview: Leslie G. Valiant",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Programa de Doutorado: Hodge Theory - Class 10 - Polarized Hodge Structures on Compact Kähler...",
    "Professor: Roberto Villaflor Aulas anteriores: http://bit.ly/2GVtWJO Class 10 - Polarized Hodge Structures on Compact Kähler ..."
  ],
  [
    "Jon Kleinberg",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "5th HLF – Laureate interview: Jeff Dean",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "2014 Fields Medalist : Manjul Bhargava",
    ""
  ],
  [
    "MetaMAT’s 36th webinar S2 - 19.07.2022 - Presentation - Aaron Welters",
    "Seminar 36th S2, Tuesday 19th July 2022, 14:00 (London Time) Title: Bessmertny ̆ı Realizations, Representations, and Related ..."
  ],
  [
    "Real Analysis | Heine Borel Theorem | Closed &amp; Bounded set is Compact.",
    "Comment Below If This Video Helped You 💯 Like 👍 & Share With Your Classmates - ALL THE BEST 🔥 Do Visit My Second ..."
  ],
  [
    "UW ECE Research Colloquium, May 11, 2021: Constantinos Daskalakis - MIT",
    "Equilibrium Computation and the Foundations of Deep Learning Abstract Deep Learning has recently yielded important advances ..."
  ],
  [
    "Konstantinos Daskalakis AP MIT",
    "TEDxAthens December 2011 Video Created by George Panteleakis."
  ],
  [
    "Kazuya Kato, Height of motives",
    "The height of a rational number a/b (a, b integers which are coprime) is defined as max(|a|, |b|). A rational number with small (resp."
  ],
  [
    "5th HLF – Laureate interview: Stephen Smale",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Combinatorial Subvarieties of the Flag Variety Pt. 2",
    "Talk given by Juliana Tymoczko at 2018 Summer School on Lie Theory, June 4-9."
  ],
  [
    "NEVER FAIL CHRONOLOGY COURSE 1",
    "We provide coaching for NTA NET English, AP SET, K SET, WB SET, TN SET, HP SET, JK SET, GATE English literature and other ..."
  ],
  [
    "5th HLF – Laureate interview: Richard Edwin Stearns",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Classical Analysis",
    ""
  ],
  [
    "UW ECE Research Colloquium, May 11, 2021: Constantinos Daskalakis - MIT",
    "Equilibrium Computation and the Foundations of Deep Learning Abstract Deep Learning has recently yielded important advances ..."
  ],
  [
    "Ryan O&#39;Donnell and Xinyu Wu on Query-to-Communication Lifting for BPP, part 1",
    "From the CMU Theory Reading Group. Part 1 of 2."
  ],
  [
    "FDP on Mathematical Developments in Cryptography and Data Science",
    ""
  ],
  [
    "The Crafoord Prize in Mathematics 2016",
    "The Royal Swedish Academy of Sciences has decided to award the 2016 Crafoord Prize in Mathematics to Yakov Eliashberg, ..."
  ],
  [
    "David Cox, Lecture 4: Homotopy Continuation and Applications",
    "NSF/CBMS Conference: Applications of Polynomial Systems, TCU, June 4-8, 2018 Slides can be found at ..."
  ],
  [
    "Migration of Greek scientists",
    "Students and teachers of 3 Geniko Lykeio Galatsi present \"Constantinos Daskalakis a Greek scientist who migrated to USA\" in the ..."
  ],
  [
    "5th HLF – Laureate interview: Daniel Spielman",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Why the Novel Matters - Explanation | Class 12 English Kaleidoscope (Non Fiction) (2022-23)",
    "Previous Video: https://www.youtube.com/watch?v=zakqGLotNZE 👉Next Video: ..."
  ],
  [
    "Fields Medals 2022 Hugo Duminil-Copin",
    "Hugo Duminil-Copin is awarded the Fields Medal 2022 for solving longstanding problems in the probabilistic theory of phase ..."
  ],
  [
    "The Lasting Impact of Turing&#39;s Work",
    "Science On Screen® brings you to the Jacob Burns Film Center in Pleasantville, NY for a screening of The Imitation Game."
  ],
  [
    "Algebraic and Motivic Vector Bundles (Mike Hopkins)",
    "Algebraic and Motivic Vector Bundles Plática dada por Mike Hopkins (University of Harvard, USA) en la Conferencia Internacional ..."
  ],
  [
    "Louis-Clément-Lefevre: Representation varieties of fundamental groups of complex algebraic...",
    "We study locally the representation varieties of fundamental groups of smooth complex algebraic varieties. These are schemes ..."
  ],
  [
    "Giancarlo Travaglini: Pick’s theorem and Riemann sums: a Fourier analytic tale",
    "VIRTUAL LECTURE We show a connection between Fourier series and a celebrated theorem of G. Pick on the number of integer ..."
  ],
  [
    "Julie Tzu-Yueh Wang (Academia Sinica, Taipei)/ ABC Theorems and Buchi&#39;s Problem over Function Fields",
    "Discrete Math 세미나 2014-06-25."
  ],
  [
    "6th HLF – Laureate interview: Alessio Figalli",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "03 - Kato&#39;s World",
    ""
  ],
  [
    "9th HLF Highlights",
    "Here's a highlight that provides a glimpse into the 9th Heidelberg Laureate Forum, which took place from September 18–23, 2022."
  ],
  [
    "Constantinos Daskalakis&#39; Statement",
    "https://bit.ly/2GK2ktH This video was part of an investigative journalism porject produced within the framework of my master's ..."
  ],
  [
    "Inverse problems for quantum graphs - Pavel Kurasov",
    "Analysis - Mathematical Physics Topic: Inverse problems for quantum graphs Speaker: Pavel Kurasov Affiliation: Stockholm ..."
  ],
  [
    "Zoom Cluster Seminar, 05/28/20, Pierre-Guy Plamondon",
    "Speaker: Pierre-Guy Plamondon Title: Realization of associahedra and minimal relations between g-vectors. Abstract: The ..."
  ],
  [
    "Abel Prize Lecture in honour of Louis Nirenberg  / Tristan Rivière, Oslo - 15 May 2015",
    "Abel Prize Lecture, Oslo - 15 May 2015 Exploring the unknown: the work of Louis Nirenberg in Partial Differential Equations."
  ],
  [
    "wollenstonecraft, nel noddings and savitri phule",
    "GYAN STHALI is a online platform for all students who not able to attend coaching classes."
  ],
  [
    "Luca BARBIERI VIALE - T-Motives",
    "Key results due to O. Caramello show us that there is a regular theory such that the Barr exact completion of its regular syntactic ..."
  ],
  [
    "The Real Analysis Survival Guide",
    "How do you study for Real Analysis? Can you pass real analysis? In this video I tell you exactly how I made it through my analysis ..."
  ],
  [
    "K. Kato - Log Drinfeld modules and moduli spaces",
    "We construct toroidal compactifications of the moduli space of Drinfeld modules of rank d with N-level structure. We obtain them as ..."
  ],
  [
    "Russian mathematicians",
    "Hello everyone - this video will cover the great Russian and Soviet mathematicians and their contributions to mathematics Please ..."
  ],
  [
    "Nikolaos Chalmoukis &quot;Random Interpolating Sequences for Dirichlet Spaces&quot;",
    "Complex Analysis Seminar https://sites.google.com/view/complex-analysis-seminar/home-page."
  ],
  [
    "Hamilton Day 2015: Interview with Professor Daniel Spielman",
    "The 2015 Hamilton Speaker, Daniel Spielman, is co-director of the Theoretical Computer Science Department at Yale Institute for ..."
  ],
  [
    "5th HLF – Laureate interview: Efim Zelmanov",
    "Laureates at the 5th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "5th HLF – Interview: Elna Schütz",
    "Elna Schütz, journalist from South Africa The opinions expressed in this video do not necessarily reflect the views of the ..."
  ],
  [
    "Completions of Period Mappings",
    "Speaker: Philip Griffiths Affiliation: IAS/IMSA 10/05/20 We will define and discuss some properties of and results about the objects ..."
  ],
  [
    "Second fundamental theorem and chain rule | MIT 18.01SC Single Variable Calculus, Fall 2010",
    "Second fundamental theorem and chain rule Instructor: Christine Breiner View the complete course: ..."
  ],
  [
    "6th HLF – Laureate interview: David A. Patterson",
    "Laureates at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Moduli of K3 surfaces as moduli of A-infinity structures",
    "Kazushi Ueda speaks at the CMSA Simons Collaboration Workshop on Homological Mirror Symmetry and Hodge Theory, held ..."
  ],
  [
    "Kazuya Kato, Height of motives",
    "The height of a rational number a/b (a, b integers which are coprime) is defined as max(|a|, |b|). A rational number with small (resp."
  ],
  [
    "Chern Medal — Masaki Kashiwara — ICM2018",
    "A film made by Simons Foundation. ICM 2018 - Rio de Janeiro | http://www.icm2018.org © 2018 International Mathematical Union ..."
  ],
  [
    "What is Hellenistic literature? | Dr. Neha Jain | The Gurukulam Academy #englishliterature",
    "What is Hellenistic literature? The Hellenistic age is defined as the time between the death of Alexander the Great and the rise of ..."
  ],
  [
    "A Guide to Variations of Mixed Hodge Structure: Generalities and Examples",
    "Speaker: Richard Hain Affiliation: Duke University 04/02/21 In this talk I will recall some basic facts about (admissible) variations of ..."
  ],
  [
    "Eva Tardos",
    "This video is from the colloquium In the Light of Evolution VIII: Darwinian Thinking in the Social Sciences, hosted by the National ..."
  ],
  [
    "Prize Winners - ICM 2018",
    "It's the moment we've been waiting for for the last 4 years - the announcement of a new batch of award winners. Spotlighting some ..."
  ],
  [
    "Extraction and verification of turbulent structures",
    "Advances in Complex Analysis and Applications Online Course ..."
  ],
  [
    "MetaMAT’s 23rd webinar - 05.01.2021 - Presentation - Graeme Milton",
    "Seminar 23 , Tuesday 5 January 2021, 14:00 (London Time) Title: New results on the range of responses that two-phase ..."
  ],
  [
    "SCIENCE_etc",
    ""
  ],
  [
    "ICM2014 Etienne Ghys, Laudations for Fields Medalist: Artur Avila",
    "The International Congress of Mathematicians (ICM) in Seoul, http://www.icm2014.org/ Laudation Speaker : Andrea Braides Title ..."
  ],
  [
    "&quot;FLORENCE NIGHTINGALE&quot; CBSE NCERT explanation, meanings, poetic devices",
    "Nightingale came to prominence while serving as a manager and trainer of nurses during the Crimean War, in which she ..."
  ],
  [
    "Shiing-Shen Chern | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: Shiing-Shen Chern Listening is a more natural way of learning, when compared ..."
  ],
  [
    "Fields Medal: Maryna Viazovska",
    "Maryna Viazovska of the École Polytechnique Fédérale de Lausanne (EPFL) proved that the E8 lattice provides the densest ..."
  ],
  [
    "Yukiko Konishi (Kyoto University) / Local B-model and Mixed Hodge Structure / 2010-01-14",
    "International Conference on Mirror Symmetry and Gromov-Witten Theory."
  ],
  [
    "5th HLF – Young researcher interview: Larwan Berke",
    "Larwan Berke of Rochester Institute of Technology explains what his experience at the HLF, hopes for his research area and the ..."
  ],
  [
    "Eva Tardos: Supporting diversity",
    "Eva Tardos offers advice about working in a career field in which you're in the minority."
  ],
  [
    "Which prize is called the Nobel of mathematics -ABEL PRIZE (Awards &amp; honours).",
    "Abelprize #nobleofmathematics #norwegiangovernment #SrinivasaSRVaradhan #firstindianwinner #firstwomantowinabelprize ..."
  ],
  [
    "Cole Prize",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Barry Simon: Tales of Our Forefathers",
    "Lecture at the Alfréd Rényi Institute of Mathematics, January 5, 2016."
  ],
  [
    "Presburger Award 2013 presentation",
    "Presburger Award 2013 presentation by Erik Demaine at ICALP 2013, Riga, Latvia. The Presburger Award 2013 was sponsored ..."
  ],
  [
    "Yoichi Mieda (Kyushu University) / Rigid spaces and their etale cohomology / 2012-01-02",
    "KIAS Intensive Lecture Series on Rigid Geometry and the Local Langlands Correspondence."
  ],
  [
    "Interpolation Problems for Vector-Valued de Branges-Rovnyak Spaces and Applications",
    "Joseph Ball, Virginia Tech October 7th, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "IMU Award Ceremony 2022",
    "International Mathematical Union IMU Award Ceremony 5 July 2022 at 10.00 (EEST) Venue: Aalto University, Runeberginkatu ..."
  ],
  [
    "The Uncanny Valley | Nivedhitha (Nila) Selvaraj | TEDxYouth@TheWoodlands",
    "With video games, humanoid robots, and animated movies, people assume that better designs become more and more realistic."
  ],
  [
    "6th HLF – Young researcher interview: Jonas Bayer (Germany)",
    "Young researchers at the 6th HLF sit down with Tom Geller, Tom Geller Productions, to discuss their career, mentoring and their ..."
  ],
  [
    "Yoichi Mieda (Kyushu University) / Rigid spaces and their etale cohomology / 2012-01-03",
    "KIAS Intensive Lecture Series on Rigid Geometry and the Local Langlands Correspondence."
  ],
  [
    "Fields Medal — Alessio Figalli — ICM2018",
    "A film made by Simons Foundation. ICM 2018 - Rio de Janeiro | http://www.icm2018.org © 2018 International Mathematical Union ..."
  ],
  [
    "Assaf Naor: Coarse dimension reduction",
    "Recording during the thematic meeting \"Non Linear Functional Analysis\" the March 7, 2018 at the Centre International de ..."
  ],
  [
    "Jon Kleinberg",
    "If you find our videos helpful you can support us by buying something from amazon. https://www.amazon.com/?tag=wiki-audio-20 ..."
  ],
  [
    "Anna Mani Lecture by  Jayasree Subramanian",
    "They were Axiomatic, We are Empirical: The Indian approach to the Gender Question in Mathematics."
  ],
  [
    "Konstantinos Daskalakis AP MIT",
    "TEDxAthens December 2011 Video Created by George Panteleakis."
  ],
  [
    "Welcome to ICM 2018!",
    "Rio de Janeiro is preparing to host the first International Congress of Mathematicians ever held in the Southern hemisphere."
  ],
  [
    "Physics 520 – March 17 – Transition to Online",
    "Just a few organizational things for our transition to online."
  ],
  [
    "Uusliberalismin aika on menossa mailleen",
    "Uusliberalismin aika on menossa mailleen. On löydyttävä jokin muu malli kuin tämänhetkinen rahoitussektorille velkaantumiseen, ..."
  ],
  [
    "コタンジェントの部分分数展開から岡カルタンの定理へ【不思議な恒等式】【複素関数論】",
    "コタンジェントとは、タンジェントの逆数 1/tan(x)=cos(x)/sin(x) のこと。コタンジェントは不思議な恒等式を満たす。これを、 ..."
  ],
  [
    "International Conference on Frontiers of Mathematics - C. Rousseau",
    "International Conference on Frontiers of Mathematics C. Rousseau: The equivalence problem for singularities in analytic ..."
  ],
  [
    "Two-variable Model Spaces &amp; Associated Realizations",
    "Kelly Bickel, Bucknell University July 27, 2021 Focus Program on Analytic Function Spaces and their Applications ..."
  ],
  [
    "Nirvana Means Extinction - Part I",
    "Quantum Psychology founder Stephen Wolinsky."
  ],
  [
    "Talk by Konstantinos Daskalakis at ECE TUC (Aug 19, 2011)",
    "Title: Nash Equilibria and Complexity Speaker: Konstantinos Daskalakis, Massachusetts Institute of Technology (ΜΙΤ), USA ..."
  ],
  [
    "Random wallks are completely determined by their trace - Mateusz Kwasnick",
    "Random walks are completely determined by their trace on the positive half-line - Mateusz Kwasnick. Wroclaw University of ..."
  ],
  [
    "HIN | The Revolution of Tomorrow: Artificial Intelligence, Data Science &amp; Society | Event Invitation",
    "They will discuss artificial intelligence, machine learning, data science, and their implications for education and society. Professor ..."
  ],
  [
    "Shiing Shen Chern",
    "AP Calculus AB Video Project about Shiing Shen Chern."
  ],
  [
    "NEVER FAIL CHRONOLOGY COURSE 2",
    "We provide coaching for NTA NET English, AP SET, K SET, WB SET, TN SET, HP SET, JK SET, GATE English literature and other ..."
  ],
  [
    "National Webinar on &quot;Introduction to Digital Topology&quot; - Day 1",
    "PG & Research Department of Mathematics, Dwaraka Doss Goverdhan Doss Vaishnav College, Arumbakkam, Chennai - 600 ..."
  ],
  [
    "23. PPAD Reductions",
    "MIT 6.890 Algorithmic Lower Bounds: Fun with Hardness Proofs, Fall 2014 View the complete course: http://ocw.mit.edu/6-890F14 ..."
  ],
  [
    "Constantinos Daskalakis: Testing Properties of Distributions",
    "Abstract: Given samples from an unknown distribution, p, is it possible to distinguish whether p belongs to some class of ..."
  ],
  [
    "Fields Medalists 2010",
    "Fields Medalists 2010, India."
  ],
  [
    "Fields Medal 2010 - Prof. Elon Lindenstrauss",
    "Prof. Elon Lindenstrauss of the Einstein Institute of Mathematics at the Hebrew University of Jerusalem today received the Fields ..."
  ],
  [
    "Pen drive course for CSIR-NET at Algebra will be available soon......",
    ""
  ],
  [
    "【数学】多変数複素解析のふしぎ【ずんだもんと学ぶトポロジー】",
    "簡単な間違いに気付かないことがよくあります． 【参考】 大沢健夫「多変数複素解析」岩波書店 野口潤次郎「岡理論新入門」裳 ..."
  ],
  [
    "Caucher Birkar&#39;s Second Fields Medal Ceremony — ICM2018",
    "Mathematician Caucher Birkar to receive new Fields Medal The organizing committee of the International Congress of ..."
  ],
  [
    "Awards and honours 2021l Honours and awards jkssb #STUDY.COM , General awareness",
    "jkssb awards and honours awards and honours 2020 jkssb awards and honours jkssb awards and honours gk awards and ..."
  ],
  [
    "ICM2014 Curtis McMullen, Laudation for Fields Medalist: Maryam Mirzakhani",
    "The International Congress of Mathematicians (ICM) in Seoul, http://www.icm2014.org/ Laudation Speaker : Curtis McMullen Title ..."
  ],
  [
    "Alexander Lubotzky plenary lecture at ICM  2018 in Rio de Janeiro Vol.2",
    "A.Lubotzky Vol.2."
  ],
  [
    "Subhash Khot - Hardness of Approximation (May 18, 2018)",
    "More details: ..."
  ],
  [
    "Uniqueness and stability for an inverse Steklov problem",
    "(22 mars 2021 / March 22, 2021) Young researchers in spectral geometry II (Mini-conférence) ..."
  ],
  [
    "ICM2014 VideoSeries PL9: Manjul Bhargava (Laudation by Benedict Grossi) on Aug16Sat",
    "The International Congress of Mathematicians (ICM) in Seoul, http://www.icm2014.org/ Fields Medalist Lecture and Laudation ..."
  ],
  [
    "Mathematician | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: https://en.wikipedia.org/wiki/Mathematician 00:00:17 1 History 00:04:53 2 ..."
  ],
  [
    "AWARD CEREMONY FIELDS MEDAL SEOUL 2014 PART2",
    "AWARD CEREMONY FOR THE FIELDS MEDALS DURING THE INTERNATIONAL CONGRESS OF MATHEMATICIANS 2014 IN ..."
  ],
  [
    "MIT Artificial Intelligence Laboratory | Wikipedia audio article",
    "This is an audio version of the Wikipedia Article: ..."
  ],
  [
    "2014 Fields Medalist : Artur Avila",
    ""
  ]
]