[
  [
    "KHAJA | Delicious Khaja Sweet Recipe Cooking In Village | Indian Dessert Recipe | Easy Sweet Recipe",
    "Today in our village, we cook delicious Indian dessert recipe. We call this recipe Khaja. It's delicious and the very easy sweet ..."
  ],
  [
    "Christmas Decoration and Recipe | HACKS and Ideas | Kids Special | CookWithNisha",
    "Dosto Christmas is coming and aaj ke iss video mein I've shared easy and beautiful decor ideas. Sath mein Kids Party special ..."
  ],
  [
    "Village Cooking Channel",
    "Village grandpa cooking traditional village food, country foods, and tasty recipes for foodies, children, villagers, and poor people."
  ],
  [
    "EASY AND QUICK MILK TOAST RECIPE #recipe #cooking #foodlover #lifehacks #foodie #toast #frenchtoast",
    ""
  ],
  [
    "American Double Patty Cheese Burger Recipe | Lego Food in real life Stop Motion Cooking ASMR",
    "American Double Patty Cheese Burger Recipe | Lego Food in real life Stop Motion Cooking ASMR Warning: This is not real, ..."
  ],
  [
    "「大鱼大肉」准备了云南的六种万能蘸料，和家人吃一顿烧烤大餐【滇西小哥】",
    "云南人对蘸水的执着和偏爱几乎到了没有蘸水就吃不饱饭的程度，忙的时候扔几个干辣椒在炭火里烤胡，用手搓碎加点盐巴就是一碗 ..."
  ],
  [
    "CHICKEN EGG FRIED RICE | Tasty Fried Rice Recipe Cooking In Village | Street Food Recipes",
    "We cook tasty Fried rice recipe by adding fried chicken and eggs. Fried rice is one of the famous South Indian street food recipe in ..."
  ],
  [
    "YOUTUBER COOK OFF CHRISTMAS SPECIAL!",
    "Subscribe & click that notification bell so you don't miss anything! : Follow me on my socials so you don't miss anything!"
  ],
  [
    "3 BIG FISH FRY | Streaked Spanish Mackerel Fish Fry Recipe Cooking In Village Vanjaram Meen Varuval",
    "Today in our village, we cook three big fish fry recipe. We call this fish as vanjaram in our village. We cutting the fish slice and ..."
  ],
  [
    "BIRYANI | MUTTON BIRYANI with Eggs | Traditional Biryani Recipe cooking in Village | Village Cooking",
    "We cook and dedicate this recipe for our channel viewers. All credits going to our viewers. Today we cooking mutton biryani ..."
  ],
  [
    "TIGER PRAWNS PERI PERI | Crispy Shrimp Recipe | Cooking Prawns with Shell | Seafood Fry Recipes",
    "Today we cook big tiger prawns by making Peri Peri fry recipe. Normally, Peri Peri is the chicken recipe, but we make it with ..."
  ],
  [
    "TURKEY SOUP | Traditional Turkey Soup Recipe Cooking in Village | Vaan Kozhi | Healthy Soup Recipes",
    "Today in our village, we cook 5 Turkeys to make a healthy traditional Turkey soup recipe. First, we fried the turkey meat, then we ..."
  ],
  [
    "$279 vs $19 Sushi: Pro Chef &amp; Home Cook Swap Ingredients | Epicurious",
    "Professional chef Yuji Haraguchi and home cook Joe are swapping ingredients and hitting the kitchen to make sushi rolls. We set ..."
  ],
  [
    "EASY &amp; QUICK CHICKEN BREAST RECIPE #recipe #chickenrecipe #chinesefood #cooking #foodlover #shorts",
    ""
  ],
  [
    "BANANA OIL FRY | Banana Balls Recipe | Pazham Bonda | Cooking Sweet Banana Bonda Recipe In Village",
    "Today in our village, we cook bananas direct to oil to make pazham bonda recipe. We add wheat flour and palm sugar to make ..."
  ],
  [
    "Beef Stomach is a Delicacy in our Village! Meat under Hot Coal",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "20 Cooking Secrets You Definitely Need to Know",
    "TIMESTAMPS: 00:17 Easy way to melt chocolate 01:32 Tricky ideas for food lovers 02:58 Quick way to peel an egg 04:54 How to ..."
  ],
  [
    "Minecraft&#39;s Funniest Cooking Show...",
    "Today TommyInnit, Schlatt, Slimecicle & start a Minecraft Diner. This was SO FUNNY! Edited by Tommy + THE AMAZING ..."
  ],
  [
    "Dylan Hollis - Boiled Cookies",
    "Christmas time means cookie time!"
  ],
  [
    "BONELESS FISH PEPPER FRY | Giant Trevally Fish Cutting &amp; Cooking | Easy and Simple Fish Fry Recipe",
    "Making Boneless Fish Fry is very easy with Debone Fish. Today, we cook Giant Trevally Fish to make Fish Fry Recipe. Normally ..."
  ],
  [
    "COOKING WITH UK | Countryballs Animation",
    "Support us on Patreon! http://patreon.com/pixelwolfanimation JOIN OUR DISCORD! https://discord.gg/YzZngMDenS CHECK OUT ..."
  ],
  [
    "How to make GUMMY BRICK FRUIT CANDY | Lego Food in real life | Stop Motion Cooking ASMR",
    "How to make GUMMY BRICK JELLO FRUIT CANDY | Lego Food in real life | Stop Motion Cooking ASMR Warning: This is not ..."
  ],
  [
    "Fast And Clever Kitchen Tricks To Help You Avoid Cooking Fails",
    "TIMESTAMPS: 00:00 How to cook egg noodle ramen 00:17 Poached egg in plastic bag 00:38 Coffee art tutorial 01:21 How to ..."
  ],
  [
    "Vlad and Niki Cooking and playing with Mom - Funny stories for children",
    "Children learn to cook and play with their mother. Funny stories for children."
  ],
  [
    "BREAD OMELETTE | Eggs with Bread | Quick Simple Easy Egg Recipe Cooking in Village | Fastest Omelet",
    "Today in our village, we cook fast and easy bread omelette recipe with using sliced breads and eggs. After cooking the bread ..."
  ],
  [
    "Harvesting Crops, COOKING TRADITION Rice Cakes And Go To Market To Sell | Free New Life",
    "freenewliffe #greenforestlife #newliffe #farm Harvesting Crops, COOKING TRADITION Rice Cakes And Go To Market To Sell ..."
  ],
  [
    "Chicken Butter Milk | Tasty Chicken Drumstick Cooking Recipe",
    "Hello everyone, today I show you \"Chicken Butter Milk Recipe\". #Chicken #Butter #Milk If you like my videos please Subscribe ..."
  ],
  [
    "I Went to the Mountains to Cook Juicy Kebab Like Our Forefathers! Relaxing Nature Cooking",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "FRENCH FRIES | Crispy French Fried potatoes Recipe Cooking In Village | Finger Chips | Easy Snacks",
    "Today in our village, we cook a French Fried Potato recipe. This French Fries recipe is a simple and easy snack recipe that ..."
  ],
  [
    "MUTTON RIBS | BBQ Mutton Ribs Cooking and Eating | 3 Full Goat Mutton Ribs | Mutton Grill Recipe",
    "To eat, mutton ribs are the tastiest piece of goat parts. Today we cook three full lamb ribs by making a mutton grilled bbq recipe."
  ],
  [
    "BIG Baits for Deep Sea GIANTS... Catch Clean Cook",
    "The last video of 2022! We went out of Hillsboro inlet and caught some big baits known as speedo's aka firetail scad. These are ..."
  ],
  [
    "BEST FOOD TO COOK FOR HOLIDAYS: Spicy Stuffed Pancakes @country_life_vlog",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UCIix6MklfJFywa_36iDj8Sw/join Dear friends, today ..."
  ],
  [
    "Morning Breakfast | Indian Village Cooking",
    "Winter is a very special season for Indian's as it brings lots of new veggies, Here is the best of winter breakfast from an Indian ..."
  ],
  [
    "Appam - Made Traditionally || With Two Side Dishes Cooking In Village House || The Traditional Life",
    "Dear Traditional Life Family, On a good noon Valar has started preparing batter for the next day breakfast so she soaked rice and ..."
  ],
  [
    "🔥Whole Chicken Prepared in the Forest🔥 Relaxing Cooking",
    "Knives available here: https://tcg-mwtpcollab.com/ Subscribe: https://www.youtube.com/channel/UCfxzr4iHJ1ZFq7KT8bwfiBw ..."
  ],
  [
    "EASY &amp; QUICK MUSHROOM STIR-FRY RECIPE #recipe #chinesefood #mushroom #cooking #vegetables #shorts",
    ""
  ],
  [
    "pumpkin leaves fry&amp;soya chicken curry cooking and eating by our santali tribe grandma||village food",
    "pumpkin leaves fry&soya chicken curry cooking and eating by our santali tribe grandma||village food to day we share a very very ..."
  ],
  [
    "CHICKEN PASTA | Delicious Pasta Recipe cooking In Village | Three Types Pastas Macaroni Spiral Penne",
    "Today in our village, we cook pasta recipe using three types of kinds of pasta. We use Macaroni, Spiral, and Penne pasta to cook ..."
  ],
  [
    "Village style making easy healthy &amp; tasty Morning Breakfast | শীতের সকালের সেরা সুস্বাদু জলখাবার",
    "Village style making easy heathy & tasty Morning Breakfast | শীতের সকালের সেরা সুস্বাদু জলখাবার ..."
  ],
  [
    "The Chef Fueling Chicago&#39;s Southern Cooking Revolution",
    "Chef Erick Williams paved the way for a revolution of upscale Southern cooking all across Chicago. He pays homage to his roots, ..."
  ],
  [
    "மாங்காய் திருட்டு | Mango Stealing | Village Hunting | Village Super Cooking",
    "OUR SOCIAL MEDIA SUPPORT IN ALL FRIENDS Sharechat : https://sharechat.com/_villagesupercooking?referer=bottomNav ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Food Battle by Multi DO Challenge",
    "We are starting a cooking battle from MultiDo! Get ready, it will be a lot of fun and very tasty! Be sure to share it with your friends!"
  ],
  [
    "Party menu ideas/Party vlog/Butter pudding /payyoli chicken fry/chicken mandi/Alfredo pasta/VLOG",
    "partymenuideas #partyvlog #secretcookingdiaries Ingredients : 6-8 tspn custard powder China grass 12 gm Water for melting ..."
  ],
  [
    "Real Kazan Kebab on the fire!",
    "Friends thank you for watching Subscribe to my channel I will delight you with new videos ..."
  ],
  [
    "full RED CUONTRY CHICKEN curry cooking&amp;eating by santali tribe family||rural village Orissa",
    "full RED CUONTRY CHICKEN curry cooking&eating by santali tribe family||rural village Orissa to day we share a very very uniq ..."
  ],
  [
    "Peri Peri Chicken ASMR Cooking #shorts",
    "Chicken-1kg Red chilli-4 Onion_1 Capsicum-1 Garlic-6pc Ginger-3pc Paprika powder-1tbs Pepper powder-2tbs Lemon juice-1tbs ..."
  ],
  [
    "10 minutes Instant Dessert Recipe | No Cooking No Baking | Quick and Easy Christmas Dessert",
    "instantdessert #chocolate #pastry #dessertrecipe #instantrecipe #quickandeasy #nocooking #nobaking #chocolatepastry Link for ..."
  ],
  [
    "കുട്ടനാടൻ പോത്തു വറയും മീൻ പീരയും |  Shappile Beef Varattiyathu | Meen Peera | Kishore Cooking",
    "Hi friends, today kishore's cooking vlog exploring shappu style beef varattiyathu recipe and meen peera in kerala style. Try this ..."
  ],
  [
    "How Chef Cat Makes the BIGGEST Lollipop in the World!🍭| Cat Cooking Food | Cute Cat TikTok #Shorts",
    "Chef Cat Makes The World's LARGEST Lollipop! The Cooking Cat who shares homemade recipes Since 2019. The first and the ..."
  ],
  [
    "10 MILLION TINY FISHES | Ayira Meen | Rare River Fish Cleaning and Cooking In Village | Fish Recipes",
    "Today in our village, we cook Millions of rare tiny river fish by making a fish curry recipe. We call this fish \"Ayira Meen\" by our ..."
  ],
  [
    "Real Kazan Kebab on the fire!",
    "Friends thank you for watching Subscribe to my channel I will delight you with new videos ..."
  ],
  [
    "chalo kuch meetha banate hain😋#shorts #youtubeshorts #ytshorts #cooking",
    "shorts #youtubeshorts #ytshorts #shortvideo #youtubeshortsindia #adayashort #youtube #cooking #recipe."
  ],
  [
    "Peri Peri Chicken ASMR Cooking #shorts",
    "Chicken-1kg Red chilli-4 Onion_1 Capsicum-1 Garlic-6pc Ginger-3pc Paprika powder-1tbs Pepper powder-2tbs Lemon juice-1tbs ..."
  ],
  [
    "CHICKEN BROCCOLI | Chicken Pepper Fry with Broccoli | Healthy Broccoli Recipe Cooking in Village",
    "Today in our village, we cook chicken broccoli recipe by using broccoli and chicken. To make this recipe, we cook broccoli and ..."
  ],
  [
    "Catch and cooking by the stream - Fragrant crabs, survival in the tropical rainforest, episode 222",
    "Catch and cooking by the stream - Fragrant crabs, survival in the tropical rainforest, episode 222 We only use only page facebook ..."
  ],
  [
    "How Chef Cat Makes the BIGGEST Lollipop in the World!🍭| Cat Cooking Food | Cute Cat TikTok #Shorts",
    "Chef Cat Makes The World's LARGEST Lollipop! The Cooking Cat who shares homemade recipes Since 2019. The first and the ..."
  ],
  [
    "CHICKEN TIKKA | Country Chicken BBQ Recipe Cooking In Village | Chicken Tikka Kebab Recipe",
    "Everyone like to eat chicken recipes, especially healthy country chicken recipes! We cook today's chicken tikka kebab recipe with ..."
  ],
  [
    "Gordon Ramsay&#39;s Top Basic Cooking Skills | Ultimate Cookery Course FULL EPISODE",
    "Gordon Ramsay demonstrates some basic cooking skills as well as some easy to do recipes. Including pork chops with sweet and ..."
  ],
  [
    "10 MILLION TINY FISHES | Ayira Meen | Rare River Fish Cleaning and Cooking In Village | Fish Recipes",
    "Today in our village, we cook Millions of rare tiny river fish by making a fish curry recipe. We call this fish \"Ayira Meen\" by our ..."
  ],
  [
    "I ate MINI FOOD for 24 Hours Challenge - MINIATURE Cooking Using Mini Things - Food Challenge INDIA",
    "Hi Infinite fam Today I will share another 24 Hours FOOD CHALLENGE. Today is Eating MINI FOOD for 24 Hours Challenge."
  ],
  [
    "INSIDE MUTTON BIRYANI | Full Goat Mutton Cooking with Stuffed Biryani | Mutton Inside Biryani Recipe",
    "Today we cook mutton inside biryani with three full goats. We cooked biryani first, then we stuffed it in the goats. Then we steam all ..."
  ],
  [
    "An easy and delicious way to cook cabbage.",
    "INGREDIENTS: • Water, salt and black pepper • 1 cabbage • 500 grams of ground beef • 2 carrots • 1 onion • 30 grams of ..."
  ],
  [
    "Cooking For The World’s Heaviest Sumo Wrestler (600 LBS)",
    "Ever had a 10000 calorie lunch? Yama is the heaviest sumo wrestler in the world and heaviest Japanese person ever."
  ],
  [
    "Easy Miniature Chicken Francaise for Dinner | Perfect Tiny Chicken Recipe | Miniature Cooking",
    "Easy Miniature Chicken Francaise for Dinner | Perfect Tiny Chicken Recipe | Miniature Cooking Hi everyone, I'm Mico. Today I ..."
  ],
  [
    "Duck egg braised delicious and Wild red apple for dinner - Solo cooking in jungle",
    "Welcome to My channel this video I want to show you about: Duck egg braised delicious and Wild red apple for dinner Mostly we ..."
  ],
  [
    "Hyderabadi Chicken Dum Biryani | Eid Special | Miniature Cooking | Chicken Biryani | Mini Food",
    "In this video we will see how to make ramzan special chicken biryani in easy method.Stay home and Cook withme.We tried in the ..."
  ],
  [
    "MY CHRISTMAS FRY FISH | Chef Ricardo Cooking",
    "MY CHRISTMAS FRY FISH | Chef Ricardo Cooking Join this channel to get access to perks: ..."
  ],
  [
    "Wendy Pretend Play Cooking Toys Food Challenge for Kids",
    "Wendy and Alex have a cooking food challenge with their fun toys for kids! They cook all kinds of meals with their toy kitchen and ..."
  ],
  [
    "Bucatini with Seafood Sauce",
    "Full Feast of the 7 Fishes video here: https://youtu.be/ce0f6c4Ymk8 #shorts #holidayrecipes #pasta #christmas #cooking #italian ..."
  ],
  [
    "&quot; Kofte &amp; Tips &quot; Bajias Cooking",
    ""
  ],
  [
    "100 HANDI BIRYANI MAKING | Matka Biryani With Vegetables | Veg Biryani Cooking In Clay Pot",
    "100 HANDI BIRYANI MAKING | Matka Biryani With Vegetables | Veg Biryani Cooking In Clay Pot."
  ],
  [
    "Whole CHICKEN cooked outdoors 🔥🍗(ASMR cooking, Relaxing Sounds, Camping, 4K)",
    "Knives- https://tcg-mwtpcollab.com/ Cookbook - http://smarturl.it/MenWiththePot Subscribe: ..."
  ],
  [
    "MIDNIGHT GOURMAND: a cooking video",
    "free yourself of daylight's culinary limitations. become a midnight gourmand. watch the 11 minute blooper reel on Patreon: ..."
  ],
  [
    "Smart cooking hacks to save time in the kitchen",
    "TIMESTAMPS 00:10 How to slice fish 00:57 Peel off tomato skin 02:27 Easy way to strain pasta 03:43 Snacking hacks Don't forget ..."
  ],
  [
    "So Yummy Amazing Miniature Pepperoni Pizza Cooking at Mini Kitchen 🍕 Fast Food Recipe",
    "So Yummy Amazing Miniature Pepperoni Pizza Cooking at Mini Kitchen Fast Food Recipe Hello World, I'm Food Lover and ..."
  ],
  [
    "Cooking The World&#39;s Rarest Wagyu (ft. Max The Meat Guy)",
    "We did the impossible...we got a Japanese A5 Wagyu Brisket. This is one of the most difficult cuts of meat in the world to find, but ..."
  ],
  [
    "BEST COOK ASMR FOOD COOKING 🤤🤤🤤 - Hamburger and Cream Cheese",
    "参考レシピ(Reference Recipe)→https://www.youtube.com/watch?v=YqTf0C5SCls NEW VIDEO, ALMOST EVERYDAY!"
  ],
  [
    "BAMBOO BIRYANI | Mutton Biryani Cooking in Bamboo | Steamed Bamboo Biryani Recipe Cooking in Village",
    "Today in our Village, we cook mutton biryani recipe inside the bamboo. We use fresh bamboo to make this bamboo biryani recipe ..."
  ],
  [
    "Cool Cooking hacks and Recipes #shorts",
    "Check out these cool and easy recipes and cooking hacks. How to cook fried cheese in a crispy breading? You need to cut the ..."
  ],
  [
    "Me vs Grandma Cooking Challenge #2 | Simple Secret Kitchen Hacks and Tools by Multi DO Challenge",
    "And what kind of food do you prefer: perfect from professional chefs or homemade from your loved ones? Share in the comments!"
  ],
  [
    "Peppa Pig Cooking Mini Pizza Shop Pizzeria Chef Set Carry Case",
    "Peppa Pig Cooking Mini Pizza Shop Pizzeria Chef Set Carry Case FTC: This video is not sponsored. All items in this video were ..."
  ],
  [
    "HOW TO MAKE RASTA PASTA! *Cooking With The Roberts Family* |Vlogmas Day 17",
    ""
  ],
  [
    "Cooking National Azerbaijani Stuffed Cabbage Dolma in the Oven!",
    "Cooking National Azerbaijani Stuffed Cabbage Dolma in the Oven! Dolma Recipes Stuffed Recipes Cabbage Recipes Azerbaijan ..."
  ],
  [
    "Vegetable Biryani &amp; 2 Veg Recipes || 3 Veg Village Foods Cooking in Village || The Traditional Life",
    "Dear Traditional Lifers, Today morning I woke up early morning and I went to our agri land to have a look, meanwhile Valar woke ..."
  ],
  [
    "Only 3 Ingrendients！Cat Makes Orange Custard🍊 | Cat Cooking ASMR | Cute Cat TikTok#Shorts",
    "The Cooking Cat who share homemade recipes Since 2019. 【Chef Cat ChangAn】 is my only Official YouTube channel."
  ],
  [
    "Turkey, Chicken and Khinkali Recipe in Wooden Village House!!!",
    "If you liked the video, then subscribe to our channel and write what you think about the video in the comments below! Please ..."
  ],
  [
    "MUTTON CURRY with raw banana cooking by tribe family || how to cook mutton curry with raw banana",
    "MUTTON CURRY with raw banana cooking by tribe family || how to cook mutton curry with raw banana village cooking channel ..."
  ],
  [
    "Awesome DIY Homemade Dessert Ideas For Christmas | Easy Dessert Recipes",
    "Question of the Day: Do you want to make Dessert by yourself? Comment Below! ▽ Watch more from So Tasty: ..."
  ],
  [
    "Chocolate and cheese?? 🤢😂 #christianjohnsoncomedy #comedy #funny #trending #cooking",
    ""
  ],
  [
    "MULTI-SPECIES Hunting with Walmart’s CHEAPEST Gun!!! (Catch Clean Cook)",
    "Check out my second channel here - https://www.youtube.com/channel/UCIzRSztGgBgPvHGCbn7Nwww ▻Check out my ..."
  ],
  [
    "Best of Miniature Cooking | 1000+ Miniature Food Recipe Videos | Tiny Cakes",
    "Story of the day: Good morning guys. This is a compilation of my best videos which you can know some recipes even though ..."
  ],
  [
    "Crab with Mango Coconut Sauce | Easy Cooking with Jabbar Bhai…",
    "Like n Follow Us on our New Facebook Page:- https://www.facebook.com/Food-Area-Tamil-20-105777528879731/ Ingredients: ..."
  ],
  [
    "Which Is Your Favorite Way To Eat Lychees?😸 | Cute Cat Cooking Show | Homemade Dessert Recipe#Shorts",
    "Today Is Royal Kitchen Cat!   Cat ChangAn Made A Lychee Recipe That Yang Guifei Is Hard To Find   The Cooking Cat who ..."
  ],
  [
    "rohu fish curry with vegetables &amp; water spinach fry cooking by our santali tribe women||rural India",
    "rohu fish curry with vegetables & water spinach fry cooking by our santali tribe women||rural India to day we share tribe people ..."
  ],
  [
    "Quick &amp; Easy Recipes With Gordon Ramsay",
    "While a lot of us are remaining indoors, here are a few quick, simple and cheap recipes to follow to learn. #GordonRamsay ..."
  ],
  [
    "How Five Of The Oldest Cooking Traditions Survived Centuries | Still Standing",
    "From super thin, layered phyllo dough in Greece, to a 1000-year-old roasted rice cakes tradition in Japan, to a rare cashew liquor ..."
  ],
  [
    "BEST COOK ASMR FOOD COOKING 🤤🤤🤤 bang bang chicken ramen 棒々鶏",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Cooking pumpkin rice with smoked fish on a cold autumn day!",
    "Pumpkin rice with smoked fish is a traditional and delicious menu that has been popular in our region for a long time. Pumpkin ..."
  ],
  [
    "Top 3 videos mother with daughter catch &amp; cook Eel .Crabs .Pick duck eggs  for food of survival",
    "Hello every one food in my country and in jungle. ♥♥ today I want to show you about videos : Top 3 videos mother with daughter ..."
  ],
  [
    "Drake ft. 21 Savage - Jimmy Cooks (Official Audio)",
    "Official audio for Drake “Jimmy Cook's” (feat. 21 Savage) off the new album 'Honestly, Nevermind' available everywhere now: ..."
  ],
  [
    "Binging with Babish: Home Alone Special",
    "This episode is sponsored by Cash App. Download Cash App from the App Store or Google Play store today to add your $cashtag ..."
  ],
  [
    "rohu fish curry with vegetables &amp; water spinach fry cooking by our santali tribe women||rural India",
    "rohu fish curry with vegetables & water spinach fry cooking by our santali tribe women||rural India to day we share tribe people ..."
  ],
  [
    "New hair style, Cute girl Siv chhee want to help mommy - Mommy and children cooking",
    "Hello friends. Welcome back to visit my channel. Today I use mantis shrimp for my recipe. Cute girl Siv chhee want to help to clean ..."
  ],
  [
    "We Bare Bears | Cooking with Ice Bear | Cartoon Network",
    "Ice Bear has a Korean-style cooking show and teaches the audience how to cook authentic Korean dishes."
  ],
  [
    "Best Of Miniature Cooking | 1000+ So Yummy Miniature Cooking Food Recipe Compilation",
    "Story of the day: Good morning guys. Today I make a compilation video all about miniature cooking. Which video do you like the ..."
  ],
  [
    "Grandma vs Mom Cooking Challenge (Cavalli) | Kids Try | Hiho",
    "Follow Cavalli's mom and support her business! IG: @triceshanell Sponsor this series: http://bit.ly/2zNbqjw Come play with us!"
  ],
  [
    "cooking | How to cook soft-shelled turtle? | mukbangs | chinese food | mukbang | songsong &amp; ermao",
    "cooking | How to cook soft-shelled turtle? | mukbangs | chinese food | mukbang | songsong & ermao,The Chinese delicacies ..."
  ],
  [
    "Mini Pressure Cooker Egg Biryani | Easy Egg Biryani Recipe | Miniature Cooking |The Tiny Foods-Hindi",
    "Mini Pressure Cooker Egg Biryani | Easy Egg Biryani Recipe | Miniature Cooking | The Tiny Foods - Hindi Follow us on ..."
  ],
  [
    "Adorable Little Boy Cooks Turkey Stew | Little Helper of the Week",
    "Does this look delicious or what?"
  ],
  [
    "Wendy Pretend Cooking with BBQ Grill Toy",
    "Wendy is pretend cooking with her new BBQ grill toy. They go to the toy store and buy the new Little Tikes Cook 'n Grow BBQ Grill ..."
  ],
  [
    "Cooking with My Korean Boyfriend - Korean &amp; Indian Couple",
    "india #korea #internationalcouple A cookin day of Korean & Indian couple."
  ],
  [
    "Bat Catch And Cook With Vanuatu Island Hunters",
    "I attempt a survival catch and cook with the local island hunters - Ep 371 Shop YBS products at https://youngbloods.co/ Previously ..."
  ],
  [
    "BANANA OIL FRY | Banana Balls Recipe | Pazham Bonda | Cooking Sweet Banana Bonda Recipe In Village",
    "Today in our village, we cook bananas direct to oil to make pazham bonda recipe. We add wheat flour and palm sugar to make ..."
  ],
  [
    "Coolest Miniature Watermelon Jelly Egg Ideas | Tiny Watermelon Cake Decorating | Miniature Cooking",
    "Coolest Miniature Watermelon Jelly Egg Ideas | Tiny Watermelon Cake Decorating | Miniature Cooking Hi everyone, I'm Mico."
  ],
  [
    "Cooking stuffed white fish in salt with coco and ashbil vegetables!",
    "White fish is one of the delicious fish of the Caspian Sea and lives in our sea and rivers. This fish is cooked in different ways, one ..."
  ],
  [
    "[ASMR] Easy Cooking Recipes Of Some Easy-To-Make Cakes🍫 #20 | Tiktok ASMR Cooking",
    "[ASMR] Easy Cooking Recipes Of Some Easy-To-Make Cakes   #20 | Tiktok ASMR Cooking https://youtu.be/4k7812HCtkI ..."
  ],
  [
    "Really Weird Rules Cooking Show Contestants Have To Follow",
    "Wearing the same smelly shirt, getting cut off from the outside world and sharing the ice cream machine. Grab your knives and find ..."
  ],
  [
    "10 Cooking Skills I Wish I Had Known...",
    "Upgrade your kitchen with Misen's amazing knives and cookware! Go to https://www.Misen.co/prohomecooks to get 20% off your ..."
  ],
  [
    "Vlad and Niki Cooking party",
    "ad Vlad and Niki Cooking party game Google Play ..."
  ],
  [
    "Cooking Bamboo Chicken with the leaders of Telangana",
    "Cooking Bamboo Chicken with the leaders of Telangana #rahulgandhi, #राहुल_गांधी, #bharatjodoyatra Declaration: ..."
  ],
  [
    "COOKING HOT CHEETO ELOTES w/ LOUIE CASTRO | MUKBANG / DEEP TALK",
    "COOKING HOT CHEETO ELOTES w/ @LouiesLife | MUKBANG / DEEP TALK FOLLOW MY TWITCH CHANNEL: ..."
  ],
  [
    "Polina playing cooking with toy Kitchen. Funny breakfast with baby dolls",
    "Please subscribe on my channel: ..."
  ],
  [
    "🧔🏻✨Appa Ketta Question 🤯 Eppudra🔥🔥🔥 #shorts #trending #youtubeshorts",
    "our cooking time channel has food cooking videos. ✨Appa Kedda Question Eppudra       #shorts #trending ..."
  ],
  [
    "Cooking Gloves 🍳 Life Hack 😂 Desi Jugaad #shorts #funny #comedy #ashortaday",
    ""
  ],
  [
    "The Perfect Christmas Dinner",
    "We celebrate multiple Holidays in my family from Hanukkah, to Christmas, to everything in between. So here are all the best ..."
  ],
  [
    "The Worst Cook On TikTok",
    "I'm never making burgers another way Save 33% on your first Native Deodorant Pack - normally $39, you'll get it for $26!"
  ],
  [
    "EASY &amp; QUICK CABBAGE STIR-FRY RECIPE #recipe #chinesefood #cabbage #vegetables #cooking #foodlover",
    ""
  ],
  [
    "Sandeep &amp; Jyothi, Madhu &amp; Priyanka Performance - Cooking Theme | Mr &amp; Mrs | 6th December 2022 |ETV",
    "mrandmrs #misterandmisses #telugushow #etvtelugu #etvwin #realityshow #sreemukhi #sneha #sivabalaji In the cooking theme, ..."
  ],
  [
    "Coffee and Chocolate Trifle",
    "Ingredients Coffee jelly - 400ml ST. ALi filter coffee - 1 tbsp brown sugar - 4 leaves gelatin Method 1. Bloom the gelatin leaves in ..."
  ],
  [
    "AWESOME!!! The Most AMAZING Miniature Snicker x BTS Cake Decorating | ASMR Cooking Mini Food",
    "AWESOME!!! The Most AMAZING Miniature Snicker x BTS Cake Decorating | ASMR Cooking Mini Food Link Video: ..."
  ],
  [
    "India Vicho Sanu Mile Gift | ਅਸੀਂ ਇੰਨਾ ਸਮਾਨ ਕਿਉਂ ਲੈ ਕੇ ਆਏ ਆ ?",
    "Instagram Link - https://www.instagram.com/indian_momcooking/?utm_medium=copy_link Facebook Page ..."
  ],
  [
    "Wilderness Cooking Skill | Steam Chicken Sticky Rice Pork Recipe With Spicy Chili Sauce.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "we&#39;re cooking a whole bird today",
    "shorts #pekingduck Instagram @doobydobap Join my discord! https://discord.gg/doobyverse www.doobydobap.com for recipes ..."
  ],
  [
    "Cooking Thousand Crabs Salty &amp; Sweet Recipe in Village For Donation With Villagers - Eating Crab",
    "Cooking Thousand Crabs Salty & Sweet Recipe in Village For Donation With Villagers - Eating Crab In this video we show you ..."
  ],
  [
    "AMAZING WOMAN LIVES ALONE IN THE MOUNTAINS! COOKING LUNCH",
    "Today Maria will cook a traditional Ukrainian dinner. Amazing national dish borscht! Maria lives in the Ukrainian mountains of the ..."
  ],
  [
    "KFC Fried Chicken Recipe, but it&#39;s LEGO in Real Life🍗Stop Motion Cooking ASMR Satisfying",
    "Lego Fast Food: Secrect KFC Fried Chicken Recipe, but it's LEGO in Real Life | Stop Motion Cooking ASMR Satisfying ..."
  ],
  [
    "Crispy Chicken 65 Asmr Cooking #shorts",
    "shorts #chicken #streetfood #indianstreetfood #chickenfry."
  ],
  [
    "Crispy French Fries with Cheese Sauce - You Suck at Cooking (episode 150)",
    "Crispy French fries with cheese sauce taste better than soggy French fries with nothing For 70% off with HelloFresh plus FREE ..."
  ],
  [
    "Gordon Ramsay Reacts to TommyInnit’s Cooking!",
    "‌Is TommyInnit an Idiot Sandwich?! Minecraft YouTuber TommyInnit put on his troll mask recently, and took aim at Gordon Ramsay, ..."
  ],
  [
    "Healthy Aval Recipe #cooking #shorts #health",
    "our cooking time channel has food cooking videos. #cooking #shorts #health."
  ],
  [
    "cooking | How to Cook Fish? | How to Cook Chestnut? | mukbangs | songsong &amp; ermao",
    "cooking | How to Cook Fish? | How to Cook Chestnut? | mukbangs | songsong & ermao, The video contains various Chinese ..."
  ],
  [
    "Sasha go to Minnie and Mickey Mouse party and Cooking with toy Kitchen play set",
    "Sasha was invited to a party with Minnie and Mickey. Sasha buys presents and goes to visit friends and gives the toy kitchen, ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Simple Secret Kitchen Hacks and Tools by TeenDO Challenge",
    "Me vs Grandma Cooking Challenge | Simple Secret Kitchen Hacks and Tools by TeenDO Challenge Be sure to share it with your ..."
  ],
  [
    "Awesome Miniature Burger King Recipe | Yummy Tiny Grilled Chicken Sandwich | Miniature Cooking",
    "Awesome Miniature Burger King Recipe | Yummy Tiny Grilled Chicken Sandwich | Miniature Cooking Hi everyone, I'm Mico."
  ],
  [
    "Satisfying Miniature Egg Fishing and Cooking Delicious Catfish Curry - Mini Yummy&#39;s Best Recipe",
    "Satisfying Miniature Egg Fishing and Cooking Delicious Catfish Curry - Mini Yummy's Best Recipe Hello World, I'm Food Lover ..."
  ],
  [
    "Cooking Big Kutabs with Beef Meat and Fresh Greens in the Village!",
    "Cooking Big Kutabs with Beef Meat and Fresh Greens in the Village! Kutab Recipes Fresh Greens Beef Recipes Azerbaijan ..."
  ],
  [
    "Home Cooking Adventure",
    "Welcome to all people who find cooking as a process of loving. For those who find pure joy in preparing their own meal, with ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by PaRaRa Challenge",
    "Today we have a new cooking challenge at PaRaRA! Go! Be sure to share it with your friends! And don't forget to subscribe to our ..."
  ],
  [
    "மட்டன் தேங்காப்பால் பிரியாணி | கொசுறு சிக்கன்  | SUNDAY LUNCH SPL COMBO  | FAST COOKING | JENI",
    "இன்றைய கலாட்டா சமையல் : மட்டன் தேங்காப்பால் பிரியாணி , கொசுறு ..."
  ],
  [
    "WHAT I EAT IN A WEEK 🍴 cooking for two!",
    "breakfast, lunch, and dinner for two! i don't have any dietary restrictions and mainly buy my groceries from the farmer's market. let ..."
  ],
  [
    "Satisfying Miniature Egg Fishing and Cooking Delicious Catfish Curry - Mini Yummy&#39;s Best Recipe",
    "Satisfying Miniature Egg Fishing and Cooking Delicious Catfish Curry - Mini Yummy's Best Recipe Hello World, I'm Food Lover ..."
  ],
  [
    "Cooking Big Kutabs with Beef Meat and Fresh Greens in the Village!",
    "Cooking Big Kutabs with Beef Meat and Fresh Greens in the Village! Kutab Recipes Fresh Greens Beef Recipes Azerbaijan ..."
  ],
  [
    "BRINJAL CURRY | Oil Brinjal Curry Recipe Cooking in Village | Eggplant Recipes | Vegetarian Recipes",
    "Today in our village, we cook our village's favorite vegetarian Recipe. We make the Brinjal Curry recipe before boiling the brinjal ..."
  ],
  [
    "Home Cooking Adventure",
    "Welcome to all people who find cooking as a process of loving. For those who find pure joy in preparing their own meal, with ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by PaRaRa Challenge",
    "Today we have a new cooking challenge at PaRaRA! Go! Be sure to share it with your friends! And don't forget to subscribe to our ..."
  ],
  [
    "WHAT I EAT IN A WEEK 🍴 cooking for two!",
    "breakfast, lunch, and dinner for two! i don't have any dietary restrictions and mainly buy my groceries from the farmer's market. let ..."
  ],
  [
    "Kitchen Play Part -8| cooking game | Alice ki school routine| #Learnwithpriyanshi",
    "Kitchen Play Part -8| cooking game | Alice ki school routine| #learnwithpriyanshi Kitchen Play Part -7| cooking game | Alice Ki ..."
  ],
  [
    "Peanut Noodles - You Suck at Cooking (episode 149)",
    "Peanut noodles are a dish that's made with both noodles and peanut butter. As well as several other ingredients which also end ..."
  ],
  [
    "cooking ASMR tiktok compilation I Tik-a-Tok",
    "hi human~ we hope this compilation can somehow make you relaxed and at ease   enjoy ..."
  ],
  [
    "1000+ Miniature Cooking Food Recipe Ideas | Best Of Miniature Cooking | Tiny Cakes",
    "Story of the day: Hi Friends ✋   This is a compilation of my best videos which you can know some recipes even though they're ..."
  ],
  [
    "Cooking a WHOLE LAMB | Cooking w/ZO",
    "Follow Me On My Social Medias: ღ Instagram: @iamzoie https://instagram.com/IAMZOIE/ ღTwitter: @GotDamnZo ..."
  ],
  [
    "Jennifer Garner&#39;s Pretend Cooking Show - Episode 43: Meatballs",
    "PretendCookingShow: Meatballs While we patiently wait for Ina Garten's newest cookbook (out in October! Go-To Dinners!)"
  ],
  [
    "AMELIA&#39;S COOKING SHOW | AITCH",
    "Amelia is joined in the kitchen by musician, and second favourite ex, Aitch who has willingly agreed to help her cook a delicious ..."
  ],
  [
    "Best Of Miniature Cooking | 1000+ ASMR Satisfying Mini Food Recipe Video Compilation",
    "Best Of Miniature Cooking | 1000+ ASMR Satisfying Mini Food Recipe Video Compilation Hello my dear viewers, this episode ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by BaRaDa Challenge",
    "Today we have a bright and tasty cooking challenge! What dish did you like the most? Be sure to share it with your friends!"
  ],
  [
    "Holiday Cooking &amp; Baking Recipes: Tater Tot Breakfast Casserole Recipe | Easy Christmas Breakfast",
    "Tater Tot Breakfast Casserole Recipe | Easy Christmas Breakfast - Jamie is sharing easy Christmas Breakfast ideas, like this ..."
  ],
  [
    "BEST Of Miniature Cooking Compilation | 1000+ Mini Food Recipe",
    "BEST Of Miniature Cooking Compilation | 1000+ Mini Food Recipe ASMR Hello my dear viewers, this episode includes the best ..."
  ],
  [
    "DRAGON FRUIT JAM | Homemade Jam Recipe Cooking in Village | Yummy Jam Making with Dragon Fruits",
    "Today in our village, we make sweet Homemade Fruit Jam using Dragon fruits. We do not use artificial colors, but we get the same ..."
  ],
  [
    "Amazing Miniature Breakfast with Eggs &amp; English Muffin | Best of Miniature Cooking Breakfast Recipes",
    "Amazing Miniature Breakfast with Eggs, Sausage, Cheese, English Muffin | Best of Miniature Cooking Breakfast Recipes Hi ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Who’s Better in the Secret Kitchen? Hacks by RATATA CHALLENGE",
    "Subscribe to the channel RATATA CHALLENGE: ..."
  ],
  [
    "SIDEMEN EXTREME CHRISTMAS COOK OFF",
    "Sign up and upgrade now via our link https://get.revolut.com/e/yt3sidemen Revolut Metal is cooking up some benefits for you this ..."
  ],
  [
    "Paw Patrol Cooking Cartoon for Kids - Pups Cook Food for Everest!",
    "Paw Patrol Cooking Cartoon for Kids - Pups Cook Food for Everest! In this preschool learning Paw Patrol cartoon animation, kids ..."
  ],
  [
    "Fun Learn Cake Cooking &amp; Colors Cake Fun Kids Games - My Bakery Empire - Bake, Decorate &amp; Serve Cake",
    "My Bakery Empire - Bake, Decorate & Serve Cakes By Coco Play By TabTale ♥ If you enjoyed my video please Comment, Like, ..."
  ],
  [
    "Cooking a Chinese dish for the first time ever! (this is not a tutorial...)",
    "Get your first purchase from Blueland for 20% off by clicking my link: https://bit.ly/3IEEBqd Now shipping to the U.S., Canada, the ..."
  ],
  [
    "HOW TO MAKE OUR FAMOUS NACHOS &amp; CHICKEN WINGS RECIPE | COOKING WITH THE PRINCE FAMILY",
    "How To Our Famous Nachos & Chicken Wings Recipe | Cooking With The Prince Family!! Follow The Prince Family on Facebook: ..."
  ],
  [
    "Western Spaghetti by PES | The FIRST Stop-Motion Cooking Film",
    "The stop-motion cooking film that started them all. See \"Fresh Guacamole\", the Oscar-nominated follow-up to \"Western Spaghetti\" ..."
  ],
  [
    "Kylie &amp; Kris Jenner Cook Dinner Together | Vogue",
    "Kris Jenner and Kylie Jenner step into the kitchen before sampling the new limited-edition Kylie Cosmetics collection inspired by ..."
  ],
  [
    "Best Of Miniature Cooking Compilation | 1000+ Miniature Food Recipe ASMR",
    "Best Of Miniature Cooking Compilation | 1000+ Miniature Food Recipe ASMR Hello my dear viewers, this episode includes the ..."
  ],
  [
    "After 7 years of cooking training in England, came back here finally.",
    "The owner was in British for 16 years as trained himself to improve cooking skills. There were many famous persons or football ..."
  ],
  [
    "Jhura Mangsho - Boneless Chicken Dry Curry Recipe - New Way Cooking Chicken for Special People",
    "Boneless chicken jhura cooking by 70+ years old 4 brothers grandpa for old age & physically challenged special people of village ..."
  ],
  [
    "SEAFOOD in GLASS JAR | Mixed Seafood Recipe cooking in Glass Jar | Crab Shrimp Squid Recipe Cooking",
    "Today, we cook three types of seafood in glass jars. We use crabs, Shrimp, and Squids to make this delicious and different ..."
  ],
  [
    "Grandma Trocheck provides some home cooking 🍝🇮🇹",
    "With roots in the Pittsburgh area, Vincent Trocheck took his Rangers teammates to Grandma's house, who provided the team with ..."
  ],
  [
    "Drake &amp; 21 Savage - Jimmy Cooks",
    "Official audio for Drake & 21 Savage “Jimmy Cooks” off the new album 'Honestly, Nevermind' available everywhere now: ..."
  ],
  [
    "KARIN DOLMA: Traditional Turkish Food - And How To Make It (Outdoor Cooking)",
    "Dear friends, today we would like to share with you the KARIN DOLMA: Traditional Turkish Food - And How To Make It (Outdoor ..."
  ],
  [
    "ये है मोहब्बतें | Cooking Competition",
    "Click here to Subscribe *Star Plus* : https://www.youtube.com/channel/UC-LPIU24bQXVljUXivKEeRQ *Free Subscription* ..."
  ],
  [
    "$120 vs $16 Enchiladas: Pro Chef &amp; Home Cook Swap Ingredients | Epicurious",
    "Professional chef Alan Delgado and home cook Daniel are swapping enchiladas recipes and hitting the kitchen! We set Daniel up ..."
  ],
  [
    "Cooking Short Rib For 72 Hours Straight",
    "They say Rome wasn't built in a day, well neither was this short rib. Get My Cookbook: http://bit.ly/JWCookbookAmazon Additional ..."
  ],
  [
    "GIANT VS TINY FOOD 24 HOURS || Cooking Challenge Of Speed And Wit! Kitchen Hacks By 123 GO! SCHOOL",
    "Hey guys! What kind of food will you choose? The big one or the small one? Do you like our videos? Then like and share this ..."
  ],
  [
    "New Cooking Secrets And Recipes You Never Heard Of || Cutting And Peeling Hacks",
    "TIMESTAMPS: 00:27 Easy way to chop cabbage 02:16 Useful kitchen tools 03:20 Simple cleaning hacks 05:53 No-mess cooking ..."
  ],
  [
    "MasterChef Cat Demonstrates How to Make Your Own CAVIAR!😺🤤 | Chef Cat Cooking  #tiktok #Shorts",
    "MasterChef Cat Demonstrates How to Make Your Own CAVIAR!     | Chef Cat Cooking The Cooking Cat who shares homemade ..."
  ],
  [
    "A Very Merry Evening | cooking, chatting, decorating",
    "Time to pull out the Christmas tree and decorate for the holidays because it is episode 2 of Jennglebells! Join Ben + I in the ..."
  ],
  [
    "Bheem Cooks The Best Pongal | Mighty Little Bheem: Kite Festival | Netflix India",
    "How will Bheem make the best Pongal? Catch Little Bheem on his big adventures in Mighty Little Bheem: Kite Festival, streaming ..."
  ],
  [
    "WHAT I EAT IN A DAY | Sunday Funday Edition!!! (Easy Vegetarian Cooking &amp; Takeout Food)",
    "It's been awhile since my last \"what I eat in a day\" video, and that's mainly because I've felt uncreative in the kitchen the past year ..."
  ],
  [
    "Pudding Eggless Online Cooking class ☎️ +91 8551 8551 04 ☎️ +91 8551 8551 07 By Om Sai Cooking Class",
    "Pudding Eggless Online Cooking class ☎️ +91 8551 8551 04 +91 8551 8551 07 By Om Sai Cooking Class Fees: 999 1."
  ],
  [
    "Primitive Technology - New style cooking geese in clay hole - Eating delicious",
    "Hi to day i wantto show you about videos: Primitive Technology - New style cooking geese in clay hole - Eating delicious if you like ..."
  ],
  [
    "Cooking with Kevin De Bruyne 👏 👨‍🍳",
    "Cooking with Kevin De Bruyne ‍   (via KevinDeBruyne/TikTok) #ESPNFC #shorts ✓ Subscribe to ESPN+: ..."
  ],
  [
    "6 COOKING MISTAKES IN EVERY INDIAN KITCHEN  | By GunjanShouts",
    "Join my Weight Loss/ Weight Gain/ Workout Program (I'MWOW): https://bit.ly/37DtL6B Instagram: ..."
  ],
  [
    "50 Cooking Tips With Gordon Ramsay | Part One",
    "Here are 50 cooking tips to help you become a better chef! #GordonRamsay #Cooking Gordon Ramsay's Ultimate Fit ..."
  ],
  [
    "Vlad and Niki pretend play cooking fruit ice cream",
    "Niki cooking fruit ice cream for Vlad. Vlad tries ice cream made from watermelon, pineapple, kiwi and fruit mix ice cream."
  ],
  [
    "TWICE REALITY &quot;TIME TO TWICE&quot; TDOONG Cooking Battle EP.02",
    "TWICE REALITY \"TIME TO TWICE\" TDOONG Cooking Battle EP.02 TWICE 11TH MINI ALBUM \"BETWEEN 1&2\" ❣Listen ..."
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #16 | MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Snail Cooking and Eating | Healthy Snail Recipe | Cooking South Indian Snails in Village",
    "View Snail Catching (old ) video here. https://youtu.be/mICjTlQdHek Today we cook above 100 KG snails in our village."
  ],
  [
    "Cooking a Delicious Salmon Dish | MasterChef Canada | MasterChef World",
    "In this Mystery Box challenge, each home cook must use one of the techniques learned from the judges to make a delicious ..."
  ],
  [
    "Primitive technology - Egg eating and cooking delicious",
    "Primitive technology - Egg eating and cooking delicious This videos is performance please do not according."
  ],
  [
    "MUTTON BIRYANI | Layered Mutton Biryani Recipe Cooking In Village | Goat Biryani Cooking &amp; Eating",
    "Mutton Biryani Recipe is all time favorite for south Indian Peoples. Because of mutton biryani gives extraordinary taste with ..."
  ],
  [
    "ASMR |  1-week Delicious Bayashi Food #32 | MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "mukbang | How to make crispy pork belly? | How to make fried chicken? | cooking | songsong &amp; ermao",
    "mukbang | How to make crispy pork belly? | How to make fried chicken? | cooking | songsong & ermao,The Chinese delicacies ..."
  ],
  [
    "Baby doll kitchen grill cooking toys baby Doli play",
    "Let's play with Baby doll kitchen grill cooking toys Enjoy and subscribe, thanks - Toypudding."
  ],
  [
    "Paw Patrol Skye&#39;s Birthday &amp; Cooking Contest Animations for Kids!",
    "Paw Patrol Skye's Birthday & Cooking Contest Animations for Kids! First, Paw Patrol Skye's Birthday Animation for Kids! In this ..."
  ],
  [
    "The Cooking Foodie",
    "Hello and Welcome to my channel, I am the cooking foodie and here you can find many different recipes. Healthy recipes ..."
  ],
  [
    "Me vs Grandma Cooking Challenge #6 | Simple Secret Kitchen Hacks and Tools by Multi DO Challenge",
    "Me vs Grandma Cooking Challenge #6 | Simple Secret Kitchen Hacks and Tools by Multi DO Challenge Be sure to share it with ..."
  ],
  [
    "JANGRI | JALEBI Recipe Cooking in Village | Indian Famous Dessert Recipe | Imarti Sweet Recipe",
    "Today in our village, we cook famous Indian sweet and dessert recipe with an easy method. We use the traditional hand grinder to ..."
  ],
  [
    "Food on the Festive Table! Beef Ribs in the Oven!",
    "Friends thank you for watching Subscribe to my channel I will delight you with new videos ..."
  ],
  [
    "5 KG of Fish fried in a cauldron! Cooking in the Snowy Mountains of Azerbaijan",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "Me vs Grandma Cooking Challenge #1 | Simple Secret Kitchen Hacks and Tools by Multi DO Challenge",
    "Me vs Grandma Cooking Challenge #1 | Simple Secret Kitchen Hacks and Tools by Multi DO Challenge Be sure to share it with ..."
  ],
  [
    "How a Woman Lives in a remote village in Ukraine! Cooking a traditional Dinner",
    "Katya lives in a remote village in Ukraine. Today she will cook a traditional dinner in the oven."
  ],
  [
    "Cooking Paavangal | Parithabangal",
    "Order all your heart desires from the Swiggy app - check out the link - https://swiggy.onelink.me/888564224/wmssuzbg #swiggy # ..."
  ],
  [
    "FULL CHICKEN ROAST | Whole Fried Chicken Recipe Cooking in village | Free Range Chicken Recipe",
    "Today in our village, we cook a spicy chicken recipe by making a full chicken roast. First we fried whole chicken then we roast the ..."
  ],
  [
    "ASMR | Delicious Bayashi Food #14 | MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "♤Satisfying relaxing video♤ || ♧Douyin ASMR cooking compilation♧ [no sub] #1♡",
    "Douyin ASMR #1 I took this video from douyin/tiktok china! [Video ini saya ambil dari douyin/tiktok china!] Thank You for ..."
  ],
  [
    "Me vs Grandma Cooking Challenge! Secret Cake Decorating Ideas by RATATA",
    "Subscribe for RATATA: https://www.youtube.com/channel/UC1I_DaL4stfZi03ozQEQ1VQ?sub_confirmation=1 Family cake ..."
  ],
  [
    "Ranking Your CURSED Cooking",
    "Opera GX gives you complete CONTROL over your RAM & CPU usage. Kill CPU-draining tabs! Download now for FREE: ..."
  ],
  [
    "එන්න මගේ කුස්සියට | cooking day | sheshadrie krisharya | Food",
    "Meat curry mix : https://instagram.com/hungersquad_sl?igshid=Nzg3NjI1NGI="
  ],
  [
    "Satisfying Miniature PEPSI Jelly Decorating | Coolest Tiny Pepsi Dessert Ideas | Miniature Cooking",
    "Satisfying Miniature PEPSI Jelly Decorating | Coolest Tiny Pepsi Dessert Ideas | Miniature Cooking Hi everyone, I'm Mico. Today I ..."
  ],
  [
    "Cooking off grid/ on grid 🍳",
    "VEVOR CANVAS YURT BELL TENT 6M https://amzn.to/3WIgFsT VINGLI PORTABLE TOILET SINK COMBO SET ..."
  ],
  [
    "इमली | Imlie wins the cooking round at Best Bahu competition!",
    "Click here to Subscribe *Star Plus* : https://www.youtube.com/channel/UC-LPIU24bQXVljUXivKEeRQ *Free Subscription* ..."
  ],
  [
    "🍄Tasty Kalan Recipe 🤩👌🏻#shorts #cooking #health #recipe",
    "our cooking time channel has food cooking videos."
  ],
  [
    "Lemon Crunchy Chicken cooked in the middle of the forest. ASMR cooking. NO TALK",
    "Knives available here: https://tcg-mwtpcollab.com/ Subscribe: https://www.youtube.com/channel/UCfxzr4iHJ1ZFq7KT8bwfiBw ..."
  ],
  [
    "mukbang | How to make braised pork? | How to make roast leg of lamb? | cooking | songsong &amp; ermao",
    "mukbang | How to make braised pork? | How to make roast leg of lamb? | cooking | songsong & ermao, Chinese delicacies ..."
  ],
  [
    "Cooking Secrets and Kitchen Hacks #Shorts",
    "Check out these kitchen tips and easy recipes! This will make life easier for every hostess and save time and nerves. For example ..."
  ],
  [
    "1000 PANI PURI | Golgappa Recipe Cooking in South Indian Village | How to make Pani Puri Recipe",
    "Pani Puri Recipe is one of the most popular street food snacks all over India. But the origin of the golgappa is north India."
  ],
  [
    "60 Days Harvest &amp; Build Life, COOKING TRADITIONAL Cakes Going To The Market To Sell | Free New Life",
    "freenewliffe #greenforestlife #newliffe #farm 60 Days Harvest & Build Life, COOKING TRADITIONAL Cakes Going To The Market ..."
  ],
  [
    "Show me your cooking hacks! #thatlittlepuff #catsofyoutube",
    ""
  ],
  [
    "Cooking with scary Kissy Missy #shorts",
    "Share and subscribe if you like the video Don't forget to click the bell to make sure you never miss our videos   #shorts Music ..."
  ],
  [
    "🐍 Eel Fishing With Eggs and Cooking Japanese Grilled Eel Rice in Miniature Kitchen 🍳 ASMR Cooking",
    "Hello World, I'm Food Lover and Miniature Lover, my name is Clover ! I'm MASTER CHEF in my MINIATURE KITCHEN !"
  ],
  [
    "Making a Gingerbread House for Homeless Christmas Lunch | How To Cook That Ann Reardon",
    "Making & decorating a large gingerbread house and gifting it to homeless. Sponsor: Alexa customers can listen to A Christmas ..."
  ],
  [
    "20 Cooking Secrets You Definitely Need to Know",
    "TIMESTAMPS: 00:17 Easy way to melt chocolate 01:32 Tricky ideas for food lovers 02:58 Quick way to peel an egg 04:54 How to ..."
  ],
  [
    "Cooking Basics For Students: Veggie Stock",
    "shorts #kwoowk."
  ],
  [
    "NOODLES | Yummy Hakka Noodles Recipe Cooking and Eating in Village | Chinese Food | Veg Noodles",
    "Today in our village, we cook traditional Chinese Hakka noodles recipe using colorful veggies. We first boiled the Hakka noodles ..."
  ],
  [
    "OCTOPUS COOKING and EATING | Big Size Octopus fry | Seafood Recipe Cooking in Village",
    "Today in our village we cook 6 big size octopuses. We make octopus fry by using fewer masalas and these are our traditional ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by RaPaPa Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "Sausage &amp; Bean Hotpot",
    "Merchandise https://kays-cooking-2.creator-spring.com."
  ],
  [
    "35 Kg SNAKE GRILLED | Snake Grilled On Charcoals | Snake Cooking Skills",
    "35 Kg Snake Grilled On Charcoals Cooking In Indonesia Manado."
  ],
  [
    "Best Of Miniature Cooking Food Video Compilation | 1000+ Miniature Food Recipe ASMR",
    "Best Of Miniature Cooking Video Compilation | 1000+ Miniature Food Recipe ASMR Hello my dear viewers, this episode includes ..."
  ],
  [
    "STUFFED ONION BOMBS WITH PASTA: The BEST Way to Cook These delicious dish",
    "Dear friends, today we would like to share with you the STUFFED ONION BOMBS WITH PASTA: The BEST Way to Cook These ..."
  ],
  [
    "Cooking Breakfast for 1,500 on a US Navy Ship",
    "Have you ever wondered what it takes to make breakfast for a boat full of US Sailors and Marines? We climbed aboard the USS ..."
  ],
  [
    "Lego Breakfast - Lego In Real Life 5 / Stop Motion Cooking &amp; ASMR",
    "Hello I'm tomosteen. Thanks for watching, The fifth installment of Lego In Real Life on my channel is a breakfast of bread, ..."
  ],
  [
    "Kung Fu Cooking",
    "shorts #kungfu #cooking #uncleroger Crouching tiger hidden potato ... @wenzh5lizz320 Original weejio here: ..."
  ],
  [
    "DIY Magic Wand And You Can Eat! ✨😻 | Chef Cat Cooking  #tiktok #Shorts",
    "DIY Magic Wand And You Can Eat! ✨   | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "He cooks Chicken perfectly and eating with his daughter | Cooking home style chicken curry",
    "Chicken curry is all time famous for every people. Today we cook chicken curry using all traditional spices for more tasty gravy."
  ],
  [
    "BIG MOMENT | RAHUL GANDHI Join In Village Cooking | Mushroom Biryani | Village Cooking Channel",
    "Today we have a Big Moment. Rahul Gandhi Joining our cooking and he encouraged us a lot. Today we cook mushroom biryani ..."
  ],
  [
    "Cooking With Vegetables Song + More Nursery Rhymes &amp; Kids Songs - CoComelon",
    "Come and learn with JJ how to harvest crops! In this educational song compilation, enjoy CoComelon kids songs such as 'Harvest ..."
  ],
  [
    "Try Guys Mystery Dish Challenge • Cooking Telephone",
    "Ad Ring, ring, ring, hello? Today we're playing a special game of telephone… in the #TryKitchen! Which Try Guy will guess the ..."
  ],
  [
    "Diana Pretend Cooking with New Kitchen Toy",
    "Diana is pretend cooking with a Minnie Mouse kitchen toyset! She is trying to fix her broken kitchen toy, but she can't fix it. Diana ..."
  ],
  [
    "mukbang | How to make crispy pork belly? | How to make fried chicken? | cooking | songsong &amp; ermao",
    "mukbang | How to make crispy pork belly? | How to make fried chicken? | cooking | songsong & ermao,The Chinese delicacies ..."
  ],
  [
    "33 Cooking Secrets to Become a Chef || Simple Recipes Anyone Can Cook",
    "TIMESTAMPS: 00:12 Homemade kebab 02:10 Baked bread with cheese and salami 04:00 Unusual way to cook meatballs 05:57 ..."
  ],
  [
    "Cooking Basics For Students: Veggie Stock",
    "shorts #kwoowk."
  ],
  [
    "Compilation Asmr Eating : Mukbang Animation with Magnet Balls | Magnet Stop Motion Cooking",
    "Compilation Asmr Eating : Mukbang Animation with Magnet Balls | Magnet Stop Motion Cooking Link ..."
  ],
  [
    "Curious George 🐵 Cooking with George 🐵 Kids Cartoon 🐵 Kids Movies 🐵 Videos for Kids",
    "George makes an eggplant soup for the Man with the Yellow Hat. ▻ Subscribe to the channel for more videos: ..."
  ],
  [
    "Beef Qutab - Traditional Azerbaijani Dish, Outdoor Cooking",
    "Dear friends, today we would like to share with you the Beef Qutab - Traditional Azerbaijani Dish, Outdoor Cooking video, we ..."
  ],
  [
    "USEFUL COOKING HACKS AND GADGETS YOU SHOULD USE",
    "Hello, cooking lovers! Check out our fresh collection of simple and really useful hack and cooking tricks. They will definitely make ..."
  ],
  [
    "Satisfying Miniature PEPSI Jelly Decorating | Coolest Tiny Pepsi Dessert Ideas | Miniature Cooking",
    "Satisfying Miniature PEPSI Jelly Decorating | Coolest Tiny Pepsi Dessert Ideas | Miniature Cooking Hi everyone, I'm Mico. Today I ..."
  ],
  [
    "Uncle Roger SHOCKED by the WORST Fried Rice Video (Kay&#39;s Cooking)",
    "Kay's original weejio: https://youtu.be/8-rj3gVOAnM Thanks to Sasa Melezatkan for sponsoring this weejio! If you in Indonesia, ..."
  ],
  [
    "27 BASIC COOKING SKILLS FOR BEGINNERS AND PROS!",
    "GOLDEN KITCHEN LIFE HACKS FOR YUMMY MEALS How to cook crispy fried chicken with chips like from a restaurant  ?"
  ],
  [
    "Kid Chef Holiday Cooking Challenge",
    "Today, we're partnering with Kroger and welcoming Jude, a kid chef to the Mythical Kitchen to make an exciting new holiday dish!"
  ],
  [
    "How a Woman Lives in a remote village in Ukraine! Cooking a traditional Dinner",
    "Katya lives in a remote village in Ukraine. Today she will cook a traditional dinner in the oven."
  ],
  [
    "5 KG of Fish fried in a cauldron! Cooking in the Snowy Mountains of Azerbaijan",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "Christmas Is Coming，Let&#39;s Make A Popular Strawberry Tart😂🍓 | Chef Cat Cooking #tiktok #Shorts",
    "Try To Make A Popular Strawberry Tart, But ....     The Cooking Cat who shares homemade recipes Since 2019. The first and the ..."
  ],
  [
    "countryside cuisine #cooking",
    ""
  ],
  [
    "जानिए कैसे Cooking Oil कम्पनी हमें बेवक़ूफ़ बनाती है? | Q&amp;A Session on Oil | Manas Samarth",
    "दुनिया का Best Cooking Oil Video: https://youtu.be/1I57VJkuVBs Want to Consult Manas Samarth for any Health ..."
  ],
  [
    "$1425 vs $13 Fettuccine Alfredo: Pro Chef &amp; Home Cook Swap Ingredients | Epicurious",
    "Professional chef instructor Frank Proto and home cook extraordinaire Emily are trading Fettuccine Alfredo recipes and hitting the ..."
  ],
  [
    "Cooking Challenge Against My Brothers (3 vs 1)",
    "I cooked against my three younger brothers in an intense, one-hour cooking challenge. Each team was responsible for making an ..."
  ],
  [
    "Me VS Grandma || Secret Cooking Hacks #SHORTS",
    "We prepared the best grandma's kitchen recipes you'll love! Moreover, here you'll find simple cooking tricks that will save your ..."
  ],
  [
    "✨🤤Bread Bajji 🧔🏻💞 Lovely Father Sentiment😥 #cooking #shorts #recipe",
    "our cooking time channel has food cooking videos. Bread Bajji Lovely Father Sentiment #cooking #shorts #trending ..."
  ],
  [
    "Show me your cooking hacks! #thatlittlepuff #catsofyoutube",
    ""
  ],
  [
    "BUTTER CHICKEN | Delicious Healthy Country Chicken Recipe | Chicken Curry Recipes | Village Cooking",
    "Today we made a healthy country chicken recipe with butter. Butter chicken recipe is everyone is love because butter is more ..."
  ],
  [
    "mukbang | How to make braised pork? | How to make roast leg of lamb? | cooking | songsong &amp; ermao",
    "mukbang | How to make braised pork? | How to make roast leg of lamb? | cooking | songsong & ermao, Chinese delicacies ..."
  ],
  [
    "Cooking Secrets and Kitchen Hacks #Shorts",
    "Check out these kitchen tips and easy recipes! This will make life easier for every hostess and save time and nerves. For example ..."
  ],
  [
    "THE ABSOLUTE BEST AIR FRYER MUNCHIES | SAM THE COOKING GUY",
    "The MUNCHIES saga continues - this time utilizing one of the best and most versatile tools in the kitchen, the air fryer! We do ..."
  ],
  [
    "POPCORN | Spicy Butter Popcorn Recipe Cooking In Village | Home Made Easy Popcorn Snack Recipe",
    "Today in our village, we cook two types of popcorn recipes. We made Spicy Butter popcorn and Flavored Mint Popcorn recipes."
  ],
  [
    "Slow Cooking Winter Recipes | Gordon Ramsay",
    "Here are two full episodes where Gordon Ramsay focuses on slow cooking and how versatile it can be with minimal stress."
  ],
  [
    "Cooking Bihari Breakfast With Sanjay Mishra | Tere Gully Mein EP 28 | Curly Tales",
    "Have you ever heard about Bihari Dal Pitha? Well, I'll allow the veteran and the legend Sanjay Mishra to do the honors. He not ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by RaPaPa Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "Me vs Grandma Cooking Challenge #2 | Simple Secret Kitchen Hacks and Tools by TeenDO Challenge",
    "Me vs Grandma Cooking Challenge #2 | Simple Secret Kitchen Hacks and Tools by TeenDO Challenge Be sure to share it with ..."
  ],
  [
    "Cooking with scary Kissy Missy #shorts",
    "Share and subscribe if you like the video Don't forget to click the bell to make sure you never miss our videos   #shorts Music ..."
  ],
  [
    "GIANT CRAB (Catch and Cook) SOLO.. Cooking with FIRE",
    "FDYS SHOP GET YOUR MERCH https://www.fielddaysshop.com GIANT CRAB (Catch and Cook) SOLO.. Cooking with FIRE."
  ],
  [
    "COOKING TikToks (w/ recipes) | TikTok Compilation 2021",
    "Cooking TikToks (w/ recipes) | TikTok Compilation 2021 Cooking Recipe: Spicy chicken pasta : 0:19 Pasta w/ feta cheese 2:04 ..."
  ],
  [
    "3 Levels of Grilled Cheese!?!",
    ""
  ],
  [
    "Kung Fu Cooking",
    "shorts #kungfu #cooking #uncleroger Crouching tiger hidden potato ... @wenzh5lizz320 Original weejio here: ..."
  ],
  [
    "꿀주부의 38가지 요리 모음 2탄 / 누구나 쉽게 따라할 수 있는 집밥 / ASMR Cooking / Cook with me",
    "여러분 안녕하세요. 꿀주부입니다. 저는 지금 1년에 딱 한번 주어지는 여름 휴가를 보내고 있어요.   그래서, 이번 주는 그동안 ..."
  ],
  [
    "Top 1 Videos: Catch Fish For Eggs And Primtive Cooking",
    "Top 1 Videos: Catch Fish For Eggs And Primtive Cooking Please that video a LIKE , comment and Subscribe. #PrimitivelifeHT ..."
  ],
  [
    "Meow~Super Huge Watermelon Sago Dessert!🍉🍡|ASMR Summer Drinks | Cat Cooking-TikTok #Shorts",
    "Meow~Super Huge watermelon Sago Dessert!    |ASMR Summer Drinks | Cat Cooking-TikTok The Cooking Cat who shares ..."
  ],
  [
    "Uncle Roger Learn How To Cook Steak (ft. Guga)",
    "Go to https://partner.bokksu.com/UncleRoger and use code UNCLEROGER to get $15 off your first Bokksu Japanese snack box!"
  ],
  [
    "Cooking Basics: How To Stirfry",
    "shorts #kwoowk."
  ],
  [
    "Cooking Tips For Kitchen Beginners | Epicurious 101",
    "Professional chef instructor Frank Proto shares his top tips for beginners, helping you to elevate the basic skills you'll need to find ..."
  ],
  [
    "Valuable Kitchen Hacks to Change The Way You Cook",
    "TIMESTAMPS: 00:45 Easy way to peel garlic 02:34 How to cook potatoes 04:14 How to cook chicken 06:21 Baked cheese bread ..."
  ],
  [
    "1000+ LEGO FOOD RECIPE Compilation | Best of Lego Cooking | Stop Motion Videos ASMR",
    "1000+ LEGO FOOD RECIPE Compilation | Best of Lego Cooking in real life | Stop Motion Videos ASMR Warning: This is not ..."
  ],
  [
    "50 Ways To Cook A Steak",
    "Can you cook a steak in a waffle iron? Over dry ice or hot molten glass? What about deep frying, or cooking on a hot car engine?"
  ],
  [
    "DIY Magic Wand And You Can Eat! ✨😻 | Chef Cat Cooking  #tiktok #Shorts",
    "DIY Magic Wand And You Can Eat! ✨   | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "$162 vs $19 Fried Chicken: Pro Chef &amp; Home Cook Swap Ingredients | Epicurious",
    "The original Ingredient Swap duo returns as professional chef instructor Frank Proto and home cook extraordinaire Lorenzo trade ..."
  ],
  [
    "Cooking - Piero 47 (Video Oficial)",
    "Forty47SevenGvng #YakuzaMafia #spanishdrill INSTAGRAM https://www.instagram.com/dcompanymusic/ ..."
  ],
  [
    "Kim Kardashian West and Paris Hilton Attempt To Use The Dishwasher | Cooking With Paris | Netflix",
    "\"That's hot, literally\". Watch Kim Kardashian West and Paris Hilton attempt to make a fluffy bacon frittata in Cooking With Paris."
  ],
  [
    "THE WOMAN LIVES ALONE IN THE MOUNTAINS! Cooking Potatoes with Meat on Fire",
    "Today, Maria Dmitronyak, who lives high in the Ukrainian Carpathian mountains, will cook for us potatoes with meat on a fire."
  ],
  [
    "Cooking Campfire Pizza on The Sadj Grill, The Best Pizza You&#39;ll Ever Eat",
    "Kənd Həyatı - bizim məqsədimiz sizə kənd abu havasını bəxş etməktir! Həmdə biz sizinlə maraqlı yemək və sərinləşdirici içki ..."
  ],
  [
    "Cooking Safety",
    "Cooking is a leading cause of home fires. Ranges and stove tops alone cause 62% of home fires. Keep anything away that can ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Simple Secret Kitchen Hacks and Tools by PaRaRa Challenge",
    "Write in the comments which of today's dishes you would like to try! Be sure to share it with your friends! And don't forget to ..."
  ],
  [
    "COOKING WITH YUNG GRAVY BETCH",
    "Buy a BETCH APRON OR HOODIE Here : https://betch.shop Follow my Instagram! (itsqcp) - https://www.instagram.com/itsqcp/ ..."
  ],
  [
    "ये है मोहब्बतें | Ishita Cooking Chicken First Time",
    "Click here to Subscribe *Star Plus* : https://www.youtube.com/channel/UC-LPIU24bQXVljUXivKEeRQ *Free Subscription* ..."
  ],
  [
    "How to Make a Meal with Blippi! 2 Hours of Cooking Stories for Kids!",
    "It's the time of year to make BIG meals with friends and family! Blippi LOVES learning how to safely help out in the kitchen and ..."
  ],
  [
    "GREEN CHICKEN | Full Chicken Cooking &amp; Eating | Fried Chicken Recipe | Chicken Green Gravy Recipe",
    "Today in our village, we cook green chicken recipe using culinary leaves and chickens. First, we ground all leaves in the ..."
  ],
  [
    "$248 vs $15 Breakfast Tacos: Pro Chef &amp; Home Cook Swap Ingredients | Epicurious",
    "Pro chef Saúl Montiel from Cantina Rooftop and home cook Lorenzo are swapping recipes and hitting the kitchen to start the ..."
  ],
  [
    "Amazing Charcoal Grilled Chicken | Grill Chicken Red Curry Recipe | Thai Street Food Style",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "Mouth-Watering Meals You Can Cook Outdoor || Cooking Hacks For Your Next Camping Trip!",
    "TIMESTAMPS: 00:36 Simple tricks to cook outdoor 01:26 Delicious sandwich recipe 02:57 Juicy steak recipe 04:34 Useful ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by Multi DO Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "Lego Chocolate Cake - Lego In Real Life 10 / Stop Motion Cooking &amp; ASMR",
    "Hello I'm tomosteen. This video is a stop motion animation created using many photos. I don't actually cook Legos. Please do not ..."
  ],
  [
    "Pro Chef Reacts... to Aunt Myrna&#39;s Party Cheese Salad by Cooking With Jack Show",
    "OKAY, according to the historical definition of salad, America invented gelatine salad in late 1800. However, help me ..."
  ],
  [
    "Chris learns how to prepare healthy dessert and other cooking stories for kids",
    "Chris learns how to prepare healthy dessert and other cooking stories for kids. Please Subscribe!"
  ],
  [
    "Cooking chicken meat in the village of Iran | village lifestyle of Iran",
    "Village Tale Cooking chicken meat in the village of Iran ---‐------------------------------------ Hello there to the Village Tale channel, ..."
  ],
  [
    "Best of Miniature Cooking #2 | ASMR Cooking Mini Food Compilation",
    "Awesome Miniature Cooking Videos | This is a compilation of my best videos which you can know some recipes even though ..."
  ],
  [
    "Soupas day  sexy no bra cooking",
    "Follow me on patreon.com/bella2022."
  ],
  [
    "Talking Tom 🐱 Cooking From The Heart 🐱 Cartoon for kids Kedoo ToonsTV",
    "New Talking Tom episode: Cooking From The Heart Subscribe and watch more new cartoons ▻ https://goo.gl/TMOrij on Kedoo ..."
  ],
  [
    "I Spend 90 Days To Building, Cooking And Survival On The Cliff",
    "Hi, my name is Peter. I come from Singapore. Recently, because I was so bored with city life, I spent about 3 months experiencing ..."
  ],
  [
    "Vlad and Nikita Cooking Breakfast for Mama",
    "Vlad and Nikita love to pretend play in a cafe and restaurant with his mother. Kids pretend to make breakfast for mom. Now the ..."
  ],
  [
    "ASMR Spicy Food | Chinese food and cooking , dinner, drink , BBQ restaurant",
    "Spicyfood #dinner #short ASMR Spicy Food | Chinese food and cooking , dinner, drink , BBQ restaurant."
  ],
  [
    "Make Holiday Candy With Claire Saffitz | Try This at Home | NYT Cooking",
    "Claire Saffitz is back in the studio kitchen for another round of “Try This at Home,” a series that guides you through different baking ..."
  ],
  [
    "Huge Lego Salmon fish Cutting / Mukbang  /  Stop Motion Cooking ＆ ASMR",
    "This time, I made a video of cooking salmon rice topped with king salmon. It took a little over a month to make and shoot salmon ..."
  ],
  [
    "ASMR MUKBANG | Chicken Sandwich, Tteokbokki, Nuggets, Indomie Mi Goreng, Shrimp Cocktails | COOKING",
    "Join me on Fanhouse for exclusive content, extra mukbang videos, early access to YouTube videos, custom requests and more!"
  ],
  [
    "cooking with waste?!🗑️",
    "doobydobap on instagram / tiktok for more!"
  ],
  [
    "Cooking a Whole Sheep in the Kelbajar Region of Azerbaijan",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "PEANUT MUTTON | Tasty Mutton Gravy Recipe Cooking In Village | Peanut Recipes | Special Mutton Curry",
    "Today In our village, we cook a special mutton curry recipe with peanuts. We did first roasting the peanuts with masala then we ..."
  ],
  [
    "Funny Cake Shorts | Christmas Cake Special | Cooking Shorts",
    "shorts #comedy #funny."
  ],
  [
    "NYT Cooking",
    "All the food that's fit to eat (yes, it's an official New York Times production)."
  ],
  [
    "[BTS VLOG] Jin l COOKING VLOG",
    "[BTS VLOG] Jin l COOKING VLOG 디자인 및 자막: Jin 꿀 제공: 석지니 할아버지 장소 & 재료 제공: 이연복 셰프님 #Jin #요리는역시 ..."
  ],
  [
    "How Chef Cat Makes Baked Milk Pudding At Home?😋😉 | Chef Cat Cooking  #tiktok #Shorts",
    "The Easiest Way Of Making Baked Milk Pudding | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since ..."
  ],
  [
    "Traditional Azerbaijani Hazelnut Baklava | Outdoor Cooking",
    "Dear friends, today we would like to share with you the Traditional Azerbaijani Hazelnut Baklava video, we really hope you enjoy ..."
  ],
  [
    "3 FULL GOAT FRY | Mutton Changezi Recipe Cooking In Village | Delicious Mutton Curry Recipe",
    "Chicken Changezi Recipe is a famous recipe in India as well as Arab Countries. But Today we make Changezi Recipe with ..."
  ],
  [
    "COOKING DELICIOUS CHICKEN PASTA RECIPE | ZO KITCHEN",
    "Hi all!! I've been busy with house work renovation mostly, I'm doing all the work by myself but I'm back again here on YouTube!"
  ],
  [
    "Cat Making A Mini World Cup Stadium With Chocolate! ⚽🏆😍| Chef Cat Cooking  #tiktok #Shorts",
    "Cat Making A Mini World Cup Football Field With Chocolate! The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by TeenDO Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "Me vs Grandma Cooking Challenge | Funny Kitchen Pranks &amp; Simple Secret Hacks by RATATA COOL",
    "Subscribe for RATATA COOL: https://www.youtube.com/channel/UCWj10BWkvjXBS_MZsTbylRw?sub_confirmation=1 I wonder ..."
  ],
  [
    "How To Cook The Perfect Steak?!",
    "shorts #steak #uncleroger Use hand like @menwiththepot. Uncle Roger is the creation of comedian Nigel Ng. YouTube: ..."
  ],
  [
    "Longyin Poached Egg Is So Cute!🤤😲😍 (ASMR) | Chef Cat Cooking | Creative Food Idea #tiktok #Shorts",
    "Longyin Poached Egg Is So Cute!       (ASMR) | Chef Cat Cooking | Creative Food Idea The Cooking Cat who shares ..."
  ],
  [
    "Let&#39;s pull out our cooking utensils #shorts #jimmyfallon #charlieputh",
    ""
  ],
  [
    "EASY VEGAN STEAMED RADISH BALLS RECIPE #recipe #radish #vegan #vegetarian #chinesefood #cooking",
    ""
  ],
  [
    "Cooking with Volk | Fishing and Cooking DELICIOUS Fresh Seafood",
    "Subscribe here: https://youtube.com/c/AlexVolkanovskiOfficial?sub_confirmation=1 Catching and Cooking Delicious Fresh ..."
  ],
  [
    "MUTTON LEG PIECE | Cooking &amp; Eating | Mutton Uppu Kari | Full Goat Leg Fry Recipe Cooking In Village",
    "Today in our village, we cook a delicious and spicy mutton fry recipe. We call this recipe Uppu Kari in our village. We use big size ..."
  ],
  [
    "Make Your Life 10X EASIER Cooking",
    ""
  ],
  [
    "Accidentally Burned House Rebuild &amp; Mutton Biryani - Full Goat Biriyani Cooking for Special People",
    "Our pride grandpa make very special work today. They visit a house that was totally burned down and they make that house for ..."
  ],
  [
    "SHE DESTROY RICE AGAIN... (Kay&#39;s Cooking)",
    "The first 1000 people to use this link will get a free trial of Skillshare Premium Membership: https://skl.sh/mrnigelng05211 Kay's ..."
  ],
  [
    "50 KG MUSSELS | River Mussels Fry Recipe Cooking &amp; Eating In Village | Rare Healthy Recipe",
    "Today in our village, we cook 50 kg river mussels for making the mussel fry recipe! River mussel recipe is one of the rare and ..."
  ],
  [
    "Lego Chocolate Cake - Lego In Real Life 10 / Stop Motion Cooking &amp; ASMR",
    "Hello I'm tomosteen. This video is a stop motion animation created using many photos. I don't actually cook Legos. Please do not ..."
  ],
  [
    "Cooking chicken meat in the village of Iran | village lifestyle of Iran",
    "Village Tale Cooking chicken meat in the village of Iran ---‐------------------------------------ Hello there to the Village Tale channel, ..."
  ],
  [
    "Wilderness Cooking Skill | Cooking Pork Belly Vegetable Tamarind Sour Soup Recipe.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "ASMR Cooking  “Spam with cheese” #Shorts",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Me vs Grandma Cooking Challenge | Funny Kitchen Pranks &amp; Simple Secret Hacks by RATATA COOL",
    "Subscribe for RATATA COOL: https://www.youtube.com/channel/UCWj10BWkvjXBS_MZsTbylRw?sub_confirmation=1 I wonder ..."
  ],
  [
    "PEANUT MUTTON | Tasty Mutton Gravy Recipe Cooking In Village | Peanut Recipes | Special Mutton Curry",
    "Today In our village, we cook a special mutton curry recipe with peanuts. We did first roasting the peanuts with masala then we ..."
  ],
  [
    "Building a New Greenhouse and Cooking Stuffed Onions",
    "Dear friends, today we would like to share with you the Building a New Greenhouse and Cooking Stuffed Onions video, we really ..."
  ],
  [
    "CHICKEN TIKKA | Country Chicken BBQ Recipe Cooking In Village | Chicken Tikka Kebab Recipe",
    "Everyone like to eat chicken recipes, especially healthy country chicken recipes! We cook today's chicken tikka kebab recipe with ..."
  ],
  [
    "Stop Motion Cooking ASMR - Catfish Hand Finding &amp; Catch Unique Eel Fish Primitive Survival Cuckoo",
    "Today we will recreate the difficult life of original technology with this video: Stop Motion ASMR - Catfish Hand Fishing Survival ..."
  ],
  [
    "Zero waste cooking Tips! #short #shorts #zerowaste #zerowastetips",
    "We can all do small everyday changes with cooking and kitchen habits that would make the biggest impact! We don't need to be ..."
  ],
  [
    "Cooking local chicken in the village of Iran | village lifestyle of Iran",
    "Village Tale Cooking local chicken in the village of Iran ---‐------------------------------------ Hello there to the Village Tale channel, ..."
  ],
  [
    "Cooking Paavangal | Parithabangal",
    "Order all your heart desires from the Swiggy app - check out the link - https://swiggy.onelink.me/888564224/wmssuzbg #swiggy # ..."
  ],
  [
    "Collect ripe jujube fruit for my recipe - Yummy river shell cooking - Cooking with Sreypov",
    "Hello friends. Welcome back to visit my channel. Today I collect ripe jujube fruit for my recipe. I'm going to make ripe jujube fruit in ..."
  ],
  [
    "50 KG MUSSELS | River Mussels Fry Recipe Cooking &amp; Eating In Village | Rare Healthy Recipe",
    "Today in our village, we cook 50 kg river mussels for making the mussel fry recipe! River mussel recipe is one of the rare and ..."
  ],
  [
    "Cooking a Whole Sheep in the Kelbajar Region of Azerbaijan",
    "Wilderness - Our special Knives and Cookware - https://bit.ly/3l7Nkrn Make sure that you have the bell turned on, so you will ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by Multi DO Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "Cooking Dinner for My Wife | Indian Village Cooking by Nikunj Vasoya",
    "Making of an Indian dinner at our farm in my village for my wife Kajal Vasoya. Watch out India's Top Award Winning Cooking show ..."
  ],
  [
    "Oreo Swiss Rolls | Fireless Cooking Recipes | Chocolate Swiss Roll Without Oven |",
    "Oreo Swiss Rolls | Fireless Cooking Recipes | Chocolate Swiss Roll Without Oven ..."
  ],
  [
    "How One of Australia’s Best Restaurants Relies Entirely on Live-Fire Cooking — Smoke Point",
    "At Firedoor, one of Sydney, Australia's busiest restaurants, chef and owner Lennox Hastie uses wood-fired grills and ovens on a ..."
  ],
  [
    "Cooking - Piero 47 (Video Oficial)",
    "Forty47SevenGvng #YakuzaMafia #spanishdrill INSTAGRAM https://www.instagram.com/dcompanymusic/ ..."
  ],
  [
    "BEST COOK ASMR FOOD COOKING 🤤🤤🤤 - Wagyu with egg yolk",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "SHARK FISHES | Tiny Shark Fish Recipe Cooking in Village | Sura Meen Kulambu | Shark Fish Recipes",
    "Today in our Village, we cook a tiny shark fish curry recipe using more than 100 shark fishes. The cleaning part is the tougher part ..."
  ],
  [
    "SEAFOOD in GLASS JAR | Mixed Seafood Recipe cooking in Glass Jar | Crab Shrimp Squid Recipe Cooking",
    "Today, we cook three types of seafood in glass jars. We use crabs, Shrimp, and Squids to make this delicious and different ..."
  ],
  [
    "Grandma vs Kitchen Gadgets | Simple Secret Cooking Hacks and Tools on TikTok by Multi DO Challenge",
    "Grandma cooks well, but she is not a modern person. Grandma competes against modern kitchen gadgets in our new challenge ..."
  ],
  [
    "Chapati With Egg Gravy - South Indian Village Life || Cooking Traditionally || The Traditional Life",
    "EP12 Dear Traditional Life Family, On this beautiful evening I was in the work of drying the paddy leaves which got wet in this rain ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Kitchen Gadgets and Parenting Hacks by TeenDO Challenge",
    "There are many more interesting tasks, unusual recipes and delicious dishes waiting for you. Be sure to share it with your friends!"
  ],
  [
    "ये है मोहब्बतें | Ishita Cooking Chicken First Time",
    "Click here to Subscribe *Star Plus* : https://www.youtube.com/channel/UC-LPIU24bQXVljUXivKEeRQ *Free Subscription* ..."
  ],
  [
    "MAKING PANEER | Homemade Paneer making in Village | Traditional Paneer Butter Masala Gravy Recipe",
    "Today in our village, we make paneer by using cow milk. After we make a panner, we use it for making paneer butter masala."
  ],
  [
    "How Chef Cat Makes Baked Milk Pudding At Home?😋😉 | Chef Cat Cooking  #tiktok #Shorts",
    "The Easiest Way Of Making Baked Milk Pudding | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since ..."
  ],
  [
    "Nomadic Women Cooking Chicken Feet _ Nomadic &amp; Village Lifestyle Of Iran",
    "Hi, Nomadic women after washing the chicken feet frying it and after added turmeric, salt and tomato paste then boil it for about an ..."
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #24| MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "How to Make a Meal with Blippi! 2 Hours of Cooking Stories for Kids!",
    "It's the time of year to make BIG meals with friends and family! Blippi LOVES learning how to safely help out in the kitchen and ..."
  ],
  [
    "Let&#39;s pull out our cooking utensils #shorts #jimmyfallon #charlieputh",
    ""
  ],
  [
    "FARM FRESH SWEET POTATOES Harvesting &amp; Cooking | Sakkaravalli Kilangu Kuzhi Paniyaram Recipe Cooking",
    "Today in our village we harvest farm fresh Sweet Potatoes to cook and making Kuzhi Paniyaram recipe with Sweet Potatoes."
  ],
  [
    "50 KG CHICKPEAS | Kerala Special Kadala Kari Recipe Cooking In Village | Chickpeas Recipes",
    "Today we cook Kerala's special traditional Kadala Kari recipe using 50 Kg of chickpeas. First, we soak the chickpeas for 6 hrs then ..."
  ],
  [
    "TWICE REALITY &quot;TIME TO TWICE&quot; TDOONG Cooking Battle EP.01",
    "TWICE REALITY \"TIME TO TWICE\" TDOONG Cooking Battle EP.01 TWICE 11TH MINI ALBUM \"BETWEEN 1&2\" ❣Listen ..."
  ],
  [
    "ASMR Spicy Food | Chinese food and cooking , dinner, drink , BBQ restaurant",
    "Spicyfood #dinner #short ASMR Spicy Food | Chinese food and cooking , dinner, drink , BBQ restaurant."
  ],
  [
    "World Smallest Miniature Milk | ASMR MDC Cooking | Mini Foodkey Cooking #Shorts",
    "Miniature Real Cooking Recipe | Mini Food | Mini Kitchen Miniature Real Cooking Recipe | World Smallest Miniature Kitchen ..."
  ],
  [
    "Wilderness Cooking Skill | Fried Braised Pork Leg Recipe | Braised Pork Leg Peanuts Eating So Yummy.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "Best of MAGNET COOKING Compilation | DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR",
    "Best of MAGNET COOKING Compilation | DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR Link ..."
  ],
  [
    "Cheese Maggi | Maggi | 5 Minutes Recipe | Easy and Quick Recipe | Cooking Short Video | #shorts",
    "cheesemaggi #maggi #5minutesrecipe #easyandquickrecipe #cookingshortvideo #shorts #shwetaskitchen maggi, maggi lovers, ..."
  ],
  [
    "CHICKEN BROCCOLI | Chicken Pepper Fry with Broccoli | Healthy Broccoli Recipe Cooking in Village",
    "Today in our village, we cook chicken broccoli recipe by using broccoli and chicken. To make this recipe, we cook broccoli and ..."
  ],
  [
    "SNAKE Like Fish! 100 KG GARFISH Recipe Cooking | Fried and Tawa Dried Fish Fry | Seafood Recipes",
    "Today in our village we cook 100 kg of garfish by fried fish Tawa dried recipe! We first fried fishes in cold pressed gingelly oil then ..."
  ],
  [
    "Mr &amp; Mrs Latest Promo - Cooking Theme | Reality Show | 13th December 2022 | Sreemukhi, Sneha | ETV",
    "mrandmrs #misterandmisses #telugushow #etvtelugu #etvwin #realityshow #sreemukhi #sneha #sivabalaji To watch your ETV all ..."
  ],
  [
    "😉The Best Way To Make Pomegranate Juice! | Chef Cat Cooking #tiktok #Shorts",
    "The Best Way To Make Pomegranate Juice! | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "Kim Kardashian West and Paris Hilton Attempt To Use The Dishwasher | Cooking With Paris | Netflix",
    "\"That's hot, literally\". Watch Kim Kardashian West and Paris Hilton attempt to make a fluffy bacon frittata in Cooking With Paris."
  ],
  [
    "3 Thanksgiving Potato Sides to Love | Claire Saffitz | NYT Cooking",
    "It's Claire Saffitz! She's in the NYT Cooking studio making three new potato recipes that are perfect for your Thanksgiving table."
  ],
  [
    "Talking Tom 🐱 Cooking From The Heart 🐱 Cartoon for kids Kedoo ToonsTV",
    "New Talking Tom episode: Cooking From The Heart Subscribe and watch more new cartoons ▻ https://goo.gl/TMOrij on Kedoo ..."
  ],
  [
    "Rural Life smart boy cooking food 조리  クック That make you miss your childhood memory",
    "Hello Everyone ! Today we are back to share Rural lifestyle of our little Chef are cooking food from wonderful hometown."
  ],
  [
    "Amazing Charcoal Grilled Chicken | Grill Chicken Red Curry Recipe | Thai Street Food Style",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "🙈 Om Nom Cooking and Shopping 🙈",
    "See these wonderful episodes and enjoy it with Om Nom Watch Om Nom Stories on: Roku TV: https://bitly.su/RokuTV ..."
  ],
  [
    "Cat Making A Mini World Cup Stadium With Chocolate! ⚽🏆😍| Chef Cat Cooking  #tiktok #Shorts",
    "Cat Making A Mini World Cup Football Field With Chocolate! The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "Huge Lego Salmon fish Cutting / Mukbang  /  Stop Motion Cooking ＆ ASMR",
    "This time, I made a video of cooking salmon rice topped with king salmon. It took a little over a month to make and shoot salmon ..."
  ],
  [
    "Cooking Alone at 2 am",
    "shorts."
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #23| MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Cooking Safety",
    "Cooking is a leading cause of home fires. Ranges and stove tops alone cause 62% of home fires. Keep anything away that can ..."
  ],
  [
    "Grandma vs Kitchen Gadgets | Simple Secret Cooking Hacks and Tools on TikTok by Multi DO Challenge",
    "Grandma cooks well, but she is not a modern person. Grandma competes against modern kitchen gadgets in our new challenge ..."
  ],
  [
    "Cooking With Marshmello",
    "Official Cooking with Marshmello YouTube Channel Subscribe and turn on notifications to stay up to date on new videos."
  ],
  [
    "Cooking - Piero 47 (Video Oficial)",
    "Forty47SevenGvng #YakuzaMafia #spanishdrill INSTAGRAM https://www.instagram.com/dcompanymusic/ ..."
  ],
  [
    "I Caught on Fire in a Cooking Challenge (Gone Wrong)",
    "The Spy Ninjas are competing in the Iron Chef Cruton Cooking Challenge for the chance to win a $572 gift card to any luxury ..."
  ],
  [
    "4 Samose only for Rs10/- #shortsfeed #shortvideo #short #foodshorts #food #cooking #streetstyle",
    ""
  ],
  [
    "Chicken Intestine Recipe | Fry Hot Chicken Intestine Holy Basil Eating So Yummy In Wild.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "EASY VEGAN STEAMED RADISH BALLS RECIPE #recipe #radish #vegan #vegetarian #chinesefood #cooking",
    ""
  ],
  [
    "Cooking Basics For Students: Veggie Stock",
    "shorts #kwoowk."
  ],
  [
    "ASMR MUKBANG | FRIED CHICKEN, STEAK, BLACK BEAN NOODLES | KOREAN FOOD | COOKING + EATING",
    "Join me on Fanhouse for exclusive content, extra mukbang videos, early access to YouTube videos, custom requests and more!"
  ],
  [
    "Flexing My Dad’s Cooking Skills",
    "chinesefood #food #homemadefood Subscribe to my channel and press the bell button to get notifications every time I post a ..."
  ],
  [
    "How One of Australia’s Best Restaurants Relies Entirely on Live-Fire Cooking — Smoke Point",
    "At Firedoor, one of Sydney, Australia's busiest restaurants, chef and owner Lennox Hastie uses wood-fired grills and ovens on a ..."
  ],
  [
    "Let&#39;s pull out our cooking utensils #shorts #jimmyfallon #charlieputh",
    ""
  ],
  [
    "Cooking an Easy Christmas Turkey with Jamie Oliver! | Jamie&#39;s Quick and Easy Christmas",
    "Subscribe to Channel 4 for more: https://bit.ly/2v2I6SY Watch the series on All 4: https://bit.ly/2Er6AfM Jamie Oliver shows how to ..."
  ],
  [
    "Cooking a FROZEN Steak",
    "Cooking a FROZEN Steak ————— SUBSCRIBE and RING THE BELL to get notified when I post a video! PLATFORMS ..."
  ],
  [
    "😲REAL Fruit Cake + Mango Latte, So Perfect!😻 | Chef Cat Cooking  #tiktok #Shorts",
    "Real Fruit Cake + Mango Latte, So Perfect!   | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since 2019."
  ],
  [
    "COOKING BUT ONLY SPEAKING IN ITALIAN",
    ""
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #24| MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "ROHU FISH curry with mustard cooking by rural mother||grandma Village cooking||rural cooking life",
    "ROHU FISH curry with mustard cooking by rural mother||grandma Village cooking||rural cooking life my 2nd channel plz Support ..."
  ],
  [
    "😼Maybe You&#39;ve Never Eaten Such Healthy &quot;Wagyu&quot;!🍴 | Chef Cat Cooking Food#tiktok #Shorts",
    "Maybe You've Never Eaten Such Healthy \"Wagyu\"!   The Cooking Cat who shares homemade recipes Since 2019. The first and ..."
  ],
  [
    "Popatlal की चल रही है Cooking Training! | Taarak Mehta Ka Ooltah Chashmah",
    "Babita invites Jethalal and his family for dinner at her house and he accepts, but on the same day Popatlal invites Dada Ji and ..."
  ],
  [
    "village traditional vapa elish recipe..😋 #shorts #viral #cooking #elish",
    "Ilish Bhapa in Boiled Rice,ilish bhapa,bhapa ilish,ilish vapa,boiled rice ilish bhapa,steamed ilish,grandmother recipe,ilish macher ..."
  ],
  [
    "Traditional Kutabs With Edible Forest Greens | Outdoor Cooking",
    "Dear friends, today we would like to share with you the Traditional Kutabs With Edible Forest Greens | Outdoor Cooking video, we ..."
  ],
  [
    "People Order Food, I Deliver Oblivion - Cooking Simulator",
    "Thanks again to Amazon Prime Video for sponsoring! Click here now to start collecting your SWEET GEAR: ..."
  ],
  [
    "Wilderness Cooking | Deep Fry Pig Knuckles Crispy | Eating Pig Knuckles With Chili Sauce.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "Mr &amp; Mrs Latest Promo - Cooking Theme | Reality Show | 13th December 2022 | Sreemukhi, Sneha | ETV",
    "mrandmrs #misterandmisses #telugushow #etvtelugu #etvwin #realityshow #sreemukhi #sneha #sivabalaji To watch your ETV all ..."
  ],
  [
    "Miniature Mutton Chukka | मटन रेसिपी | Miniature Cooking | The Tiny Foods - Hindi",
    "Miniature Mutton Chukka | मटन रेसिपी | Miniature Cooking | The Tiny Foods - Hindi #TheTinyFoods-Hindi ..."
  ],
  [
    "HOW TO COOK MEATBALLS #SHORTS",
    "Improve your cooking skills! In this video, we showed new uses for kitchen tools that can surprise you! Cook delicious meals using ..."
  ],
  [
    "Big river fish cooking recipe in my village",
    "Hi every one welcome to visit my channel is talk about cooking life style and cooking big river fish in my village. Please subscribe ..."
  ],
  [
    "Kay&#39;s Cooking Hates Me",
    "Today I learned that Kay doesn't like me very much. So to deal with my grief we watch her cook a pizza. New to the channel?"
  ],
  [
    "TWICE REALITY &quot;TIME TO TWICE&quot; TDOONG Cooking Battle EP.04",
    "TWICE REALITY \"TIME TO TWICE\" TDOONG Cooking Battle EP.04 TWICE 11TH MINI ALBUM \"BETWEEN 1&2\" ❣Listen ..."
  ],
  [
    "1-99/120 Cooking Guide 2019/2020 | Fast &amp; Cheap Methods [Runescape 3]",
    "RS3 Updated 1-99/120 Cooking Guide for 2019. Showing you fast & cheap methods. Also might work for Ironmen. Helpful Links ..."
  ],
  [
    "Queenfish Taste Delicious - 60 KG Queenfish Cooking in Village - 3 Couples Cooking Sea Fish Curry",
    "60 KG Ocean Queenfish cutting & cooking by 3 couples of village to share food with 400+ villagers. First 3 couples cutting giant ..."
  ],
  [
    "How a Woman Lives in a remote village in Ukraine! Cooking pumpkin porridge",
    "Yulia lives in the remote Ukrainian village of Kopanki. Today she will cook traditional pumpkin porridge from pumpkin from her ..."
  ],
  [
    "How To Design Egg Tarts Into Michelin Desserts?😉 | Chef Cat Cooking  #tiktok #Shorts",
    "How To Design Egg Tarts Into Michelin Desserts?   | Chef Cat Cooking The Cooking Cat who shares homemade recipes Since ..."
  ],
  [
    "Lego Oreo Factory - Stop Motion Cooking",
    "No butter or eggs are used in the actual Oreos.＊ Hello I'm tomosteen. If there were a world ruled by LEGO, the factory in the video ..."
  ],
  [
    "31 RECIPES WILL SAVE YOU FROM COOKING ROUTINE",
    "YUMMY RECIPES TO MAKE YOUR DAY PERFECT Tasty recipes with eggs and hot dogs  , with cocoa and potatoes, you'll find ..."
  ],
  [
    "Make Your Life 10X EASIER Cooking",
    ""
  ],
  [
    "Medlar Harvesting and Canning for Winter | Outdoor Cooking",
    "Dear friends, today we would like to share with you the Medlar Harvesting and Canning for Winter | Outdoor Cooking video, we ..."
  ],
  [
    "Wilderness Cooking Skill | Fried Braised Pork Leg Recipe | Braised Pork Leg Peanuts Eating So Yummy.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "[5Min] Bina Cooking k Super Tasty Chocolate Mithai banao💃🏻😋 Oreo Mithai Recipe #shorts #dessert #yt",
    "In this video we will know how to make unique and instant chocolate mithai recipe in just 5mins at home. It's a Diwali special easy ..."
  ],
  [
    "RAINBOW CHEESE SANDWICH RECIPE || Mouth-watering Cooking Hacks by 5-Minute Recipes",
    "UNEXPECTED AND DELICIOUS RECIPES THAT YOU DID NOT KNOW After watching this video, you'll present food like a pro!"
  ],
  [
    "Best of LEGO COOKING Compilation / Lego Food In Real Life Stop Motion Cooking ASMR",
    "Best of LEGO COOKING Compilation / Lego Food In Real Life Stop Motion Cooking ASMR Warning: This is not real, not for kids ..."
  ],
  [
    "Nutella &amp; Strawberry for Breakfast : DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR",
    "Nutella & Strawberry for Breakfast : DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR Link : https://youtu.be/J33lFSQbzvw ..."
  ],
  [
    "How to Cook Nongshim Shin Ramyun",
    "http://www.nongshimusa.com http://www.worldofshin.com How to Cook Perfect Nongshim Ramen! Cooking Nongshim Ramen is ..."
  ],
  [
    "Wilderness Cooking Skill | Fried Braised Pork Leg Recipe | Braised Pork Leg Peanuts Eating So Yummy.",
    "Hello all my beloved visitors, I am ARS Cooking would love to show you my technique of cooking in my Country, Cambodia."
  ],
  [
    "Survival cooking in forest- Octopus arm curry spice for lunch - Seafood yummy",
    "Hi, this video I want to show you about: Octopus arm curry spice for lunch Hope you enjoy with my videos and Subscribe my ..."
  ],
  [
    "Claire Saffitz Brings Fruitcake BACK | Try This At Home | NYT Cooking",
    "Claire Saffitz is here to walk us through her new recipe for fruitcake, just in time for the holidays. While traditional fruitcake takes ..."
  ],
  [
    "POTATO OMELETTE | BIG Spanish Omelette Recipe Cooking in Indian Village | Egg Recipes | Egg Omelette",
    "Today in our village, we cook Big Omelette in a single pot. We cook Traditional Spanish Omelette recipe by using potatoes and ..."
  ],
  [
    "TWICE REALITY &quot;TIME TO TWICE&quot; TDOONG Cooking Battle EP.04",
    "TWICE REALITY \"TIME TO TWICE\" TDOONG Cooking Battle EP.04 TWICE 11TH MINI ALBUM \"BETWEEN 1&2\" ❣Listen ..."
  ],
  [
    "How To Make  Perfect Homemade Black Tea by Cooking Simplified",
    "Black Tea is an healthy refreshing drink, it can be make very easily in couple of minutes. Water and Tae powder are the only ..."
  ],
  [
    "Miniature Real Cooking l mini Masala Dosa l 😍😍l Mini Cooking l #shorts #youtubeshorts #dosa",
    ""
  ],
  [
    "The Makanai: Cooking for the Maiko House | Official Trailer | Netflix",
    "Set in the geisha district of Kyoto, this series follows Sumire, a maiko (apprentice geisha) and Kiyo, a cook at the maiko house ..."
  ],
  [
    "SpongeBob&#39;s Biggest Cooking Disasters &amp; Worst Meals 🥴🍔 | SpongeBob",
    "SpongeBob is famous for his Krabby Patty making skills, but that doesn't always translate to other dishes. From trying Gary's ..."
  ],
  [
    "Cameron Diaz &amp; Drew Barrymore Remember Cooking with Gwyneth Paltrow | The Drew Barrymore Show",
    "Cameron Diaz joins Drew Barrymore in the kitchen to whip up one of her favorite dishes while \"dishing\" on some fun moments the ..."
  ],
  [
    "Stop Motion ASMR - Primitive Cooking catching Eel Fish-Hole Mukbang IRL Recipe 4K | Cuckoo",
    "Hi guys, This is my next video, content with lego in real life Stop Motion ASMR eel fish-hole primitive technology cooking catching ..."
  ],
  [
    "Marriage Food Style Chicken Roast &amp; Polao Rice Cooking By Grandpa for Old Age &amp; Special people",
    "Traditional Bengali Marriage Style country chicken roast & polao rice cooking by 70+ years old 3 brothers grandpa for old age, ..."
  ],
  [
    "ASMR MUKBANG | FRIED CHICKEN, STEAK, BLACK BEAN NOODLES | KOREAN FOOD | COOKING + EATING",
    "Join me on Fanhouse for exclusive content, extra mukbang videos, early access to YouTube videos, custom requests and more!"
  ],
  [
    "Nutella &amp; Strawberry for Breakfast : DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR",
    "Nutella & Strawberry for Breakfast : DIY Satisfying Magnet Balls - Stop Motion Cooking ASMR Link : https://youtu.be/J33lFSQbzvw ..."
  ],
  [
    "YUMMY FOOD AND SPECIAL COOKING TECHNIQUES || Food Challenge and Kitchen DIY Tricks by 123 GO! Like",
    "Get ready because we've picked some really awesome food tricks and hacks you probably didn't even know you needed."
  ],
  [
    "Cooking Mama Let&#39;s Cook Puzzle",
    "The app Cooking Mama Let's Cook Puzzle is released on Feb 18st! It's cooking, puzzle, action, game rolled into one! Connect ..."
  ],
  [
    "1-99/120 Cooking Guide 2019/2020 | Fast &amp; Cheap Methods [Runescape 3]",
    "RS3 Updated 1-99/120 Cooking Guide for 2019. Showing you fast & cheap methods. Also might work for Ironmen. Helpful Links ..."
  ],
  [
    "RAINBOW CHEESE SANDWICH RECIPE || Mouth-watering Cooking Hacks by 5-Minute Recipes",
    "UNEXPECTED AND DELICIOUS RECIPES THAT YOU DID NOT KNOW After watching this video, you'll present food like a pro!"
  ],
  [
    "Queenfish Taste Delicious - 60 KG Queenfish Cooking in Village - 3 Couples Cooking Sea Fish Curry",
    "60 KG Ocean Queenfish cutting & cooking by 3 couples of village to share food with 400+ villagers. First 3 couples cutting giant ..."
  ],
  [
    "COOKING ADOBO CHICKEN 🐔 🍗 🐓",
    "COOKING ADOBO CHICKEN IG / Socials: @azelbeatbox \"Adobo\" — Filipino-Style Chicken (Azel Riddim Recipe) #Adobo ..."
  ],
  [
    "TWICE REALITY &quot;TIME TO TWICE&quot; TDOONG Cooking Battle EP.01",
    "TWICE REALITY \"TIME TO TWICE\" TDOONG Cooking Battle EP.01 TWICE 11TH MINI ALBUM \"BETWEEN 1&2\" ❣Listen ..."
  ],
  [
    "Yummy Miniature Fried Shrimp CheeseBalls Recipe | Best Of Miniature Cooking",
    "Story of the day: Hi guys. Today I make yummy dish for all of you. It's Fried Shrimp CheeseBalls. Very delicious !!! Wake up and ..."
  ],
  [
    "Chunkz ROASTS Cuppy In Nigerian Cook Off 🇳🇬 | Secret Sauce | Channel 4.0",
    "ChunkzEast is joined in the Secret Sauce kitchen by Oxford-educated DJ, musician and philanthropist DJ Cuppy to cook up her ..."
  ],
  [
    "Flaky Coconut Twists | Melissa Clark | NYT Cooking",
    "Melissa Clark's Crunchy Coconut Twists are today's Cookie Week cookies, and they're crunchy, caramelized and look dramatic on ..."
  ],
  [
    "😼Maybe You&#39;ve Never Eaten Such Healthy &quot;Wagyu&quot;!🍴 | Chef Cat Cooking Food#tiktok #Shorts",
    "Maybe You've Never Eaten Such Healthy \"Wagyu\"!   The Cooking Cat who shares homemade recipes Since 2019. The first and ..."
  ],
  [
    "Butternut Squash Mac &amp; Cheese!?!",
    ""
  ],
  [
    "Market Show: Buy river prawn and cook yummy local recipe | River prawn cooking | Cooking with sros",
    "Hello all dears. Today I'm back from market with fresh river prawn. I cook yummy local recipe called sweet and salty river prawn ..."
  ],
  [
    "cabbage kofta curry cooking&amp;eating in tribal method by santali tribe women||rural India orissa",
    "cabbage kofta curry cooking&eating in tribal method by santali tribe women||rural India orissa to day we share a very very tasty ..."
  ],
  [
    "The Guide to Cooking A Perfect Standing Rib Roast",
    "I get it, prime rib roasts are expense. Cooking them is surprisingly easy, it just requires the right method, and some temperature ..."
  ],
  [
    "Best of LEGO COOKING Compilation / Lego Food In Real Life Stop Motion Cooking ASMR",
    "Best of LEGO COOKING Compilation / Lego Food In Real Life Stop Motion Cooking ASMR Warning: This is not real, not for kids ..."
  ],
  [
    "Stop Motion ASMR Relaxing - Catching Catfish, Frogs, Seafood Catch Hand Eels Cooking Cuckoo",
    "In this video, I feed Catfish, Frogs on Swimming Pool eggs, lego ,goldfish ...Let's see how the daily work of a Stop Motion ASMR ..."
  ],
  [
    "Cooking and Food Background Music For Videos | Food Show",
    "Cooking and Food Background Music For Videos | Food Show ✓ DOWNLOAD HERE: https://1.envato.market/bn9Qv ✓ Need ..."
  ],
  [
    "Lego Fried Pork Cutlet Rice Bowl / Stop Motion Cooking &amp; ASMR",
    "Hello I'm tomosteen. The Lego food I am making in this video is Katsudon, a delicious Japanese dish of pork cutlet gently ..."
  ],
  [
    "THE ULTIMATE PARTY APPETIZERS (V2) | SAM THE COOKING GUY",
    "Once again we're bringing you the ultimate party appetizers... so good we had to make three of them. @beefitswhatsforDinner ..."
  ],
  [
    "cooking recipe",
    "Hii everyone Kase h aap main cooking recipe se aapko is channal per cooking se realated video dal rahi ho aap log itna to jante ..."
  ],
  [
    "33 FAST RECIPES TO COOK YOUR FAVORITE FOOD",
    "YUMMY RECIPES TO COOK LIKE A PRO How to cook delicious caramel popcorn? How to cook egg taco or fast pancakes for the ..."
  ],
  [
    "Cooking Stuff",
    ""
  ],
  [
    "36 Yummy Recipes Every Mom Can Cook In 5 Minutes",
    "TIMESTAMPS: 00:25 Homemade ice cream recipe 02:15 Tricky ideas for moms 03:37 How to make colorful pancakes 05:12 How ..."
  ],
  [
    "35 USEFUL KITCHEN HACKS TO MAKE YOUR LIFE EASIER || 5-Minute Delicious Recipes And Cooking Tricks!",
    "LIFE-CHANGING COOKING TRICKS Try these useful kitchen hacks and tricks to feel like a super chef! We prepared helpful ..."
  ],
  [
    "Primitive Wildlife - Cacth Duck &amp; Cooking in wild - Eating delicious ( Ep00118 )",
    "Hi to day i wantto show you about videos: Primitive Wildlife - Cacth Duck & Cooking in wild - Eating delicious ( Ep00118 ) if you ..."
  ],
  [
    "Tube Well, Wheelchair &amp; Chicken Tehari Cooking for Old Age &amp; Physically Challenged People of Village",
    "Today's video is special video for grandpa and for this program whole cost given by someone from Dhaka, Bangladesh and he ..."
  ],
  [
    "Cooking",
    "Cooking."
  ],
  [
    "Cooking Very Delicious Azerbaijani Style Vegetable Beef Soup, A Beautiful Autumn Day in Our Village!",
    "Cooking Very Delicious Azerbaijani Style Vegetable Beef Soup, A Beautiful Autumn Day in Our Village! Very Delicious Vegetable ..."
  ],
  [
    "Chewy Gingerbread Latte Cookies | Vaughn Vreeland | NYT Cooking",
    "Cookie Week is off to a tasty start, folks! Vaughn is in the kitchen studio making his Gingerbread Latte Cookies. Chewy, spicy ..."
  ],
  [
    "Easy To Cook Recipes",
    "00:00 Intro 00:10 2-Ingredient Chocolate Souffle 00:56 2-Ingredient Chocolate Cake 01:52 2-Ingredient Strawberry Sorbet 02:26 ..."
  ],
  [
    "Baby Panda&#39;s Cooking Game | Make Coffee And Cook Delicious Food | Babybus Gameplay Video",
    "Baby Panda's Cooking Game | Make Coffee And Cook Delicious Food | Babybus Gameplay Video ----------- Download Link ..."
  ],
  [
    "New Ways to Use Food Leftovers || Delicious Meals You Can Cook From Food Scraps!",
    "TIMESTAMPS: 00:12 Homemade ice cream 01:08 Tasty cheese treats 02:17 How to reuse orange peels 03:21 Unusual plant pots ..."
  ],
  [
    "The Ultimate White Chocolate Macadamia Cookies | Sohla El-Waylly | NYT Cooking",
    "Cookie Week continues! Today, Sohla El-Waylly is making her really special White Chocolate Macadamia Nut Cookie recipe."
  ],
  [
    "Gochujang Caramel Cookies | Eric Kim | NYT Cooking",
    "Eric Kim's Cookie Week entry is his Gochujang Caramel Cookie, where brown-sugary caramel meets savory-sweet gochujang."
  ],
  [
    "Lemon Bars, An Old Fashioned Recipe from Scratch",
    "This recipe is in our Volume Three Cookbook. It is an old fashioned lemon bar that is made from scratch. It is super easy to make, ..."
  ],
  [
    "Can @AbroadinJapan  Cook Better Than @JunkFoodJapan  |  Champ’s Cooking Contest",
    "Use Code \"CHAMP\" to get $5 off for your first #Sakuraco box: https://team.sakura.co/champSC2212 and get a chance to win FREE ..."
  ],
  [
    "Huevos sorpresa: aprende vehículos y colores y mucho más con Cleo y Cuquin | Familia Telerin",
    "Disfruta de los huevos sorpresa junto a Cuquin y aprende los colores, los vehiculos, pero también las formas y muchas cosas ..."
  ],
  [
    "How to Slice And Peel Your Favorite Food In a Flash",
    "TIMESTAMPS: 00:01 Easy way to cut eggs 01:55 Quick way to cut a watermelon 04:23 How to cut tomatoes 06:16 How to peel a ..."
  ],
  [
    "UNUSUAL KICTHEN HACKS FOR TRUE FOOD LOVERS || Cooking Tips by 5-Minute Recipes!",
    "INCREDIBLE RECIPES AND SMART HACKS FOR EVERYDAY Today you will know how to cook delicious pastries with meat and ..."
  ],
  [
    "How to cook wild strawberry jam in the wild nature.",
    "You can watch my whole adventure here: https://www.youtube.com/watch?v=TFwWX1FBMG8&t=342s&ab_channel=CAMPAddict ..."
  ],
  [
    "Rava Fried Vegan Fish | Vegan Fish Fry | Raw Banana Rava Fry | Cookd",
    "cookd #veganfishfry #rawbananaravafry #veganrecipes Livin the veg life with this heavenly Rava Fried Vegan Fish! Do try it out ..."
  ],
  [
    "Goan Prawn Curry | Prawn Curry | Goan Curry | Goan Cuisine | Cookd",
    "prawncurry #prawn #cookd Let's go wild with this shrimply best Goan Prawn Curry ❤️ Do try it out and let us know how it turns ..."
  ],
  [
    "Let&#39;s combine today&#39;s fat reducing lunch with our daily, self disciplined fat reducing meal to eat t",
    "chinesefood #streetfood #food #shorts #how to eat."
  ],
  [
    "Mushu Pork | Kenji’s Cooking Show",
    "Donate to No Kid Hungry here: https://p2p.onecause.com/livestreamfornokidhungry/kenji-alt-lopez Get my books (including The ..."
  ],
  [
    "Andhra Stuffed Brinjal Curry | Gutti Vankaya Kura | Brinjal Curry | Andhra Recipes | Cookd",
    "The Cookd app is now available for download at https://app.cookdtv.com. With our unique Step-by-step Cooking mode, No more ..."
  ],
  [
    "GENUIS KITCHEN HACKS FOR BEGINNERS AND CHEFS || Tasty Tricks by 5-Minute Recipes!",
    "SIMPLE RECIPES AND COOL KITCHEN HACKS FOR EVERY DAY Delicious breakfast is easier with our recipes. We'll show you ..."
  ],
  [
    "Instant Bhatura | Bhatura Recipes | Street Food | Indian Breads | Punjabi Recipes | Cookd",
    "Instant Bhatura is a popular Punjabi #StreetFoodRecipe. This #Bhatura is made using maida, curd, baking soda, and baking ..."
  ],
  [
    "It&#39;s Time To Pickle It | Pickles | Tomato Pickle | Chicken Pickle | Mango Pickle | Cookd",
    "To watch our recipe videos in Tamil, visit here: https://bit.ly/cookd-tamil No lunch is complete without pickles! Cookd brings you a ..."
  ],
  [
    "Simple Recipes And Kitchen Hacks Every Mom Will Love || Tasty Snack Ideas For Your Kids",
    "TIMESTAMPS: 00:13 Easy way to eat noodles 01:49 How to get kids to eat healthy food 03:10 How to make edible colors 04:00 ..."
  ],
  [
    "how to cook PANGAS FISH CURRY with green tomato || indian village tribe mans cooking &amp; eating show",
    "how to cook PANGAS FISH CURRY with green tomato || indian village tribe mans cooking & eating show village cooking channel ..."
  ],
  [
    "Chapli Kebab Recipe | Peshawari Chapli Kebab | Kebab Recipes | Mutton Kebab | Indian Cuisine | Cookd",
    "For more tasty food videos subscribe to our channel @ https://bit.ly/SubscribeToCookd Chapli Kebab is an easy to make and ..."
  ],
  [
    "What I Eat in a Day || easy home-cooked recipes, Tteokbokki, cooking for two // ep. 8",
    "HAPPY FEAST-MAS, EVERYONE! I am Tiffy Welcome back to my vlogs; I know it has been a while! Thank you for your ..."
  ],
  [
    "GENIUS HACKS TO CUT AND PEEL LIKE A PRO || 5-Minute Kitchen Tricks To Make Your Life Easier!",
    "BRILLIANT HACKS TO IMPROVE YOUR KNIFE SKILLS We prepared easy and clever hacks to сut and peel in a flash and useful ..."
  ],
  [
    "USEFUL KITCHEN TRICKS TO MAKE YOUR LIFE EASIER || 5-Minute Recipes For Everyone!",
    "GENIUS KITCHEN HACKS TO SAVE YOUR TIME In this video, we showed unusual ways to reuse fruit and veggie scraps and ..."
  ],
  [
    "Veg Momos Recipe | Dim-Sum | Momos Recipe | How to make Veg Momos | Dumplings | Cookd",
    "For more tasty food videos subscribe to our channel @ https://bit.ly/SubscribeToCookd Veg Momos is a popular #SnackRecipe."
  ],
  [
    "2 Minute Easy Fried Rice - Egg Fried Rice | 炒饭食谱",
    "How To Cook Easy Fried Rice Facebook : www.facebook.com/cookingfoodsir Tiktok : www.tiktok.com/cookingfoodsirs Recipe ..."
  ],
  [
    "Knool kol porial 👍நூல்கோல் #shorts #trendingshorts",
    "shorts @MadrasSamayal @VillageCookingChannel @CookingShookingHindi @cookingwithlynja @cookinhogirl9613 ..."
  ],
  [
    "Christmas Stew Cooked in a Pressure Cooker.  Campfire Cooking.  Kazan Afghan Pressure Cooker.",
    "In this video, I head out to the woods on a cold and crisp morning to cook a big hearty Christmas stew over the campfire in my ..."
  ],
  [
    "26 LIFE SAVING HACKS TO SURVIVE IN YOUR KITCHEN",
    "BRILLIANT SURVIVAL TIPS YOU SHOULD DEFINITELY KNOW❗ Do you know that you can treat a shiner with a boiled egg?"
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #37 | MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Catching Many Fish 화려한 잉어, 무지개 장어 - Stop Motion Cooking ASMR Funny Animation",
    "Catching Many Fish 화려한 잉어, 무지개 장어 - Stop Motion Cooking ASMR Funny Animation 경고 : 이것은 실제가 아니므로 집 ..."
  ],
  [
    "Mutton Kuzhambu Recipe | Clay Pot Mutton Curry | Recipe [CC] in 8 Languages",
    "For more tasty food videos subscribe to our channel @ https://bit.ly/SubscribeToCookd Mutton Kuzhambu is a popular South ..."
  ],
  [
    "Masala veg pulao |quick and easy veg pulao |veg pulao |मसाला वेज पुलाव |झटपट बनाये वेज पुलाव",
    "Thanks for watching and keep supporting me       Music:www.bensound.com Ingredients Oil 1cup Sliced onion Clove 2-3 ..."
  ],
  [
    "Remove the pulp from the zucchini! I cooking them like this for years! Easy and tasty recipe.",
    "INGREDIENTS: • 1 sliced zucchini • 2 diced sausages • 2 minced garlic cloves • Green smell to taste • ½ teaspoon of salt • ½ ..."
  ],
  [
    "30 AWESOME WATERMELON HACKS THAT WILL FRESHEN UP YOUR DAY",
    "WATERMELON TRICKS THAT WILL BLOW YOUR MIND You'll find incredible watermelon ideas in this video! Watch to know how ..."
  ],
  [
    "CookingCuisine",
    ""
  ],
  [
    "Kevin O&#39;Leary, FTX, Binance Is A Distraction From What Is Cooking - Mark Yusko",
    "Kevin O'Leary, FTX, Binance Is All A Distraction From What Is Cooking - Mark Yusko Retire With A Crypto IRA/401k ..."
  ],
  [
    "MY FIRST EVER TAMALES (3 WAYS) AT HOME AND OMG WHAT TOOK ME SO LONG... | SAM THE COOKING GUY",
    "It's that time of year for Tamales! And if you can make these baby's at home then you're in for a real treat SHOP OUR ..."
  ],
  [
    "Cooking Nashville Hot Chicken On The Street.. in Nashville",
    "Vlog_062 DAY 16 OF THE CROSS COUNTRY ROAD TRIP FROM VEGAS TO MARYLAND. Comment below any places you think ..."
  ],
  [
    "Have you ever grown round eggplant around home? / Yummy round eggplant cooking",
    "Hello friends. Welcome back to visit my channel. Round eggplant in my vegetable garden is big enough for cooking. Have you ..."
  ],
  [
    "Come to my friendly villager, ask them some long bean for my recipe | Long bean farm is so peaceful",
    "Hi. Long bean farm today is so beautiful and peaceful. It's belong to my villager. I come here to ask them for some long bean for ..."
  ],
  [
    "How santali POOR FAMILY GIRL cooking &amp; eating SHOL FISH recipe with TOMATOES &amp; CAPCICUM",
    "How santali POOR FAMILY GIRL cooking & eating SHOL FISH recipe with TOMATOES & CAPCICUM This girl is cooking a shole ..."
  ],
  [
    "SEA FISH masala curry with brinjal&amp; BOK FLOWER pakora cooking and eating by santali tribe family",
    "SEA FISH masala curry with brinjal& BOK FLOWER pakora cooking and eating by santali tribe family to day we share a totaly uniq ..."
  ],
  [
    "Me vs Grandma Cooking Challenge | Food Battle by HAHANOM Challenge",
    "Burger, nuggets, cookies!.. What is your favorite dish? Write in the comments, and our heroes will surely try to cook it next time!"
  ],
  [
    "Cooking sour chicken in the village of Iran | village lifestyle of Iran",
    "Village Tale Cooking sour chicken in the village of Iran ---‐------------------------------------ Hello there to the Village Tale channel, ..."
  ],
  [
    "ASMR | 1-week Delicious Bayashi Food #35 | MUKBANG | COOKING",
    "NEW VIDEO, ALMOST EVERYDAY!! SUBSCRIBE ME!!"
  ],
  [
    "Sweet Potato Casserole | Cooking With Brenda Gantt 2022",
    "Website:: https://cookingwithbrendagantt.net/ Brendaganttrecipes.com Cooking with Brenda Gantt, Andalusia, Alabama."
  ],
  [
    "village noodles cooking and enjoying || Bhumi village vlog ||",
    "Bhumi Kitchen & cooking || Nepali village Kitchen || A village family vlog from rural Nepal || a family video ..."
  ],
  [
    "LIVING ALONE AT 18🤍 solo cooking nights, at home pilates, &amp; studying",
    "LIVING ALONE AT 18   solo cooking nights, at home pilates, & studying here's a little living alone in college vlog!! said bye to the ..."
  ],
  [
    "Lunchbox Cooking Vlog | Mini Vlog 25 | Dec 25th | Chicken Pulao #shorts #lunchboxideas @AnisCastle",
    "Lunchbox Cooking Vlog | Mini Vlog 25 | Dec 25th | Chicken Pulao #shorts #lunchboxideas @AnisCastle."
  ],
  [
    "32 ODDLY SATISFYING TRICKS YOU CAN TRY AT HOME",
    "MAGICAL ANTI-STRESS VIDEO We've prepared oddly satisfying things that can help to relieve your stress. Watch and relax!"
  ],
  [
    "UNUSUAL WAYS TO USE KITCHENWARE || Amazing DIYs From Old Kitchen Stuff by 5-Minute Recipes!",
    "AMAZING CRAFTS FOR YOUR KITCHEN Don't rush to throw away your old kitchen stuff - reuse it! We prepared amazing ways to ..."
  ],
  [
    "32 CAMPING HACKS THAT ARE TRULY GENIUS",
    "SIMPLE YET AMAZING LIFE HACKS FOR TRAVELERS How to make a fire or a toilet in the wild? You'll know how to survive in ..."
  ],
  [
    "EASY CLEANING HACKS TO SPEED UP YOUR ROUTINE || 5-Minute Recipes Cleaning Tips",
    "HELPFUL CLEANING HACKS YOU HAVE TO TRY You can clean everything using our simple tips! In this video we showed how ..."
  ],
  [
    "New Cleaning Hacks That Will Speed Up Your Routine || Restroom Survival Guide by 5-Minute Recipes!",
    "TIMESTAMPS: 00:29 Useful restroom hacks 01:19 Toilet cleaning tips 02:15 Hacks for embarrassing moments 03:55 How to ..."
  ]
]