[
  [
    "The Ultimate JERUSALEM FOOD TOUR + Attractions - Palestinian Food and Israeli Food in Old Jerusalem!",
    "Join us on the ultimate Jerusalem food tour! Follow David on Instagram: https://www.instagram.com/the.hungry.tourist/ Also, ..."
  ],
  [
    "Tel Aviv Food Tour - BEST Sabich, Hummus, and Lamb Pita - Middle Eastern Israeli Food!",
    "Follow David on Instagram: https://www.instagram.com/the.hungry.tourist/ and Facebook: ..."
  ],
  [
    "Israeli Food Is The Best",
    "The food in Israel is reason enough to visit the country. I've gained at least 3kg during my week sampling the best of what the ..."
  ],
  [
    "Top 10 the Best Israeli Food and Dishes | Food in Israel",
    "The tastiest Israeli dishes. What to eat in Israel? In the history of the Jewish people there have been many sad and even terrible ..."
  ],
  [
    "JERUSALEM STREET FOOD | Jewish Street Food at MAHANE YEHUDA MARKET - Street Food in Jerusalem 2019",
    "JERUSALEM STREET FOOD tour at Mahane Yehuda Market Jerusalem is a city full of some of the BEST STREET FOOD from all ..."
  ],
  [
    "FOOD IN ISRAEL 🇮🇱 &amp; PALESTINE 🇵🇸 | How Expensive &amp; How Cheap?",
    "israel #palestine #food In this video this Video I tried to sum up the different types of food in Israel and Palestine basically food in ..."
  ],
  [
    "What Are the Top 8 Jewish Foods?",
    "Judaism has a very close relationship with food. Most holidays have one or more specific foods associated to it. There are many ..."
  ],
  [
    "TEL AVIV STREET FOOD | Arabic Street Food + Hummus HEAVEN - Middle Eastern + Israeli Food in Israel",
    "HUMMUS HEAVEN in Tel Aviv + ARABIC STREET FOOD The price for the CARMEL MARKET STREET FOOD TOUR: $90 USD ..."
  ],
  [
    "Home Cooked ISRAELI JEWISH FOOD + Levy&#39;s SHAWARMA in Aventura, Florida!!",
    "TAL: https://linktr.ee/thetravelingclatt YAEL: https://www.instagram.com/whatscookingbyyael LEVY'S SHAWARMA: ..."
  ],
  [
    "Jewish Iraqi Food - AMAZING Eating Tour of Ramla Market!",
    "Follow David on Instagram: https://www.instagram.com/the.hungry.tourist/ and Facebook: ..."
  ],
  [
    "STREET FOOD in TEL AVIV!!! Ultimate 24-HOUR FOOD TOUR of MIDDLE EASTERN FOOD!",
    "The Ultimate 24 HOUR STREET FOOD TOUR of Tel Aviv full of Kebab's, hummus and much more! In this video we discover the ..."
  ],
  [
    "How expensive is Israel? | Local Market Tour | Tel Aviv Israel Vlog",
    "This is Ninth Vlog of my 10 days Israel Palestine trip. In this Video I explained what is the cost of living in Israel for Indians or how ..."
  ],
  [
    "Israeli breakfast - mcPitta with eggs",
    "The famous Israeli breakfast.. it's the mcPitta with eggs, ...:) with cheese and fresh vegetables. Like, Share & Comment ..."
  ],
  [
    "Jewish Food Safari | Jewish Cuisine",
    "In the final episode, Maeve O'Meara explores the delicious and complex world of Jewish food - full of age-old traditions and ..."
  ],
  [
    "😋 Delicious Burika  at the Carmel Market - Tel Aviv 🌞 | 🇮🇱 Israeli Street Food",
    "Delicious Burika at the Carmel Market - Tel Aviv | Israeli Street Food In this video, I take you on a tour of the Carmel Market ..."
  ],
  [
    "INSANE KEBABS Handmade With a Sword - Palestinian Food in Nazareth!",
    "Follow David on Instagram: https://www.instagram.com/the.hungry.tourist/ and Facebook: ..."
  ],
  [
    "BEST STREET FOOD IN JERUSALEM // ISRAEL-PALESTINE TRAVEL VLOG",
    "Street food in Jerusalem in delicious! We started the day off with empty stomachs and slowly filled them up as we tried as many ..."
  ],
  [
    "TEL AVIV ISRAEL (not what you would expect)",
    "This week we share our favourite spots from our time in Tel Aviv, Israel! For exclusive content, join our Patreon Community!"
  ],
  [
    "INCREDIBLE STREET FOOD in JERUSALEM (top 9 must eats)",
    "We created an app to help you save up to 80% on international flights! Try it risk free ➡️ https://faredrop.app/ytd_191127 ..."
  ],
  [
    "Eyal Shani Ha Salon - HOTTEST RESTAURANT in Tel Aviv, Israel!",
    "Follow David on Instagram: https://www.instagram.com/the.hungry.tourist/ and Facebook: ..."
  ],
  [
    "11 Things NOT to do in Israel - MUST SEE BEFORE YOU GO!",
    "Israel is one of the most fascinating countries in the world. The food, the culture, the history... it's an amazing place. That being ..."
  ],
  [
    "Jerusalem&#39;s BEST Street Food Guide - PALESTINIAN HUMMUS NINJA + HUGE Old Jerusalem Street Food Tour!",
    "BEST Jerusalem STREET FOOD Tour 2019 - Palestinian Food Become a member for exclusive bloopers & private livestream: ..."
  ],
  [
    "The BEST FOOD In ISRAEL Picked By Locals 🇮🇱",
    "I will ask the locals which is the BEST traditional FOOD in Israel! Today we arrive Israel with Odyssey Of The Seas. My plan is to ..."
  ],
  [
    "How to make Israeli salad",
    "Get the full recipe here: http://www.haaretz.com/jewish/food/1.698731 and find out why this chopped salad is a staple in the ..."
  ],
  [
    "ഇസ്രായേൽക്കാരുടെ ഭക്ഷണം ഉണ്ടാക്കി നോക്കിയാലോ|Cooking Israel Food|kebab tel Aviv|Dona Philip Inchikal",
    "ISRAEL FOOD PREPARATION kebab preparation Israel style കൂട്ടുകാരെ ഇന്ന് നമ്മുടെ പുതിയ ..."
  ],
  [
    "Americans Try Israeli Food For The First Time",
    "Israeli Good! Check out more awesome videos at BuzzFeedVideo! http://bit.ly/YTbuzzfeedvideo MUSIC Hora Melody Licensed via ..."
  ],
  [
    "Is There a Truly Israeli Food? | Israel Phenomenology | Unpacked",
    "There's no denying Israel punches above its weight in the culinary stakes. But whether there's anything truly homegrown Israel ..."
  ],
  [
    "Kids Try Snacks from Israel | Kids Try | HiHo Kids",
    "We're making a Kids Try Cookbook! Sign up for updates at: http://kidstry.co Sponsor this series: http://www.cut.com/sponsorship ..."
  ],
  [
    "In Search of Israeli Cuisine Official Trailer 1 (2017) - Documentary",
    "Directed by: Roger Sherman In Search of Israeli Cuisine Official Trailer 1 (2017) - Documentary A portrait of the Israeli people told ..."
  ],
  [
    "Americans Try Weird Israeli Snacks for the First Time",
    "Today, Americans try Israeli snacks for the very first time, and they are extremely impressed. The chocolate from Israel is ..."
  ],
  [
    "Auckland’s best lunch | Life changing Israeli street food",
    "Carmel- Israeli Street Food is our favourite spot in Tāmaki Makaurau Auckland to get a taste of Israeli food. They specialise in ..."
  ],
  [
    "Trying Israeli McDonald&#39;s... 🇮🇱 (not what we expected)",
    "Trying Israeli McDonald's... (not what I expected) - Ah, McDonald's. The go-to place for a quick meal. Today Philip and I try ..."
  ],
  [
    "AMAZING ISRAELI BREAKFAST!! | you MUST TRY!",
    "FOLLOW US ON INSTAGRAM! @alfonsoandjessicaofficial Hey guys! today we woke up and wanted to try something completely ..."
  ],
  [
    "My Israelite Cuisine - 10 Israeli Foods You Should Try! By Traditional Dishes",
    "My Israelite Cuisine - 10 Israeli Foods You Should Try! By Traditional Dishes Israeli food is made of some of the most original and ..."
  ],
  [
    "What&#39;s the best street food in Israel?",
    "We promise you'll go bananas over Israeli food! What is your favorite Israeli street food?"
  ],
  [
    "SITSOT - ISRAELI FOOD | MEATBALLS IN TOMATO SAUCE (eng sub)",
    "Sitsot is a very healthy dish. Sitsot or meatballs can be of beef meat, turkey or in my recipe today, I used chicken meat. It's your ..."
  ],
  [
    "Street Food in Israel",
    "Street food is enjoying a revival around the world ... and the Israeli street is packed with mouth-watering morsels. If you enjoy food, ..."
  ],
  [
    "Chinese try Israeli food",
    "On the occasion of 25 years of diplomatic relations between Israel and China, we were curious to know what Chinese people ..."
  ],
  [
    "How Expensive is ISRAEL 🇮🇱? SuperMarkets, Food &amp; Hotels",
    "israel #yatridoctor #indianinisrael In this Video I tried to cover about how expensive is Israel. Israel is one of the most expensive ..."
  ],
  [
    "Laafa बनाओ और Laafa खाओ Famous Israeli Food at Pushkar Streets | Laffa and Falafel",
    "Laafa बनाओ और Laafa खाओ Famous Israeli Food at Pushkar Streets Pushkar streets are famous for a large variety of street ..."
  ],
  [
    "Jewish Food: More Than Just Matzo Ball Soup | Unpacked",
    "Talking about Jewish food is both mouth-wateringly delicious and just a little complicated. While Ashkenazi Jews (Jews from ..."
  ],
  [
    "The Jewish Food Taste Test",
    "Good food. Good meat. Good G-d, let's eat! Music: Hora Melody Music Licensed via Warner Chappell Production Music Inc. Stock ..."
  ],
  [
    "Best Israeli food in Kasol, India - The Evergreen Cafe",
    "Kasol in Himachal Pradesh is an oft-visited place. Food is an integral element of any place that you visit. So when in Kasol, head ..."
  ],
  [
    "Traditional Israeli food in Auckland | Level 3 takeaways you must eat! #shorts",
    "We are officially obsessed with Carmel's food- it's freaking amazing that Tāmaki Makaurau Aucklanders have access to freshly ..."
  ],
  [
    "Americans &amp; Israelis Swap Snacks",
    "Subscribe to BuzzFeed's newest channel, Cocoa Butter!: https://www.youtube.com/CocoaButter/ Bamba over everything. Credits: ..."
  ],
  [
    "List Of Popular Israeli Foods - A Tasty Top 10",
    "List Of Popular Israeli Foods - A Tasty Top 10 If you are visiting Israel and want to try the best Israeli food, here is a list of the most ..."
  ],
  [
    "Israeli Food: BABA GANOUSH COOKED OUTSIDE | Canada Park, Israel",
    "Get paid to shoot food videos: http://bit.ly/2KCcChw Free $45 AirBnb credit for your next trip: http://bit.ly/AirBnb34Coupon Learn ..."
  ],
  [
    "Top 10 Street Foods To Eat In Israel - The Ultimate Israeli Food Tour | BEST Falafel &amp; Hummus Dishes",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL ✈️ Vegan Food Tour ..."
  ],
  [
    "Israeli Food Technologies",
    "What if you could get water out of thin air? What if you could grow food in the middle of the desert? What if you could have a ..."
  ],
  [
    "How to make Israeli shakshuka",
    "Get the full recipe here: http://www.haaretz.com/jewish/food/1.697174 Producer & Director: Aimee Amiga, Photographer: David ..."
  ],
  [
    "Israeli Food is Amazing! #shorts #arayes #israelifood",
    "Jeremy Jacobowitz is eating his favorite at 12 Chairs in Brooklyn, Arayes! #brooklyn #nyc #foodasmr Instagram: ..."
  ],
  [
    "ULTIMATE STREET FOOD TOUR OF JERUSALEM  - &quot;Eitan Explores Israel&quot; (E:1) | Eitan Bernath",
    "On this new series, \"Eitan Explores Israel\", watch me on my first trip to Israel! I had the most amazing trip full of lots of good food ..."
  ],
  [
    "MIMOLAIM|ISRAELI FOOD|HOMEMADE",
    "MIMOLAIM is an Israeli food that they really like to have on their table once a week. The ingredients and procedure is in the video."
  ],
  [
    "How to cook Shaksuka || Israeli Food",
    "Shakshuka is among popular food in Israel,, It is an Israeli dish made of poached egg in the sauce of tomatoes and spices."
  ],
  [
    "Israeli Street Food in New York | Condé Nast Traveler",
    "Named for Tel Aviv's iconic boulevard, Dizengoff in Chelsea Market serves up warm pita and hummus with delicious toppings all ..."
  ],
  [
    "Enjoying a Biblical Meal in Nazareth Village",
    "See also this video: Biblical Images Come to Life in Nazareth Village www.youtube.com/watch?v=0SNf2aUtROA ..."
  ],
  [
    "Travel Vlog: Eating My Way Across Israel Part 1 of 2",
    "I had an absolute blast filming this vlog in Israel! I learned so much about various cuisines and how to appreciate the different ..."
  ],
  [
    "Taste of Israel - Meatballs",
    "Meatballs, Israeli style ✔️. If you're looking for a flavorful #recipe that combines meat, fresh tomatoes and lots of spices, this ..."
  ],
  [
    "Auckland’s best lunch | Life changing Israeli street food",
    "Carmel- Israeli Street Food is our favourite spot in Tāmaki Makaurau Auckland to get a taste of Israeli food. They specialise in ..."
  ],
  [
    "Know Your Israeli Food | Birthright Israel",
    "In this episode of 'Know Your Israeli Food', our #BirthrightIsrael alumni take the blindfold test to see which beloved Israeli snacks ..."
  ],
  [
    "Israeli Food in New York | The Jewish Foodie – Episode 3 | Restaurants, Food, and Purim in Brooklyn",
    "How did Israeli food become a success story in New York? Watch this amazing Israeli food restaurant- that has Italian cooking ..."
  ],
  [
    "Home made Israeli Pita bread | Israel Tours | Israeli food",
    "Have you been to Israel and are missing and are missing the taste of the Israeli Pita, filled with Falafel or other favorite fillings?"
  ],
  [
    "Is There a Truly Israeli Food? | Israel Phenomenology | Unpacked",
    "There's no denying Israel punches above its weight in the culinary stakes. But whether there's anything truly homegrown Israel ..."
  ],
  [
    "The Jewish Food Taste Test",
    "Good food. Good meat. Good G-d, let's eat! Music: Hora Melody Music Licensed via Warner Chappell Production Music Inc. Stock ..."
  ],
  [
    "Israeli Jew Eats Palestinian 🇵🇸 Food For The First Time!",
    "Israeli Jew Eats Palestinian Food For The First Time! - Today, we try some local Palestinian food around East Jerusalem for the ..."
  ],
  [
    "Israeli food || Grilled Chicken || Green Peas  telugu",
    "Israeli food || Grilled Chicken || Green Peas telugu."
  ],
  [
    "British Guys Shocked by ISRAELI Snacks!!?",
    "Today we try some Jolly Snacks sent to us from Israel!! 오늘은 이스라엘에서 날아온 졸리한 간식을 먹어봅니다! Buy Josh's ..."
  ],
  [
    "List Of Popular Israeli Foods - A Tasty Top 10",
    "List Of Popular Israeli Foods - A Tasty Top 10 If you are visiting Israel and want to try the best Israeli food, here is a list of the most ..."
  ],
  [
    "Chinese try Israeli food",
    "On the occasion of 25 years of diplomatic relations between Israel and China, we were curious to know what Chinese people ..."
  ],
  [
    "The Forkers Go On An Israeli Adventure On The Goan Coast | E3 | S2 | The Big Forkers",
    "If you ever find yourself in the presence of a big bearded man who brings you food and drinks after a long day, then one of two ..."
  ],
  [
    "Journey Through Israel - Travel Documentary",
    "Israel means a lot of different things to many people, and is one of the most diverse and dynamic countries in the world."
  ],
  [
    "😋 Delicious Burika  at the Carmel Market - Tel Aviv 🌞 | 🇮🇱 Israeli Street Food",
    "Delicious Burika at the Carmel Market - Tel Aviv | Israeli Street Food In this video, I take you on a tour of the Carmel Market ..."
  ],
  [
    "In Search of Israeli Cuisine Official Trailer 1 (2017) - Documentary",
    "Directed by: Roger Sherman In Search of Israeli Cuisine Official Trailer 1 (2017) - Documentary A portrait of the Israeli people told ..."
  ],
  [
    "Episode 1. Israel 2022, shopping before Sukkot, food prices and my Israeli daily life",
    "Today I will tell you when and why I moved to Israel, take you around the supermarket in Bat Yam Mall and tell you what makes ..."
  ],
  [
    "This is how to eat hummus like an Israeli #shorts #recipe #jewish #israel",
    ""
  ],
  [
    "Americans &amp; Israelis Swap Snacks",
    "Subscribe to BuzzFeed's newest channel, Cocoa Butter!: https://www.youtube.com/CocoaButter/ Bamba over everything. Credits: ..."
  ],
  [
    "Exploring kasol market + Tasting Israeli food in Kasol | Celebrating &amp; Chilling in Tosh #ruvlogs",
    "Hey guys! New to my channel? Subscribe :- https://www.youtube.com/channel/UC8Cbt_KXnRL97b3AHqUtuLw ..."
  ],
  [
    "trying israeli food",
    ""
  ],
  [
    "Israeli Food: BABA GANOUSH COOKED OUTSIDE | Canada Park, Israel",
    "Get paid to shoot food videos: http://bit.ly/2KCcChw Free $45 AirBnb credit for your next trip: http://bit.ly/AirBnb34Coupon Learn ..."
  ],
  [
    "Korean Girls Try Israeli Snacks For The First Time",
    "Hello, Welcome to our channel! We upload new videos (at least) twice a week. Don't forget to subscribe to our channel and like ..."
  ],
  [
    "Mahane Yehuda Market Jerusalem Israel #shorts #israel",
    "machane yehuda market jerusalem israel - more content: https://bit.ly/3oX6TEn - ig: https://bit.ly/3ddDLFZ tags: machane,machane ..."
  ],
  [
    "The Best In JERUSALEM 🇮🇱  Most Tasty STREET FOOD",
    "WOW, I didn't NOT expect this in Jerusalem! Not only did we get the chance to learn a ton about the history but I felt like we didn't ..."
  ],
  [
    "Israelis: What is the Israeli national food?",
    "Please donate to the project so I can travel further and more often: http://www.gofundme.com/Ask-Project ..."
  ],
  [
    "‘Stealing our food?’: Israeli Facebook page promoting Mansaf as a ‘taste of Israel’ sparks outrage",
    "Mansaf 'a taste of Israel' Social media users heavily mocked an official Israeli Facebook page after it published a video on the ..."
  ],
  [
    "Laafa बनाओ और Laafa खाओ Famous Israeli Food at Pushkar Streets | Laffa and Falafel",
    "Laafa बनाओ और Laafa खाओ Famous Israeli Food at Pushkar Streets Pushkar streets are famous for a large variety of street ..."
  ],
  [
    "Cruising Israel - Food Tour",
    "For those who have yet to visit Israel - we'll let you in on a little secret.... the food here is beyond delicious. ILTV's Emanuelle ..."
  ],
  [
    "Israeli Food Tech Startup Launches ‘Hybrid Meat’ Revolution in Tel Aviv",
    ""
  ],
  [
    "ISRAELI Tries The BEST THALI In Rishikesh ? | INDIA 🇮🇳",
    "After looking on this people costumed in the front of this restaurants couple of times , i have decided to go and try the food."
  ],
  [
    "Israeli food vlog with my brother Sushil Saini || Best Cafe in Rishikesh little buddha || Survival",
    "Israeli food vlog with my brother Sushil Saini || Best Cafe in Rishikesh little buddha || Survival places to visit in rishikesh,laxman ..."
  ],
  [
    "Wah Kya Taste Hai |Season 2 | Episode 11 | Israeli Cuisine | Israeli Food | Charles Thomson",
    "Wah Kya Taste Hai |Season 2 | Episode 11 | Israeli Cuisine | Israeli Food | Charles Thomson."
  ],
  [
    "Shawarma- Haifa",
    "Don't forget to LIKE this video! For more Street Food subscribe to our channel and join us on our FB page: ..."
  ],
  [
    "Eating only ISRAELI FOODS for a DAY!",
    "Cass and Jay spent the day eating only Israeli foods! We started the day with shakshuka and some dairy products, for lunch we ..."
  ],
  [
    "Eggplants 🍆 Recipe(Israeli food)",
    ""
  ],
  [
    "ഇസ്രായേൽക്കാരുടെ ഭക്ഷണം JERUSALEM STREET FOOD IN MALAYALAM VLOG, INCREDIBLE STREET FOOD in JERUSALEM",
    "israel #Jerusalem #travel #smartinphilip Israel is a pretty complicated place, but we are pretty sure that there is one thing we can ..."
  ],
  [
    "PREPARING DISHES FOR SHABBAT DINNER || ISRAELI FOOD || Smilymyles",
    "Shabbat Family dinner."
  ],
  [
    "White People Try Jewish Food &#39;For the First Time&#39; | All Def Comedy",
    "What happens when we put black people in front of some tasty Jewish foods? Will they be able to stomach it? Find out now on ..."
  ],
  [
    "Israeli Food",
    ""
  ],
  [
    "Top 10 Street Foods To Eat In Israel - The Ultimate Israeli Food Tour | BEST Falafel &amp; Hummus Dishes",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL ✈️ Vegan Food Tour ..."
  ],
  [
    "HOW TO MAKE JACHNUN (ISRAELI FOOD)",
    "Hi welcome to my Chanel PLEASE FOLLOW ME MY SECOND YOUTUBE ACCOUNT; https://www.youtube.com/channel/UCEB2."
  ],
  [
    "Amazing Shakshuka recipe from a Cowboy! 🍳 Israeli Food in Texas | The Jewish Foodie - Episode 7",
    "What food did we eat in Texas? How is Shakshaka made by a cowboy?! Mexican food, Israeli food, eating in Texas, ..."
  ],
  [
    "AMAZING ISRAELI BREAKFAST!! | you MUST TRY!",
    "FOLLOW US ON INSTAGRAM! @alfonsoandjessicaofficial Hey guys! today we woke up and wanted to try something completely ..."
  ],
  [
    "I tried Israeli food and loved it. #israelifood #israeli #shawarma",
    "Street food style chicken shawarma in pita bread. So good!"
  ],
  [
    "BULGUR RECIPE | HOW TO COOK BULGUR? | ISRAELI FOOD | Smilymyles Vlog",
    "Bulgur #IsraeliFood #GoodForDiet."
  ],
  [
    "Cruising Israel - Food Tour",
    "For those who have yet to visit Israel - we'll let you in on a little secret.... the food here is beyond delicious. ILTV's Emanuelle ..."
  ],
  [
    "HANUKKAH FEAST! Jewish Food Mukbang - Potato Latkes, Matzo Ball Soup, Tzimmes &amp; Baked Salmon - Asmr",
    "Happy Hanukkah! Let's eat Jewish food! Eating some Potato Latkes, Matzo Ball Soup, Sweet Potato Tzimmes & Baked Salmon!"
  ],
  [
    "Israeli Food Taste Test | Israeli Finger Food &amp; Hermon White Wine | Food &amp; Drink",
    "In this episode of Food & Drink you will see Israeli food: a great finger food box from Danel in Munich and an amazing white wine ..."
  ],
  [
    "Falafel | Israelstreet food | easy recipe | Malayalam | It&#39;s Me Linuz | vlog | Israel",
    "Falafel | Israelstreet food | easy recipe | Malayalam | It's Me Linuz |vlog | Linu wilson | travel #falafal #streetfood #easyrecipe ..."
  ],
  [
    "🤔 KIDS TRY ISRAELI FOOD FOR THE FIRST TIME 🇮🇱INTERNATIONAL SNACKS, TREATS AND CANDY 🍫",
    "Thanks to our incredible and generous international subscribers, we get food from all over the world sent right to our home! So we ..."
  ],
  [
    "The Israeli embassy promotes Kosher and Israeli food",
    "http://www.israelnationalnews.com."
  ],
  [
    "PASTIDA ISRAELI FOOD#ISRAFILF",
    "pastidasimplewayofcooking #pastidaisraelifood #foodforsukkotholiday #happysukkotday #pls dont forget to likes comments and ..."
  ],
  [
    "TRYING ISRAELI FOOD FOR THE FIRST TIME!",
    "This weeks video is a little different, Charcoal Grill & Bar invited me to have a meal at their restaurant and I'd never tasted Israeli ..."
  ],
  [
    "Street Food in Israel - ULTIMATE ISRAELI FOOD Tour in Wadi Nisnas, Haifa, Israel!",
    "Please subscribe to my other YouTube channels: Amir In Jerusalem - https://bit.ly/3sWLjkA Amir Rimer ..."
  ],
  [
    "Americans React To Israeli Candy",
    "In this Reaction Time Episode my friend and I tried and tasted some candy from Israel. It was extremely delicious! Friend's ..."
  ],
  [
    "HOW TO MAKE JACHNUN (ISRAELI FOOD)",
    "Hi welcome to my Chanel PLEASE FOLLOW ME MY SECOND YOUTUBE ACCOUNT; https://www.youtube.com/channel/UCEB2."
  ],
  [
    "ISRAELI Tries The BEST THALI In Rishikesh ? | INDIA 🇮🇳",
    "After looking on this people costumed in the front of this restaurants couple of times , i have decided to go and try the food."
  ],
  [
    "Hungry in Jerusalem City Center?! 🍕🥗🍸 - Israeli food, girls night out &amp; updates // Israel Vlog 17",
    "City center Jerusalem is one of my favorite places. There are SO many food options. Here are just a few that I like! What ..."
  ],
  [
    "&quot;What is Israeli food?&quot; by Chef Erez Komorovsky",
    "Israeli chefs make the traditional relevant to modern tastes. Chef Erez Komorovsky matches authentic Galilee tastes with ..."
  ],
  [
    "Trying Israeli Food with my יִשׂרְאֵלִי הֶחָבֵר",
    ""
  ],
  [
    "Israeli Food Tech Startup Launches ‘Hybrid Meat’ Revolution in Tel Aviv",
    ""
  ],
  [
    "Waste Not Want Not for Israeli Food Bank",
    "Originally published at - http://www.voanews.com/media/video/3290193.html."
  ],
  [
    "SITSOT #ISRAELI FOOD #VEGETARIANRECIPE",
    "SITSOT #ISRAELIFOOD #VEGETARIANRECIPE combination of grated brocolli cauliflower onion garlic eggs turmeric pepper flour ..."
  ],
  [
    "Israeli Chicken Pilaf",
    "Ingredients: Za'atar, or make your own, with oregano, coriander seeds, sesame seeds, lemon grass - taste along the way and find ..."
  ],
  [
    "how to make stuffed pepper. (pelpel memulaim israeli food)",
    "STUFFED PEPPER (PELPEL MEMULAIM, ISRAELI FOOD) 3 tbtsp oil 3 pcs onions 350 grams chicken breast 1 tbtsp full sweet ..."
  ],
  [
    "Mike Colameco&#39;s Real Food  Israeli Food &amp; Wine #1",
    "The current Israeli Food and Wine scene. In these next 3 shows we travel all over the country visiting restaurants, markets, ..."
  ],
  [
    "Israeli Food Impossible Meat Arayes Challenge! from Motek Cafe | Jeremy Jacobowitz",
    "Jeremy Jacobowitz is in Miami, Florida eating one of his favorite dishes, Arayes, from a new Israeli cafe, Motek. Here they serve ..."
  ],
  [
    "Turkish Shawarma From Turkey - Israeli Food #IsraeliFood #Turkey #Istanbul #StreetFood #Shorts",
    ""
  ],
  [
    "Perfect pita and Israeli street food in Singapore | CNA Lifestyle",
    "Think you know your pita? We visited newly opened Miznon in Singapore. The global chain founded by a MasterChef Israel judge ..."
  ],
  [
    "Where to eat in Jerusalem 🥘 #shorts #jerusalem #israel #timeinisrael #jerusalemtoday #middleeast",
    "Where to eat in Jerusalem, Israel, Jachnun, food of Israel, traveling the middle east."
  ],
  [
    "Eating only ISRAELI FOODS for a DAY!",
    "Cass and Jay spent the day eating only Israeli foods! We started the day with shakshuka and some dairy products, for lunch we ..."
  ],
  [
    "Trying ISRAELI FOOD for the first time | Israeli Cuisine | Pushkar | Food Tankerzz",
    "In this video, we try Israeli food for the very first time at the most popular restaurant that serves Israeli cuisine in the Pushkar- A ..."
  ],
  [
    "Mike Colameco&#39;s Real Food  Israeli Food and Wine #2",
    "Part 2 of our trilogy on Israel's food and wine scene. We travel all over the country visiting restaurants, markets, vineyards and ..."
  ],
  [
    "What Indians think about Israeli food",
    "On the occasion of Israel's 73rd IndependenceDay, we were curious to know what Indians think about Israeli food. So, we asked ..."
  ],
  [
    "Indian Trying Israeli Food At Tel Aviv | Halawa, Shakshuka, Bourekas, Hummus | Travofoodie",
    "Indian Trying Israeli Food Hello #travofoodie Family In this video I am trying different #israelifood at #telaviv I tried #Hummus ..."
  ],
  [
    "(Pastida) Baked Zukini Omelet (Israeli Food)Easy &amp; Healthy",
    "Subscribe for more recipes."
  ],
  [
    "Everything I eat in a day living in israel 🇮🇱 #shorts #israel #telaviv #whatieatinaday",
    "Everything I eat in a day living in Israel | Middle East | Tel Aviv."
  ],
  [
    "Shaloha PITA | Israeli Food",
    "Come take a taste of traditional Israeli food from Shaloha PITA. They also make freshly baked pita breads everyday and delicious ..."
  ],
  [
    "Americans Try Israeli Candies For The First Time!",
    "Hello Everyone! Here is my Girlfriend Emily and my friends Luke and Kyle trying Israeli candies for the first time ever! The Israeli ..."
  ],
  [
    "YHT Kids Try Israeli Food",
    "We asked YHT people to try Israeli food on our Yom HaAtzmaut lunch menu and recorded the results. Sababa! FOLLOW US ON ..."
  ],
  [
    "DELICIOUS PITA SANDWICH - Israeli Food #IsraeliFood #Pita #TelAvivFood #MiddleEasternFood #Shorts",
    ""
  ],
  [
    "How to make Israeli food | sitsot | Caregiver in Israel",
    "Hi everyone, I'm Alona and welcome to my channel! If you're new to my channel, please SUBSCRIBE and to be notified with my ..."
  ],
  [
    "How Israel is Changing the Future of Food | FULL EPISODE | Insights on TBN Israel",
    "On this episode of Insights: Israel & the Middle East, host Mati Shoshani visits Vinia Labs for an inside look into how this company ..."
  ],
  [
    "Druze Israeli Food and Arabic Cuisine at a restaurant in Haifa, Israel (מטבח ערבי ישראלי דרוזי)",
    "Druze Israeli Food and Arabic Cuisine at a restaurant in Haifa, Israel (מטבח ערבי ישראלי דרוזי) One of the most fascinating aspects of ..."
  ],
  [
    "THIS LAMB!!!!  Trying Israeli Food in London",
    "We get to try the Laffa Couture with slow roasted lamb. It took first at Taste of London 2019!!! Now if the British weather could just ..."
  ],
  [
    "Israeli food Pieri ( mashed potato 🥔)",
    "How to cooked tasty and diet mashed potato?"
  ],
  [
    "HOW TO MAKE TRADITIONAL israeli FOOD",
    "MEMES Just for fun."
  ],
  [
    "Another Top 10 Street Foods To Eat In Israel - The Ultimate Israeli Food Tour | BEST Jachnun, Bagels",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL ✈️ Vegan Food Tour ..."
  ],
  [
    "Israel: Benjamin Netanyahu’s favorite Indian restaurant in Tel Aviv",
    "An Indian-origin celebrity chef and owner of a famous restaurant owner Reena Pushkarna narrated Benjamin Netanyahu's love ..."
  ],
  [
    "9 of the BEST Street Food Spots in Tel Aviv",
    "I hope you're hungry because in this video, you'll discover some of the BEST spots in Tel Aviv for a quick and delicious meal."
  ],
  [
    "Israeli Malabi Recipe – Rosewater Pudding With Pomegranate Syrup",
    "INGREDIENTS (Serves 3-4) For the malabi 1 1/2 cup milk 1/3 cup sugar 1/2 cup cold water 3 tbsp. cornstarch 1/2 tbsp. rosewater ..."
  ],
  [
    "MY BREAKFAST (MALAWAK ISRAELI FOOD)#SHORTS |GY LOVERS",
    "GYlovers #MALAWAKISRAELIFOOD THANKS FOR WATCHING."
  ],
  [
    "Try Vegan Israeli Food at &#39;Aviv&#39; in SE Portland",
    "Try Vegan Israeli Food at 'Aviv' in SE Portland."
  ],
  [
    "HOW TO MAKE TRADITIONAL israeli FOOD",
    "MEMES Just for fun."
  ],
  [
    "Israeli food Pieri ( mashed potato 🥔)",
    "How to cooked tasty and diet mashed potato?"
  ],
  [
    "Mike Colameco&#39;s Real Food  Israeli Food &amp; Wine #1",
    "The current Israeli Food and Wine scene. In these next 3 shows we travel all over the country visiting restaurants, markets, ..."
  ],
  [
    "FAMOUS ISRAELI FOOD MUKBANG  - SHAWARMA AND FALAPEL feat. MY GOD IS AWESOME channel",
    "Bilang OFW it's very important na ma adopt natin ang pagkain ng bansang ating pupuntahan. Why? Para madali tayong makapag ..."
  ],
  [
    "HOW TO EAT ISRAELI FOOD!! | I CAN&#39;T BELIEVE she used a KNIFE!?!",
    "LIKE & SUBSCRIBE SO WE CAN CONTINUE MAKING CONTENT FOR YOU GUYS! Hey guys! Today we met up with our Israeli ..."
  ],
  [
    "ISRAELI FOOD",
    "A must try Israeli Food #Israel #MiddleEasternFood #IsraeliFood #Shawarma #BestShawarma #Falafel."
  ],
  [
    "British Guys Shocked by ISRAELI Snacks!!?",
    "Today we try some Jolly Snacks sent to us from Israel!! 오늘은 이스라엘에서 날아온 졸리한 간식을 먹어봅니다! Buy Josh's ..."
  ],
  [
    "Jewish Food Tour of Poland - Warsaw Tzimmes | POLIN Museum",
    "Welcome to our Jewish Food Tour series. Join us to discover the role of Jewish culinary traditions in today's Polish cuisine."
  ],
  [
    "Jewish food | Israeli meatballs #shorts #food #jews #meatballs #yummy #ouft",
    ""
  ],
  [
    "Israeli Food Tour !!",
    "Join the Yeti On The Move as he takes you on a short tour of food in Israel from an earlier visit in 2020. #foodblogger, #foodporn ..."
  ],
  [
    "Israeli Street Food",
    "It's fresh, it's tasty, and it's fast. Street food in Israel is famous far and wide, and as chef Janna Gur, points out - with good reason."
  ],
  [
    "How to cook Ptitim(Israeli Food)",
    "Ptitim is Israeli food it is made by extruding dough through around mold. It is prepared with fried onion and garlic. Ingredients for ..."
  ],
  [
    "Israelis: What is the Israeli national food?",
    "Please donate to the project so I can travel further and more often: http://www.gofundme.com/Ask-Project ..."
  ],
  [
    "i cook israeli food/caregiver life☺",
    "Music: Derp Nugget Musician: Kevin MacLeod License: http://creativecommons.org/licenses/by/4.0/"
  ],
  [
    "BEAUTIFUL Mini Pancakes - Israeli Food #Pancake #Cream #Chocolate #Tasty #IsraeliFood #Food #Shorts",
    ""
  ],
  [
    "DELICIOUS PITA SANDWICH - Israeli Food #IsraeliFood #Pita #TelAvivFood #MiddleEasternFood #Shorts",
    ""
  ],
  [
    "HUGE CANDY SHOP - Israeli Food #Candy #Chocolate #CandyShop #Food #Dessert #IsraeliFood #Shorts",
    ""
  ],
  [
    "How Israel became the most advanced country in agriculture",
    "At the beginning of the nineteenth century, early settlers who decided to settle in the lands of Israel faced a huge challenge: how ..."
  ],
  [
    "New Orleans Travel Vlog: Israeli Food Review of Shaya Middle Eastern Restaurant Review Videos",
    "In this episode of our New Orleans Travel Vlog we are doing a Middle Eastern food review of Israeli food with a visit to Shaya for a ..."
  ],
  [
    "Israeli Food in India? 😍",
    ""
  ],
  [
    "Israeli food#shortvideo #short #yummyfoods",
    ""
  ],
  [
    "Jewish dietary laws Kosher |നിയമാനുസൃതമായുളള യഹൂദരുടെ ഭക്ഷണങ്ങൾ |The Holyland Leo Vlogs #96",
    "jewish_Traditions #Israel #kosher The Hebrew word “kosher” (כָּשֵׁר) literally means “fit.” It has come to refer more broadly ..."
  ],
  [
    "Israeli food in MINI ISRAEL !!!",
    "description not found ;-)"
  ],
  [
    "First IMPRESSIONS of Hasidic Jewish Community JERUSALEM  S06 EP.67 | MIDDLE EAST MOTORCYCLE TOUR",
    "Instagram: https://www.instagram.com/WildLensByAbrar Email (only business): wildlensbyabrar@1degree.media Membership: ..."
  ],
  [
    "Tried Cheese Laafa for first time ever 😲🔥Israeli food | Psynyasi Cafe PULGA | #foodshorts #shorts",
    ""
  ],
  [
    "ISRAELI FOOD",
    "Dan Raviv on Israeli food a story for i24News."
  ],
  [
    "Unique PIZZA Slice!! Tel Aviv Street Food - Pizza Tour in Israel!!",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "Israeli Cuisine and Arabic Street Food in Israel",
    "Coming to Israel and participating in Taste of Israel was one of the top highlights for us in 2013. Having experienced eating ..."
  ],
  [
    "ISRAELI FOOD In Wadi Nisnas Market Haifa - MIDDLE EASTERN FOOD Falafel HaZkenim פלאפל הזקנים, Israel",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL."
  ],
  [
    "&quot;What is Israeli food?&quot; by Chef Avi Levy",
    "Israeli chefs know how to enhance Israel's rich gastronomic heritage. Chef Avi Levy cooks traditional casserole dishes with the ..."
  ],
  [
    "The Best Jewish Food in New York City |The Jewish Foodie | Episode: 1 | Jewish restaurants and Food",
    "Where is the best Jewish food in New York City? Join us to discover the best Jewish food and restaurants in NYC."
  ],
  [
    "Acre Israel - Israel Food Tour, Falafel, Hummus With Tahini, ISRAEL&#39;S OLD CITY - Travel Vlog",
    "Acre is a city in the north of Israel, join me and discover the Arabic street food, the Turkish bazaar, Hummus with Tahini, and more."
  ],
  [
    "How Israeli Kosher Shawarma is Prepared | الشاورما | איך להכין שווארמה כשר",
    "Join How2Kosher as we discover how Kosher shawarma in prepared in Jerusalem, Israel. We scoured the finest and greasiest ..."
  ],
  [
    "Molly Yeh&#39;s Rugelach 2 Ways | Girl Meets Farm | Food Network",
    "Cook along with Molly as she reveals how to prepare rugelach two different ways! Watch #GirlMeetsFarm on Sundays @ 11a|10c ..."
  ],
  [
    "HOW TO BAKE &quot;MALAI&quot; | ISRAELI FOOD",
    "hotcake #israelifood #malai #risalakwatchera #taim #corncake #delicious #uga #yummyfood."
  ],
  [
    "Madgicx Webinar: How Madgicx helped an Israeli food-tech business sell its entire stock in 1 month?",
    "In this Webinar, we discuss how ToLive was able to scale their performance and sell out their entire stock within 1 month using ..."
  ],
  [
    "ISRAELI FOOD #shorts #shortvideos",
    ""
  ],
  [
    "What is Israeli food   by Chef Avi Levy",
    "קרדיט ל-israel https://www.youtube.com/user/Israel."
  ],
  [
    "🇵🇸🇮🇱Too little, too late&#39;: Palestine ban on Israeli food products | Al Jazeera English",
    "Israeli fruit, vegetables and poultry will no longer be available in Palestinian shops. The Palestinian Authority (PA) is stopping all ..."
  ],
  [
    "Celebrating Egyptian Food in Israel",
    "Israelis of Egyptian origin bring Egypt's culture & cuisine into the diverse mixture comprising the Israeli society. What better time to ..."
  ],
  [
    "Israeli Food and Israeli Cuisine Travel Videos",
    "This is a series or travel videos that showcase Israeli street food, Israeli food, Israeli meals, Israeli cuisine, Israeli lunches, Israeli ..."
  ],
  [
    "Falafel Platter | Mezze Platter 🔥| Israeli Food",
    "shorts #israelifood #mezzeplatter #falafel."
  ],
  [
    "Laffa &amp;falafel in Pushkar | Israeli food dish #shorts #shortsvideo #israelifood #pushkar #food🌯🫔",
    "Laffa &falafel in Pushkar | Israeli food dish #shorts #shortsvideo #youtubeshorts #ytshorts #israelifood #pushkar #food."
  ],
  [
    "JERUSALEM FOOD TOUR + Attractions - Palestinian Food and Israeli Food in Old Jerusalem!",
    "JERUSALEM FOOD TOUR + Attractions - Palestinian Food and Israeli Food in Old Jerusalem! There are few cities in the world ..."
  ],
  [
    "Dutch trying Israeli food and drinks - Episode 3 Snacks",
    "Of het nu voor kinderfeestjes of bij de borrel is, zoutjes mogen niet ontbreken. Wat zijn typisch Israëlische snacks? Dit is aflevering ..."
  ],
  [
    "PLEASING Crepe - Israeli Food #Crepe #IsraeliFood #StreetFood #Dessert #Tasty #Food #Foodie #Shorts",
    ""
  ],
  [
    "Israeli food you like/dislike",
    "Kibbutz volunteers trying to reply about the Israeli food they like or dislike."
  ],
  [
    "Israeli Food - Homemade Harissa by Yaniv Cohen - The Spice Detective (spicy pepper spread)",
    "Israeli Food - Homemade Harissa by Yaniv Cohen - The Spice Detective In this video we created we show how you can make at ..."
  ],
  [
    "Epic Bagel, Bourekas, Cholent, ISRAELI FOOD From Mea Shearim + Shuk Machane Yehuda Jerusalem, Israel",
    "Watch Part 1 (My First Mea Shearim Food Tour) https://youtu.be/hUbxiPJ96gk The food spots I talk about in this video: Avichail ..."
  ],
  [
    "Dutch trying Israeli food and drinks - Episode 3 Snacks",
    "Of het nu voor kinderfeestjes of bij de borrel is, zoutjes mogen niet ontbreken. Wat zijn typisch Israëlische snacks? Dit is aflevering ..."
  ],
  [
    "PLEASING Crepe - Israeli Food #Crepe #IsraeliFood #StreetFood #Dessert #Tasty #Food #Foodie #Shorts",
    ""
  ],
  [
    "Israeli food you like/dislike",
    "Kibbutz volunteers trying to reply about the Israeli food they like or dislike."
  ],
  [
    "Where to find Israeli food in Bangkok ? Ep.3",
    ""
  ],
  [
    "Israeli Food - Homemade Harissa by Yaniv Cohen - The Spice Detective (spicy pepper spread)",
    "Israeli Food - Homemade Harissa by Yaniv Cohen - The Spice Detective In this video we created we show how you can make at ..."
  ],
  [
    "Israeli Street Food",
    "It's fresh, it's tasty, and it's fast. Street food in Israel is famous far and wide, and as chef Janna Gur, points out - with good reason."
  ],
  [
    "More crimes against the #Jewish food #Pork #Jewishfood #Food #Kosher #Comedy #jewishcomedy",
    ""
  ],
  [
    "MARAKH ADOM OF/CHICKEN SOUP ISRAELI FOOD RED NI KA MYS STYLE VLOG",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UC t_RgiBrVRenoL_oIY46fWw/join."
  ],
  [
    "How Israeli Kosher Shawarma is Prepared | الشاورما | איך להכין שווארמה כשר",
    "Join How2Kosher as we discover how Kosher shawarma in prepared in Jerusalem, Israel. We scoured the finest and greasiest ..."
  ],
  [
    "The Israeli food channel - Woman&#39;s month - Promo",
    ""
  ],
  [
    "EATING TESTICLES AND HEARTS- Israeli Food Taste Test",
    "EATING TESTICLES AND HEARTS- Israeli Food Taste Test. Today we eat testicles hearts and tonsils! Israeli food is so good."
  ],
  [
    "ISRAELI FOOD | SIGARIA",
    "ISRAELI FOOD | SIGARIA My channel is all about lifestyle vlogs that include personal vlogs, travel and adventure vlogs, how-to ..."
  ],
  [
    "Beef Carpaccio - Israeli Food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "JERUSALEM FOOD TOUR + Attractions - Palestinian Food and Israeli Food in Old Jerusalem!",
    "JERUSALEM FOOD TOUR + Attractions - Palestinian Food and Israeli Food in Old Jerusalem! There are few cities in the world ..."
  ],
  [
    "Israeli Street Food - Fricassee Zehava  - Tsfat (Safed) Israel",
    "Location: https://goo.gl/maps/V3iNGhxunWmZ3fdaA."
  ],
  [
    "The Third Eye Restaurant Pushkar | Real &amp; Best Israeli Food in Pushkar #Shorts",
    "The Third Eye Restaurant Pushkar | Real & Best Israeli Food in Pushkar #Shorts."
  ],
  [
    "Green Crepe - Israeli Food #Crepe #IsraeliFood #Dessert #StreetFood #Shorts",
    ""
  ],
  [
    "TRYING ISRAELI FOOD! 5 DISHES TO TASTE IN ISRAEL - Tel Aviv",
    "TRYING ISRAELI FOOD! 5 DISHES TO TASTE IN ISRAEL - Tel Aviv. Eating Classic Israeli food and dishes in Tel Aviv Israel."
  ],
  [
    "Jewish dietary laws Kosher |നിയമാനുസൃതമായുളള യഹൂദരുടെ ഭക്ഷണങ്ങൾ |The Holyland Leo Vlogs #96",
    "jewish_Traditions #Israel #kosher The Hebrew word “kosher” (כָּשֵׁר) literally means “fit.” It has come to refer more broadly ..."
  ],
  [
    "Gal Gadot Teaches You Hebrew Slang | Vanity Fair",
    "Gal Gadot schools us in Hebrew slang. From \"ma ani, ez?\" to \"tachles,\" Gal will leave you saying \"ores\" after this episode of Slang ..."
  ],
  [
    "What is Israeli food   by Chef Meir Adoni",
    "קרדייט: http://www.youtube.com/user/Israel?fe... -israel."
  ],
  [
    "Best Meat Restaurant In Tel Aviv - Israeli Food #IsraeliFood #Meat #Kebab #Shorts",
    ""
  ],
  [
    "Israeli food",
    ""
  ],
  [
    "Israeli food#shorts #food",
    ""
  ],
  [
    "ISRAELI FOOD CHAIN!",
    "I finally clean and organize baby Abigails bedroom. She is going to be using it after she turns one year old. Rafael helps me clean ..."
  ],
  [
    "The ULTIMATE Druze Food Experience - Noor Restaurant | Julis ,  Israel",
    "Recently I experienced authentic Druze Food at Noor Restaurant in Julis (Druze Village) , Israel. The restaurant is owned by ..."
  ],
  [
    "Dutch trying Israeli food and drinks - Episode 1 Drinks",
    "Wij hebben een aantal Nederlanders gevraagd om enkele typisch Israelische snacks, gebakken en drankjes te proeven en er ..."
  ],
  [
    "The Israeli food channel - Amateurs night - Promo",
    ""
  ],
  [
    "ISRAELI FOOD SHABBAT - Shabbat Series Episode 4 &amp; HOW TO MAKE HUMMUS!",
    "Here are my best recipes for an Israeli themed kosher Shabbat dinner, including a super simple and delicious homemade ..."
  ],
  [
    "Eating Israeli Street Food and Arabic Street Food touring around Jaffa - Tel Aviv, Israel",
    "Eating Israeli Street Food and Arabic Street Food touring around Jaffa - Tel Aviv, Israel. So today is our first morning in Israel."
  ],
  [
    "How to cook Chicken soup &quot;Marak Of&quot; Israel food/I&#39;ts me Clar TV",
    "Hi guys, I'ts me Clar TV. Today we show you how to cook basic Chicken soup ..easy and cheap.. I hope you give this a try."
  ],
  [
    "ISRAELI FOOD",
    "Dan Raviv on Israeli food a story for i24News."
  ],
  [
    "Palestinian Food - SHAWARMA Al-Sheikh Restaurant Nazareth Falafel Israel",
    ""
  ],
  [
    "Israeli Food",
    "Israeli Food is a Mix of Flavors from All Over the World! So Good!"
  ],
  [
    "Israeli Food",
    ""
  ],
  [
    "Aubergine 🍆 in Tahini Dressing (Israeli food)🇮🇱",
    ""
  ],
  [
    "MEMOLAIM/ISRAELI FOOD",
    "MEMOLAIM/ISRAELI FOOD WITH RICE AND MEAT,VEGETABLE INSIDE GOOD FOR LUNCH AND DINNER. #SHORT ..."
  ],
  [
    "Best Friends Cook Chinese And Jewish Food For Each Other",
    "\"This is actually f*cking delicious, oh my f*cking god!\" Check out more awesome videos at BuzzFeedVideo!"
  ],
  [
    "😋 Hummus at Ein Bokek - Dead Sea | Israeli Food Vlog | Eat With Me | Gur Eats",
    "In this video, I take you to the Taj Mahal Restaurant at Ein Bokek (Dead Sea) in Israel to eat some delicious Hummus. If you loved ..."
  ],
  [
    "Cooking schnitzel  Israeli food l Vhanie Mercado",
    ""
  ],
  [
    "Eating Israeli food",
    ""
  ],
  [
    "KASOL - ISRAEL TOWN OF INDIA | EP 2 : DAY 1 | ISRAELI FOOD,RIVER BRIDGE AND MORE | HIMACHAL PRADESH",
    "This Video is the part of day 1 on what we did on rest of the remaining hours after reachin parvati valley himachal pradesh. in this ..."
  ],
  [
    "Israeli Food - One Of The BEST Hummus in Haifa! Hummus Al Sham (Hummus Elsham) | Wadi Nisnas 2021",
    "Amir In Jerusalem - https://bit.ly/3sWLjkA Amir Rimer - https://www.youtube.com/user/Amirimer Amir Rimer Traveling ..."
  ],
  [
    "Cooking Israeli food set shot Israel",
    ""
  ],
  [
    "Singapore Israeli food",
    "https://g.page/miznonsg?share."
  ],
  [
    "The Best Israeli Food In Singapore! @Miznon Singapore",
    "BUSINESS ENQUIRIES: offthebeatentrailss@gmail.com WHAT I USE: ▪️Gopro Hero 9 black + media mod ▪️Iphone 13 pro ..."
  ],
  [
    "5 ISRAELI FOOD",
    ""
  ],
  [
    "Bread filled with Potatoes👍 | Israeli food",
    "shorts #israelifood."
  ],
  [
    "The Wonderful World of Israeli Food",
    "Join Chef Judi as she explores the diversities of Israeli cuisine with The Jewish Federation of Sarasota Manatee's Shonim ..."
  ],
  [
    "First Time In Israeli Food Market",
    "While vacationing in Israel I made a lovely trip to the local food market. I was amazed to see the incredible selection of fresh fruits, ..."
  ],
  [
    "Top 5 street foods in Israel",
    "From Shakshuka, a Mediterranean take on poached eggs, to Sabih, an eggplant based sandwich which combines local spices ..."
  ],
  [
    "Falafel Platter | Mezze Platter 🔥| Israeli Food",
    "shorts #israelifood #mezzeplatter #falafel."
  ],
  [
    "TEL AVIV STREET FOOD | Israeli Food - Nepali, Sudanese, Eritrean, Philippines | Tel Aviv Walk",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL ✈️ Vegan Food Tour ..."
  ],
  [
    "Chicken schnitzel (Israeli food)",
    "A simple but yummy and healthy recipe."
  ],
  [
    "Israeli Food Fest at Amedeous.",
    "\"Sweet Home\" is an half hour women's tele magazine show developed & directed by Samir Kazmi. \"Sweet Home\" airs on Friday ..."
  ],
  [
    "Sitsot im afuna israeli food",
    "Hello cookers for today let me share to you how to a delicious sauce of sitsot. Happy cooking! Ingridients: 1/4 kl. ground beef 1 ..."
  ],
  [
    "CALIFORNIA ISRAELI FOOD",
    "Subscribe for weekly video posts: https://www.youtube.com/c/CHRIS7IANL_eatlikeanapex?sub_confirmation=1 Travel and Eating ..."
  ],
  [
    "TRYING ISRAELI FOOD FOR THE FIRST TIME!",
    "This weeks video is a little different, Charcoal Grill & Bar invited me to have a meal at their restaurant and I'd never tasted Israeli ..."
  ],
  [
    "See the best Israeli food in America! #shorts",
    "Zahav, Philadelphia #shorts #youtubeshorts #israeli #foodie #foodporn."
  ],
  [
    "israeli food#shorts",
    "tess mix collection."
  ],
  [
    "Israeli food in Hampi | Must try some street food in Hampi | Mayuri Banaji",
    "Hampi, also referred to as the Group of Monuments at Hampi, is a UNESCO World Heritage Site located in east-central Karnataka, ..."
  ],
  [
    "EATBEAT: hosting Comeback Kid - Israeli food Blind Tasting - איטביט מארחים את קאמבקיד",
    "EATBEAT: hosting Comeback Kid - Israeli food Blind Tasting."
  ],
  [
    "YASHKA SHAWARMA TAKES OVER ISRAEL!",
    ""
  ],
  [
    "Israeli Food - Mediterranean Ceviche by Yaniv Cohen - The Spice Detective",
    "Israeli Food - Mediterranean Ceviche by Yaniv Cohen - The Spice Detective So I created this cool video for Chef Yaniv Cohen, ..."
  ],
  [
    "Yummy Israeli food in Frankfurt at Bar Shuka - with best falafel in town!",
    "Yummy Israeli food in Frankfurt @barshuka with best falafel in town! https://barshuka.com #israelifood #frankfurt #barshuka ..."
  ],
  [
    "STUNNING BIG SALAD - Israeli Food #Salad #IsraeliFood #Food #StreetFood #Israel #Foodie #Shorts",
    ""
  ],
  [
    "Israeli food#shorts #food",
    ""
  ],
  [
    "Israeli food",
    "By 5th grade thanj 2020."
  ],
  [
    "Ban Israeli Food &amp; Beverages",
    "This document is part-1 of a series highlighting Israeli products."
  ],
  [
    "My Own Version of Pashtida | Israeli Food | Caregiver in Israel | Picknic Guariño",
    ""
  ],
  [
    "Perfect Pita Bread - Israeli Food #Pita #IsraeliFood #TelAviv #Shorts",
    ""
  ],
  [
    "laffa falafal Israeli food in rajasthan 😍 #food #foodie",
    "follow me on instagram https://instagram.com/foodhunt_with_shubham?igshid=YmMyMTA2M2Y= -... Facebook ..."
  ],
  [
    "ISRAELI FOOD SHABBAT - Shabbat Series Episode 4 &amp; HOW TO MAKE HUMMUS!",
    "Here are my best recipes for an Israeli themed kosher Shabbat dinner, including a super simple and delicious homemade ..."
  ],
  [
    "INDIA - Indian guy hosts an Israeli girl 🇮🇳🇮🇱",
    "This is the amazing man who hosted us, go support him and spread love @Budding Vet Thank you brother! I travel all over the ..."
  ],
  [
    "[Vlog] Aug22 - Living in Singapore Diaries - Swedish and Israeli food",
    "Tried new food, saw fireworks, went on dates, but most importantly thank God for seeing me through the transitions to come ..."
  ],
  [
    "Traveling to NYC and Israeli Food l NYC Vlog",
    "https://discord.gg/cQerQqkU instagram: @doobydobap Restaurant: North Miznon 161 W 72nd St, New York, NY 10023 Ben is my ..."
  ],
  [
    "Israeli food",
    ""
  ],
  [
    "I try to cook Israeli food,,delicious",
    "Israeli food Lifeinhollyland."
  ],
  [
    "israeli food at home",
    ""
  ],
  [
    "Foodography - A Unique Israeli Adventure Combining Food &amp; Photography",
    "670 million hashtags on instagram speak for themselves: People take photos of food anywhere and everywhere. The human ..."
  ],
  [
    "Tosh Ke Trek se Hui Halat Kharab | Israeli food | #kasol #tosh #israeli #food #trek #Trip #friends",
    ""
  ],
  [
    "BEAUTIFUL Belgian Waffle - Israeli Food #Waffle #BelgianWaffle #Israel #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "Israeli food giant announces pending 3-7% price hikes- Asst. Prof. Villy Abraham",
    "Join our community now and receive 24/7 of new & original content from the State of Israel. https://www.iltv.tv. Now if you're a fan ..."
  ],
  [
    "Israeli Couscous recipe/kooskoos recipe israeli/israeli food recipe/mediacraft",
    "israelicouscous #israelifoodrecipe."
  ],
  [
    "Kasol Trip - Chalal Trek | Parvati valley | How to reach Rasol | Israeli food &amp; Cafe | My Experience",
    "Chalal is small village in Kasol which can be covered on foot. It is famous for scenic beauty of Parvati valley and Cafes and food ..."
  ],
  [
    "STUNNING Yemen Street Food - Israeli Food, Middle Eastern Food #IsraeliFood #Jachnun #Saluf #Shorts",
    "Watch the full video here: https://youtu.be/YTG8cOUEgvM."
  ],
  [
    "SUKSUKAN( ISRAELI FOOD)",
    ""
  ],
  [
    "Israeli Food: Tel Aviv Hamburger",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL GDB Burger Location: ..."
  ],
  [
    "KASOL TOSH TRIP VLOG | KASOL GRAHAN VILLAGE TREK | TRIED ISRAELI FOOD | Best Weekend Trip Kasol",
    "Please subscribe to my YouTube channel Music: As Leaves Fall Musician: @iksonmusic \"Art of Silence - by Uniq\" is under a ..."
  ],
  [
    "Oreo Fruits Crepe - Israeli Food #Crepe #Fruit #Chocolate #Tasty #Dessert #IsraeliFood #Oreo #Shorts",
    ""
  ],
  [
    "Israeli food",
    "Falafel, Pita, Eggplant, Hummus, Tehina, Lafa, and much more, only in Israel."
  ],
  [
    "Favorite Israeli Food | Israel 101 | All Israel News",
    "Which is your favorite Israeli food? All Israel News and All Arab News, tracking news and events impacting the Middle East for the ..."
  ],
  [
    "STUNNING Blue Crepe - Israeli Food #Crepe #IsraeliFood #StreetFood #Dessert #Tasty #Food #Shorts",
    ""
  ],
  [
    "ISRAELI FOOD CHAIN!",
    "I finally clean and organize baby Abigails bedroom. She is going to be using it after she turns one year old. Rafael helps me clean ..."
  ],
  [
    "Palestinians Launch Boycott of Israeli Food Products in West Bank - TOI",
    "Palestinians Launch Boycott of Israeli Food Products in West Bank Activists from Palestinian President Mahmoud Abbas' Fatah ..."
  ],
  [
    "Dutch trying Israeli food and drinks - Episode 2 Pastry",
    "Onze sympatieke proefkonijnen zijn terug, dit keer met Israelisch gebak. Feest van kerkenning of allemaal nieuw? Dit is aflevering ..."
  ],
  [
    "israeli food in old manali❤️ psycho shots❤️! #oldmanali #manali #himachal #youtubeshorts #shorts",
    ""
  ],
  [
    "Chiken Shakshuka | Israeli Food | Kasol",
    ""
  ],
  [
    "Nazareth Street Food – Israeli Food Documentary",
    "Nazareth Street Food – Israeli Food Documentary."
  ],
  [
    "Israeli Cooking Class at Dan Gourmet with Taste of Israel Food Tour in Tel Aviv (כיתת בישול ישראלית)",
    "Israeli Cooking Class at Dan Gourmet with Taste of Israel Food Tour in Tel Aviv. In the kitchen we learned how to make ..."
  ],
  [
    "Israeli Food - Limonana by Yaniv Cohen The Spice Detective",
    ""
  ],
  [
    "Tahini Bread Gluten Free Bread almost Carbs Free! Israeli Food (by Yaniv Cohen The Spice Detective)",
    "Tahini Bread Gluten Free Bread almost Carbs Free! Israeli Food (by Yaniv Cohen The Spice Detective) This recipe will change ..."
  ],
  [
    "KDHS Israeli food",
    ""
  ],
  [
    "BEAUTIFUL PIZZA  - Israeli Food #Pizza #Tasty #Streetfood #Italianstreetfood #Israelifood #Shorts",
    ""
  ],
  [
    "The Israeli Food Revolution",
    "Ori Shavit, Israeli food journalist, speaker and vegan activist ... \"In only a few years Israel has become a great place for veganism, ..."
  ],
  [
    "Israeli food giant announces pending 3 - 7% price hikes",
    "Price increases seen across the world have not spared the Israeli economy. Although Israelis are already feeling the Israeli ..."
  ],
  [
    "Beautiful Red Waffle With Icecream - Israeli Food #StreetFood #IsraeliFood #Dessert #Waffle #Shorts",
    ""
  ],
  [
    "cooking sitsot plus pita bread,salad(israeli food)",
    "sitsot recipe onion,potato,parsley,baking powder,flour,chicken soup powder,egg,black pepper,oil salad recipe cucumber,onion ..."
  ],
  [
    "Chocolate Banana Crepe - Israeli Food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "Israeli food so yummy.meatball, chicken soup, brousel prout,",
    ""
  ],
  [
    "TRADITIONAL FOOD NG MGA ISRAELI: ANO ANG MADALAS KAININ NG MGA HUDYO?",
    "Shalom mga kababayan! Sa video vlog na ito ay ang paguusapan natin ay ang mga pagkain ng mga hudyo dito sa Israel."
  ],
  [
    "Mini Israel Cafe Kasol | Best Israeli food in town 🔥👌Chole bature in Kasol #shorts #kasol #foodie",
    ""
  ],
  [
    "STUNNING Taboon Bread - Labneh, Za&#39;atar - Israeli Food #IsraeliFood #StreetFood #Tasty #Food #Shorts",
    ""
  ],
  [
    "Israel Food Tour",
    "A quick culinary trip across Israel with the wonderful Uri Jeremias. Subscribe to Travel + Leisure!"
  ],
  [
    "BREAD FOR SHABBAT &quot;CHALLAH&quot; ISRAELI FOOD #Shorts | Smilymyles Vlog",
    "Shorts #Bread #ShabbatBread #Challah #IsraeliFood."
  ],
  [
    "How to make LIMONANA - Israeli Food by Yaniv Cohen the Spice Detective",
    ""
  ],
  [
    "israeli food snitzel,chicken bb",
    ""
  ],
  [
    "ISRAELI STREET FOOD!! #streetfood #israel",
    "SUBSCRIBE for more food videos! IG @Alfonso and Jessica Official Hey guys! We wanted to show you a elevated version of what ..."
  ],
  [
    "A relaxing Friday at the Tel Aviv port with delicious Israeli food - Virtual Walking",
    "Friday noon, holiday season, Tel Aviv Port. I enjoyed walking around the harbor between the cafes and restaurants. The food ..."
  ],
  [
    "SHITSOT NG ISRAEL | ISRAELI FOOD",
    "risalakwatchera #taim #israelifood #shitsot."
  ],
  [
    "How to make A Simple corn Rice???🔥 SIMPLE RECIPE | ISRAELI FOOD VLOGS 🔥",
    "How to make corn Rice???   SIMPLE RECIPE | ISRAELI FOOD VLOGS   Here u can see how to make a simple Rice with corn ..."
  ],
  [
    "Chocolate Dessert - Israeli Food #chocolate #tasty #israelifood #shorts",
    ""
  ],
  [
    "Kerem HaTeimanim - Tel Aviv Walk, Israeli Food, Middle Eastern Food, Ethiopian, Yemen, Georgian,Thai",
    "My Food Channel - https://www.youtube.com/user/Amirimer 🎞️ My Education Channel - https://bit.ly/2FihPsL The area I visited in ..."
  ],
  [
    "ISRAELI  FOOD  VP   55  ISRAEL",
    ""
  ],
  [
    "Israeli food startup aims to make meat     minus the animal",
    ""
  ],
  [
    "Israeli Food Taste Test | Pastrami Sandwich &amp; Yena Red Grape Juice | Food &amp; Drink",
    "In this episode of Food & Drink you will see Israeli food: a fantastic pastrami sandwich with hummus, mustard and pickles and a ..."
  ],
  [
    "Best street food in Israel 🇮🇱Israeli #food cuisine gastronomy cooking culinary local Israeli food",
    "The amazing variety of food in Israel is mouthwatering, none more so than the following favorite dishes: falafel, hummus, shwarma ..."
  ],
  [
    "Cooking Israeli food | Fasolia",
    "No comments."
  ],
  [
    "Israeli Food|| First Time Food Vlog ||vlog17",
    "My first food vlog     . . Thank you everyone for your love and support. . #foodvlog #israelifood #nepalivlog #darjeeling ..."
  ],
  [
    "INDIAN STREET FOOD in ISRAEL - Israeli Food #IsraeliFood #India #IndianFood #Shorts",
    ""
  ],
  [
    "Good Day Cooks: Israeli street food",
    "It's the one-year anniversary of TLV at Austin's Fareground Food Hall. Owner Berty Richter made some of their specialties. MORE ..."
  ],
  [
    "Israeli food in INDIA || Delicious ISRAELI DISHES ||",
    "Hello everyone…I am Oshvika & in this video we explore some Israeli cafes and restaurants and tast delicious Israeli foods."
  ],
  [
    "Tomato Salad And Tahini - Israeli Food #IsraeliFood #TomatoSalad #Tahini #Shorts",
    ""
  ],
  [
    "Kasol, Camping and Israeli Food",
    "After Manali our initial plan was to go to spiti valley but unfortunately that didn't work out so we decided to go to kasol, and i'm glad ..."
  ],
  [
    "PESACH RECIPE  -PASSOVER  RECIPE / CAROUSET BALLS #PASSOVER FOOD #PESAc#MORROCAN ISRAELI FOOD",
    "KATAS OFW DREAM HOUSE/OFW IN ISRAEL MAGKANO INABOT katasofw,#ofwhouseinphilippinesKATAS OFW DREAM ..."
  ],
  [
    "Israeli Food",
    ""
  ],
  [
    "The best Jaknun in Tel-aviv Israel | Traditional Yemeni/Israeli food | Homer Vlogs",
    ""
  ],
  [
    "Waffle With Chocolate - Israeli Food #Waffle #Chocolate #Tasty #Food #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "FALAFEL ISRAELI FOOD IN THE PHILIPPINES",
    "Falafel Israeli Food @ SM North Annex, Yummylicious Food! Ze Taim meod! Thanks to all my viewers. Special thanks to my ..."
  ],
  [
    "GORGEOUS Chocolate Dessert - Israeli Food #chocolate #tasty #streetfood #cream #israelifood #shorts",
    ""
  ],
  [
    "Meatballs in Tomato Sauce Recipe#Israeli food Recipe",
    "Ground meat -250gms Onion -2 big Garlic -8 Presley leaves Bread crumbs -1/2 cup Sweet chilly powder Black pepper-1pinch Salt ..."
  ],
  [
    "Israeli Food Bank - Plates",
    "An unique guerrilla campaign for Israeli Food Bank."
  ],
  [
    "#Mark Wiens #JERUSALEM FOOD TOUR CLIPS #SHORTS  Palestinian Food and Israeli Food in Old Jerusalem!",
    "CREDIT: Mark Wiens Check out his video: https://www.youtube.com/watch?v=FLmNLrog6dQ&t=795s. Jerusalem traditional food ..."
  ],
  [
    "LIVE with Yael: Local Israeli Food!",
    "Join Yael Eckstein as she gives us an inside look into one of the organic cafes in Israel. So many foods in Israel are locally grown, ..."
  ],
  [
    "MARAKH ADOM OF/CHICKEN SOUP ISRAELI FOOD RED NI KA MYS STYLE VLOG",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UC t_RgiBrVRenoL_oIY46fWw/join."
  ],
  [
    "ADVENTUROUS TOUR OF MANALI | INDIAN AND ISRAELI FOOD IN OLD MANALI 2019 | EPISODE 4",
    "ADVENTUROUS TOUR OF MANALI | INDIAN AND ISRAELI FOOD IN OLD MANALI 2019 | EPISODE 4 Best place to visit in ..."
  ],
  [
    "Israeli Food: All kinds of Israeli food from the supermarket",
    "In my videos you can find out what types of food there are in supermarkets in Israel What to and what not to buy."
  ],
  [
    "Israeli food!",
    ""
  ],
  [
    "ISraeli food❤️shakshuka❤️ Healthyfood ❤️",
    ""
  ],
  [
    "ISRAELI FOOD - Egg roll, Grape Leaves &amp; Cabbage!! Bourekas, Knafeh In Shuk Machane Yehuda, Jerusalem",
    "Amir In Jerusalem - https://bit.ly/3sWLjkA Amir Rimer Traveling - https://www.youtube.com/c/AmirRimerTraveling Amir Rimer ..."
  ],
  [
    "STUNNING FRUIT Crepe - Israeli Food #Crepe #IsraeliFood #StreetFood #Dessert #Tasty #Food #Shorts",
    ""
  ],
  [
    "MARAKH ADOM OF/CHICKEN SOUP ISRAELI FOOD RED NI KA MYS STYLE VLOG",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UC t_RgiBrVRenoL_oIY46fWw/join."
  ],
  [
    "chocolate crepe - israeli food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "ISRAELI Turkish Street Food is The BEST. Bourekas.",
    "ISRAELI Turkish Street Foodnis The BEST. Bourekas. Well Bourekas or burekas is a very popular baked pastry in Sephardic ..."
  ],
  [
    "Jewish Food: Kasha: Kasha Recipes: Kupecheskaya Russian Jewish Kasha Recipe",
    "I have been taking requests for about six months now and doing mostly Asian and Italian cuisines as they are my fave cuisines."
  ],
  [
    "•Falafel• A must eat Israeli food in Pushkar.",
    "A must eat thing in Pushkar. It is known as Falalfel. It looks like roll of some kind, but the balls that are put in the end makes all the ..."
  ],
  [
    "Chocolate Dessert - Israeli Food #Chocolate #Dessert #Tasty #StreetFood #Food #Foodie #Yummy #Shorts",
    ""
  ],
  [
    "Israeli Couscous: Jewish Food! Shashlik: Russian Food! A Great Combination For Dinner",
    "Have you ever had shashlik? What? You have never had shashlik? Have you ever had Israeli couscous? What? You haven't had ..."
  ],
  [
    "Palestinian and Israeli Food Cultures - Co-taught by Professors Michal Friedman and Nevine Abraham",
    "This is an academically rigorous course that challenged students' critical thinking. These highlights reflect our events of food ..."
  ],
  [
    "I Only Ate Jewish Food for a Day",
    "Happy Hanukkah! ✿ LINKS ✿ ✨ instagram https://bit.ly/2XppLkM ✨ tiktok https://bit.ly/2X5ReYr ✨ goodreads ..."
  ],
  [
    "DELICIOUS Hotdog - Israeli Food",
    ""
  ],
  [
    "Removal of Israeli food truck &quot;Moshava Philly&quot; from &quot;Eat Up the Border&quot; event prompts outrage",
    "Regional Director for the Anti-Defamation League Philadelphia joined Good Day to update us with the latest involving an Israeli ..."
  ],
  [
    "Chocolate And Strawberry Crepe - Israeli Food #Chocolate #Strawberry #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "How to make Israeli Shakshuka#Israeli food Recipe",
    ""
  ],
  [
    "Miyuki,and mushroom(petriot) with tomato sauce|Israeli food#shorts ||Dia Narrah Official",
    "Machane yehuda Market#jerusalem."
  ],
  [
    "Arab-Israeli flavours take centre stage at Haifa food festival",
    "(11 Dec 2015) LEAD-IN: Arab-Israeli cuisine is the focus of a new food festival taking place in the northern Israeli port city of Haifa ..."
  ],
  [
    "Eating Middle Eastern Food in Jaffa, Israel! 🇮🇱 | Yohanna Tal",
    "MiddleEasternFood#Israel#Jaffa Shalom everyone, Join us today as we visit one of the restaurant in Jaffa which serve ..."
  ],
  [
    "Israeli food my employer&#39; favorite food. # buhay caregiver Israel",
    "Welcome to my channel. In this video I wanna some of my employer favorite food also with her family. Thank you for watching."
  ],
  [
    "LIVE with Jorge #2 - Spicy Israeli food challenge",
    "It seems like Jorge is getting really good at that, so we decided to give him another chance. Join us for the spicy Israeli food ..."
  ],
  [
    "ICECREAM WITH POPCORN - Israeli Food #IceCream #Popcorn #Tasty #Dessert #IsraeliFood #TLV #Shorts",
    ""
  ],
  [
    "healthy Israeli food",
    "talking about Israel/"
  ],
  [
    "Tel Aviv Israel, Video Walk In Levinsky Street Food Market - Israeli Food And Turkey Turkish Food",
    "My Food Channel - https://www.youtube.com/user/Amirimer 🎞️ My Education Channel - https://bit.ly/2FihPsL The area I visited in ..."
  ],
  [
    "Hike to Chalal | FOREST FIRE and Israeli Food",
    "The one where we played bongo, hiked to a beautiful village and almost got caught in a forest fire, and had some yummy dinner!"
  ],
  [
    "ISRAELI FOOD EXPERIENCE | ISRAEL TOUR",
    "Here's some of my video during our ISRAEL TOUR. Thanks to @Highlight Tours Philippines for a well coordinated and a great ..."
  ],
  [
    "Vanilla Ice Cream - Israeli Food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "Einat&#39;s Vegan Israeli Food Compilation",
    "what vegans eat when they go out in Israel."
  ],
  [
    "Best Bakery - Israeli Food #IsraeliFood #Bakery #Pastry #Shorts",
    ""
  ],
  [
    "best Israeli food falafel humus pushkar rajasthan",
    ""
  ],
  [
    "HAMPI | BEST AND CHEAPEST LOCAL FOOD+SURPRISE ISRAELI DISH",
    "Are there good places to eat in hampi from where you can gather the energy for the rest of your journey? Idli/Paddu/Dosa/Mirchi ..."
  ],
  [
    "Cook Israeli Food Like A Pro: Culture Mavens",
    "In this episode of Culture Mavens, Rabbi Susan Nanus and writer Tom Teicholz discuss a myriad of online cultural offerings ..."
  ],
  [
    "Beautiful Ravioli - Israeli Food #Ravioli #StreetFood #Food #Pasta #IsraeliFood #ItalianFood #Shorts",
    ""
  ],
  [
    "Israeli Food Recipe - Healthy Gluten Free Vegan Pancakes by Yaniv Cohen - The Spice Detective",
    "So I created this cool video for Chef Yaniv Cohen, 'The Spice Detective' for his video blog. I used only one camera, basic lighting, ..."
  ],
  [
    "This is the Ultimate Fast Casual ISRAELI Food",
    "In this episode, I'm in Washington, DC, the Nation's Capital, to enjoy some of the city's premiere Israeli food. Namely, two shops ..."
  ],
  [
    "Israeli foods for thunders//Jewish dish tsitsot ve agvanyot marack //check this out #shorts",
    ""
  ],
  [
    "ISRAELI FOOD - Egg roll, Grape Leaves &amp; Cabbage!! Bourekas, Knafeh In Shuk Machane Yehuda, Jerusalem",
    "Amir In Jerusalem - https://bit.ly/3sWLjkA Amir Rimer Traveling - https://www.youtube.com/c/AmirRimerTraveling Amir Rimer ..."
  ],
  [
    "Israeli Food: Beef &amp; Chicken Sitsot",
    "Home made Israeli Food: Beef and Chicken Sitsot. Easy to cook Its good in vegetable salad and its good to put it on the bread like ..."
  ],
  [
    "Teachers Try Israeli Food",
    ""
  ],
  [
    "Arayes, Pitta Stuffed With Meat - Israeli Food #IsraeliFood #Arayes #Pita #Shorts",
    ""
  ],
  [
    "Cooking up Israeli Food #Shorts",
    "Shorts Cooking an Israeli Shabbat dinner from scratch. Follow and like for more videos Let's connect on social media www."
  ],
  [
    "Amazing Hamburger - Israeli Food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "Enjoying French Israeli food at Tekes Paris #Tekes #Paris #Cuisine #Isreal",
    ""
  ],
  [
    "SUPER Lahoh - Israeli Food #Lahoh #IsraeliFood #StreetFood #Lachuch #Yemenite #Food #Pancake #Shorts",
    "Full video: https://youtu.be/kzaEJxmYgQ0."
  ],
  [
    "STUNNING Gray Crepe - Israeli Food #Crepe #IsraeliFood #StreetFood #Dessert #Tasty #Food #Shorts",
    ""
  ],
  [
    "ISRAELI FOOD 🍕 BEST Street Food Pizza Place From Italy in Florentin Tel Aviv Israel, Giuseppe Pizza",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL ISRAELI FOOD BEST Street Food ..."
  ],
  [
    "The Most Amazing Food and BBQ in Memphis | The Jewish Foodie - Episode 5 | BBQ, Whiskey &amp; Memphis",
    "Did you ever try food and BBQ in Memphis, Tennessee? Watch our food journey with some great BBQ, whiskey, meat, and ..."
  ],
  [
    "Trying Israeli Food! מנסים אוכל ישראלי! with TRAVEL WITH NOFARCY",
    "Since lockdown restrictions here in Israel have been eased, we decided to have an authentic Israeli food trip with our friend Arcy!"
  ],
  [
    "Cooking Brain - Israeli Food #Cooking #Brain #IsraeliFood #Shorts",
    ""
  ],
  [
    "Shahar Lubin cooking Israeli food on Vietnamese television - VTV4",
    "Me cooking my take on Israeli food for Vietnamese television - VTV 4. On the menu today: - Chickpea salad with mint dressing ..."
  ],
  [
    "ISRAEL NATIONAL DISH -A SHORT STORY#food #shorts #facts",
    "In Israel, every neighbourhood has its falafel stand. You might see several on the same block, especially in downtown streets."
  ],
  [
    "ISRAEL PACK UNBOXING | ISRAELI FOOD SUBSCRIPTION BOX",
    "Get 35% off on your first Israel Pack box here https://bit.ly/3csqkwT WELCOME TO MY CHANNEL! HERE ARE SOME OTHER ..."
  ],
  [
    "The Most Amazing Food and BBQ in Memphis | The Jewish Foodie - Episode 5 | BBQ, Whiskey &amp; Memphis",
    "Did you ever try food and BBQ in Memphis, Tennessee? Watch our food journey with some great BBQ, whiskey, meat, and ..."
  ],
  [
    "ISRAEL PACK UNBOXING | ISRAELI FOOD SUBSCRIPTION BOX",
    "Get 35% off on your first Israel Pack box here https://bit.ly/3csqkwT WELCOME TO MY CHANNEL! HERE ARE SOME OTHER ..."
  ],
  [
    "Trying Israeli Food! מנסים אוכל ישראלי! with TRAVEL WITH NOFARCY",
    "Since lockdown restrictions here in Israel have been eased, we decided to have an authentic Israeli food trip with our friend Arcy!"
  ],
  [
    "Cooking Brain - Israeli Food #Cooking #Brain #IsraeliFood #Shorts",
    ""
  ],
  [
    "Pasta Carbonara | ISRAELI FOOD",
    "caregiverisrael #caregiverisrael2022 #israelcaregiversalary2022 #israelcaregiverrequirementsforfilipino ##israelcaregiver ..."
  ],
  [
    "Shahar Lubin cooking Israeli food on Vietnamese television - VTV4",
    "Me cooking my take on Israeli food for Vietnamese television - VTV 4. On the menu today: - Chickpea salad with mint dressing ..."
  ],
  [
    "GRILLED LAMB LIVER #Shorts | Israeli Food | Smilymyles Vlog",
    "Shorts #Lamb #Liver #GrilledLambLiver #IsraeliFood #YummyLiver #GrilledLiver."
  ],
  [
    "Macaroni Hamin Recipe - How to Make Israeli Macaroni Casserole - Comfort Food",
    "Got a few hours or days before your guests arrive? Only have a few ingredients lying around? Then Macaroni Hamin is for you!"
  ],
  [
    "🇮🇳 Eating Israeli food in Pushkar, India $1.50",
    ""
  ],
  [
    "ISRAEL NATIONAL DISH -A SHORT STORY#food #shorts #facts",
    "In Israel, every neighbourhood has its falafel stand. You might see several on the same block, especially in downtown streets."
  ],
  [
    "Beautiful Chocolate Fountain - Israeli Food #chocolate #chocolatefountain #israelifood #shorts",
    ""
  ],
  [
    "The Shuk 2019: Israeli Food &amp; Wine Festival || Ticketsasa Events",
    "The biggest #culinaryfestival of the year is back and it's happening on March 30th & 31st from 12pm till 8pm at Ananas center ..."
  ],
  [
    "Shaksuka/try it and you will love it (Israeli food)",
    "Shaksuka Ingredients: 4pcs medium size of tomatoes 4pcs medium size of eggs 3cloves of garlic 1medium size of onion 1medium ..."
  ],
  [
    "Tel Aviv Hummus House - Traditional Israeli food in Belgrade - by Belgrade Travel Card",
    "Traditional Israeli food in the center of Belgrade at Tel Aviv Hummus House. Use your Belgrade Travel Card to get loyalty discount ..."
  ],
  [
    "Pistachio Crepe - Israeli Food",
    "Street food from another world! Yummy Guy tries to create good videos. Thank you for being here. Location: ..."
  ],
  [
    "Kerem HaTeimanim - Tel Aviv Walk, Israeli Food, Middle Eastern Food, Ethiopian, Yemen, Georgian,Thai",
    "My Food Channel - https://www.youtube.com/user/Amirimer 🎞️ My Education Channel - https://bit.ly/2FihPsL The area I visited in ..."
  ],
  [
    "Shinshinyot Adult Program Israeli Food 2202 03 09",
    ""
  ],
  [
    "Organic/Traditional Israeli Food Steam Cooked #Israel",
    "Organic Potatoes, Garlic, Chicken, mixed Chili's, Salt, Fresh Oregano and Rosemary leaves, Olive Oil."
  ],
  [
    "Israel Pack:  Israeli Food, Jewish Culture and Israel&#39;s Local Artisans #IsraelPack",
    "Get 35% off your first box: https://bit.ly/37CkcR4 Merch: https://teespring.com/stores/kandyfoxx My Poshmark Closet: ..."
  ],
  [
    "Stunning Thai Noodles - Israeli Food #thaicuisine #thaifood #israelifood #shorts",
    ""
  ],
  [
    "Eating Israeli food for A day",
    "Watch me make and eat Israeli food for a whole day!! Breakfast, lunch and dinner; all from the middle east. YUM. If you want me to ..."
  ],
  [
    "babaganush israeli food",
    ""
  ],
  [
    "Israeli food with Re&#39;em and Adi- Shakshuka",
    "The best Israeli food- Shakshuka. Now available in DVD!!"
  ],
  [
    "shakshuka Recipe|Shakshuka with fresh tomatoes|Israeli Shakshuka|Israeli Food| Food And Recipe",
    "shakshuka Recipe|Shakshuka with fresh tomatoes|Israeli Shakshuka| Israeli Food|Food And Recipe things I use   •my camera: ..."
  ],
  [
    "FAMOUS MODERN ISRAELI FOOD MUKBANG with ANNELISE!!",
    "My girlfriend Annelise and I taste test one of my NEW favorite foodie spots in LA! I always get DM's about where to go when you ..."
  ],
  [
    "Israeli food my employer&#39; favorite food. # buhay caregiver Israel",
    "Welcome to my channel. In this video I wanna some of my employer favorite food also with her family. Thank you for watching."
  ],
  [
    "Israeli food Cholent # prepration",
    "Cholent (Yiddish: טשאָלנט‎, romanized: tsholnt or tshoolnt) or hamin (Hebrew: חמין‎) is a traditional Jewish stew. It is usually ..."
  ],
  [
    "Israeli food",
    ""
  ],
  [
    "MARAK OF | CHICKEN SOUP | ISRAELI FOOD",
    "caregiverisrael #caregiverisrael2022 #israelcaregiversalary2022 #israelcaregiverrequirementsforfilipino ##israelcaregiver ..."
  ],
  [
    "Juicy Grilled Meat - Israeli Food #IsraeliFood #Meat #Grilling #Shorts",
    ""
  ],
  [
    "Israeli food salsa",
    ""
  ],
  [
    "The Israeli Food #3.AVI",
    ""
  ],
  [
    "THE TASK AS A CAREGIVER IS TO COOK MARAKOFF ISRAELI FOOD FOR THE SHABBAT NI KA MYRA AV TV",
    "Ingredients: 3 TBS. oil 2 pcs. potatoes 1:pc. 1 Kl. chicken 1 tbs. camon 1/2 TBS. Turmeric 1/8 TSP. salt 1/2 TSP. black pepper 4 ..."
  ],
  [
    "fruit salad /israeli food",
    ""
  ],
  [
    "mosaic: How Israeli Food can be the Great Uniter, with Zahav&#39;s Chef Michael Solomonov",
    "When it comes to American Jews' complex relationship with Israel, could food be the great uniter? On this episode of mosaic, we ..."
  ],
  [
    "THE GRAPE HARVEST - Daily Life in the Time Of Jesus - Israeli food- Land of milk and honey",
    "https://www.thejerusalemgiftshop.com/the-holy-land-kitchen/israeli-foods.html The DAILY LIFE IN THE TIME OF JESUS invites ..."
  ],
  [
    "ETHIOPIAN FOOD - Israeli Food #ETHIOPIANFOOD #ETHIOPIANSTREETFOOD #IsraeliFood #TelAviv #TLV #Shorts",
    "Full Video: https://youtu.be/wkP3p_ijHSc."
  ],
  [
    "Getting the best Shawarma in Tel Aviv, Israel at the Carmel Market!",
    "If you find yourself in Tel Aviv, Israel, make sure to find a little time to visit the Carmel market and get some Shawarma! This is ..."
  ],
  [
    "Trying Israeli Food Specialties ,U S  Embassy Tel Aviv, Israel",
    "Trying Israeli Food Specialties,U S  Embassy Tel Aviv, Israel September 20, 2017."
  ],
  [
    "Extraordinary Churro And Chocolate Treats -  Israeli Food #churro #tasty #chocolate #israelifood",
    ""
  ],
  [
    "Icecream Bun - Israeli Food #israelifood #icecream #dessert #shorts",
    ""
  ],
  [
    "Israeli Food Taste Test - Get Connected 2019",
    ""
  ],
  [
    "Kya foood spread hai 😍👌| Mini Israel Cafe Kasol | Best israeli food in town | #kasol #foodshorts",
    ""
  ],
  [
    "Food Fight: Israel Invented Hummus, Falafel And Shawarma",
    "Has Israel's national airline bitten off more than it can chew? El Al has been giving us lessons in culinary history. Shame their ..."
  ],
  [
    "Israeli Food Shabbath || CRIS TV",
    "As many of you probably know, it's not easy to get into Israel at the moment. It's not the same, but I try to cheer myself up by making ..."
  ],
  [
    "What is Israeli Food? What is Jewish Food? Take a Culinary Tour with a Tour Guide of Israel",
    "From a Tour Guide of Israel: There are so many different ways to experience Israel. One interesting, unconventional and delicious ..."
  ],
  [
    "TRYING ISRAELI SNACKS!   *food challenge*",
    "TIKTOK: @isabelnielsen2 INSTAGRAM: @isabel98x https://www.facebook.com/Isabel-Julie... WATCH MY LAST VLOG HERE: ..."
  ],
  [
    "Shakshuka. traditional israeli food | 4K footage",
    "shakshuka is a israeli origin dish of eggs poached in a sauce of tomatoes."
  ],
  [
    "Israeli food OMG!!! #shorts #dessert #pastry #sweet",
    "shorts Follow me for more hidden gems in Israel and Europe Instagram/pinterest/tiktok: Thebonvoyagers Facebook: ..."
  ],
  [
    "Unique Icecream Treat - Israeli Food #IceCream #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "Tasty Fruit Crepe - Israeli Food #Chocolate #Pomegranate #Mango #Cherry #Lychee #Pineapple #Shorts",
    ""
  ],
  [
    "RAINBOW Waffle - Israeli Food #Waffle #IsraeliFood #Dessert #StreetFood #Food #Tasty #Israel #Shorts",
    ""
  ],
  [
    "Beautiful Filipino Soup 🍲 Israeli Food #Soup #FilipinoFood #PhilippinesFood #StreetFood #Shorts",
    ""
  ],
  [
    "MUKBANG Episode 4 - ISRAELI FOOD",
    ""
  ],
  [
    "One Night in the Jerusalem Market (Israeli Food)",
    "We spend the night traveling from Tel Aviv to Jerusalem (and back) so we could meet a friend at the Mahane Yehuda market."
  ],
  [
    "TASTY Falooda - Israeli Food #Falooda #IndiaFood #PersianFood #Faloodeh #IsraeliFood #Tasty #Shorts",
    ""
  ],
  [
    "Trying Israeli Food | Israel Snack Crate",
    "CLICK FOR MORE INFO ⭐️ SUBSCRIBE TO MY CHANNEL! https://www.instagram.com/shamthebaddest/ ..."
  ],
  [
    "Israeli Food by Yaniv Cohen the Spice Detective - Miami Design District Jaffa Restaurant",
    ""
  ],
  [
    "Israeli kitchen and Israeli food",
    "food."
  ],
  [
    "What&#39;s On The Menu? w/ Jaz the Rapper -  Israeli Food",
    "\"What's on the Menu?\" streams live on Caffeine every Friday @ 6pm EST . This show is about trying out and tasting dishes ..."
  ],
  [
    "The Israeli food channel - Dinner&amp;movie night - Promo",
    ""
  ],
  [
    "Novy Goad Israeli food",
    ""
  ],
  [
    "BBQ Legend - Israeli Food #BBQ #Barbecue #IsraeliFood #Shorts",
    ""
  ],
  [
    "Mike Colameco&#39;s Real Food: Israeli Food &amp; Wine Episode#2",
    "For some of my more recent work, please visit: https://rbszu6.wixsite.com/szuter Mike Colameco's Real Food: Israeli Food & Wine ..."
  ],
  [
    "TASTY Malabi - Israeli Food | Middle Eastern Food #Malabi #Muhallebi #IsraeliFood #Dessert #Shorts",
    "Full Video: https://youtu.be/9P7rgjlZHsQ."
  ],
  [
    "TRYING WEIRD ISRAELI FOOD | TRAVEL VLOG: Destination Israel | Chapter 6 | Gabby Rueff",
    "In this video we are trying WEIRD SNACK FOOD here in Israel!!! Hope y'all like it! :)"
  ],
  [
    "Grilled Chicken&amp;spaghetti complete israeli food.మనం కూడా try చేద్దామా.",
    "Grilled Chicken&spaghetti complete israeli food.మనం కూడా try చేద్దామా."
  ],
  [
    "Beautiful Red Waffle - Israeli Food #Food #StreetFood #IsraeliFood #Dessert #Waffle #Waffles #Shorts",
    ""
  ],
  [
    "Cabbage casserole(kruv pashtida israeli food)",
    "Cabbage casserole(Kruv pashtida israeli food) Ingredients: 1cup cabbage cut into strips 2eggs 2tbsp kotage Grated mozzarella ..."
  ],
  [
    "Delicious Israel food tour pt. 2 - Mahane Yehuda market",
    "Delicious Israel is a touring company offering curated food tours around the markets & backstreets of Tel Aviv & Jerusalem."
  ],
  [
    "STUNNING Red Crepe - Israeli Food #Crepe #IsraeliFood #Tasty #StreetFood #Food #Dessert #Shorts",
    ""
  ],
  [
    "NYC: Israeli Food @ Mama Kitchen in Crown Heights Brooklyn, Mafrum w/ couscous, Hummus (Sabich), etc",
    "Mafrum (Libyan Stuffed Vegetables, a mixture of ground beef and spices is sandwiched inside a potato and cooked in tomato ..."
  ],
  [
    "Savory Crepes - Israeli Street Food | Exotic Israeli Food - Labaneh &amp; Eggplant CREPE In TLV Israel",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL Merch - https://tinyurl.com/uhblkc7 ..."
  ],
  [
    "Waitrose claiming Israeli food as being British",
    "Waitrose supports Israel claiming their food as British. The anti-poverty charity War on Want accused supermarket retailer ..."
  ],
  [
    "Authentic Israeli Food in Melbourne at MIZNON",
    "The only Israeli restaurant in Melbourne CBD. Delicious food, good vibes and very authentic. A must try, especially the pita range, ..."
  ],
  [
    "Mike Colameco&#39;s Real Food: Israeli Food &amp; Wine Episode#1",
    "For some of my more recent work, please visit: https://rbszu6.wixsite.com/szuter Mike Colameco's Real Food: Israeli Food & Wine ..."
  ],
  [
    "D FEEDING BABY JECELLE ISRAELI FOOD",
    ""
  ],
  [
    "Israeli food In NY - The Spice Detective",
    ""
  ],
  [
    "Milkshake With Pancakes - Israeli Food #Milkshake #Pancake #IsraeliFood #Shorts",
    ""
  ],
  [
    "ISRAELI FOOD FOR LUNCH | HEALTHY FOODS | SUPER YUMMY! #shorts",
    ""
  ],
  [
    "Vlog 2 | Israeli Food Mukbang | Aesthetic Random",
    "In this video we are eating Israeli food by Mommy Susan. Thanks to Mommy Susan & Angela's Mom Without them both this video ..."
  ],
  [
    "How to Make Schnitzels | Cooking with Omer | kitchen Diary | 2021 | Israeli Food",
    "Cooking with Omer / Schnitzels / Episode 1."
  ],
  [
    "AUTHENTIC ISRAELI FOOD | OREN’S  HUMMUS LOS GATOS DOWNTOWN | BEST FALAFELS",
    "losgatos #losgatostown #losgatosdowntown Follow me on Instagram ..."
  ],
  [
    "AMERICAN TRIES ISRAELI FOOD FOR THE FIRST TIME (Part 2): Yumbox | Tasting | Mukbang",
    "This video is intended for audiences 13 and older Part one: https://www.youtube.com/watch?v=TOj7KLhbLOc Time to finish the ..."
  ],
  [
    "Israeli Food at Design District Miami Jaffa Restaurant by the Spice Detective",
    ""
  ],
  [
    "AMAZING Ethiopian Injera - Israeli Food | Middle Eastern Food, Ferment Teff Flour | Tel Aviv, Israel",
    ""
  ],
  [
    "Yummy Israel Food Spread | Israel popular food",
    ""
  ],
  [
    "Korean Best Shaved Ice - Israeli Food #KoreanStreetFood #Bingsu #IsraeliFood #Shorts",
    ""
  ],
  [
    "An Israeli food SHAKSHOUKA is famous at Yama Cafe || Coffee House &amp; Restaurant",
    "YAMA COFFEE HOUSE & RESTAURANT IS AN ADVENTURE COMPANY CAFE BASED IN CHANGSPA ROAD NEAR OMASILA ..."
  ],
  [
    "Colorful Waffles 🧇 Israeli Food #Waffle #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "An Israeli food startup wants humans to eat fruit fly larvae",
    "An Israeli food startup wants humans to eat fruit fly larvae in order to save the planet Article in Greek Language ..."
  ],
  [
    "Israeli Food Culture #Israelian #Jewish #Religious #Birthday #Party",
    ""
  ],
  [
    "Israeli Food Bank - Plates",
    "Y&R Tel Aviv."
  ],
  [
    "Israeli Food In Kerem HaTeimanim - Eating Middle Eastern Food, Ethiopian Food, Yemen | Tel Aviv Walk",
    "My Travel Channel - https://bit.ly/3dh30Fe 🎞️ My Education Channel - https://bit.ly/2FihPsL Location in Google Maps: ..."
  ],
  [
    "Tel Aviv Israeli Street Food Market - Sarona Market - Walking In Israel - Israel Street Walk",
    "My Food Channel - https://www.youtube.com/user/Amirimer 🎞️ My Education Channel - https://bit.ly/2FihPsL The area I visited in ..."
  ],
  [
    "Best Meat Restaurant In Tel Aviv | Israeli Food | #meat #streetFood #israelifood #shorts",
    ""
  ],
  [
    "Rajiv Israeli Food",
    ""
  ],
  [
    "Tsitsot Dagem ve yerakot 🥕 🐟 Israeli foods//Check it out #shorts",
    ""
  ],
  [
    "Pretzel Pizza 🥨 🍕 Israeli Food #pizza #pretzel #israelifood #shorts",
    ""
  ],
  [
    "STUNNING FROZEN YOGURT - Israeli Food #Frozenyogurt #Yogurt #IceCream #Dessert #StreetFood #Shorts",
    ""
  ],
  [
    "Tsitsot Dagem ve yerakot 🥕 🐟 Israeli foods//Check it out #shorts",
    ""
  ],
  [
    "Pretzel Pizza 🥨 🍕 Israeli Food #pizza #pretzel #israelifood #shorts",
    ""
  ],
  [
    "STUNNING FROZEN YOGURT - Israeli Food #Frozenyogurt #Yogurt #IceCream #Dessert #StreetFood #Shorts",
    ""
  ],
  [
    "Israeli Foods 🥗🥙🧆#yummy#shorts",
    ""
  ],
  [
    "AMERICAN AND BRAZILIAN TRY ISRAELI FOOD!!!!! 🇮🇱",
    "We opened our yummy box and this time we tried \"ISRAELI\" food let us know what do you think what should be our next box, ..."
  ],
  [
    "Diffirent Kinds of israeli 🇮🇱Foods",
    "The yammier,the tastier     israeli foods that you taste only in israel they sales different kinds of delicious foods to satisfied ..."
  ],
  [
    "New Israeli coalition deal includes plan to advance annexation of the occupied West Bank",
    "Israel's prime minister-designate, Benjamin Netanyahu, has agreed to a clause in the coalition deal that would extend Israeli ..."
  ],
  [
    "Israeli foods/The Lucky Hands Kitchen Channel",
    ""
  ],
  [
    "Israeli salad#satisfying healhty food goodfor the heart #shorts",
    ""
  ],
  [
    "Soft Pretzel - Israeli Food #SoftPretzel #Pretzel #IsraeliFood #Shorts",
    ""
  ],
  [
    "Street Food in Israel - INSANE Kugel + Herring | ISRAELI FOOD Tour in Mea Shearim, Jerusalem, Israel",
    "The food spots I visited in this video: Avichail Bakery Address: Pri Hadash St 8, Jerusalem Nechama Bakery Address: Ha-Rav ..."
  ],
  [
    "Eating Israeli foods : Eating food from around the world",
    ""
  ],
  [
    "Food in 1960s Israel",
    "In this program, Gil Hovav (Culinary Journalist Food Critic, & Television Personality discusses growing up eating food in Israel, ..."
  ],
  [
    "i took my ISRAELI BOYFRIEND (חבר ישראלי) for ISRAELI FOOD (שווארמה)",
    "Jayden is from Israel and he was was missing the food like crazy! I decided to take him to get some Israeli food here in South ..."
  ],
  [
    "Israel&#39;s Netanyahu says he has formed new government • FRANCE 24 English",
    "Veteran leader Benjamin Netanyahu announced that he had formed a new Israeli government on Wednesday, returning to power ..."
  ],
  [
    "Crepe With Cookie - Israeli Food #Crepe #Cookie #IsraeliFood #Shorts",
    ""
  ],
  [
    "ISRAELI SALAD RECIPE #food #salad #vegan #recipe",
    "Did you know Israeli Salad is the name of this mix vegies? I also never knew until I searched it. #food #salad #vegan #saladrecipe ..."
  ],
  [
    "Israeli Food &amp; Side-Hustle Talk with Shir @shirisawesome",
    "PITA INGREDIENTS: - 2 (1/4-ounce) packages (or 14 grams) active dry yeast - 1 tsp sugar - 1 & 1/2 cups lukewarm water - 4 cups ..."
  ],
  [
    "Israeli foods or goods",
    "You can make a difference and a stand to the treatment of the Palestinian people by Israel by not buying any Israeli foods or ..."
  ],
  [
    "Excellent Icecream - Israeli Food #IceCream #IsraeliFood #Dessert #Shorts",
    ""
  ],
  [
    "Take A Sneak Peek Into How We Celebrate Hanukkah In Our Orthodox Jewish Home Donut Sufganiyot Recipe",
    "Take A Sneak Peek Into How We Celebrate Hanukkah In Our Orthodox Jewish Home Donut Sufganiyot Recipe Holiday Decorate ..."
  ],
  [
    "Israel Airstrikes Near Damascus; Iran Pushing Russia to BLOCK Israel in Syria? | Watchman Newscast",
    "On today's Watchman Newscast, host Erick Stakelbeck breaks down the overnight Israeli airstrikes on a Hezbollah facility near the ..."
  ],
  [
    "AMRITSAR | A Sikh Family Hosted an Israeli Girl 🇮🇳🇮🇱",
    "i went with @COCOBOY369 I travel all over the world and show you how to live a life of freedom and how a woman can ..."
  ],
  [
    "Jewish acapella group parodies songs to highlight their heritage",
    "They are called Six 13 and their newest parody involves the music of Sir Elton John."
  ],
  [
    "Gopi ki rasoi | Ultimate￼ राजस्थानी थाली, बेजड़ की रोटी,आलू प्याज़ पनीर की सब्ज़ी | Jaipur food tour",
    "rajasthanifood #rajasthanithali #streetfood #indianfood #jaipurfoodtour #jaipur #pinkcity #virtualbanjara #rajasthan Food quality ..."
  ],
  [
    "Far-Right Israeli Government is Most Extreme Yet",
    "For $5 a month, become a Useful Idiot! Get extended interviews, Thursday Throwdowns, and a chance to have your comment ..."
  ],
  [
    "Day 11, Israel! #israel #latkes #food #foodie #shortsfeed #shorts #shortsyoutube",
    ""
  ],
  [
    "BEST SHAWARMA IN ISRAEL TOUR 2014",
    "On our 2013 Israel Tour , we took a video of this man preparing his famous shawarma for our COP tour group. We thought the ..."
  ],
  [
    "TML NEWS   What Will Christmas Dinner of the Future Look Like Israeli Startups Unveil New Food Tech",
    "Locust as an alternative upgraded meat!"
  ],
  [
    "Why Christians Are SERIOUSLY CONCERNED About Israel’s New Government",
    "Check out our end-of-year fundraiser! Every dollar you give will be doubled until December 31st: https://serveisrael.com/double/ ..."
  ],
  [
    "Why INDIAN Love ISRAELIS ? | INDIA 🇮🇳",
    "After the first part that i did on why Israeli people chose to travel to India ,I went to explore why Indians love the Israeli people so ..."
  ],
  [
    "JEWISH Christmas Dinner?! | How To Make A Chinese-American FEAST At Home!",
    "Eating Chinese food on Christmas is damn near as American as apple pie. It's a fact, Jews have been eating Chinese food on ..."
  ],
  [
    "Sufganiyot Israeli Donuts  -traditionally eaten during Hanukkah #fyp #amazing #satisfying #viral",
    ""
  ],
  [
    "street food ISRAEL 🇮🇱 Шаурма в Израиле. #shorts #israel #food",
    ""
  ],
  [
    "8 Days Alone in World’s Most Dangerous Country",
    "Get My Top 100 Travel Pics for FREE! https://bit.ly/3Fsk0qo - SUBSCRIBE for More Travel Videos: http://bit.ly/2hyQnZ1 Check out ..."
  ],
  [
    "The Reason Why Lionel Messi Was Furious With Salt Bae After The Final",
    "Leo Messi was having the time of his life after winning the World Cup. Then, Salt Bae decided to do his best to spoil La Pulga's ..."
  ],
  [
    "Israel: The Startup Nation of Innovators | Technology Highlights | Insights on TBN Israel",
    "On this episode of Insights Israel & the Middle East, host Mati Shoshani dives into what transformed Israel from a nation behind ..."
  ],
  [
    "&quot;Fake Che Guevara&quot; | Ty Jones Disagrees With Recent Godfrey Guest: Israeli Filmmaker Rudy Rochman",
    "Do you agree? Ty Joins has a few grievances regarding recent Godfrey guest: Filmmaker & Activist Rudy Rochman. Watch Rudy ..."
  ],
  [
    "History of Latkes",
    "Thank you to Wondrium for sponsoring today's video! Signup for your FREE trial to Wondrium here: http://ow.ly/o1rR50LVqHS ..."
  ],
  [
    "Israel Zuckerman: Sponsor Food at Masbia and Get The Giving Table Cookbook",
    "https://www.masbia.org/givingtable Masbia needs your help to feed the needy. Every donation makes a difference regardless of ..."
  ],
  [
    "What makes Israelis come to India after the army? 🇮🇳🇮🇱",
    "I travel all over the world and show you how to live a life of freedom and how a woman can manage anywhere If you want to ..."
  ],
  [
    "PBS News Weekend full episode, Dec. 24, 2022",
    "Saturday on PBS News Weekend, we look at the controversial facial recognition technology being used at some airports. Then ..."
  ],
  [
    "Christmas Celebrations in the Northern city of Haifa, Israel | 2022",
    "The Northern city of Haifa is one of the best places in Israel to experience the festive season. During this time Haifa is decorated ..."
  ],
  [
    "Ordering What The Car In Front Orders From KFC #mukbang #kfcchicken #kfcmukbang #eatingshow",
    ""
  ],
  [
    "Jewish mandel bread?? Yes please!! # #shorts #top10 #trendingshorts #trending #jewishfood #food",
    ""
  ],
  [
    "Bishop Nathanyel On His Origin Story, The Creation Of IUIC &amp; Kyrie Irving",
    "Bishop Nathanyel from Israel United In Christ returns to share his origin story, how the IUIC was created, and Kyrie Irving."
  ],
  [
    "How to maintain eye-contact during the Interview | UPSC Interview FAQs | Israel Jebasingh",
    "UPSCINTERVIEW #MOCKINTERVIEW #TIPS For registration, call 7397767226 Interview Tips from RA Israel Jebasingh ..."
  ],
  [
    "MTOI Weekly Torah Study | Mikeitz | Genesis 41:1 - 44:17",
    "Welcome to our weekly Torah Study. This week's Parsha is Mikeitz, Genesis 41:1 - 44:17 Don't miss out on new teachings every ..."
  ],
  [
    "Christmas market in the old city of Jerusalem - join me for a delicious and historical tour",
    "Information about the Christian Quarter, Jerusalem itself will be provided after this announcement. Should you wish to support me ..."
  ],
  [
    "Delivering food in the rain in Israel #2 (WOLT)",
    ""
  ]
]