[
  [
    "Top 10 Mexican Foods",
    "Hope you're hungry, because this is one delicioso list! Join http://www.WatchMojo.com as we count down our picks for the Top 10 ..."
  ],
  [
    "EXTREME Mexican Street Food in Oaxaca | INSANE Mexican Street Food Tour in Oaxaca, Mexico",
    "Mexican Street Food in Oaxaca, Mexico, is some of the BEST street food in the world! Check out ..."
  ],
  [
    "Mexican Street Food in Tijuana 🇲🇽 INSANE TACOS TOUR IN MEXICO 🌮(Part 2)",
    "Watch - Tijuana Street Food (Part 1): https://youtu.be/UT4hPMISonI Thanks to Jeffrey Merrihue: ..."
  ],
  [
    "I Only Ate MEXICAN FOOD🇲🇽 for 24 Hour Challenge | Veggie Paaji",
    "Mexican Food Challenge My Fun Cooking Channel : @Cooking Paaji My Fun Vlog Channel : @Travelling Paaji Veggie Paaji ..."
  ],
  [
    "Mexican Food for 24 Hours || Food Challenge",
    "Download Magicpin App fron here- http://magicpin.in/getapp/cravingsandcalories Referral Code- cravingsandcalories Instagram ..."
  ],
  [
    "$1 Tacos VS $113 Tacos in MEXICO!! Super RARE Mexican Food!!",
    "SECOND CHANNEL!! MORE BEFRS » http://bit.ly/2pQYjvM​ BEFRS MERCH » https://bit.ly/ShopBEFRS SUPPORT OUR ..."
  ],
  [
    "12 Recipes For A Perfect Mexican Dinner",
    "Looking to spice up your dinners? Well this video sure will help you! With these 12 cheesy, spicy, sweet, and amazing recipes, ..."
  ],
  [
    "Mexican Street Food in Surat | Veggie Paaji",
    "Veggie Paaji Shows mexican street food in Surat. My Fun Cooking Channel : @Cooking Paaji My Fun Vlog Channel : @Travelling ..."
  ],
  [
    "Mexican Rice Recipe | Easy One Pot Meal | How To Make Mexican Rice | Kanak&#39;s Kitchen",
    "Hey Guys Many of you requested for a quick Mexican rice recipe, so here's the recipe for you. Do give a big like to this recipe in ..."
  ],
  [
    "Mexican food every foodie should try",
    ""
  ],
  [
    "Extreme MEXICO CITY STREET FOOD TOUR with 5 Mexican Guys CDMX!",
    "Check out 5 Mexican Guys: https://goo.gl/ankJN3 ▻SUBSCRIBE for 2 new videos per week: http://bit.ly/MarkWiensSubscribe ..."
  ],
  [
    "Mexican Rice Recipe | Mexican Rice- 2 ways | Quick Rice Recipe | मेक्सिकन राइस | Chef Sanjyot Keer",
    "Full Written Recipe for Mexican Rice I'll be making two different ways to make the Mexican rice; you can choose any method as ..."
  ],
  [
    "LA Food Truck Serves The Juiciest Tacos | Food Insider",
    "Birrieria San Marcos has some of the best tacos in Los Angeles thanks to their specialty: birria tacos. These tacos are bathed in ..."
  ],
  [
    "Mexican Rice | मैक्सिकन चावल | How to make Mexican Rice at home | Chef Ranveer Brar",
    "Craving for spicy Mexican rice? Try it at home. It's a perfect one-pot recipe to try in these times.. #MexicanRice #Easyricerecipe ..."
  ],
  [
    "World&#39;s Cheapest Tacos!?! ULTIMATE Playa Del Carmen Street Food Tour!",
    "WATCH OUR MAIN CHANNEL » http://bit.ly/BestEverFoodReviewShow AMERICAN EATS IRAN!"
  ],
  [
    "The Ultimate MEXICAN STREET FOOD TACOS Tour of Mexico City! (ft. La Ruta de la Garnacha)",
    "Subscribe to Lalo's channel: https://www.youtube.com/user/vpedoardo ▻T-shirts available now: https://migrationology.com/store/ ..."
  ],
  [
    "The Best Tacos In LA | Best Of The Best",
    "INSIDER's Joe Avella and Sydney Kramer visit four of the best places to get tacos in Los Angeles. They visit Sonoratown ..."
  ],
  [
    "Enchiladas Recipe Video | Veg Enchiladas | How to Make Enchiladas | Mexican Food | Jay Patel",
    "Enchiladas Recipe Video, learn how to make Enchiladas / Veg Enchiladas at home. Enchiladas Recipe Video | Veg Enchiladas ..."
  ],
  [
    "All You Can Eat PRIME RIB and TACOS at the Best MEXICAN BUFFET in LA!",
    "All You Can Eat Prime Rib and Tacos at the Best Mexican Buffet in LA! If you are looking for the best Mexican buffet in Los ..."
  ],
  [
    "Top 10 Mexican Dishes | Mexican cuisine | Famous Food of Mexico | Hotel Management Student",
    "ChefDheerajBhandari #Continentalcuisine top ten Mexican Dishes, Mexican cuisine, best dishes of Mexican cuisine, avocado ..."
  ],
  [
    "Ultimate Mexican Street Food Tour!! MEAT JUICE TACOS + Sonoran Hot Dogs in Tucson, Arizona!!",
    "Eating the Original Chimichanga: https://youtu.be/sTzIkTh580o NEW T-shirts and caps available now: ..."
  ],
  [
    "Mexican Cheesy Vegetable Quesadilla | Simple n Easy Recipe | Chetna Patel Recipes",
    "Ingredients : (6 will Ready from this measurement ) Tortilla : 1 Cup - Maida Salt to taste 1/2 tsp - Powder Sugar 1 tsp - Oil 1 tsp ..."
  ],
  [
    "Mexican tacos 🌮 adiripotayi assalu | Food truck in USA #melodymocktail #tacos #teluguvlogsfromusa",
    ""
  ],
  [
    "Most UNIQUE Food in MEXICO!! SUPER RARE Food Tour!! (FULL DOCUMENTARY)",
    "SECOND CHANNEL!! MORE BEFRS » http://bit.ly/2pQYjvM​ BEFRS MERCH » https://bit.ly/ShopBEFRS SUPPORT OUR ..."
  ],
  [
    "MEXICAN FOOD in Mumbai | Cheesy NACHOS, Crunchy TACO, Mexican PIZZA at this Chowpatty outlet",
    "SUBSCRIBE for delicious eats, travel recommendations & MORE! https://www.youtube.com/sugarspiceniceindia Instagram ..."
  ],
  [
    "Eating only Mexican food for the whole day! #shorts #mexico",
    "Instagram: @tommywinkler Snapchat: @tommy2910 Twitter: @tommy_winkler_ TikTok: @tommywinkler."
  ],
  [
    "Best Mexican Cuisine Challenges | MasterChef Australia | MasterChef World",
    "Some of the best dish inspirations to cook Mexican Cuisine! Subscribe to MasterChef World here: ..."
  ],
  [
    "Most INSANE LAMB PIT BARBACOA - Mexican Food in Texcoco + AZTEC Pyramids, Mexico!",
    "SUBSCRIBE for 2 new videos per week: http://bit.ly/MarkWiensSubscribe ▻T-shirts available now: ..."
  ],
  [
    "Mexican food 🍱 Rancherò Tacos 🌮 Tampa | Florida #melodymocktail #teluguvlogsfromusa #tampa #food",
    ""
  ],
  [
    "Mexican Veg Burritos Recipe | How To Make Burrito | Homemade Burritos Recipe",
    "Mexican Veg Burritos Recipe | How To Make Burrito | Homemade Burritos Recipe Ingredients : Oil Some cumin seeds(jeera) 5-6 ..."
  ],
  [
    "Mexican Food Recipes. Traditional Mexican Cooking",
    "The basics of Mexican Food. Authentic interior Mexican Cuisine from Jauja Cocina Mexicana. Awarded \"One of the Best in ..."
  ],
  [
    "Guy Fieri Visits Restaurant Serving Ridiculous Modern Mexican Dishes | Diners Drive-Ins &amp; Dives",
    "Guy Fieri is in Cleaveland, Ohio to visit a beloved modern Mexican restaurant serving knock-out Mexican dishes with plenty of ..."
  ],
  [
    "Gorditas de Comal De Mi Rancho a Tu Cocina",
    "Gorditas de Comal De Mi Rancho a Tu Cocina, hoycocinando en el rancho les muestro como ago yo las gorditas de comal con ..."
  ],
  [
    "How to make A CHRISTMAS FEAST for the HOLIDAYS!!! MEXICAN COOKING!!",
    "Make sure that you have the bell turned on, so you will definitely not miss any of our videos!! Happy Holiday feast making making!"
  ],
  [
    "क्या CID आई एक Restaurant में &quot;Mexican&quot; खाना खाने? | CID | 17 Dec 2022 | Full Episodes",
    "CID is a crime show that will take you into the thrilling world of danger and criminals. The team will solve the cases and bring ..."
  ],
  [
    "Two Brothers Make New York&#39;s Spiciest, Juiciest Birria Tacos | Food Insider",
    "Birria-Landia is a taco truck in the Jackson Heights neighborhood of Queens, New York, that is getting praise left, right, and center."
  ],
  [
    "The BEST Mexican Restaurant SALSA ROJA Recipe (+ the secret ingredient)",
    "Getcha Some APC BBQ Rubs Here: https://www.pitmaster.us/ Years ago I used to have a restaurant down in the Tex-Mex and ..."
  ],
  [
    "Wednesday&#39;s Jenna Ortega &amp; Luis Guzmán Eat Mexican &amp; Puerto Rican Food | Taste Buds | Netflix",
    "In this new episode of Taste Buds, 'Wednesday' star Jenna Ortega (Wednesday Addams) and her onscreen dad Luis Guzmán ..."
  ],
  [
    "INDIANS TRYING MEXICAN FOOD FOR THE FIRST TIME",
    "location - Booth 49, Sector 8-B, Near Sector 8, Chandigarh https://www.google.co.in/maps/dir//30.741016,76.7947476/@30.74116 ..."
  ],
  [
    "Amazing Mexican Street Food Compilation | Tasty TACOS and BURRITO Videos | #168",
    "Hi Everyone! Today we made a satisfying and tasty Mexican food compilations video. Stay tuned for these kinds of tasty fo od ..."
  ],
  [
    "Using Ancient Tools To Make Traditional Mexican Chicken Mole | Passport Kitchen | Epicurious",
    "Chef Saúl Montiel from Cantina Rooftop in New York returns to Epicurious for the next installment of Passport Kitchen, this time ..."
  ],
  [
    "✨ Yummy Mexican Foods! ✨ | Tiktok Compilation",
    "Hello there, everyone! Don't forget to like, comment and subscribe! and please let me know what kind of compilation videos you'd ..."
  ],
  [
    "Top 10 Most Popular Mexican Foods | Foods Around the World",
    "Top 10 Most Popular Mexican Foods All the images have been used by permission for use as copyright free content."
  ],
  [
    "Cheesy Tostada from California Burrito 🌯 😍 || Mexican Food 🍲 😋",
    ""
  ],
  [
    "Cheesy Vegetable Quesadillas | Popular Mexican Food Recipe | Kanak&#39;s Kitchen",
    "Watch how to make Vegetable Quesadilla recipe. A very popular mexican recipe stuffed with cheese and a lot of healthy veggies."
  ],
  [
    "3 Unbelievable Mexican Meals Under 15 Minutes",
    "Shop Great Jones! https://prohomecooks.com/collections/great-jones-pots-and-pans Mexican Street Corn Blog Post: ..."
  ],
  [
    "How a Master Chef Runs the Only Two Michelin-Starred Mexican Restaurant in America — Mise En Place",
    "At two-Michelin-starred Californios in San Francisco, chef and owner Val Cantu aims to honor and preserve the ingredients and ..."
  ],
  [
    "Full day of Mexican! @agaveazulcocinamex 😍😍 #shorts #mexicanfood #birria #tacos #foodie #eating",
    ""
  ],
  [
    "Mexican Snacks | Kids Try | HiHo Kids",
    "We're making a Kids Try Cookbook! Sign up for updates at: http://kidstry.co Sponsor this series: http://www.cut.com/sponsorship ..."
  ],
  [
    "Mexico&#39;s Extreme Corn Obsession!! DAY to NIGHT Street Food in Oaxaca!",
    "WATCH OUR MAIN CHANNEL » http://bit.ly/BestEverFoodReviewShow MOST UNIQUE FOOD IN MEXICO ..."
  ],
  [
    "Chicken Mexican Tacos Recipe | Tacos With Chicken Filling | The Bombay Chef – Varun Inamdar",
    "Learn how to make Chicken Mexican Tacos at home with chef Varun Inamdar only on Get Curried. A taco is a traditional Mexican ..."
  ],
  [
    "How to make Spanish Mexican Red Rice Arroz Rojo (Traditional &amp; Easy Recipe) #shorts",
    "SUBSCRIBE ᕼEᖇE! ➡ https://bit.ly/2rNLvXR Business Email ➡ lov.kari19@gmail.com #shorts Spanish or Mexican rice is ..."
  ],
  [
    "You Vs. Me: Mexican Food",
    "Abuelita over Swiss Miss. Subscribe to BuzzFeed's newest channel! Check us out on Facebook! - facebook.com/perolike Pero ..."
  ],
  [
    "What I Eat In A Day | Delicious Indian &amp; Mexican food #shorts #youtubeshorts #foodie #whatieatinaday",
    ""
  ],
  [
    "Orignal Mexican Burrito Bowl | Burrito Bowl Recipe | Veg Burrito Bowl | Mexican Rice Recipe",
    "In this video we will be preparing Mexican Burrito Bowl, straight from Mexican Cuisine with Layers of Mexican Rice, Refried Beans ..."
  ],
  [
    "Mexico&#39;s Extreme Corn Obsession!! DAY to NIGHT Street Food in Oaxaca!",
    "WATCH OUR MAIN CHANNEL » http://bit.ly/BestEverFoodReviewShow MOST UNIQUE FOOD IN MEXICO ..."
  ],
  [
    "Street Food in Oaxaca - CHEESE CORN CHAMPION and Mexican Meat Alley Tour in Mexico!",
    "SUBSCRIBE for 2 new videos per week: http://bit.ly/MarkWiensSubscribe ▻T-shirts available now: ..."
  ],
  [
    "Americans Try Mexican Food For The First Time! (Menudo, Chapulines, Chiles en Nogada)",
    "Americans try some of Mexico's favorite dishes for the first time! From Menudo to Huitlacoche tacos, what do they think about these ..."
  ],
  [
    "God I miss eating Mexican food #comedy #podcast #cilantro #cooking #restaurant #funny #jokes #shorts",
    ""
  ],
  [
    "Mexican Chilaquiles | Rating Breakfast Around The World",
    "Shorts #Breakfast #Chilaquiles."
  ],
  [
    "Uncle Roger HATE Great British Bake Off Mexican Week (ft. Joshua Weissman)",
    "British people coming for Mexican food now... How they gonna do? Go subscribe to Uncle @JoshuaWeissman, he the best!"
  ],
  [
    "Mexican Food Safari | Mexican Cuisine",
    "Mexican cuisine is one of the most ancient and developed on earth. In tonight's episode, Mexican expatriates in Australia ..."
  ],
  [
    "These Are Hands Down The Best Mexican Restaurants In The U S",
    "Mexico would be worth visiting even if you did nothing but eat in restaurants. However, not all of us have the time, resources, ..."
  ],
  [
    "Quesadilla | Veg Quesadilla Recipe | Cheesy Quesadilla | Mexican style Quesadilla | Tortilla Recipe",
    "Quesadilla | Veg Quesadilla Recipe | Cheesy Quesadilla | Mexican style Quesadilla | Tortilla Recipe Quesadilla is a lovely dish ..."
  ],
  [
    "Eating At The Most VIRAL MEXICAN Restaurant... (HOT CHEETO FOOD COMBOS)",
    "A portion of today's video is sponsored by DUER Shop Duer here: ..."
  ],
  [
    "Mexican Nachos Sandwich😵🥵|| Indian food",
    "trendingfood #streetfoodindia #trendingvideo #streetfood #shorts #food #foodies #indianstreetfood #recipes #youtubeshort ..."
  ],
  [
    "How a Master Chef Runs the Only Two Michelin-Starred Mexican Restaurant in America — Mise En Place",
    "At two-Michelin-starred Californios in San Francisco, chef and owner Val Cantu aims to honor and preserve the ingredients and ..."
  ],
  [
    "Most Popular Mexican Quesadilla In Surat #shorts",
    "MEXICAN QUESADILLA: \"Mexican Spicy Salsa\" Opp. Kings Ford Showroom, Surat, Gujarat (India) Daily Sale It's Very Tasty ..."
  ],
  [
    "Traditional Mexican cuisine - ancestral, ongoing community culture, the Michoacán paradigm",
    "UNESCO: Representative List of the Intangible Cultural Heritage of Humanity - 2010 URL: ..."
  ],
  [
    "Are these foods Mexican? ft. TheCrazyGorilla",
    "We asked our Mexican Moms how well they know Mexican foods and items! Did any of these surprise you? SUBSCRIBE ..."
  ],
  [
    "Eating MEXICAN FOOD with MARK WIENS for 24 HOURS in Phoenix, Arizona!!",
    "MARK WIENS: https://www.youtube.com/c/MarkWiens CARLOS: https://www.instagram.com/benniebustamante With another ..."
  ],
  [
    "Mexican Food in Chennai😍 #shorts #ytshorts Omakase Anna nagar",
    "Person Name starting with M has to give you treat here From @omakasechennai Mexican cuisine has a large number of following ..."
  ],
  [
    "Delicious Tacos Mexican Street Food #shorts #tacos",
    "Delicious Tacos Mexican Street Food Try the best tacos, handmade corn tortilla Birria, Asada, Barbacoa. Subscribe for future ..."
  ],
  [
    "Why Mexican Cuisine is the King of Meal Prep",
    "Join Thrive Market today to get 25% off your first order AND a FREE gift!http://thrivemarket.com/prohomecooks Shop the gear in ..."
  ],
  [
    "EATING ONLY MEXICAN FOOD FOR 24 HOURS 🌮🌯🇲🇽",
    "Hey guys!! So here's a much awaited food challenge, I finally decided to do one. I only ate mexican food for 24 hours and it was ..."
  ],
  [
    "Why Mexican Food is a World Leading Cuisine, with Martha Ortiz",
    "documentary In this video we speak to Martha Ortiz, about her new restaurant in London, Ella Canta. Although educated in ..."
  ],
  [
    "I Tried FIVE STAR Mexican Food For The Entire Day 😳#Shorts",
    "Social Media Links     Instagram: https://www.instagram.com/blatantreviewz/?hl=en TikTok: ..."
  ],
  [
    "Mexican Inspired Rice and Beans Recipe 🪅 Healthy One Pot Black Bean Vegan Food (Super Easy)",
    "Let me show you a simple Mexican-inspired rice and beans recipe you and your friends can enjoy. ➡️ Black beans are a good ..."
  ],
  [
    "The Ultimate MEXICAN STREET FOOD‼️Experience (In Mexico 🇲🇽)#fyp #entertainment #shorts #streetfood",
    ""
  ],
  [
    "Tribal People Try Mexican Food For The First Time",
    "Tribal People Try Mexican Food For The First Time This video is sponsored by The Chai Spot https://www.thechaispot.com/ To ..."
  ],
  [
    "Mexican food for lunch. ☺️☺️",
    "Sunday was a relaxing day for khushi . she didnt have to cook . we went to eat some mexican food which just like indian food only ..."
  ],
  [
    "Top 10 Most Popular Mexican Foods | Foods Around the World",
    "Top 10 Most Popular Mexican Foods All the images have been used by permission for use as copyright free content."
  ],
  [
    "Making My Chinese Friends Try Mexican Food!!",
    "Don't forget to SUBSCRIBE and TURN ON POST NOTIFICATIONS! Follow my other social medias! Instagram ..."
  ],
  [
    "Oaxaca&#39;s cuisine: the cradle of Mexican food",
    "Mexican food has the distinction of being one of the world's most popular cuisines. Famous from Texas to Tokyo for its tacos and ..."
  ],
  [
    "Mexican Street Food 🇲🇽!! ULTIMATE TACOS TOUR 🌮 in Tijuana, Mexico! (Part 1)",
    "Mexican Street Food in Tijuana - PART 2: https://youtu.be/RYHs4tV3vcY Thanks to Jeffrey Merrihue: ..."
  ],
  [
    "How 500 Pounds Of Lamb Barbacoa Is Cooked Every Weekend In Texcoco, Mexico | Big Batches",
    "Inside El Pica 1 in Texcoco, Mexico, the original barbecue of the Americas is still being cooked low and slow inside of pit ovens."
  ],
  [
    "The Birria Taco King of LA",
    "Teddy Vaquez is the man behind Teddy's Red Tacos, the birria-style taco trucks in Los Angeles via Tijuana, Mexico that have ..."
  ],
  [
    "Extreme MEXICAN STREET FOOD in Los Angeles!! 🌮 DINO DRUMSTICKS + Backyard Breakfast!!",
    "Mexican Street Food in LA with @mexipapaadventures9911 Giant Turkey Wings: https://youtu.be/BEbKyZSpBQk ..."
  ],
  [
    "Mexican food is the best in the world | Tyler Cowen and Lex Fridman",
    "Lex Fridman Podcast full episode: https://www.youtube.com/watch?v=7Grseeycor4 Please support this podcast by checking out ..."
  ],
  [
    "UNKNOWN Mexican Food!! Taco Bell is Jealous!! (Mexican Street Food)",
    "SECOND CHANNEL!! MORE BEFRS » http://bit.ly/2pQYjvM​ BEFRS MERCH » https://bit.ly/ShopBEFRS SUPPORT OUR ..."
  ],
  [
    "The Most Delicious Traditional Mexican Dishes - Top 10 foods to try in Mexico By Traditional Dishes",
    "The Most Delicious Traditional Mexican Dishes - Top 10 foods to try in Mexico By Traditional Dishes This is a list of the most ..."
  ],
  [
    "Salsa | How to make Salsa | Homemade Salsa | Mexican Salsa | Salsa Recipe | Mexican Food",
    "Salsa | How to make Salsa | Homemade Salsa | Mexican Salsa | Salsa Recipe | Mexican Food Salsa is a specialty dip or sauce ..."
  ],
  [
    "Value-For-Money Mexican Food In Singapore | Eatbook Food Guide | EP 40",
    "HOLA AMIGOS! For our first food guide of the year, we will be exploring places that offer authentic Mexican food for under $20."
  ],
  [
    "Tribal People Try Famous Mexican Food For The First Time",
    "Help Us Start Girls School In Tribal Regions: Patreon: https://www.patreon.com/reactistan https://gofund.me/02542d64 This ..."
  ],
  [
    "Indian family enjoying Mexican food the whole day. No cooking day. #indianinmexico",
    "Today,We decided to eat only Mexican food for breakfast lunch and dinner #englishvlogs #mexico #indianmom #breakfast #lunch ..."
  ],
  [
    "The Patron Saint of Street Food in South Central LA | Street Food Icon",
    "Keith Garrett of All Flavor No Grease sells his take on Mexican street food out of his food truck in South Central Los Angeles."
  ],
  [
    "Mexican Food For Cheap | Struggle Meals",
    "Try these 3 Mexican food recipes for under $2 a plate! Comment below with what recipes you want to see next. ___ Subscribe to ..."
  ],
  [
    "Mexican Food Lovers Enjoy!! #shorts",
    "tacos #tacotuesday #taco #mexicanfood #southflorida #florida #travel #travelfooddiaries #food #foodblogger #foodie #foodlover ..."
  ],
  [
    "Oaxacan Mole Negro - THE MOST MYSTERIOUS Mexican Food in Oaxaca Village, Mexico!",
    "Mole negro is one of the most amazing Mexican foods! ▻SUBSCRIBE for 2 new videos per week: ..."
  ],
  [
    "MEXICANO BY THE BAY || BEST MEXICAN FOOD || SALSA DANCE IN AHMEDABAD",
    "MEXICANO BY THE BAY Ground Floor, Riverfront House, Behind Vallabhsadan, Near Nehru Bridge, Riverfront Road, ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | SATISFYING AND TASTY FOOD| OVER 2 Hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS | SATISFYING AND TASTY FOOD| OVER 2 Hours of COOKING!!!☁️The ingredients ..."
  ],
  [
    "Buñuelos #mexicanfood #mexicanrecipes #mexicanfoodrecipes #mexico #recipe #recipes #streetfood #",
    ""
  ],
  [
    "A Fascinating Behind-the-Scenes Look at History of Mexican Food",
    "A Fascinating Behind-the-Scenes Look at History of Mexican Food. With recipes that date back hundreds of years and traditions ..."
  ],
  [
    "i only ate mexican food for 24 hours | clickfortaz",
    "FOLLOW MY SOCIAL MEDIA TIK TOK | clickfortaz TWITTER | https://twitter.com/clickfortaz INSTAGRAM ..."
  ],
  [
    "Pambazos! I love Mexican food!",
    "Thank you for watching my video, Pambazos! I love Mexican food! It was freaking good! Ingredients Pickled Red onions 1 red ..."
  ],
  [
    "Friday fire destroys Nettie&#39;s Mexican restaurant in Bellevue",
    "No firefighters or employees suffered any injuries during the fire, and no customers were inside. Subscribe to KETV on YouTube ..."
  ],
  [
    "Street Tacos of Texas | Street Food Icons",
    "Jose Luis Perez Mendez, better known as El Primo, is king of breakfast tacos in Austin, TX. He's been selling street tacos for over ..."
  ],
  [
    "Mexican Street Food - SEAFOOD TOWER!! 🦐 Burritos, Tacos + Ceviche in Tucson, Arizona!!",
    "Carne Asada Tour: https://youtu.be/4FTSW08mDN4 SUBSCRIBE: http://bit.ly/MarkWiensSubscribe Don't miss new food videos!"
  ],
  [
    "A Day at the Best Mexican Restaurant in Portland, Oregon | On The Line | Bon Appétit",
    "República is a Mexican restaurant in Portland, Oregon with a menu based on seasonality - dishes that appear one week might ..."
  ],
  [
    "Pakistanis Trying MEXICAN STREET FOOD First Time in Life 🥵 Tacos, Beef Fries, beef Beria, Brown Rice",
    "Pakistanis Trying MEXICAN STREET FOOD Fist Time in Life Tacos, Beef Fries, beef Beria, Brown Rice Don't Forget to Like ..."
  ],
  [
    "12 Types of Authentic Mexican Food from The Casagrandes! 🇲🇽 | Nickelodeon Cartoon Universe",
    "From birria tacos to huevos rancheros, check out all of the DELICIOUS authentic Mexican food featured in The Casagrandes!"
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | Satisfying and tasty food| Over 2 hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS | Satisfying and tasty food ❤️If you are looking for a recipe. Search on YouTube ..."
  ],
  [
    "Can I Spend $100 on STREET FOOD in MEXICO??",
    "SECOND CHANNEL!! MORE BEFRS » http://bit.ly/2pQYjvM​ BEFRS MERCH » https://bit.ly/ShopBEFRS SUPPORT OUR ..."
  ],
  [
    "Tried MEXICAN Food in São Paulo, Brazil | Enchiladas | Indian Vlogger",
    "Yes, I ate Mexican food in Si Senor Tex Mex Mexican Restaurant located near Avenida Paulista or Paulista avenue, São Paulo, ..."
  ],
  [
    "What I Eat In A Day | Delicious Indian &amp; Mexican food #shorts #youtubeshorts #foodie #whatieatinaday",
    ""
  ],
  [
    "Mexican Dinner Party Menu ~ Easy Indian Mexican Food Recipes / Maxican Fusion Indian Party Ideas 😊",
    "Mexican Dinner Party Menu ~ Easy Indian Mexican Food Recipes / Maxican Fusion Indian Party Ideas Other Mexican Recipes ..."
  ],
  [
    "Australian Tries Popular Mexican Candy",
    "BONUS: https://www.youtube.com/watch?v=IQguWRUJ2zk EXTENDED CUT: https://www.youtube.com/watch?v=Qv3TwqDxufg ..."
  ],
  [
    "Homemade CORN TORTILLAS! Easier than you think. #shorts #corn #tortillas #mexicanfood #food #tacos",
    "Victoria 10\" Commercial Grade Cast Iron Tortilla Press: https://amzn.to/3hCluBi 🖨️ FULL printable recipe here ..."
  ],
  [
    "Mexican food for lunch. ☺️☺️",
    "Sunday was a relaxing day for khushi . she didnt have to cook . we went to eat some mexican food which just like indian food only ..."
  ],
  [
    "World Famous Mexican Food Has Come to Tokyo",
    "Massive, Michelin Star Burritos in Japan Originating from New York, Oxomoco has made a colorful splash in Tokyo's Hiroo ..."
  ],
  [
    "Mexican Thai Food vs. Thai Mexican Food Taste Test",
    "Today, we're mixing and matching Mexican and Thai food! GMM #2131 Subscribe to GMM: ..."
  ],
  [
    "Mexican Snacks Cavity Battle!!",
    "Let's Find Out If These ASMR Foods From Mexico Will Cause My Teeth Cavities and Give Me Bad Breath!? Then Use A Travel ..."
  ],
  [
    "God I miss eating Mexican food #comedy #podcast #cilantro #cooking #restaurant #funny #jokes #shorts",
    ""
  ],
  [
    "The Mexican Restaurant Hidden in a Barn on a Rural New York Farm | Word of Mouth",
    "Greenane Farms is a small family farm in the Catskill Mountains of upstate New York and it's the type of place that you would ..."
  ],
  [
    "TRYING MEXICAN FOOD | Roxette Arisa",
    "TRYING MEXICAN FOOD !!!!! A follow up to our last few food videos - Trying Mexican Snacks and Trying Mexican Candy!"
  ],
  [
    "Mexican-Inspired Recipes You CANNOT Resist",
    "If you're ready for a fiesta, well, then, you're in for a treat! We have a handpicked list of recipes inspired by Mexican dishes that you ..."
  ],
  [
    "Gordon Ramsay RIPS Into Microwaved Mexican Food | Kitchen Nightmares FULL EP",
    "Full Episodes from the Gordon Ramsay Back catalog. #GordonRamsay #Cooking #Food."
  ],
  [
    "Mexican Chilaquiles | Rating Breakfast Around The World",
    "Shorts #Breakfast #Chilaquiles."
  ],
  [
    "Enjoyed Awesome Mexican Food in USA🥰 #shorts #youtubeshorts #usavlogs #indianvlogger #foodie #usa",
    ""
  ],
  [
    "Mexican Food Festival | Mexican Cuisine | The Foodie",
    "Mexican food for most of us is limited to tacos but you will be surprised to find there is so much more. We went to the Mexican ..."
  ],
  [
    "ASMR BEST GIANT BURRITO HUGE BURGERS MEXICAN FOOD ANIMAL STYLE",
    "ASMR BEST GIANT BURRITO HUGE BURGERS MEXICAN FOOD ANIMAL STYLE I HOPE YOU'LL ENJOY THIS VIDEO AND IF ..."
  ],
  [
    "Mexican Nachos Sandwich😵🥵|| Indian food",
    "trendingfood #streetfoodindia #trendingvideo #streetfood #shorts #food #foodies #indianstreetfood #recipes #youtubeshort ..."
  ],
  [
    "48 HOURS IN BROOKLYN ft. Classic Steakhouse, Mexican food, The Best Bakeries and New York Pizza",
    "There is just so much going on in Brooklyn that we had to make a film dedicated to this side of the East River. In this film we profile ..."
  ],
  [
    "Taco Yeah Hai Kya, Roti Ke Beech me Sabji ? | Mexican Food Desi Ladka",
    "Taco Yeah Hai Kya, Roti Ke Beech me Sabji ? | Mexican Food Desi Ladka i had this taco which was good in taste and filled ..."
  ],
  [
    "Chef Calvin’s $100 Fish Taco!! Chefs UPGRADE Mexican Food!! | FANCIFIED Ep 2",
    "Thanks to Omaze for sponsoring this video! For your chance to win a custom Tesla Model S and $20000 and support a great ..."
  ],
  [
    "Mexican rice! #shorts",
    ""
  ],
  [
    "The surprising history of New Mexican cuisine",
    "It's not Tex-Mex and it's not Mexican. New Mexican cuisine is unique as goes back millennia. Today, the food is a fusion of Native ..."
  ],
  [
    "Frozen vs. Fast vs. Fancy Food Taste Test",
    "Today, we're trying the frozen, fast food, and fancy versions of Mexican food side by side and seeing how expensive our tastes are ..."
  ],
  [
    "Unbelievable Mexican Food - FIRE GRILLED MEAT + Cenote and Chichen Itza in Yucatán, Mexico!",
    "Join us on this amazing Mexican food road trip through Yucatan, Mexico! ▻SUBSCRIBE for 2 new videos per week: ..."
  ],
  [
    "BIRRIA | Mexican Survival Guide",
    "Birria is a traditional Mexican food dish. It can be eaten in a variety of different ways, but a popular way is in a taco called ..."
  ],
  [
    "Most Popular Mexican Quesadilla In Surat #shorts",
    "MEXICAN QUESADILLA: \"Mexican Spicy Salsa\" Opp. Kings Ford Showroom, Surat, Gujarat (India) Daily Sale It's Very Tasty ..."
  ],
  [
    "The Best Homemade Salsa Recipe, Mexican Restaurant style Salsa Recipe, Basic Salsa",
    "Get the Ingredient list, step-by-step written, printable and Mobile ready \"-------------------\" recipe with measurements on my website: ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | Satisfying and tasty food| Over 2 hours of COOKING!!!",
    "Mexican food recipes compilations Links below will take you to each recipe, you can find ingredient details for your selected ..."
  ],
  [
    "Chicken Enchiladas - Enchiladas de Pollo - Mexican Food",
    "mexicanfood #cookmentality #enchiladas Chicken enchiladas is always a family comfort food for me. I grew up eating my Mother's ..."
  ],
  [
    "Eating The Best Reviewed MEXICAN FOOD in Oregon...(GIANT SIZE)",
    "MY GAMING CHANNEL: @Brennen Taylor Gaming https://www.youtube.com/channel/UC0fGpCgFiTAwiGPMrjkPLmQ Text me: ..."
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "I Didn&#39;t Eat Mexican Food Till I was 28 😂😁🤣I&#39;m From The Hood...",
    "I didn't have Mexican food until I was 28 years old. Cause I'm from the hood... Cleveland. There wasn't any Mexican food, we had ..."
  ],
  [
    "We went to Mexican Food Restaurant | Chipotle Mexican Grill | Burrito Bowl",
    "chipotle #chipotlemexicangrill #mexicanfood #vegetarian #burrito Hi Guys, Mexican food is very yummy and is good options for ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | SATISFYING AND TASTY FOOD| 3 Hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES: Birria☁️The ingredients and quick tips are listed below ⬇️ Social ..."
  ],
  [
    "Most DELICIOUS Mexican Food Challenge EVER!!",
    "A&Z #797 - Atlas and Dan \"Killer\" Kennedy each vs Rey Azteca's \"Super Grande Especial\" Delicious Mexican Food Challenge at ..."
  ],
  [
    "Mexican Snacks Cavity Battle!!",
    "Let's Find Out If These ASMR Foods From Mexico Will Cause My Teeth Cavities and Give Me Bad Breath!? Then Use A Travel ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | Satisfying and tasty food| Over 2 hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS | Satisfying and tasty food ❤️If you are looking for a recipe. Search on YouTube ..."
  ],
  [
    "I Didn&#39;t Eat Mexican Food Till I was 28 😂😁🤣I&#39;m From The Hood...",
    "I didn't have Mexican food until I was 28 years old. Cause I'm from the hood... Cleveland. There wasn't any Mexican food, we had ..."
  ],
  [
    "MEXICAN STREET FOOD - The Best Street Food in The World!!!",
    "We traveled to Mexico specifically to try tons of Mexican street food and delicious Mexican cuisine. This series playlist has 10 ..."
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "White people ordering Mexican food #shorts #themannii",
    ""
  ],
  [
    "Mexican rice! #shorts",
    ""
  ],
  [
    "48 HOURS IN BROOKLYN ft. Classic Steakhouse, Mexican food, The Best Bakeries and New York Pizza",
    "There is just so much going on in Brooklyn that we had to make a film dedicated to this side of the East River. In this film we profile ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | SATISFYING AND TASTY FOOD| 3 Hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES: Birria☁️The ingredients and quick tips are listed below ⬇️ Social ..."
  ],
  [
    "What We Eat In A Day: Vegan Mexican Food 🇲🇽",
    "Today we are making and eating only Mexican food for a day! Click here: http://ritual.com/simplevegan and use code ..."
  ],
  [
    "We went to Mexican Food Restaurant | Chipotle Mexican Grill | Burrito Bowl",
    "chipotle #chipotlemexicangrill #mexicanfood #vegetarian #burrito Hi Guys, Mexican food is very yummy and is good options for ..."
  ],
  [
    "Most DELICIOUS Mexican Food Challenge EVER!!",
    "A&Z #797 - Atlas and Dan \"Killer\" Kennedy each vs Rey Azteca's \"Super Grande Especial\" Delicious Mexican Food Challenge at ..."
  ],
  [
    "Only eating SPCY MEXICAN FOOD for a day #shorts",
    "Only eating SPICY MEXICAN FOOD for an entire day. I'm such a wimp with spice."
  ],
  [
    "Uncle Roger HATE Great British Bake Off Mexican Week (ft. Joshua Weissman)",
    "British people coming for Mexican food now... How they gonna do? Go subscribe to Uncle @JoshuaWeissman, he the best!"
  ],
  [
    "You’re Doing Mexican Food All Wrong! Here’s Why — with Chef Aaron Sanchez",
    "Aarón Sánchez is one of the most beloved celebrity chefs, and one of the biggest names in Mexican cuisine in the US."
  ],
  [
    "I TRIED MEXICAN FOOD FOR THE FIRST TIME! #shorts",
    ""
  ],
  [
    "MEXICO FOOD GUIDE: 10 best foods in Mexico you HAVE to try",
    "MEXICO FOOD GUIDE: 10 best foods in Mexico you HAVE to try! There are some food you just simply cannot leave Mexico ..."
  ],
  [
    "CHICKEN FAJITAS | the best easy mexican recipe + homemade seasoning",
    "Chicken fajitas are an easy and flavorful weeknight meal. A classic Mexican recipe, juicy chicken is seasoned, seared and cooked ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS | SATISFYING AND TASTY FOOD| 3 Hours of COOKING!!!",
    "Mexican Food Recipes compilation: Enchiladas ☁️The ingredients and quick tips are listed below ⬇️ Social Media (Follow ..."
  ],
  [
    "Make mexican food recipes",
    "Make mexican food recipes so delicious."
  ],
  [
    "BEST Barbacoa/Birria TACOS In Town - Mexican Street Food - Tipping $100 Dollars",
    "AWESOME Juicy,Tender, Spicy & DELICIOUS Birria, Al Pastor, Chorizo & Steak Street TACOS At \"TACOS EL OSO\" Deep In The ..."
  ],
  [
    "Americans vs Mexican Food",
    "Trigger Warning: The content of this video was produced after a real conversation on Discord. One of the participants was a man ..."
  ],
  [
    "Fried (Puffed-up) Gorditas, Mexican Recipe, how to Mexican food",
    "To subscribe: http://full.sc/LfL3op My Facebook: http://full.sc/LfNDKT Blog: http://full.sc/PPUcGY Instagram: Sandybvv Twitter: ..."
  ],
  [
    "Restaurant Style Mexican Rice",
    "Learn how to make authentic Mexican rice just like you get in a Mexican restaurant. Light and fluffy and slightly smoky, this is great ..."
  ],
  [
    "You need to try this Mexican Restaurant in San Francisco (highly recommend) #shorts",
    "My friend is visiting SF for a week so I wanted to give her the full SF experience. My brother and I took her to Garaje today, ..."
  ],
  [
    "Mexican Food Lovers Enjoy!! #shorts",
    "tacos #tacotuesday #taco #mexicanfood #southflorida #florida #travel #travelfooddiaries #food #foodblogger #foodie #foodlover ..."
  ],
  [
    "Enjoyed Awesome Mexican Food in USA🥰 #shorts #youtubeshorts #usavlogs #indianvlogger #foodie #usa",
    ""
  ],
  [
    "Top 8 Mexican dishes You Have to Try | The Traditional Food of Mexico | Mexican Cuisine",
    "The reasons for visiting Mexico are so many: the warm and friendly people, a lively culture, the ruins of civilizations lost for ..."
  ],
  [
    "🌯 ASMR Cooking Mexican Burrito BEST EVER Recipe  🌯 Realistic Miniature Food Video by Mini Yummy",
    "ASMR Cooking Mexican Burrito Best Recipe Realistic Miniature Food Video by Mini Yummy Hello World, I'm Food Lover and ..."
  ],
  [
    "Eating EVERYTHING I CRAVE Mukbang! Mexican Food + Birria, WingStop, Flamin Hot + 80K Special",
    "So I thought it would be interesting to put a few delicious favorite foods of mine together for this special subscriber milestone!"
  ],
  [
    "Mexican Food Tiktok Compilation",
    "I don't know why Mexican food makes me so hungry do Mexican foods make you hungry ??? Enjoy this video I hope this video ..."
  ],
  [
    "Gourmet Mexican Food",
    "Rick Bayless visits Tijuana's top culinary chefs You can catch his full episodes at: https://vimeo.com/rickbayless."
  ],
  [
    "KIDS EAT MEXICAN FOOD | Kids Vs. Food",
    "Kids try Mexican food! Click to get Amazon Fresh 30 days FREE with FBE's code! https://goo.gl/N3RVae Watch all People Vs Food ..."
  ],
  [
    "WORLD&#39;S BIGGEST MEXICAN FOOD CHALLENGE | THE BEST MEXICAN FOOD | Ordering ALL the Menu | Man Vs Food",
    "HAPPY CINCO DE MAYO! THIS IS AMAZING MEXICAN FOOD! AND THIS IS THE WORLDS BIGGEST MEXICAN FOOD/MENU ..."
  ],
  [
    "MAKING LEXI TRY MY FAVORITE MEXICAN CANDY!",
    "Don't forget to SUBSCRIBE and TURN ON POST NOTIFICATIONS! Follow my other social medias! Instagram ..."
  ],
  [
    "Eating only food from Mexico for the whole day! #shorts #mexico",
    "Instagram: https://www.instagram.com/tommywinkler/ TikTok: https://www.tiktok.com/@tommywinkler? Twitter: @tommy_winkler_ ..."
  ],
  [
    "Cajun chicken Crunchwrap, hot Cheeto elote, &amp; churro beignets! #shorts #foodie #mexicanfood #comfort",
    ""
  ],
  [
    "Korean Grandma Makes GUACAMOLE for the first time (Mexican Food)",
    "Hello, Welcome to our channel! We upload new videos (at least) twice a week. Don't forget to subscribe to our channel and like ..."
  ],
  [
    "I ate ONLY MEXICAN FOOD for 72 hrs in Korea",
    "Pozole recipe I used in the video https://www.simplyrecipes.com/recipes/posole_rojo/ Hello, Welcome to our channel! We upload ..."
  ],
  [
    "Menudo, Pozole, Albondiga Soup &amp; More | Mexican Food Recipes #cooking",
    "Here is a Mexican food compilation for soup recipes. With the cooler weather and holiday season upon us, it's time for menudo ..."
  ],
  [
    "Mexican food #food #mexico #india #foodie",
    ""
  ],
  [
    "Mexican &amp; British People Swap Snacks",
    "Subscribe to BuzzFeed's newest channel, Cocoa Butter!: https://www.youtube.com/CocoaButter/ \"It's an allegory for life\" Credits: ..."
  ],
  [
    "￼ Mexican food in Louisville, Kentucky! #food #mexicanfood #family #jalapeños #elburrito #hamburger",
    ""
  ],
  [
    "What I order at a Mexican restaurant",
    ""
  ],
  [
    "Top 10 Mexican Foods",
    "Mexican cuisine is well-known around the world, and it extends beyond the conventional plain fare served by restaurants like ..."
  ],
  [
    "When your in laws always feed you homemade Mexican food 🥰😋",
    ""
  ],
  [
    "Mexican Food",
    "Facebook https://www.facebook.com/KaysVideos."
  ],
  [
    "Veg Paratha Quesadilla | Veg Quesadilla Recipe | Mexican Recipe | Kunal Kapur Iftar Recipes | Rolls",
    "How to Make Mexican Quesadilla | Mexican Style Masala Aloo Paratha Quesadilla is a Mexican taco that is made with soft bread ..."
  ],
  [
    "Mexican Food Can’t Be Vegan",
    "Find all my recipes on @Dora's Table - Vegan Mexican Recipes."
  ],
  [
    "Cheesy Mexican Food Mukbang Round 2! Burritos, Loaded Tostada, Fish Taco +",
    "I was really craving Mexican food and it was a Monday, so i decided to celebrate my new national holiday properly. Happy ..."
  ],
  [
    "BEST Barbacoa/Birria TACOS In Town - Mexican Street Food - Tipping $100 Dollars",
    "AWESOME Juicy,Tender, Spicy & DELICIOUS Birria, Al Pastor, Chorizo & Steak Street TACOS At \"TACOS EL OSO\" Deep In The ..."
  ],
  [
    "Mexican Food - The BEST QUESABIRRIA TACOS in Chicago! Tacotlan",
    ""
  ],
  [
    "Fresh Street Tacos | Mexican Tacos | The Mexican Food Channel | Tacos Al Pastor | straight Fire",
    ""
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "Most DELICIOUS Mexican Food Challenge EVER!!",
    "A&Z #797 - Atlas and Dan \"Killer\" Kennedy each vs Rey Azteca's \"Super Grande Especial\" Delicious Mexican Food Challenge at ..."
  ],
  [
    "Best Mexican Food Austin Texas | Best Tacos Austin TX | Restaurant",
    "In my opinion this place has the best Mexican food and tacos in Austin, Texas. The melted cheese they use is unbelievable."
  ],
  [
    "Eating ONLY Mexican Food For 24 Hours!",
    "Eating ONLY Mexican Food For 24 Hours! In today's video, I'm taking on a fun challenge of trying Mexican food for 24 hours."
  ],
  [
    "I Didn&#39;t Eat Mexican Food Till I was 28 😂😁🤣I&#39;m From The Hood...",
    "I didn't have Mexican food until I was 28 years old. Cause I'm from the hood... Cleveland. There wasn't any Mexican food, we had ..."
  ],
  [
    "EATING ONLY MEXICAN FOOD FOR 24 HOURS #shorts",
    ""
  ],
  [
    "Bangalore&#39;s Famous Bannerghatta National Park | Eating Mexican Food At Sanchez, Indiranagar.",
    "This is a vlog of visiting Bannerghatta National Park and eating at a Mexican Restaurant in Bangalore city. Follow me on ..."
  ],
  [
    "Mexican Dinner Party Menu ~ Easy Indian Mexican Food Recipes / Maxican Fusion Indian Party Ideas 😊",
    "Mexican Dinner Party Menu ~ Easy Indian Mexican Food Recipes / Maxican Fusion Indian Party Ideas Other Mexican Recipes ..."
  ],
  [
    "Top 8 Mexican dishes You Have to Try | The Traditional Food of Mexico | Mexican Cuisine",
    "The reasons for visiting Mexico are so many: the warm and friendly people, a lively culture, the ruins of civilizations lost for ..."
  ],
  [
    "Top 10 Mexican Foods",
    "Mexican cuisine is well-known around the world, and it extends beyond the conventional plain fare served by restaurants like ..."
  ],
  [
    "Authentic LA Style Mexican Food in Seoul, Korea feat. Kim&#39;s Taco",
    "Hi guys! In this video, I'm talking to Eric Kim from Kim's Taco in Gangnam to understand what it takes to open a Mexican Taco ..."
  ],
  [
    "Pancho&#39;s Food Review with Tosha Mexican Restaurant West Memphis Arkansas",
    "Tosha and I never been to Pancho's but heard some good thangs about it, we decided to pay them a visit and have lunch here."
  ],
  [
    "The Best Homemade Salsa Recipe, Mexican Restaurant style Salsa Recipe, Basic Salsa",
    "Get the Ingredient list, step-by-step written, printable and Mobile ready \"-------------------\" recipe with measurements on my website: ..."
  ],
  [
    "Top 10 Mexican Restaurants in Singapore | Tropika Club Magazine",
    "Join us as Tropika Club Magazine counts down the Top 10 Mexican Restaurants in Singapore! There are so many options about ..."
  ],
  [
    "Trying Mexican Food In Mexico",
    "Its just too good not to share. Culture is art, celebration and food and we are participating, learning and engaging with the culture ..."
  ],
  [
    "You’re Doing Mexican Food All Wrong! Here’s Why — with Chef Aaron Sanchez",
    "Aarón Sánchez is one of the most beloved celebrity chefs, and one of the biggest names in Mexican cuisine in the US."
  ],
  [
    "The best Mexican restaurant for tacos on the Las Vegas Strip is Javier’s Cantina inside Aria Resort",
    "The best taco platter on the Las Vegas Strip is from Javier's Cantina inside Aria Resort. Visit Javier's when you join Lip Smacking ..."
  ],
  [
    "TRYING MEXICAN CUISINE… #viral #youtubeshorts #foodreview",
    ""
  ],
  [
    "Eating Lion, Llama and Wild Boar!! Mexico&#39;s Exotic Meat Obsession!!!",
    "SECOND CHANNEL!! MORE BEFRS » http://bit.ly/2pQYjvM​ BEFRS MERCH » https://bit.ly/ShopBEFRS SUPPORT OUR ..."
  ],
  [
    "Mexican food #food #mexico #india #foodie",
    ""
  ],
  [
    "Mexican Burger | Hamburgesa Mexicans | The Mexican Food Channel | Oaxaca Cheese Burger | Best Burger",
    ""
  ],
  [
    "GREASY MEXICAN FOOD FEAST",
    "MY BRAND NEW CHANNEL! https://youtube.com/channel/UCRdFo4dY8bxHitHktNAWDxQ SHOP my MEXICAN AMERICAN ..."
  ],
  [
    "Mexican Food Fiesta | Yummy Eats in Sayulita",
    "Like many people around the world, we LOVE Mexican food. In this video, we're sharing our favourite places to eat in Sayulita, ..."
  ],
  [
    "What I eat at a Mexican restaurant",
    ""
  ],
  [
    "The surprising history of New Mexican cuisine",
    "It's not Tex-Mex and it's not Mexican. New Mexican cuisine is unique as goes back millennia. Today, the food is a fusion of Native ..."
  ],
  [
    "MAKING LEXI TRY MY FAVORITE MEXICAN CANDY!",
    "Don't forget to SUBSCRIBE and TURN ON POST NOTIFICATIONS! Follow my other social medias! Instagram ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | SATISFYING AND TASTY FOOD| OVER 2 Hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS | SATISFYING AND TASTY FOOD| OVER 2 Hours of COOKING!!!☁️The ingredients ..."
  ],
  [
    "Mexican rice! #shorts",
    ""
  ],
  [
    "La Reina Inc. and Anita&#39;s Mexican Food Corp.",
    "La Reina Inc. and Anita's Mexican Food Corp. The story of Anita's is quite frankly, inspirational. The origins of the business date ..."
  ],
  [
    "Unbelievable Mexican Food - FIRE GRILLED MEAT + Cenote and Chichen Itza in Yucatán, Mexico!",
    "Join us on this amazing Mexican food road trip through Yucatan, Mexico! ▻SUBSCRIBE for 2 new videos per week: ..."
  ],
  [
    "How to pronounce Mexican food",
    "Website: https://noitienganhchuan.org #noitienganhchuan, #tienganhmy Facebook: https://www.facebook.com/noitienganhchuan ..."
  ],
  [
    "10 Healthiest Dishes to Order at a Mexican Restaurant",
    "The idiom \"Your eyes are bigger than your stomach\" is one you may be familiar with. Or how about \"You eat with your eyes first\"?"
  ],
  [
    "BIRRIA | Mexican Survival Guide",
    "Birria is a traditional Mexican food dish. It can be eaten in a variety of different ways, but a popular way is in a taco called ..."
  ],
  [
    "Great Mexican Food in Whittier | La Pancita Feliz | My Whittier",
    "Today I visited a great Mexican food restaurant serving up delicious dishes. This is one of the best Mexican food restaurants in the ..."
  ],
  [
    "$5 DINNERS MEXICAN FOOD: RECIPES ON A BUDGET: FIVE INGREDIENTS OR LESS",
    "Hey guys! I hope you enjoy my take on Mexican food for only five dollars a meal! LET'S CONNECT! All meals are priced and ..."
  ],
  [
    "Enjoy MEXICAN FOOD in INDIA now with Riliberto&#39;s Restaurant Tour | News Today Live",
    "MexicanFood #Riliberto ⬇️Subscribe ⬇️ http://www.youtube.com/newstodaylive Facebook: ..."
  ],
  [
    "Restaurant Style Mexican Rice",
    "Learn how to make authentic Mexican rice just like you get in a Mexican restaurant. Light and fluffy and slightly smoky, this is great ..."
  ],
  [
    "MEXICAN FOOD MUKBANG!",
    "WHAT'S UP YUMMYBITERS!!! SO TODAY WE ARE HAVING A MEXICAN FOOD MUKBANG! MY NEW ASMR CHANNEL: ..."
  ],
  [
    "Enjoy a Authentic Mexican food!",
    "More than 30 delicious Mexican food dishes to taste. Come and try them! Location: 3333 N University Dr Davie, Miami FL 33024 ..."
  ],
  [
    "CHICKEN FAJITAS | the best easy mexican recipe + homemade seasoning",
    "Chicken fajitas are an easy and flavorful weeknight meal. A classic Mexican recipe, juicy chicken is seasoned, seared and cooked ..."
  ],
  [
    "Veg Quesadilla Recipe in Hindi | वेज केसाडीला | Mexican Food |  Advikas world",
    "Veg Quesadilla Recipe in Hindi | वेज केसाडीला | Mexican Food | Advikas world . Hey guys! So today u have brought to ..."
  ],
  [
    "GOLDEN MEAT JACUZZI 🌮 Carnitas Tacos + Loaded Quesadillas!! Best Street Food in Los Angeles!!",
    "Follow Mexi Papa: @Mexi papa Adventures Mexican Street Food in LA (Part 1): https://youtu.be/BEbKyZSpBQk ..."
  ],
  [
    "Eating EVERYTHING I CRAVE Mukbang! Mexican Food + Birria, WingStop, Flamin Hot + 80K Special",
    "So I thought it would be interesting to put a few delicious favorite foods of mine together for this special subscriber milestone!"
  ],
  [
    "KIDS EAT MEXICAN FOOD | Kids Vs. Food",
    "Kids try Mexican food! Click to get Amazon Fresh 30 days FREE with FBE's code! https://goo.gl/N3RVae Watch all People Vs Food ..."
  ],
  [
    "Jamaican Tries Mexican Food | Reaction Video",
    "Today I will be cooking a Mexican dish and trying it. (Reacting to Mexican food) ..."
  ],
  [
    "Can Mexican Moms Taste The Difference? Real Mexican Food Vs. Mexican Fast Food",
    "Can Mexican Moms tell the difference between real Mexican food and Mexican-style fast food from the US? We asked ..."
  ],
  [
    "Americans Eat Mexican Food in the UK",
    "Hey guys! Hope you enjoy this vlog on our experience eating good Mexican food in the United Kingdom. Well done, La Baronia!"
  ],
  [
    "Gordon Horrified By Mexican Restaurant’s Kitchen | Kitchen Nightmares",
    "Gordon Ramsay is outraged at the way the food is kept in the Fiesta Sunrise Kitchen. #Mexicanrestaurant #GordonRamsay ..."
  ],
  [
    "Mexican Food in Japan 🇲🇽 Is it Authentic!? | Wahoo&#39;s Tacos &amp; More",
    "Hey guys! This is Sarah, a Japanese \"salary woman\" living and working in Tokyo. I tried the banzai burrito at Wahoo's Tacos ..."
  ],
  [
    "Most DELICIOUS Mexican Food Challenge EVER!!",
    "A&Z #797 - Atlas and Dan \"Killer\" Kennedy each vs Rey Azteca's \"Super Grande Especial\" Delicious Mexican Food Challenge at ..."
  ],
  [
    "Is this Fast Food in Mexico? ft. TheCrazyGorilla",
    "We asked our Mexican Moms if these popular restaurants in the United States are also available Mexico! Did you know these food ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | Satisfying and tasty food| Over 2 hours of COOKING!!!",
    "MEXICAN FOOD RECIPES COMPILATIONS | Satisfying and tasty food ❤️If you are looking for a recipe. Search on YouTube ..."
  ],
  [
    "How to make TAMALES | MEXICAN FOOD COMPILATIONS | 2 hours of tasty recipes | MEXICAN COOKING",
    "Make sure that you have the bell turned on, so you will definitely not miss any of our videos!! Happy Holiday & Tamales making!"
  ],
  [
    "SPANISH FOOD VS MEXICAN FOOD: Who has THE BEST? (ft. Dreaming Spanish)",
    "Have you tried Spanish Food or Mexican Food? Which one do you think is better? In this Spanish listening comprehension ..."
  ],
  [
    "Digging For TACOS!! 🌮 🐐 BBQ PIT to MOUTH Mexican Food in California, USA!",
    "Tijuana Street Food (Part 1): https://youtu.be/UT4hPMISonI Thanks to Jeffrey Merrihue: ..."
  ],
  [
    "KIDS EAT MEXICAN FOOD | Kids Vs. Food",
    "Kids try Mexican food! Click to get Amazon Fresh 30 days FREE with FBE's code! https://goo.gl/N3RVae Watch all People Vs Food ..."
  ],
  [
    "FEDERICO&#39;S MEXICAN FOOD | Arizona and Carne Asada Burrito Food Review | Phoenix, AZ",
    "FOLLOW US: Subscribe: https://www.youtube.com/c/JbrosCooking Instagram: https://www.instagram.com/jbroscooking Facebook: ..."
  ],
  [
    "10 Keto Southwest Inspired Recipes [Low-Carb Mexican Food]",
    "Typically on a low-carb or ketogenic diet, you can't easily have Mexican and Tex-Mex cuisine because of all of the tortillas, beans, ..."
  ],
  [
    "Veg Paratha Quesadilla | Veg Quesadilla Recipe | Mexican Recipe | Kunal Kapur Iftar Recipes | Rolls",
    "How to Make Mexican Quesadilla | Mexican Style Masala Aloo Paratha Quesadilla is a Mexican taco that is made with soft bread ..."
  ],
  [
    "Universal CityWalk Antojitos Authentic Mexican Food Restaurant | Dining Review | Orlando, Florida",
    "Tonight we dine at Universal Orlando CityWalk Antojitos Authentic Mexican Food Restaurant. Located right in Universal CityWalk, ..."
  ],
  [
    "TRYING MEXICAN FOOD IN ALABAMA!",
    "Let me just say that it has been VERY hard to find good places here.. We hope you guys enjoy our video! Make sure to like, ..."
  ],
  [
    "$20.25/person for All-You-Can-Eat Authentic Mexican Food @ Hacienda Buffet | Fort Worth, TX",
    "Come join us for an All-You-Can-Eat Authentic Mexican Food buffet at Hacienda Buffet in Fort Worth, Texas. At $20.25/person, is it ..."
  ],
  [
    "Joe Rogan Why Is Mexican Food So Good?",
    "Mexican cuisine is one of the best in the world #1782 #joerogan #mexico #mexicanfood #authenticmexicanfood #tacos ..."
  ],
  [
    "MEXICAN FOOD🚽",
    "I just recovered from an illness so I thought I would make a fun little roblox party.exe meme of my favourite funny moments ever ..."
  ],
  [
    "SAIGON EATS: Great Mexican food to try in Ho Chi Minh City",
    "Welcome to this is - Saigon, On today's episode we are going across the whole city to take you to some of our favorite Mexican ..."
  ],
  [
    "Amazing Mexican Food 👌🏻🤤🇲🇽",
    "enchiladas #mexicanfood #food #foodlovers #tacosmexicanos #comidasaludable #guacamole #enchiladassuizas #reels ..."
  ],
  [
    "Mexican Food",
    "Facebook https://www.facebook.com/KaysVideos."
  ],
  [
    "Mexican rice! #shorts",
    ""
  ],
  [
    "Eating only food from Mexico for the whole day! #shorts #mexico",
    "Instagram: https://www.instagram.com/tommywinkler/ TikTok: https://www.tiktok.com/@tommywinkler? Twitter: @tommy_winkler_ ..."
  ],
  [
    "African + Mexican at &quot;Afro Taco Food Truck&quot; in Newark, NJ. Ultimate Fusion of Flavors!",
    "In this episode we visit Afro Taco Food truck located 761 Elizabeth Ave. Newark, NJ. A one of a kind food truck that fuses Ghana ..."
  ],
  [
    "Mexican Moms Try Indian Snacks",
    "Mexican moms try store-bought Indian snacks such as Samosa, Parle-G, and more! Filmed and Produced by The Crazy Gorilla."
  ],
  [
    "Best Mexican Food Austin Texas | Best Tacos Austin TX | Restaurant",
    "In my opinion this place has the best Mexican food and tacos in Austin, Texas. The melted cheese they use is unbelievable."
  ],
  [
    "Mexican Food Adventure 🇲🇽 Muy Rico Ep. 1",
    "What was just supposed to be a much needed holiday to Mexico earlier this year, I became so inspired by the rich culture & food ..."
  ],
  [
    "Best Vegetarian Burrito Bowl Recipe/ Chipotle Burrito Bowl at home// DIY Burrito Bowl Chipotle Style",
    "burritobowl #vegdesiaomas #mexicanfood Today, I'll show you how to make Chipotle's burrito bowls at home. This is an easy and ..."
  ],
  [
    "Quesadillas",
    "What filling will you choose - beef, chicken or vegetable? https://www.recipetineats.com/quesadilla/"
  ],
  [
    "Lloyd’s favorite mexican food won’t save Lassie | Psych",
    "Shawn and Gus's \"hombreeee\" when the seller didn't have any food left...I felt that Psych is streaming now on Peacock: ..."
  ],
  [
    "Cajun chicken Crunchwrap, hot Cheeto elote, &amp; churro beignets! #shorts #foodie #mexicanfood #comfort",
    ""
  ],
  [
    "Son&#39;s TikTok saves Salt Lake City Mexican restaurant",
    "Thanks to a TikTok video, a struggling local business was saved after the owner almost closed his doors for good. FULL STORY: ..."
  ],
  [
    "5 Fast and Easy Mexican Food  Recipes | Mexican Food - Spicy Latina Mom",
    "Hola amigos! I´m back with a special of 5 Mexican food recipes super fast and easy to make, they can be used as a snack perfect ..."
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS RECIPES | SATISFYING AND TASTY FOOD| Over 1 HOUR OF COOKING",
    "Hello & welcome! Today's recipe compilation will be showing you detailed Mexican instant pot recipes. These easy recipes help ..."
  ],
  [
    "Are these foods Mexican? ft. TheCrazyGorilla",
    "We asked our Mexican Moms how well they know Mexican foods and items! Did any of these surprise you? SUBSCRIBE ..."
  ],
  [
    "San Diego Mexican FOOD TOUR! (3 types of TACOS 🌮, California Burrito, &amp; Carne Asada Fries)",
    "When we think of San Diego we think of sunny weather, beaches, and amazing Mexican food! Being right by the border of ..."
  ],
  [
    "Carne Guisada con papas - Mexican Beef Stew - Mexican Food",
    "Carne Guisada is a Mexican beef stew that screams delicious comfort food with fresh flavors and soft tender beef. Nothing better ..."
  ],
  [
    "Letting The Employees Decide What I Eat [Mexican Food + Food Challenge]",
    "In todays video, KristinandJamil do another food challenge where we LET THE EMPLOYEE DECIDE WHAT I EAT! This food ..."
  ],
  [
    "Mexican Moms Rank Mexican Snacks",
    "Mexican moms rank popular Mexican snacks like gansito, bubu lubu, duritos, sabritones, takis, and more! Filmed and Produced ..."
  ],
  [
    "Restaurant Style Fajitas (Authentic Mexican Recipe)",
    "Getcha Some APC BBQ Rubs Here: https://www.pitmaster.us/ Join the Pitmaster Class for 25% OFF: ..."
  ],
  [
    "Eating MEXICAN FOOD with MARK WIENS for 24 HOURS in Phoenix, Arizona!!",
    "MARK WIENS: https://www.youtube.com/c/MarkWiens CARLOS: https://www.instagram.com/benniebustamante With another ..."
  ],
  [
    "Best Mexican Food For Hangovers 🇲🇽 #mexicanfood #shorts",
    ""
  ],
  [
    "Japanese Trying Mexican Food for the First Time",
    "El Pueblo de Los Angeles is one of the oldest places in the city, and we're here to try some authentic Mexican food and treats."
  ],
  [
    "Texas Best - Mexican Food (Texas Country Reporter)",
    "Chow down at our viewers' choice for Texas best Mexican food. To cast your vote for the Texas Best polls visit ..."
  ],
  [
    "12 COURSE MEXICAN Food Delivery - Eric Meal Time #457",
    "Today's Menu: 00:00 Intro & Food Delivery 1. 0:46 Corona Extra beer 2. 1:31 Mixed green Salad w/creamy lemon dressing 3. 2:32 ..."
  ],
  [
    "Mexican Food Experience",
    "Follow Adrianna and Daniel Hernández on their Food Adventures in Mexico!"
  ],
  [
    "Mexican Food Mukbang (Jumbo Burrito, Quesadilla &amp; Chips with Dip)",
    "MERCH: https://stephpappas.bonfire.com ♡ Instagram: @StephPappas ♡ ♡ Food Instagram: @StephsMeals ♡ ♡ Tiktok: ..."
  ],
  [
    "Mexican Food Mukbang!                            #foodie #shortvideo",
    ""
  ],
  [
    "British guys try SPICY Mexican snacks 🔥🌶",
    "Today we have a throwback to last year - as we try more snacks jollybeans sent in from around the world! We actually filmed this ..."
  ],
  [
    "Mexican food workshop Online live ..",
    ""
  ],
  [
    "Like a Local: Mony&#39;s Mexican Food",
    "There are tacos, then there's Mony's Mexican Food. As the locals know, this Funk Zone staple's authentic Mexican cuisine will fuel ..."
  ],
  [
    "Pancho&#39;s Food Review with Tosha Mexican Restaurant West Memphis Arkansas",
    "Tosha and I never been to Pancho's but heard some good thangs about it, we decided to pay them a visit and have lunch here."
  ],
  [
    "Tactical Mexican Food",
    "http://www.originalsoegear.com http://www.tacticalresponse.com http://www.rifledynamics.com http://thepatriotnurse.com/ ..."
  ],
  [
    "Kai Cenat&#39;s First Time Eating Mexican Food..😂",
    "Kai Cenat's First Time Eating Mexican Food..   FOLLOW ME ON TWITCH: https://www.twitch.tv/imkaicenat Follow My Socials: ..."
  ],
  [
    "The best Mexican Food in Seoul B&#39;Mucho Cantina , South Korea.",
    "Chris Da Canha introduced us to Julian Alejandro Tellez Mercado who owns B'Mucho a Mexican Cantina in Yeonnam-Dong in ..."
  ],
  [
    "Mexican Moms Try VEGAN Mexican Food!",
    "We asked our Mexican moms to try vegan Mexican food! Will they like the vegan version of the Mexican dishes they ..."
  ],
  [
    "Taco Bell VS AUTHENTIC Mexican Food",
    "We spent 8 days in Mexico City, learned a lot, offended a little, but came back with a fun concept. What is the difference between ..."
  ],
  [
    "Driving to Antipolo for Mexican Food | Dishes &amp; Destinations with Mitsubishi Ep. 1: Mirage G4",
    "Antipolo is home to pilgrims, suman, and some killer, authentic Mexican cuisine. We drive the Mitsubishi Mirage G4 GLS Sport to ..."
  ],
  [
    "Cooking Mexican Food: The Lucy &amp; Sophia Cooking Class (Part 1 of 2)",
    "Want to see everything we travel with?! Check out our Amazon Store https://www.amazon.com/shop/influencer-bc348f8b ."
  ],
  [
    "The Freshest Mexican Food in Las Vegas is Viva inside Resorts World scratch made tortilla guacamole",
    ""
  ],
  [
    "TRYING THE MOST OVERRATED MEXICAN FOOD",
    "Today we are trying one of the most popular dishes in Mexico...the problem is that we typically don't like this particular dish."
  ],
  [
    "Authentic Mexican Food Mukbang • Burritos &amp;  Tacos",
    ""
  ],
  [
    "Loaded Cheesy Chicken Quesidilla -  Spicy Mexican food -",
    "quesidilla #food #mexicanfood #instafood #foodie #foodporn #quickmeals #cooking #foodstagram #yummy #tacos #mexican ..."
  ],
  [
    "AUTHENTIC MEXICAN FOOD *for real this time (Mole Tacos + Tamales + Churros + Queso) MUKBANG",
    "AUTHENTIC MEXICAN FOOD *for real this time (Mole Tacos + Tamales + Churros + Queso) MUKBANG Finish college your way ..."
  ],
  [
    "Mexican Food Mukbang!                            #foodie #shortvideo",
    ""
  ],
  [
    "Mouth Watering MEXICAN FOOD Dishes You Need to Try! Best Mexican Food in LA (Part 11)",
    "Mouth Watering Mexican Food Dishes You Need to Try! Best Mexican Food in LA (Part 11) Steve Cha (aka Rockstar Eater) adds a ..."
  ],
  [
    "Americans Eat Mexican Food in the UK",
    "Hey guys! Hope you enjoy this vlog on our experience eating good Mexican food in the United Kingdom. Well done, La Baronia!"
  ],
  [
    "It’s not Authentic Mexican Food | MyHealthyDish #Shorts #flautas",
    "Quick dinner recipe with leftover Ground Turkey #mexicanfood #easyrecipe #lunchideas #healthyrecipes."
  ],
  [
    "HOW to make Traditional Refried Beans | Authentic Mexican Food | Villa Cocina",
    "refriedbeans #mexicanfood #villacocina Refried beans are a staple when it comes to Mexican cuisine. Their creamy texture and ..."
  ],
  [
    "HALAL MEXICAN FEAST at BURRITO MASTERS | 100% HALAL MEXICAN FOOD IN CANADA",
    "In this video I had a feast at Burrito Masters! Everything on their menu is 100% Halal! For More Food Vlogs Stay connected here: ..."
  ],
  [
    "This is what REAL mexican food looks like",
    ""
  ],
  [
    "Mexican Rice Recipe | Part 1 | #shorts #mexicanrice #mexicanfood #youtubeshorts #streetfood #yummy",
    "shorts #mexicanfood #mexicanricerecipe #streetfood #youtubeshorts #food #recipe Veg Mexican Rice Recipe | Part 1 | वेग ..."
  ],
  [
    "TACO!!! Authentic Mexican Street Food - Nothing Like Taco Bell - Real Mexican Food!!!",
    "These Are Real Mexican Tacos!!! - Nothing Like Taco Bell - Mexican Street Food Is The Best!!! - You Want A Good Taco?"
  ],
  [
    "Eating At The Most VIRAL MEXICAN Restaurant... (HOT CHEETO FOOD COMBOS)",
    "A portion of today's video is sponsored by DUER Shop Duer here: ..."
  ],
  [
    "4 Must-Visit Mexican Restaurants in Portland | Sweet Heat with Rick Martinez",
    "Rick heard great things about Mexican food in Portland, Oregon so he hopped on a plane for a whirlwind trip filled with mole, ..."
  ],
  [
    "Enjoy MEXICAN FOOD in INDIA now with Riliberto&#39;s Restaurant Tour | News Today Live",
    "MexicanFood #Riliberto ⬇️Subscribe ⬇️ http://www.youtube.com/newstodaylive Facebook: ..."
  ],
  [
    "10 BEST MEXICAN FOOD EVER!",
    "TOP 10 BEST MEXICAN FOOD!! In this video we take you on a food tour to our FAVORITE food spots in San Miguel de Allende!"
  ],
  [
    "Paul Hollywood SHOCKED By The Strangest Mexican Food | Paul Hollywood Eats... Mexico",
    "Paul Hollywood experiences the weird and wonderful cuisine of Mexico, as he eats some of the world's hottest chillies, tries an ..."
  ],
  [
    "Triana&#39;s Real Mexican Food – Haverhill, MA",
    "Wicked Bites has found a must try spot in downtown Haverhill. Dishes made with real and unique homemade Mexican flavor."
  ],
  [
    "Taco Tuesday | Best Tacos | The Mexican Food Channel | Real Mexican Tacos | Happy Chef = Great Tacos",
    ""
  ],
  [
    "Mexican Moms Rank Mexican Snacks",
    "Mexican moms rank popular Mexican snacks like gansito, bubu lubu, duritos, sabritones, takis, and more! Filmed and Produced ..."
  ],
  [
    "Thief DESTROYS Mexican Restaurant (5M Special)",
    "I called this woman over the course of 5 months, and it's the best prank I've ever pulled off. Things got so crazy that I had to hop on ..."
  ],
  [
    "A Fascinating Behind-the-Scenes Look at History of Mexican Food",
    "A Fascinating Behind-the-Scenes Look at History of Mexican Food. With recipes that date back hundreds of years and traditions ..."
  ],
  [
    "MEXICAN FOOD- Homemade BARBACOA Tacos (2 ways) | Instant Pot &amp; Slow COOKER Recipe",
    "Ingredients for Barbacoa Enchilada Oaxaca Style 4 to 8 Pounds of chuck roast or choice of fatty beef cuts 2 cups of water + ..."
  ],
  [
    "GREASY MEXICAN FOOD FEAST",
    "MY BRAND NEW CHANNEL! https://youtube.com/channel/UCRdFo4dY8bxHitHktNAWDxQ SHOP my MEXICAN AMERICAN ..."
  ],
  [
    "Jamaican Tries Mexican Food | Reaction Video",
    "Today I will be cooking a Mexican dish and trying it. (Reacting to Mexican food) ..."
  ],
  [
    "Documentary of Mexican Cuisine | Mexican Food |Mexican Cooking Story",
    "Mexican cuisine began 9000 years ago, 7000 BC, when agricultural communities such as the Maya formed, domesticating maize, ..."
  ],
  [
    "Chicken Burrito Recipe Healthy | Mexican Food",
    ""
  ],
  [
    "again my take on mexican food, does it look good?",
    ""
  ],
  [
    "Mexican Food#shorts",
    ""
  ],
  [
    "MEXICAN FOOD RECIPES COMPILATIONS | SATISFYING AND TASTY FOOD| MEXICAN FOOD COOKING",
    "Casserole compilations to help you make a quick and easy meal for your lovely family☁️The ingredients and quick tips are listed ..."
  ],
  [
    "How to Cook Chile Verde Mexican Food - Recipe Yum!",
    "Join me, as I show you how to cook Chile Verde Mexican Food from start to finish! I hope you enjoy this recipe! Below is Rockin ..."
  ],
  [
    "MEXICAN FOOD MUKBANG!",
    "WHAT'S UP YUMMYBITERS!!! SO TODAY WE ARE HAVING A MEXICAN FOOD MUKBANG! MY NEW ASMR CHANNEL: ..."
  ],
  [
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time! #Shorts",
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time Looking for the best Mexican food in Los Angeles? Consider El ..."
  ],
  [
    "How to pronounce Mexican food",
    "Website: https://noitienganhchuan.org #noitienganhchuan, #tienganhmy Facebook: https://www.facebook.com/noitienganhchuan ..."
  ],
  [
    "Jailhouse recipes comp 5! - Mexican dishes! - Pozole, tamales, ceviche, menudo",
    ""
  ],
  [
    "🔥Mexican Food in Chennai 🤠💥 ! El Toro, Chennai",
    "D hippo."
  ],
  [
    "Authentic Mexican food according to people who aren’t Mexican",
    "I have a pet peeve! People who invalidate ethnic food on the grounds of their purported privileged access to that food's ..."
  ],
  [
    "Bangalore&#39;s Famous Bannerghatta National Park | Eating Mexican Food At Sanchez, Indiranagar.",
    "This is a vlog of visiting Bannerghatta National Park and eating at a Mexican Restaurant in Bangalore city. Follow me on ..."
  ],
  [
    "HEALTHY MEXICAN FOOD in Westport Connecticut - Don Memo #shorts",
    "What a healthy meal! Best Mexican Food in Westport Connecticut at Don Memo! Join me for the Food Travel! #shorts #foodtravel ..."
  ],
  [
    "MEXICAN FOOD- The Absolutely BEST BEEF RIBS Street Tacos are JUICY &amp; TENDER!!!",
    "Make sure that you have the bell turned on, so you will definitely not miss any of our videos!! Happy RIB Baking!! Pre-heat oven ..."
  ],
  [
    "Mexican food workshop Online live ..",
    ""
  ],
  [
    "Jailhouse recipes comp 5! - Mexican dishes! - Pozole, tamales, ceviche, menudo",
    ""
  ],
  [
    "the best Mexican food in Kansas City #shorts",
    "shorts #short #foodie #foodvideo #foodvlog #food #cooking #cookingvideo #vlog #mexicanfood #kc #kansascity #kcmo ..."
  ],
  [
    "Taco Mexicana - Homemade Dominos Style in Tawa / Oven Tacos Shells Recipes - CookingShooking",
    "In this video, we will cook together Taco Mexicana which is a very popular recipe from Dominos India, at home. This Indo ..."
  ],
  [
    "How to make Loaded Nachos #mexico #nachos #mexicanfood",
    "Get ready to cheer up your favorite team with loaded Nachos #fifa22 ⚽ Nachos Chili Con Carne Cheddar & Mozzarella ..."
  ],
  [
    "HEALTHY MEXICAN FOOD in Westport Connecticut - Don Memo #shorts",
    "What a healthy meal! Best Mexican Food in Westport Connecticut at Don Memo! Join me for the Food Travel! #shorts #foodtravel ..."
  ],
  [
    "EatTC - The Original Pepe&#39;s Mexican Food",
    "Award-winning breakfast burritos, grass-fed beef tacos and freshly-rolled taquitos are just a few delicious dishes you'll find at ..."
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "How to make Mexican Carne Con Chile Colorado Y Papas | Stewed Beef Recipe | Views on the road",
    "Hello & welcome to the Views Kitchen! in today's recipe we will be showing you how to make Carne con chile colorado that you'll ..."
  ],
  [
    "Eating Pozole and Mexican food in San Antonio, Texas | TheFatPassport #shorts",
    ""
  ],
  [
    "Authentic Mexican food according to people who aren’t Mexican",
    "I have a pet peeve! People who invalidate ethnic food on the grounds of their purported privileged access to that food's ..."
  ],
  [
    "Mexican Food in Tagaytay, Cavite PHILIPPINES - Chinampa Restaurant at Cabins by Eco Hotel",
    "Craving for authentic Mexican Food like soft tacos, cheese quesadillas and nachos? We tasted some of the delicious Mexican ..."
  ],
  [
    "HUGE MEXICAN FOOD CHEAT MEAL | Burritos, Tortas, Sopes, Guacamole | Authentic Mexican Cuisine",
    "Mexican food is a very delicious cuisine and one of my all time favorites! Today we dine some delicious items including Burritos, ..."
  ],
  [
    "ASMR AL PASTOR TACOS &amp; GIANT BURRITO MEXICAN FOOD MUKBANG | Eating Show | ASMR Phan",
    "ASMR AL PASTOR TACOS & BURRITO MEXICAN FOOD MUKBANG | Eating Show | ASMR Phan PART 2 VLOG feeding Fluffy ..."
  ],
  [
    "Thief DESTROYS Mexican Restaurant (5M Special)",
    "I called this woman over the course of 5 months, and it's the best prank I've ever pulled off. Things got so crazy that I had to hop on ..."
  ],
  [
    "Best Mexican Food At Dumas Road, Surat",
    ""
  ],
  [
    "Like a Local: Mony&#39;s Mexican Food",
    "There are tacos, then there's Mony's Mexican Food. As the locals know, this Funk Zone staple's authentic Mexican cuisine will fuel ..."
  ],
  [
    "Mexican food has my heart 🤍 | a’Verde Cocina + Tequila Library | North Carolina #shorts",
    "Mexican food has my heart | a'Verde Cocina + Tequila Library | North Carolina #shorts."
  ],
  [
    "Mexican Street Food TikTok | Cooking Mexican Food TikTok | Amazing Cooking Skills of Mexicans #28",
    "mexicanfood #mexicancooking #mexicanrecipe #mexicanrecipes #mexicanstreetfood."
  ],
  [
    "MEXICAN FOOD! (+alcohol)",
    "Oscar brings me some great Mexican food to try!"
  ],
  [
    "3$ Burgers Mexican Village 🇲🇽🍔",
    "shorts We tried some hamburgers at a local stand in Tomatlán. I didn't know back then that they put ham into their hamburgers but ..."
  ],
  [
    "Piña con Jicama y Chamoy | The Mexican Food Channel | Mexican Snack | Chamoy",
    ""
  ],
  [
    "Korean in her 70s tries MEXICAN FOOD FOR THE FIRST TIME (Tacos, Burrito, Nachos)",
    "reacthing #GrandmaOK #MexicanFood Hello, Welcome to our channel! ‍♀️ ‍♂️ I LOOOOOOVVVEEE Mexican Food!"
  ],
  [
    "In Dubai Better Mexican Food Than Paris في دبي الأكل المكسيكي أفضل من باريس",
    "I always say Dubai is one of the top destinations when it comes to authentic cuisines from every corner of the world. For now ..."
  ],
  [
    "Best Mexican Food East Of California. Senor Julian Mexican Bar And Grill.",
    ""
  ],
  [
    "again my take on mexican food, does it look good?",
    ""
  ],
  [
    "I got SCHOOLED on Birria Tacos by a Master, ft. @La Capital",
    "Thank you Dalstrong for sponsoring this video . Get your new favorite knives here: https://dalstrong.com/collections/all-knives ..."
  ],
  [
    "🇲🇽 Mexican Food Ep. 5 - Huevos Rancheros",
    ""
  ],
  [
    "Ordering at a Mexican Restaurant on a Carnivore/Keto Diet",
    "This was my first time at On the Border and what an awesome experience as a Carnivore!! Anytime I'm at a Mexican restaurant I ..."
  ],
  [
    "Fresh Street Tacos | Mexican Tacos | The Mexican Food Channel | Tacos Al Pastor | straight Fire",
    ""
  ],
  [
    "#1 RATED Mexican Food in CALIFORNIA!",
    ""
  ],
  [
    "La Reina Inc. and Anita&#39;s Mexican Food Corp.",
    "La Reina Inc. and Anita's Mexican Food Corp. The story of Anita's is quite frankly, inspirational. The origins of the business date ..."
  ],
  [
    "KAMPOT IS AWESOME! 🤩 (Must visit in Cambodia | Mexican food | Best retirement for expats in Asia)",
    "Also watch this vlog in Kannada: https://youtu.be/Q46J9AmbDDU After a few days in Phnom Penh, we took a bus down to Kampot ..."
  ],
  [
    "Collections of Mexican foods #youtubeshorts #youtube #shorts #best #food",
    ""
  ],
  [
    "It’s not Authentic Mexican Food | MyHealthyDish #Shorts #flautas",
    "Quick dinner recipe with leftover Ground Turkey #mexicanfood #easyrecipe #lunchideas #healthyrecipes."
  ],
  [
    "Tacos Nachos Mexican Food In Karachi | Extreme mexican food #shorts",
    ""
  ],
  [
    "Mexican Burger | Hamburgesa Mexicans | The Mexican Food Channel | Oaxaca Cheese Burger | Best Burger",
    ""
  ],
  [
    "TAKING MY GF TO EAT MEXICAN FOOD",
    ""
  ],
  [
    "AUTHENTIC MEXICAN FOOD MUKBANG • Birria Tacos, Nachos, Burritos, Quesadilla, Elote, Taquitos +",
    "EATING BIRRIA tacos, LOADED nachos, taquitos, bean and cheese burrito nachos, elote & much more from my favorite Mexican ..."
  ],
  [
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time! #Shorts",
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time Looking for the best Mexican food in Los Angeles? Consider El ..."
  ],
  [
    "How to make Veg Enchiladas | Enchiladas Recipe | Mexican food",
    "Learn how to make Enchiladas at Home, delicious and exotic food dishes from #theglobalblogster . We travel around the world to ..."
  ],
  [
    "Mexican food every foodie should try in Budapest",
    "PAPITOS BUDAPEST - MEXICAN STREET FOOD."
  ],
  [
    "Chipotle vs Qdoba Taste Test | FOOD FEUDS",
    "Today, we're pinning two fast Mexican food chains against each other: Chipotle vs. Qdoba-- who will win? FOOD FEUDS!"
  ],
  [
    "Cheesy Mexican Food Mukbang! Burritos, Tamales + Enchiladas, Taquitos, Chips N&#39; Guac",
    "I was craving Mexican food and it was Friday- so i decided to celebrate my new national holiday of eating Mexican food on ..."
  ],
  [
    "Enjoy a Authentic Mexican food!",
    "More than 30 delicious Mexican food dishes to taste. Come and try them! Location: 3333 N University Dr Davie, Miami FL 33024 ..."
  ],
  [
    "Best Mexican Food in El Paso, Texas //  [USA Road Trip Travel Vlog VII]",
    "Disclaimer: This video was filmed before the recent Covid-19 outbreak. I am now self-isolating in my home in California and will ..."
  ],
  [
    "LA vs SF vs SD (Mexican Food Edition)",
    ""
  ],
  [
    "HUGE MEXICAN FOOD MUKBANG",
    "HUGE MEXICAN FOOD MUKBANG Story TIme - Nachos, Street Tacos, and a torta, . Lots of love, Stephanie #Mexicanfood #torta ..."
  ],
  [
    "Mexican food",
    "freefire #fyp #toxic #beauty #power #food #food #fabulous #mexico #mexicanfood."
  ],
  [
    "Mexican Food Culture",
    "http://preparetoserve.com/MEXICO Mexican Food Culture."
  ],
  [
    "Newest Mexican Restaurant in YegTown",
    "FilmoraGo."
  ],
  [
    "This Place In Mumbai Serves Authentic Mexican Food",
    "New York Burrito Company in Ghatkopar serves some of the most authentic Mexican dishes you'll come across in Mumbai."
  ],
  [
    "Mexican Samosa Recipe | Mexican appetiser | Indian Mexican food | मेक्सिकन समोसा | મેક્સિકન સમોસા",
    "Mexican Samosa Recipe Mexican appetiser Easy to make Indian style Mexican Samosa मेक्सिकन समोसा बनाने ..."
  ],
  [
    "Mexican Moms Rank Every Mexican Food! (Compilation)",
    "We have asked our Mexican Moms to try many different foods in the past few years so we put together a 3+ hour compilation of the ..."
  ],
  [
    "Authentic Mexican Food and The History of Mariachi",
    "Nothing like authentic Mexican food and some Mariachi History! ♦️Featured: ✤Taco Jalisco: ..."
  ],
  [
    "Indian try Mexican food for lunch |  #Shorts #streetfood",
    "I ordered Mexican food for lunch | Trying Chili's LUNCH MENU! Chili's fajitas are outstanding. Enjoyed our lunch!!! Thanks For ..."
  ],
  [
    "MEXICAN FOOD | #Nachos #Tacos #Salmon #foodie",
    "mexicanfood #nacho #tacos #searedsalmon #salmon #food #homecookingwithjeanette."
  ],
  [
    "Taco Bell VS AUTHENTIC Mexican Food",
    "We spent 8 days in Mexico City, learned a lot, offended a little, but came back with a fun concept. What is the difference between ..."
  ],
  [
    "Mi yaodana car wash touba….yamsu thuba aduga waisu sangba + Mexican food try touba ||🚙🧼🌮🌯😄",
    ""
  ],
  [
    "Paneer taco | पनीर टाको | Mexican Food | Recipe by Akshit Vermani",
    "Paneer taco | पनीर टाको | Mexican Food | Recipe by Akshit Vermani A paneer taco is a traditional Mexican dish consisting ..."
  ],
  [
    "CHILAQUILES | Mexican Survival Guide",
    "Chilaquiles is a traditional Mexican breakfast that consists of corn tortillas that are cut into quarters and lightly fried, covered in ..."
  ],
  [
    "ULTIMATE Mexican Food Tour 🇲🇽BEST Food in Mexico",
    "Watch My FREE 1 Hour Spanish Masterclass https://spanishwithnate.com/?src=yt Join me on a mouth watering Mexican food ..."
  ],
  [
    "EatTC - The Original Pepe&#39;s Mexican Food",
    "Award-winning breakfast burritos, grass-fed beef tacos and freshly-rolled taquitos are just a few delicious dishes you'll find at ..."
  ],
  [
    "ITS BEST MEXICAN FOOD",
    ""
  ],
  [
    "Mexican Sizzler 😋Tag a Mexican Food Lover",
    "mexicansizzler #teribatonmein #teribatonmein❤️ #raghav #sizzlinghot #hotandspicy #hotandspicyfood #sizzlers #sizzler ..."
  ],
  [
    "Documentary of Mexican Cuisine | Mexican Food |Mexican Cooking Story",
    "Mexican cuisine began 9000 years ago, 7000 BC, when agricultural communities such as the Maya formed, domesticating maize, ..."
  ],
  [
    "Mexican Food",
    ""
  ],
  [
    "Mexican Food In Korea : Vatos",
    "We go to a favourite chain of Xander's Vatos, the Korean Mexican fusion restaurant. Not only is the food great, but the drinks are ..."
  ],
  [
    "Authentic Mexican Food Mukbang • Burritos &amp;  Tacos",
    ""
  ],
  [
    "Taco Review Episode 16 -  Yuliana&#39;s Mexican Food",
    "Yuliana's Mexican Food is about a 5-minute drive from my house and I've never tried it until now. I'm not gonna lie... I had VERY ..."
  ],
  [
    "Federico&#39;s Mexican Food Buckeye Az Grand Opening Jun 2014 cocina GoCampeones com 2-3",
    "For nearly two decades Federico's Mexican Food hasserved the best-tasting carne asada to its ever-growing following in Arizona ..."
  ],
  [
    "CASAMIGOS FOOD REVIEW| MINNESOTA AUTHENTIC MEXICAN FOOD- Tacos &amp; Enchiladas",
    "CASAMIGOS FOOD REVIEW IN MINNESOTA. The price was for the food is reasonable. Casamigos AKA Casa Azul Agave ..."
  ],
  [
    "Mexican food every foodie should try in Budapest",
    "PAPITOS BUDAPEST - MEXICAN STREET FOOD."
  ],
  [
    "Good Mexican Tamales: Mexican food in Kansas City?",
    "Good Mexican Tamales: Mexican food in Kansas City? I was hungry after a quick workout while on a layover in Kansas City."
  ],
  [
    "Best Modern Mexican Food in Las Vegas Hola Mexican Cocina Cantina",
    "In this video we met up with one of my good friend Co-Owner of Hola Mexican Conina Cantina. We get to go behind the kitchen ..."
  ],
  [
    "This is what REAL mexican food looks like",
    ""
  ],
  [
    "BIG A** Burritos! | Sayulitas Mexican Food | Munchin&#39; Mondays",
    "Hot cheetos burrito?! Pacman Fries?! A burrito the size of two forearms! What do these all have in common? You can find it at ..."
  ],
  [
    "Mexican Food, Mushroom Quesadilla, Chicken Tacos | Uba Tuba Restaurant Review | Bandra - Mumbai",
    "Uba Tuba is a Mexican Food joint in Bandra. Check out the Mexican cuisine review here. For more updates on the spiciest and ..."
  ],
  [
    "Tortilla wrap Mexican food by SCN Recipes",
    "shorts #tortillawraptaco#scnrecipes Click link below to watch full videos Popular Uploads/ Kabab/keema Kabob/chicken tikka/tikka ..."
  ],
  [
    "Mexican Food must try",
    ""
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "Trying MEXICAN FOOD for the FIRST TIME! *SPICY BURRITO*",
    "TikTok: @tacobellfan22 Instagram: @tacobellfantoo."
  ],
  [
    "Indian Style Tacos /fusion food/ Tasty tacos for mexican food lovers/Taco recipe without Maize Flour",
    ""
  ],
  [
    "Mexican food in South Florida",
    ""
  ],
  [
    "Vegetable Quesadilla Recipe | Easy Breakfast recipe | Homemade Quesadilla | Mexican food | Tortilla",
    "Easy Cheesy Quesadilla Recipe | Veggie Quesadilla Recipe Video | Breakfast ideas | easy breakfast recipes | Veg Quesadilla ..."
  ],
  [
    "Paul Hollywood SHOCKED By The Strangest Mexican Food | Paul Hollywood Eats... Mexico",
    "Paul Hollywood experiences the weird and wonderful cuisine of Mexico, as he eats some of the world's hottest chillies, tries an ..."
  ],
  [
    "इस delicious Mexican food का ज़ायक़ा Indian जैसा | Chipotle, New York",
    "In this video, I am having Chipotle's crispy corn taco bowl, a great option for vegetarian food lovers in New York City. Chipotle ..."
  ],
  [
    "This Mexican restaurant in Denver Colorado will blow your mind!#denvercolorado #denverfood",
    ""
  ],
  [
    "No Way Jose&#39;s Mexican Food in Gatlinburg TN:  a Mexican Restaurant in Gatlinburg with Margaritas",
    "No Way Jose Cantina in Gatlinburg TN offers a Mexican food restaurant to those needing their margaritas, chips & salsa, tacos, ..."
  ],
  [
    "How to Make Enchiladas Without Oven | Veg Enchiladas | Homemade Mexican Food",
    "How to Make Enchiladas Without Oven | Veg Enchiladas | Homemade Mexican Food Enchiladas Recipe Video, learn how to ..."
  ],
  [
    "What Aztecs Were Eating Before European Contact",
    "The Aztecs thrived in the area corresponding to Mexico between the 14th and 15th centuries until they were overthrown by ..."
  ],
  [
    "Carne Guisada con papas - Mexican Beef Stew - Mexican Food",
    "Carne Guisada is a Mexican beef stew that screams delicious comfort food with fresh flavors and soft tender beef. Nothing better ..."
  ],
  [
    "How to Make Guacamole Like Your FAVORITE MEXICAN RESTAURANT!!! #shorts",
    "Here's how to make a simple Guacamole at home! All of these videos are on my Instagram and TikTok as well! Jovi_greene on all ..."
  ],
  [
    "Nanajoe Makes Modern Mexican Food &amp; Lizzo Loves It | How Do You Holiday? | @Nanajoe 19 | TOGETHXR",
    "Alejandra Tapia, known as @nanajoe19 on TikTok, is from Puerto Vallarta, Mexico, but currently resides in Visalia, California."
  ],
  [
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time! #Shorts",
    "Restaurant Mom Cooking 10 Mexican Dishes at the Same Time Looking for the best Mexican food in Los Angeles? Consider El ..."
  ],
  [
    "Mexican Red Rice with Jacket Potatoes Recipe | Easy To Make Mexican Food",
    "Simple recipe to make Mexican Red Rice with Jacket Potatoes Serves 4 Ingredients: For Red Rice: Rice - 1 Cup Red Chilli: 2-3 ..."
  ],
  [
    "Beef Salad, Salpicon Recipe, HEALTHY MEXICAN FOOD",
    "Salpicón is a Mexican salad with shredded beef. This Mexican SALPICÓN recipe is actually a shredded beef salad that can be ..."
  ],
  [
    "Taco Bell || Mexico || Mexican Restaurant in Chandigarh, India 📍",
    "Does it ring a bell?  🛎️ If it doesn't  , then you must ring the Taco Bell         Location: Taco Bell, Sector 35, Chandigarh   ..."
  ],
  [
    "OLDEST MEXICAN FOOD RESTAURANT in AMERICA",
    "SEASON 2 - El Charro Cafe - Episode 2 of Season 2: Journey Maps Live & Local featuring the oldest Mexican food restaurant, ..."
  ],
  [
    "Mexican Rice #mexicanfood #viral",
    ""
  ],
  [
    "Mexican food every foodie should try",
    ""
  ],
  [
    "INDIAN TRYING MEXICAN FOOD FOR THE FIRST TIME | MEXICAN FOOD MUKBANG",
    "Hey foodies what's up??? Today I am going to try Mexican food for the fist time.. Restaurant Name: Taco Mex (Race Course, ..."
  ],
  [
    "We Love Mexican Food!",
    "One of the best parts about living in Mexico is getting to eat all the delicious food here. Over the last two and a half years, we've ..."
  ],
  [
    "we tried the worst rated food",
    "BE ONE OF THE BOYS WITH YOUTUBE MEMBERS: https://www.youtube.com/channel/UCrXzMVbjcaVvVtihxNpBvMQ/join ..."
  ],
  [
    "Paneer taco | पनीर टाको | Mexican Food | Recipe by Akshit Vermani",
    "Paneer taco | पनीर टाको | Mexican Food | Recipe by Akshit Vermani A paneer taco is a traditional Mexican dish consisting ..."
  ],
  [
    "Pancho&#39;s Food Review with Tosha Mexican Restaurant West Memphis Arkansas",
    "Tosha and I never been to Pancho's but heard some good thangs about it, we decided to pay them a visit and have lunch here."
  ],
  [
    "Mexican Food, So Satisfying 😋",
    ""
  ],
  [
    "Cooking Mexican Food: The Lucy &amp; Sophia Cooking Class (Part 1 of 2)",
    "Want to see everything we travel with?! Check out our Amazon Store https://www.amazon.com/shop/influencer-bc348f8b ."
  ],
  [
    "See why customers love Lollicupstore.com! Introducing Mauricio&#39;s Mexican Food &amp; Pizza!",
    "LollicupStore is an online store specializing in restaurant supplies, coffee, and tea operating under Karat by Lollicup. See why ..."
  ],
  [
    "MEXICAN FOOD EP2 | CUSTOMS AND CUISINE | MEXICAN FRIED CHICKEN RECIPE |RLumbang MyMEDIA #documentary",
    "Title: #documentary EP2 MEXICAN FOOD | CUSTOMS AND CUISINE | BLASTING WITH MEXICAN FRIED CHICKEN |RLumbang ..."
  ],
  [
    "When it’s your first time in Mexico but you know Mexican food… #mexico #food #foodie #mexicanfood",
    ""
  ],
  [
    "HUGE MEXICAN FOOD CHEAT MEAL | Burritos, Tortas, Sopes, Guacamole | Authentic Mexican Cuisine",
    "Mexican food is a very delicious cuisine and one of my all time favorites! Today we dine some delicious items including Burritos, ..."
  ],
  [
    "The Best Homemade Salsa Recipe |  Mexican Restaurant Style Salsa | Basic Salsa | #shorts",
    "salsarecipe #mexicansalsa #shorts The Best Homemade Salsa Recipe Keep watching, liking & sharing our quick recipes with ..."
  ],
  [
    "Abuelo’s Mexican Food / Restaurante Mexicano Abuelos",
    "Fuimos a cenar al restaurante Abuelos en Peoria Az. Muy buena comida especialmente las fajitas y a muy buen precio y bonito ..."
  ],
  [
    "Mexican Food, Mushroom Quesadilla, Chicken Tacos | Uba Tuba Restaurant Review | Bandra - Mumbai",
    "Uba Tuba is a Mexican Food joint in Bandra. Check out the Mexican cuisine review here. For more updates on the spiciest and ..."
  ],
  [
    "Hidden Spot for Mexican Food in MIAMI",
    ""
  ],
  [
    "10 BEST MEXICAN FOOD EVER!",
    "TOP 10 BEST MEXICAN FOOD!! In this video we take you on a food tour to our FAVORITE food spots in San Miguel de Allende!"
  ],
  [
    "Cheesy BIRRIA Mexican Food Mukbang ASMR Quesa BIRRIA Tacos, Burritos, Consomé, Chips, Guacamole +",
    "Eating Cheesy Birria Mexican Food ASMR Mukbang Eating Quesa Birria Tacos, Birria Quesadilla, Vampiro, Birria Burrito, Bean ..."
  ],
  [
    "MEXICAN FOOD in LA that Tastes Just Like Mom&#39;s Home Cooking!",
    "Mexican Food in LA that Tastes Just Like Mom's Home Cooking! Looking for some of the best Mexican food in Los Angeles?"
  ],
  [
    "Nettie&#39;s Fine Mexican Food considers future",
    "The owners of Nettie's Fine Mexican Food are picking up the pieces and looking forward after a devastating Christmas Eve fire."
  ],
  [
    "Newest Mexican Restaurant in YegTown",
    "FilmoraGo."
  ],
  [
    "Mexican food is both a blessing and a curse Video By lizetteam0r #Shorts",
    "For Copyright Contact @ Brighthit01@gmail.com #Shorts."
  ],
  [
    "MEXICAN FOOD | #Nachos #Tacos #Salmon #foodie",
    "mexicanfood #nacho #tacos #searedsalmon #salmon #food #homecookingwithjeanette."
  ],
  [
    "This Place In Mumbai Serves Authentic Mexican Food",
    "New York Burrito Company in Ghatkopar serves some of the most authentic Mexican dishes you'll come across in Mumbai."
  ],
  [
    "MEXICAN FOOD MUKBANG | CHEESY STEAK TACO🌮 + QUESDILLAS | RICE + PINEAPPLE JARRITO | chewing sounds",
    "Helllooooo!! Today was smacked on: Chew On This Co. 7544 W. Addison St. Chicago, IL 2 steak quesadillas and basically 1 ..."
  ],
  [
    "Yeah Buddy.. Taco King is excellent. Some of the best Mexican food around.",
    "birria #foodblogger #tacos #ramen #foodie #canamryker #mexicanfood."
  ],
  [
    "Bangalore&#39;s Famous Bannerghatta National Park | Eating Mexican Food At Sanchez, Indiranagar.",
    "This is a vlog of visiting Bannerghatta National Park and eating at a Mexican Restaurant in Bangalore city. Follow me on ..."
  ],
  [
    "THE BEST TACOS 🌮 - KEEP 3 KILL 3 #tacos #taco #mexican #mexicanfood #carneasada #latinos #foodie",
    ""
  ],
  [
    "Tortilla wrap Mexican food by SCN Recipes",
    "shorts #tortillawraptaco#scnrecipes Click link below to watch full videos Popular Uploads/ Kabab/keema Kabob/chicken tikka/tikka ..."
  ],
  [
    "Tim Hawkins Mexican Food",
    ""
  ],
  [
    "#shorts  Delicious Lunch Mojara - Mexican Food - Mojara Dish",
    "Hit the [Subscribe] button or click here to sub: https://vod.strms.net/s/UCQ9B6H1WQH5N1Q0m8zX2MIA *** ⭐ Newest Subscriber: ..."
  ],
  [
    "HOLA |  | MEXICAN CUISINE | CHENNAI - OMR  | WEEKENDS",
    "To all the mexican food lover's out there, Hola is the best restaurant to unleash your mexican food cravings. Watch out for the food ..."
  ],
  [
    "Mexican food 🌮 🇲🇽 #mexico #food",
    "Taco is my favorite mexican food #taco #mexico #easyrecipe #foodchannel #istanbul #restaurant #méxico #foodie #delicious ..."
  ],
  [
    "Mexican food",
    ""
  ],
  [
    "Mexican food in South Florida",
    ""
  ],
  [
    "Mexican Chicken Quesadilla Recipe | Mexican Food Recipe",
    "Chicken quesadilla is an easy and festive dish. Tortillas stuffed with tender and perfectly seasoned chicken with Sauteed bell ..."
  ],
  [
    "CASAMIGOS FOOD REVIEW| MINNESOTA AUTHENTIC MEXICAN FOOD- Tacos &amp; Enchiladas",
    "CASAMIGOS FOOD REVIEW IN MINNESOTA. The price was for the food is reasonable. Casamigos AKA Casa Azul Agave ..."
  ],
  [
    "Mexican Food",
    ""
  ],
  [
    "DRAGON FRUIT | The Mexican Food Channel | PITAYA Snack | Mexican Snack",
    ""
  ],
  [
    "Mexican food night",
    ""
  ],
  [
    "Camp TACOS, TORTAS &amp; GORDITAS - Camping And Cooking MEXICAN FOOD Over The Fire",
    "Backpacking & Camping Trip Where We Cook Some AMAZING Mexican Food - Delicious Barbacoa TACOS, Grilled Steak ..."
  ],
  [
    "Authentic Mexican Food Restaurant in America!!",
    "I went to Poblanos Restaurant, an authentic Mexican restaurant, located in Chattanooga, Tennessee to taste authentic Mexican ..."
  ],
  [
    "Banana Cream Pie || Mexican Food | Recipe Series | Easy Food Recipes",
    "Banana Cream Pie || Mexican Cuisine Taking you on a journey to the delicious world of yummy recipes, with our easy to follow, ..."
  ],
  [
    "Friday fire destroys Nettie&#39;s Mexican restaurant in Bellevue",
    "No firefighters or employees suffered any injuries during the fire, and no customers were inside. Subscribe to KETV on YouTube ..."
  ],
  [
    "Hot Wine Taste ఎలా ఉంది ? || Mulled Wine || Mexican Food || Christmas Market",
    "In this video, we will take you to Canopy Christmas Market in Kings Cross, London. There are many stalls selling cheese, bread, ..."
  ],
  [
    "Beto&#39;s Mexican Food Commercial [Yuma, AZ]",
    "One of the most 'classic' commercials from Yuma TV in the 80s. Figured this needed to be preserved for future generations."
  ],
  [
    "Mexican Food in Chennai ft. Mex It Up by Chef Kavya Verghese Chennai Cloud Kitchens Review 1",
    "\"Cloud Kitchen Reviews\" A cloud kitchen is a concept of delivery only restaurant with no physical space, no dine-in space or ..."
  ],
  [
    "my INDIAN mom tries MEXICAN food (while answering random questions about life) | Taco Bell Mukbang 🌮",
    "So, after seeing how much ya'll liked seeing the ' my INDIAN mom tries KOREAN food ' video ..."
  ],
  [
    "WHAT I EAT | MEXICAN FOOD #shorts #mexicanfood #nachos #tacos #whatieatinaday #foodreview #whatieat",
    ""
  ],
  [
    "Fritos Cheetos nacho Pie | The Mexican Food Channel | Mexican Snack | Frito Pie | Cheeto Pie | Nacho",
    ""
  ],
  [
    "MEXICAN FOOD, MEXICAN TACOS AND BURRITOS, MEXICAN STREET FOOD, TORTILLAS, STREET FOOD",
    "MEXICAN FOOD, MEXICAN TACOS AND BURRITOS, STREET FOOD IN LONDON, MEXICAN STREET FOOD, TORTILLAS, ..."
  ],
  [
    "This Mexican food is amazing 😍🤩🤩 #maxicanfood  #snack  #food #delicious",
    "please subscribe to our channel."
  ],
  [
    "Mexican Food",
    ""
  ],
  [
    "Yeah Buddy.. Taco King is excellent. Some of the best Mexican food around.",
    "birria #foodblogger #tacos #ramen #foodie #canamryker #mexicanfood."
  ],
  [
    "THE BEST TACOS 🌮 - KEEP 3 KILL 3 #tacos #taco #mexican #mexicanfood #carneasada #latinos #foodie",
    ""
  ],
  [
    "#shorts  Delicious Lunch Mojara - Mexican Food - Mojara Dish",
    "Hit the [Subscribe] button or click here to sub: https://vod.strms.net/s/UCQ9B6H1WQH5N1Q0m8zX2MIA *** ⭐ Newest Subscriber: ..."
  ],
  [
    "MEXICAN FOOD WISDOM AND MASTERY | CITY OF MORELIA | FOOD FESTIVAL",
    "SUPPORT OUR VIDEOS: https://www.patreon.com/5mexicanguys Subscribe for more food videos! : http://bit.ly/2HCq1zu ..."
  ],
  [
    "UPDATED Q&amp;A / MEXICAN FOOD MUKBANG",
    "ANSWERING A BUNCH OF YOUR QUESTIONS Enjoy my loves! Madi xxx."
  ],
  [
    "Which one is better? 👀 #mexican #food #snack #hispanic",
    "Shorts Which one is better? #mexican #food #snack #hispanic."
  ],
  [
    "Caption this 🥰🥰🥰 #asmr #storiesinhindi #mexicanfood #burrito #short #burritos #viralshorts #hulk",
    ""
  ],
  [
    "Vegetable Quesadilla Recipe | Easy Breakfast recipe | Homemade Quesadilla | Mexican food | Tortilla",
    "Easy Cheesy Quesadilla Recipe | Veggie Quesadilla Recipe Video | Breakfast ideas | easy breakfast recipes | Veg Quesadilla ..."
  ],
  [
    "Best Mexican food in town || Mamacita&#39;s  Restaurant #foodie #trending #texas #unitedstates",
    "mexico #mexicanfood #mexican #mexicanfoodlover #mexicana #gujju #gujratithali #gujratifoodchannel #indianfood #thali #dubai ..."
  ],
  [
    "Mexican food is my favorite 😍",
    ""
  ],
  [
    "Fritos Cheetos nacho Pie | The Mexican Food Channel | Mexican Snack | Frito Pie | Cheeto Pie | Nacho",
    ""
  ],
  [
    "quesaritos are a go to for something quick and simple #mexican #food #chef #cooking #fyp",
    ""
  ],
  [
    "Californian Searching for Mexican Food in Amsterdam, Pathé Tuschinski, Embarrassing Nespresso Story",
    "Quick weekend update... If you're wondering how I learned Spanish I learned it working as a nurse in California because a lot of ..."
  ],
  [
    "The most underrated Mexican food in Las Vegas - Juan&#39;s Flaming Fajitas #shorts",
    ""
  ],
  [
    "Mexican food ! 🤤🤤🤤🤤🤤",
    ""
  ],
  [
    "#shorts | Madro cafe chennai | Mexican food | Halal food ✅",
    "Come over to Madro cafe (Chennai) with your kids, family and friends for the fantastic food experience! 100% Halal food ..."
  ],
  [
    "Mexican Chicken Quesadilla Recipe | Mexican Food Recipe",
    "Chicken quesadilla is an easy and festive dish. Tortillas stuffed with tender and perfectly seasoned chicken with Sauteed bell ..."
  ],
  [
    "Tortilla wrap Mexican food by SCN Recipes",
    "shorts #tortillawraptaco#scnrecipes Click link below to watch full videos Popular Uploads/ Kabab/keema Kabob/chicken tikka/tikka ..."
  ],
  [
    "Tamales For Christmas Eve | The Mexican Food Christmas PARTY | Tamales For Christmas Traditions",
    ""
  ],
  [
    "Tasty Mexican Food in New Orleans - On the Hunt",
    "Gotta get some good Mexican food in New Orleans (or as good as you can find - I was warned today that there's no real Mexican ..."
  ],
  [
    "Authentic Mexican Food - Carne asada burritos, enchiladas, Flautas and Tacos - Mukbang!",
    "Crunchie Flautas with fresh guac on top...amazingly BBQ charred steak burritos, cheesy tacos and saucy enchiladas! We eat ..."
  ],
  [
    "Mexican Food #shorts #mexivato #mexicanfood #chileverde",
    ""
  ],
  [
    "Best Modern Mexican Food in Las Vegas Hola Mexican Cocina Cantina",
    "In this video we met up with one of my good friend Co-Owner of Hola Mexican Conina Cantina. We get to go behind the kitchen ..."
  ],
  [
    "CHEESY NACHOS 🧀 | Mexican food | Nachos Recipe #shorts",
    "Yummy Nachos topped with canned beans Instagram :- Janhavi_ashokmalti."
  ],
  [
    "My Indian husband cooks MEXICAN food | Yum YUM|  Ram and Pie",
    "Happy New Year to everyone!!! Please like and share our videos. Instagram: https://www.instagram.com/ram_and_pie."
  ],
  [
    "Nachos Recipe Vegetarian, Mexican Food Series EP - 4",
    "Nachos Recipe Vegetarian video is episode 4 of my Mexican Food Series. This Nachos Recipe is Homemade, Easy & Simple."
  ],
  [
    "🇲🇽🍇•Famous then Mexican food•famous 🍇🇲🇽",
    ""
  ],
  [
    "Lovers food tag your love ❤️❤️❤️❤️❤️❤️❤️ #asmr #mexicanfood #short",
    ""
  ],
  [
    "Review Authentic Mexican food!! #vacation #mexicanfood #review",
    ""
  ],
  [
    "Newest Mexican Restaurant in YegTown",
    "FilmoraGo."
  ],
  [
    "Mexican Burrito in Malayalam | homemade mexican food |#mexicanburritos",
    "home made mexican burrito, #burritos #homemadeburritos #mexicanburrito #mexicanburritomalayalam for more recipes pls visit ..."
  ],
  [
    "Guacamole Recipe, Mexican Food Series EP - 3",
    "Guacamole Recipe Video is part of our Mexican Food Series Episode 3, This Guacamole Recipe is Homemade, Easy & Simple."
  ],
  [
    "Food trend | Mexican food #shorts #youtubeshorts",
    ""
  ],
  [
    "Beto&#39;s Mexican Food Commercial [Yuma, AZ]",
    "One of the most 'classic' commercials from Yuma TV in the 80s. Figured this needed to be preserved for future generations."
  ],
  [
    "Try this authentic Mexican food and thank me later #shorts #reels #youtube #vlogging #explore #fyp",
    ""
  ],
  [
    "Mexican food you must try in Philly #philly #phillyfoodie #mexicanfood #tacos #margarita #food",
    ""
  ],
  [
    "Trying Super Burrito | Mexican food | So Delicious | Amazing Taste",
    "Look Trying Super Burrito | Mexican food | So Delicious | Amazing Taste. I recommend! #shorts #SuperBurrito #burritos ..."
  ],
  [
    "Indimex Bar and Restaurant in Greenslopes QLD serving Indian and Mexican Food",
    "Indimex is funky Indian with a Mexican twist and a warm welcome. Indimex is a place about taste. Your taste. Aussie pace."
  ],
  [
    "BEST MEXICAN FOOD AND MOCKTAILS IN VADODARA | CLUB OFFSHORE | VADODARA ON VLOGS | VOV",
    "Vadodara on vlogs team are at CLUB OFFSHORE to explore the best environment and maxican food and much more."
  ],
  [
    "Best Mexican Food in Wellington New Zealand - Rosie&#39;s Red Hot Cantina &amp; Taco Joint",
    "Bringing you the best street food from L.A. to the Baja Coast all the way to the Wellington waterfront. Over the years Rosie ate her ..."
  ],
  [
    "Some Authentic Mexican Food",
    "Wanting to share some real Mexican food with you all."
  ],
  [
    "Chicken Birria Mexican Food🌮",
    ""
  ],
  [
    "COYOÁCAN Market MEXICO City | Eating INCREDIBLE Mexican Food! | *Traducción al español*",
    "I have a new WEBSITE! Head over to https://www.thetaoofdavid.com/ for Travel, Digital Nomad and Teaching blog posts ..."
  ],
  [
    "Enchilada Casserole Recipe - Mexican Food",
    "Enchilada Casserole Recipe - Mexican Food Ingredients: 1 dozen corn tortillas 1 tablespoon vegetable oil for cooking 2 scallions ..."
  ],
  [
    "Chalupa | Super Delicious Mexican Food | Vegetarian Chalupa",
    "reyankaskitchen #chalupa #vegetarianchalupa Guacamole Recipe: https://www.youtube.com/watch?v=_8l-LpvTbxg Dough: All ..."
  ],
  [
    "Mexican Food #Shorts #mexicanfoods #mexicanfood #dinner #CarneAsada",
    "my family went to our favorite Mexican restaurant for dinner. It was very delicious! I ordered my all time favorite Carne Asada."
  ],
  [
    "Mexican food tonight.",
    ""
  ]
]