[
  [
    "Top 10 NYC Foods You MUST Try 2022",
    "Top 10 NYC Foods You MUST Try 2022 I gained 10 pounds to film this video so please subscribe @brettconti Follow my ..."
  ],
  [
    "Top 10 NYC Foods You MUST try Before you DIE",
    "Top 10 NYC Foods You MUST try Before you DIE Join the journey - https://www.youtube.com/user/brettconti Merch ..."
  ],
  [
    "10 Iconic NYC Restaurants To Visit When Social Distancing Is Over | Legendary Eats Marathon",
    "On March 17, New York City Mayor Bill de Blasio ordered all bars and restaurants in the city to close or serve only delivery and ..."
  ],
  [
    "The Halal Guys&#39; Chicken And Gyro Platter Is NYC’s Most Legendary Street Food | Legendary Eats",
    "The Halal Guys first came to the streets of New York City in 1990, when the three founders opened up a hot-dog cart in Midtown."
  ],
  [
    "The Iconic $1 Pizza Slice of NYC | Street Food Icons",
    "Eli and Oren Halali, the two brothers who founded 2 Bros Pizza, sell slices for a buck. They're known for getting their patrons in ..."
  ],
  [
    "The Legendary Dosa Man of NYC | Street Food Icons",
    "Thiru Kumar, AKA the Dosa Man, has been running NY Dosas, a food cart in Greenwich Village's Washington Square Park, since ..."
  ],
  [
    "31 NYC Restaurants You Need To Eat In Your Lifetime | The Ultimate List",
    "Insider compiled a list of 31 New York City restaurants you need to try before you die. The list consists of New York institutions like ..."
  ],
  [
    "The Best Burger In NYC | Best Of The Best",
    "INSIDER producers Herrine Ro and Emily Christian visit four of New York City's top-ranked burger restaurants to find the best ..."
  ],
  [
    "Best Late Night Food in Downtown NYC with Jonnyshipes",
    "Jonny Shipes, native New Yorker and founder of hip-hop label Cinematic Music Group, gives us a run-down of his favorite ..."
  ],
  [
    "New York City Food Tour : HUGE Pastrami Sandwich at Katz’s Deli and The Halal Guys!",
    "Join me on this delicious New York City food tour! ▻Check out my NYC food guide: https://goo.gl/xubRjU ▻Get a t-shirt here: ..."
  ],
  [
    "Why Is This New York’s Most POPULAR Street Food?",
    "We eat at New York City's Best Halal Food Trucks to see why they're so popular? Plan the Ultimate NYC Trip! Shop our NEW ..."
  ],
  [
    "Meet the Legendary Dosa Man -  New York Street Food Icons",
    "Thiru Kumar, AKA the Dosa Man, has been running NY Dosas, a food cart in Greenwich Village's Washington Square Park, since ..."
  ],
  [
    "American Food - The BEST HENNESSY FRIED CHICKEN WINGS in New York City! Hudson Smokehouse NYC",
    ""
  ],
  [
    "Tamil Dosa Man in America | Newyork Street Food - Irfan&#39;s View",
    "irfansview #dosaman #streetfood in this video we visited the Famous Dosa Man in New York, the place was packed with locals ..."
  ],
  [
    "10 Foods You MUST EAT in New York City!  Top 10 Local Restaurant Recommendations",
    "I've called New York City home for almost 20 years and over that time I've found some true GEMS! Here are some of my favorite ..."
  ],
  [
    "LIVING on STREET FOOD for 24 HOURS in NYC!",
    "For 24 Hours I lived just on street food in NYC. This food challenge was both delicious, and interesting to discover cheap to ..."
  ],
  [
    "Only eating from NYC food carts for a day! #shorts",
    ""
  ],
  [
    "What to Eat in New York City! NYC Food Tour Part 2 (street food, boba, noodles, dumplings &amp; more)",
    "Get 50% OFF your first 6-bottle box https://www.brightcellars.com/feedmeimei for a total of only $55 including shipping!"
  ],
  [
    "New York City Street Food - ITALIAN PIZZA PIES Slice &amp; Co NYC",
    ""
  ],
  [
    "NEW YORK CITY STREET FOOD TOUR like you&#39;ve NEVER SEEN | HIDDEN street food GEMS in NYC, USA",
    "NEW YORK CITY STREET FOOD TOUR like you've NEVER SEEN | Best street food in NYC, USA We take you on a massive New ..."
  ],
  [
    "5 of the Best Street Food in Queens, New York",
    "If you're going to take a bite out of the Big Apple, you'd better start in Queens. With over 150 countries represented and 138 ..."
  ],
  [
    "The Best Pizza Slice In NYC | Best Of The Best",
    "New York pizza is in a league of its own. But with so many options in this city, finding the best can be tough. With visits to Joe's ..."
  ],
  [
    "NYC Top 10 Foods 2022",
    "shorts."
  ],
  [
    "The Best Pepperoni Pizza In NYC | Best In Town | Food Insider",
    "Best in Town (formerly known as Best of the Best) is BACK for a limited-run season 3. In this episode, Herrine Ro and Erin ..."
  ],
  [
    "The 9 Most ICONIC FOODS of New York City",
    "LEARN MORE ABOUT NYC FOODS: 1. New York City Food Crawls: Touring the Neighborhoods One Bite & Libation at a Time -by ..."
  ],
  [
    "WHAT TO EAT IN MANHATTAN! Midtown New York Food Tour 🗽 (tacos, bagels, empanadas &amp; more!)",
    "Midtown Manhattan Food Guide featuring budget on-the-go eats in New York City! From Japanese food to FRESH empanadas to ..."
  ],
  [
    "Getting Indian food in NYC",
    "My other socials: Instagram: https://www.instagram.com/kylegoesoff/ TikTok: www.tiktok.com/@kylegoesoff Facebook: ..."
  ],
  [
    "Eating only the most iconic food from New York for the whole day! #shorts #series #challenge",
    "Social Media's: Instagram: https://www.instagram.com/tommywinkler/ TikTok: https://www.tiktok.com/@tommywinkler? Twitter: ..."
  ],
  [
    "24 HOURS IN NYC FOOD CHALLENGE // Top 10 Most Famous New York City Foods You MUST Try  [4K]",
    "In this film we travel around Manhattan to eat New York City's 10 MOST FAMOUS foods of all time! Pizza, Lox & Bagel, Pastrami, ..."
  ],
  [
    "The BEST Cheap Eats in NEW YORK CITY ($5 Times Square Food Guide)",
    "We'll take you to the Top 5 Affordable Places to eat in the Times Square + Midtown Manhattan area for 2021! Tell us in the ..."
  ],
  [
    "Authentic TAIWANESE STREET FOOD Tour in NEW YORK CITY🧋! Classic Taiwanese Eats NYC",
    "TAIWANESE FOOD TOUR in NYC eating all our favorite Taiwanese street food and classic Taiwan dishes at three New York ..."
  ],
  [
    "New York Nagaram 🗽| Street Food #melodymocktail #streetfood #newyork #food #kebabs #usa",
    ""
  ],
  [
    "$2 Burgers in Harlem | Street Food Icons",
    "Mo's Burgers in Harlem is a neighborhood staple. Mo Robinson Jr. has been serving the greater Harlem community for over 30 ..."
  ],
  [
    "Cheap Hidden Food Gems in CHINATOWN New York! Pt. 15!",
    "Buy G-Fuel 30% off by using \"FUNGBROS\" at http://www.GFUEL.com RESTAURANTS I'Milky ..."
  ],
  [
    "What to Eat in NEW YORK CITY! NYC Food Tour Part 1 (boba, ramen, pizza, sushi &amp; more)",
    "Use code MEIMEI16 for up to 16 FREE MEALS + 3 Surprise Gifts across 6 HelloFresh boxes plus free shipping at ..."
  ],
  [
    "The BBQ King Of Brooklyn | Street Food Icons",
    "Ruben Santana is the owner and pitmaster of Bark Barbecue, a Texas-style BBQ pop up in NYC with a Dominican twist."
  ],
  [
    "Top 5 NYC Foods You MUST Try- What To Eat in New York City !",
    "What are the Top 5 Foods you MUST Try when you visit New York City? Plan the Ultimate NYC Trip! Shop our NEW ..."
  ],
  [
    "New York City Food - AMAZING STEAK &amp; CHICKEN SANDWICHES Manhattan NYC",
    ""
  ],
  [
    "Full Day of Eating at The BEST Spots in NYC!",
    ""
  ],
  [
    "New York LITTLE INDIA Food Tour | BEST INDIAN Street Food!",
    "Use the Code “BF2021” before November 28th to get FREE bonus Japanese snacks and goodies with your first TokyoTreat box!"
  ],
  [
    "Snacking through the Big Apple: Food carts in NYC - Street Food",
    "Snacking through the Big Apple: Food carts in NYC - Street Food Exploring the cultural diversity exemplified throughout the ..."
  ],
  [
    "AMAZING Food in New York City - Restaurants You HAVE to Try!",
    "New York City is the land of amazing food experiences. From pasta made in a wheel of cheese, to a Christmas ornament filled ..."
  ],
  [
    "NEW YORK CITY FOOD VLOG | What I Ate On My Trip To New York! 🏙🍕",
    "Join my FREE YouTube Masterclass: https://bit.ly/38dS4o6 Check out my store: https://www.kritikagoelshop.com Visited New York ..."
  ],
  [
    "New York City&#39;s Best Steakhouses | Food.com",
    "Courtney's in the Big Apple to visit Old Homestead and Peter Luger, two of New York City's oldest and best steakhouses. Courtney ..."
  ],
  [
    "Who has the best pizza in NYC?",
    "Little Italy Pizza 2 E 33rd St New York, NY 10016 #shorts #pizza #NYC #LittleItaly My cooking and camera gear: ..."
  ],
  [
    "Only eating food in NEW YORK CITY for a day with my parents! #shorts",
    ""
  ],
  [
    "100 Hours of Indian Food in NYC! (Full Documentary) Indian Street Food in New York City!",
    "CHECK OUT MY TRAVEL BLOG: https://davidsbeenhere.com/ MARCO: https://www.instagram.com/marcosworldnyc ..."
  ],
  [
    "K-TOWN NYC ♦ Korean Food in New York City",
    "It's our first time in Koreatown NYC and we're checking out what there is to eat and do. Looking for Korean BBQ, cafes and Kpop?"
  ],
  [
    "Indian Street Food - The BEST DOSA in New York City! Dosa Man NYC",
    ""
  ],
  [
    "TRYING VEGAN FOOD IN NEW YORK CITY",
    "Let's fly to NYC and eat some food! In today's video we are trying vegan food in New York City! New York is one of my favorite ..."
  ],
  [
    "The BBQ King Of Brooklyn | Street Food Icons",
    "Ruben Santana is the owner and pitmaster of Bark Barbecue, a Texas-style BBQ pop up in NYC with a Dominican twist."
  ],
  [
    "Life In New York | traveling solo, shopping, best food",
    "Took a mini vacation in NYC to see my very special friend, Dani, for a jam-packed time in the city. Thank you to Monica Vinader for ..."
  ],
  [
    "NYC Food Guide - 13 Must Hit Places to Eat in New York City",
    "I travel the world on my stomach...and NYC has some of the best offerings of any city in the world. So come with me as I show you ..."
  ],
  [
    "The Best Pancakes In NYC | Best In Town",
    "Insider's Herrine Ro and friend Erin Kommor visit three famous pancake restaurants in New York City to find the best one."
  ],
  [
    "NYC halal travel guide shaking up the food scene",
    "A tourism group has made the first guide for halal restaurants and other attractions in New York. It aims to encourage visitors to ..."
  ],
  [
    "Must Try Iconic New York Food: VEGAN Style! | Vegan Pizza, Bagels, Unreal Deli Meat",
    "New York has an amazing food scene but there's some MUST TRY VEGAN food that's iconic to New York City. New York is known ..."
  ],
  [
    "The Best Persian Food In NYC Is Hidden In A Pizza Shop | Legendary Eats",
    "Hidden away in a corner of a pizza shop, Taste of Persia NYC serves traditional Persian dishes to its customers from a counter at ..."
  ],
  [
    "How a Master Chef Runs New York&#39;s Most Iconic New Indian Restaurant — Mise En Place",
    "Dhamaka is one of NYC's most exciting new restaurants. We follow chef and co-owner Chintan Pandya as he gets ready for ..."
  ],
  [
    "The Best Hot Chocolate In NYC | Best In Town | Insider Food",
    "Insider's Herrine Ro and Emily Christian tried three famous hot chocolate shops in New York City. They visited Squish ..."
  ],
  [
    "The Bodega Food Truck Slinging Chopped Cheese in NYC",
    "Jeremy Batista is the man behind Bodega Truck, the first bodega food truck in NYC to serve one of the city's most famous ..."
  ],
  [
    "NYC’s Best South Indian Food Is Hidden In A Temple Basement",
    "We head out to Queens to try some of the best South Indian food in New York. And guess what? It's hidden in the basement of a ..."
  ],
  [
    "WEEKEND IN NYC | exploring New York City, best food spots, romantic things to do, a travel vlog!",
    "a weekend in NYC! in this vlog, we spend a romantic weekend in New York City for our anniversary... we explore all our favorite ..."
  ],
  [
    "Can I sell food from my house in New York [ Can I Sell Food from my house in NYC ]",
    "Can I sell food from my house in New York [ Can I Sell Food from my house in NYC ] DID YOU KNOW WE OFFER ECOMMERCE ..."
  ],
  [
    "Two Brothers Make New York&#39;s Spiciest, Juiciest Birria Tacos | Food Insider",
    "Birria-Landia is a taco truck in the Jackson Heights neighborhood of Queens, New York, that is getting praise left, right, and center."
  ],
  [
    "Only eating from New York City’s most famous restaurants for a day #shorts",
    ""
  ],
  [
    "The happiest street food vendor in new york #shorts",
    "shorts #short #foodie #foodvideo #foodvlog #food #cooking #cookingvideo #vlog #nyc #newyork #newyorkcity #streetfood."
  ],
  [
    "Indian Street Food - The BEST DOSA in New York City! Dosa Man NYC",
    ""
  ],
  [
    "Now I get it 😂🫣😍 #coffee #newyork #nyc #coffee #vacation #aupair #food #entrepreneur #glutenfree",
    ""
  ],
  [
    "The Nightmare Of Food Delivery In NYC",
    "App-based delivery drivers in New York City snake through traffic, dodging life-threatening accidents and robberies, to meet strict ..."
  ],
  [
    "TRYING the BEST Street FOOD in New York City!",
    "New York City is known for all kinds of food, and among them is street food. Today I try all the best street food in New York City!"
  ],
  [
    "14 BEST EATS IN MANHATTAN: NYC FOOD GUIDE",
    "In 12 minutes, we sprint through our 14 favorite restaurants in Manhattan in New York! What are the best places to eat in ..."
  ],
  [
    "Eating the weirdest foods from NYC for the whole day! #funny #food #shorts",
    "Social Media's: Instagram: https://www.instagram.com/tommywinkler/ TikTok: https://www.tiktok.com/@tommywinkler? Twitter: ..."
  ],
  [
    "trying NYC BEST restaurants!🤩 #shorts #nyc",
    ""
  ],
  [
    "The Best Pastrami Sandwich In NYC | Best Of The Best | Food Insider",
    "INSIDER's Herrine Ro and Alana Yzola visit four of the best places to get pastrami sandwiches in New York City. They visit Harry ..."
  ],
  [
    "new york city vlog 🗽🚕🍎 good food, best spots &amp; a chill week in NYC!",
    "Spent a super chill week in New York City with my brother and best friend and had the most fun week! This was actually my third ..."
  ],
  [
    "LIVING on the SPICIEST Food in NYC for 24 HOURS",
    "I'm not good with spicy food and I'm hoping to one day be featured on Hot Ones soooo to prepare I decided to only eat the spiciest ..."
  ],
  [
    "the best NYC weekend 🗽🍕 // autumn in new york vlog, lots of food, fun!",
    "new york city vlog! :) instagram// https://www.instagram.com/sophiakleo/ music: -trees and lucy: fit check spotify link: ..."
  ],
  [
    "Is This New York&#39;s BEST Kept Food Secret?",
    "A movie night for one of the best feckin' films needs the best feckin' Irish food. Searchlight Pictures' The Banshees of Inisherin is ..."
  ],
  [
    "New York City’s Newest Food Court Tour 2022 -  The Hugh Food Hall, 5th Avenue &amp; Bryant Park",
    "NYC Walking Tour 2022 Lexington Avenue/ Citicorp Center Food Hall, Paley Park & Bryant Park Bumper Car on Ice ..."
  ],
  [
    "Does QUEENS Have The BEST FOOD in NEW YORK? (Flushing Crawl)",
    "What other new spots in Flushing, Queens did we miss? Perry Stacks http://instagram.com/perrystacks Rolls Rice ..."
  ],
  [
    "WHAT TO EAT IN NEW YORK! 24 Hours in NYC FOOD GUIDE (BREAKFAST, DINNER &amp; MORE!)",
    "WHAT TO EAT IN NEW YORK! Check out the Razer Book https://rzr.to/razerbookquartz Spend 24 hours eating in NYC trying ..."
  ],
  [
    "Is This FOOD The Future of Chinatown NEW YORK?",
    "What do you think about the future of New York's Chinatown? Potluck Club https://www.yelp.com/biz/potluck-club-new-york-2 Cha ..."
  ],
  [
    "Best restaurant in NYC",
    "Raclette is my favorite restaurant in NYC and the perfect place for any cheese lover."
  ],
  [
    "Street Food — New York【4K】🇺🇸",
    "Welcome to NYC - Today we are going to walk Manhattan to find the BEST places to EAT in New York City, including: Los Tacos ..."
  ],
  [
    "Eating Classic German Food in New York City",
    ""
  ],
  [
    "ULTIMATE NEW YORK CITY DIY FOOD TOUR - MUST TRY FOODS NYC",
    "You know how much WE LOVE FOOD & with New York city having such a wide variety to try we decided we had to eat our way ..."
  ],
  [
    "The Only Ethiopian Food Truck in NYC | Street Food Icons",
    "Eden Gebre Egziabher owns and operates Makina Cafe, the first and only Eritrean and Ethiopian food truck in New York City."
  ],
  [
    "First Singapore-style food hawker centre in New York opens in Manhattan",
    "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtube The first Singapore-style hawker centre in New ..."
  ],
  [
    "New York Food Tour: What to Eat in Greenwich Village",
    "Join Free Tours by Foot tour guides, Katie and Lori, on the Greenwich Village food tour video and discover for yourself just what ..."
  ],
  [
    "Michelin Star INDIAN FOOD in Manhattan!! Upscale Street Food at Junoon | NYC",
    "MARINA: https://www.instagram.com/lacerti JUNOON: https://www.instagram.com/junoonnyc ✈️ CHECK OUT MY TRAVEL ..."
  ],
  [
    "American Street Food - ITALIAN BRICK OVEN PIZZA Pozzuoli Pizza Party NYC",
    ""
  ],
  [
    "🗽🏙 new york vlog: best food spots, where to go, what to do &amp; more!",
    "NEW YORK CITY IN 3 DAYS. We're here in the hectic, but beautiful city, NEW YORK. Come along with us on this vlog filled with ..."
  ],
  [
    "NEW YORK Food Tour - Halal Guys, Chicken Burger, Ramen",
    "New York Burger Tour: https://www.youtube.com/watch?v=lsvtMZuw9Bk&t=317s New York Pastrami Sandwich: ..."
  ],
  [
    "Making kimchi at The New York Times Food Festival!",
    "Here you go! Highlights from the kimchi demo I did with Eric Kim at The New York Times Food Festival!"
  ],
  [
    "NYC FOOD GUIDE Best Local Places to Eat Breakfast Lunch and Dinner",
    "NYC FOOD GUIDE Best Local Places to Eat Breakfast Lunch and Dinner from the classic bagels to brunch pancakes or a Chinese ..."
  ],
  [
    "The Best Korean Food in New York 🇰🇷",
    "Get a free 14-day trial at https://www.squarespace.com/kchoi and 10% off your first purchase with code 'KCHOI' // Click 'SHOW ..."
  ],
  [
    "New York City FOOD TRUCKS You Must Try 🌮🗽! NYC Street Food Tour",
    "Eating at the best New York food trucks and carts! Tacos, dosa, rice noodles, a NY street food crawl! The first 1000 people to ..."
  ],
  [
    "NYC Food Tour 2022!!",
    "We are back in New York City for another food review. This time we are going after three places that are very different from the ..."
  ],
  [
    "Serving Up Indian Food, From Mumbai to NYC",
    "If you love Indian food as much as we do, you will savor every moment of this. First up: We're going to show you where to find ..."
  ],
  [
    "a week in NYC VLOG 🗽🍝 best cafes &amp; restaurants, tourist activities, hanging with friends",
    "I went back to New York for the first time in 2 years and here is my lovely trip (half of it) I'll be releasing part 2 soon so make sure ..."
  ],
  [
    "Americans Try Singapore Hawker Food (New York City)",
    "We head to Urban Hawker in Manhattan, New York to see what people there think about Singaporean food. Specifically, food with ..."
  ],
  [
    "The Finest Michelin Star Indian Restaurant in New York | Junoon",
    "Junoon is a Michelin one-starred restaurant in NYC offering contemporary Indian food in a fine dining setting. They offer a ..."
  ],
  [
    "THE BEST CHINESE STREET FOOD IN NEW YORK CITY!!!",
    "Go to http://casetify.com/mango to save 15% off your order! *Thank you Casetify for sponsoring today's video! I do NOT make any ..."
  ],
  [
    "Eating WEST INDIAN FOOD in LITTLE GUYANA!! Queens, NYC",
    "SHIVA: https://www.instagram.com/backyardpromotions ✈️ CHECK OUT MY TRAVEL BLOG: https://davidsbeenhere.com/ New ..."
  ],
  [
    "24 Hours Eating in NYC K-TOWN | Koreatown NYC Food Tour (Korean BBQ, Food Gallery 32, Itaewon Pocha)",
    "K-pop & K-food in K-Town - that's our type of night! During our 24 hours in NYC's K-Town, we had KBBQ, bibimbap, galbi, bubble ..."
  ],
  [
    "Why is Astoria, NYC the GREEK FOOD Capital of America?",
    "We're going on a Greek Food Tour in Astoria, Queens NYC with a local! Let's see if the best reviewed Greek Restaurants are ..."
  ],
  [
    "New York City FOOD TRUCKS You Must Try 🌮🗽! NYC Street Food Tour",
    "Eating at the best New York food trucks and carts! Tacos, dosa, rice noodles, a NY street food crawl! The first 1000 people to ..."
  ],
  [
    "Midtown Manhattan Food Guide: BEST Budget Bites in NYC!",
    "We're going on a Quick and Easy Food Crawl in Midtown Manhattan, NYC! Our first stop is at 10000 Coffee, an Australian brand ..."
  ],
  [
    "Is This New York&#39;s BEST Kept Food Secret?",
    "A movie night for one of the best feckin' films needs the best feckin' Irish food. Searchlight Pictures' The Banshees of Inisherin is ..."
  ],
  [
    "New York Food - CRISPY FRIED CHICKEN Shrimp Fried Rice Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "New York City&#39;s Best Steakhouses | Food.com",
    "Courtney's in the Big Apple to visit Old Homestead and Peter Luger, two of New York City's oldest and best steakhouses. Courtney ..."
  ],
  [
    "The Best Jewish Food in New York City |The Jewish Foodie | Episode: 1 | Jewish restaurants and Food",
    "Where is the best Jewish food in New York City? Join us to discover the best Jewish food and restaurants in NYC."
  ],
  [
    "Does QUEENS Have The BEST FOOD in NEW YORK? (Flushing Crawl)",
    "What other new spots in Flushing, Queens did we miss? Perry Stacks http://instagram.com/perrystacks Rolls Rice ..."
  ],
  [
    "American Street Food - The BEST HOT DOGS in New York City! Nathan’s Famous Brooklyn NYC",
    ""
  ],
  [
    "Never Pay For Food Again In NYC",
    "Full story here: http://gothamist.com/2016/03/24/dumpster_diving_gourmet_yummo.php For many, the term \"dumpster diving\" ..."
  ],
  [
    "NYC NOODLES &amp; PIZZA 🍕 FOOD TOUR of Chelsea Market, New York City",
    "Today in New York City, we go on an All-Day Food Tour at the Chelsea Market! No worry if it's a rainy day. There's so much to eat ..."
  ],
  [
    "the best NYC weekend 🗽🍕 // autumn in new york vlog, lots of food, fun!",
    "new york city vlog! :) instagram// https://www.instagram.com/sophiakleo/ music: -trees and lucy: fit check spotify link: ..."
  ],
  [
    "Singapore Street Food | New York Live TV",
    "Lauren Scala goes to Midtown to check out “Urban Hawker”, a new food hall offering Singapore style street food counters."
  ],
  [
    "2022 Top NYC Restaurants Tour - Michelin Starred Food in SoHo, New York City: Vestry, Nonna Beppa",
    "Our latest trip kept us closer to home but set us off in search of the best fine dining in one of the top culinary hubs on the planet: ..."
  ],
  [
    "Top 10 Indian Restaurants in New York | Indian Food NYC | Knowledge World",
    "Here is the list of the top 10 Indian restaurants in New York by Knowledge World. Indian food-considered is the most delicious ..."
  ],
  [
    "Amazing and CHEAP BBQ PORK in NYC Chinatown! Wah Fung Fast Food",
    "On this episode of UA Eats, I take you to Manhattan Chinatown, the most well-known of all of the NYC Chinatown neighborhoods."
  ],
  [
    "MANHATTAN FOOD GUIDE | What you MUST eat in New York!",
    "MANHATTAN FOOD GUIDE | What you MUST eat in New York We're stuffing our faces on a food tour! We recently took a detour ..."
  ],
  [
    "EATING NYC DELI FOOD FOR 24 HOURS... was this a mistake?",
    "I decided to only eat food from the deli aka the cornerstore for a whole day... bro MERCH: https://teespring.com/stores/fanumyktv ..."
  ],
  [
    "New York City Food - The BEST PHILLY CHEESESTEAKS in NYC! Fedoroff’s Roast Pork Sandwiches",
    ""
  ],
  [
    "NYC VLOG PART ONE | brooklyn, soho, night out, broadway and food ofc | WEAR.JUTI.EATS",
    "So sorry it took so long but I hope you love it! Part two coming sunday xxxxx Follow Me: INSTAGRAM ..."
  ],
  [
    "24 HOURS IN NYC FOOD CHALLENGE // Top 10 Most Famous New York City Foods You MUST Try  [4K]",
    "In this film we travel around Manhattan to eat New York City's 10 MOST FAMOUS foods of all time! Pizza, Lox & Bagel, Pastrami, ..."
  ],
  [
    "Trying Korean food in NYC",
    "Mr. Mista Oh 41 W 24th St New York, NY 10010 https://www.mistaohnyc.com #shorts #KoreanFood #NYC #NewYork #Mandoo ..."
  ],
  [
    "New York City Food - GIANT SEA CLAMS AND LOBSTER VERMICELLI Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "NEW YORK CITY FOOD TOUR! Feast of San Gennaro | Little Italy &amp; Chinatown",
    "Join us for the ultimate food tour of lower Manhattan — specifically, Little Italy & Chinatown. Including a stop at the legendary feast ..."
  ],
  [
    "The BBQ King Of Brooklyn | Street Food Icons",
    "Ruben Santana is the owner and pitmaster of Bark Barbecue, a Texas-style BBQ pop up in NYC with a Dominican twist."
  ],
  [
    "ULTIMATE NEW YORK CITY DIY FOOD TOUR - MUST TRY FOODS NYC",
    "You know how much WE LOVE FOOD & with New York city having such a wide variety to try we decided we had to eat our way ..."
  ],
  [
    "New York Nagaram 🗽| Street Food #melodymocktail #streetfood #newyork #food #kebabs #usa",
    ""
  ],
  [
    "Pak Food NYC",
    "Hi! Welcome to my channel. On this channel you will find easy recipes you can make at home. I enjoy cooking and love making ..."
  ],
  [
    "THE BEST FOOD OF MY ENTIRE LIFE... NYC food tour vlog!!",
    "SHOP MERCH HERE!! https://shopremicruz.com/ WATCH MY MAIN CHANNEL HERE!"
  ],
  [
    "NYC Chinese Street Food gives us EMOTIONAL DAMAGE ft. Steven He!",
    "Thanks to @StevenHe for taking us for amazing Chinese food in New York! Also, we've been loving Everydaze Essential C's ..."
  ],
  [
    "The Dosa Man Thiru Kumar, Street Food New York City, August 12 2022",
    "Thiru Kumar, AKA The Dosa Man at Washington Square Park New York City. #DosaMan #StreetFood #NYC #"
  ],
  [
    "The $1 Tamale Queen of New York | Street Food Icons",
    "Evelia Coyotzi has been selling dollar tamales in Corona, Queens since 2001. Her team starts every day around 9 PM, cooking ..."
  ],
  [
    "Is New York the Next BIG Mexican Food Destination?",
    "We're going on a Mexican Street Food Crawl in Sunset Park, Brooklyn. This neighborhood has a large Latino population and ..."
  ],
  [
    "THE HALAL GUYS New York City Street Food | Chicken &amp; Gyro Combo Platter | WHAT&#39;S ALL THE FUSS ABOUT?",
    "New York is world famous for it's street food and there's no street food more famous than The Halal Guys in New York City. You'll ..."
  ],
  [
    "USA Atho kadai #shorts #tamil #usatamilvlog #trending #chennai #newyork #food",
    ""
  ],
  [
    "One NYC family&#39;s struggle to survive on a fast food salary",
    "Between food, housing and baby supplies, Shenita Simon struggles each week to support her family of seven. The 25-year-old ..."
  ],
  [
    "Lower East Side NYC Cheap Eats Food Tour // New York City Manhattan Budget Guide [4K]",
    "You won't believe how much quality food you can find in NYC's Lower East Side for under $10! BECOME A PATRON ..."
  ],
  [
    "NEW ASIAN Food You CANNOT MISS In NEW YORK!",
    "Follow 5ive Spice and our social to see what dishes we come up with! http://instagram.com/5ivespicenyc ..."
  ],
  [
    "The Best Chocolate Chip Cookie In NYC | Best Of The Best",
    "INSIDER's Herrine Ro and Alana Yzola visit four of the best places to get chocolate chip cookies in New York City. They visit ..."
  ],
  [
    "Singapore food vendors launch first hawker center in New York",
    "Follow us on YouTube: http://bit.ly/FollowST A Singapore-style hawker center has opened in New York for the first time, bringing ..."
  ],
  [
    "The Biggest Tortas in NYC | Street Food Icons",
    "Galdino Molinero and his wife Lilia run Tortas Neza, a food truck in Corona, Queens that sells massive tortas. The tortas are the ..."
  ],
  [
    "The ULTIMATE Buffalo, New York FOOD tour! (WINGS, Beef on Weck, Peanut Sticks, Pizza, &amp; MORE!)",
    "Today we're going on the ULTIMATE Buffalo, NY food tour! Buffalo is home to some famous (and lesser known) iconic food items ..."
  ],
  [
    "New York’s Cheapest Eats! | Under $10 Flushing Chinatown Food Crawl 2022",
    "Flushing is the best place to get the cheapest and tastiest food in NYC. Everything we're trying today is under $10 so get ready for ..."
  ],
  [
    "NYC $5 Food Guide: Brooklyn’s Best NEW Cheap Eats!",
    "Where are the best new Cheap Eats Spots in Brooklyn, New York in 2023? Best Pizza & Other NYC Guides: ..."
  ],
  [
    "The Seafood Queen of Harlem | Street Food Icons",
    "Chef Tami Treadwell, known as “The Seafood Lady” to her customers, serves up soul food and Black excellence to the people of ..."
  ],
  [
    "Newyork City Toddy Shop / Alappuzha, Kuttanadu / House boat / Nadan Food / Paddy Field.",
    "toddy shop#kuttanadau#alappuzha#alleppy#kallushapp#toddyshapp#sanju It is located on Champakulam – Kandamkari road in ..."
  ],
  [
    "BEST NYC CHEAP EATS🚕 #shorts #shortclip #nyc #food",
    ""
  ],
  [
    "New York’s Cheapest Eats! | Under $10 Flushing Chinatown Food Crawl 2022",
    "Flushing is the best place to get the cheapest and tastiest food in NYC. Everything we're trying today is under $10 so get ready for ..."
  ],
  [
    "American Street Food - LEGENDARY ROAST PORK Lechonera La Piraña New York City",
    ""
  ],
  [
    "The ULTIMATE Buffalo, New York FOOD tour! (WINGS, Beef on Weck, Peanut Sticks, Pizza, &amp; MORE!)",
    "Today we're going on the ULTIMATE Buffalo, NY food tour! Buffalo is home to some famous (and lesser known) iconic food items ..."
  ],
  [
    "NYC $5 Food Guide: Brooklyn’s Best NEW Cheap Eats!",
    "Where are the best new Cheap Eats Spots in Brooklyn, New York in 2023? Best Pizza & Other NYC Guides: ..."
  ],
  [
    "24 Hours in NYC Food Tour: What to Eat in New York City Manhattan&#39;s CHINATOWN! (Meals &amp; Desserts)🗽",
    "We're eating in Chinatown for reeeaaal Can't get enough of Chinatown - there's just so many delicious foods and places to eat ..."
  ],
  [
    "THE HALAL GUYS New York City Street Food | Chicken &amp; Gyro Combo Platter | WHAT&#39;S ALL THE FUSS ABOUT?",
    "New York is world famous for it's street food and there's no street food more famous than The Halal Guys in New York City. You'll ..."
  ],
  [
    "5 Iconic Dessert Shops in New York City | Food Network Finds | Food Network",
    "Next time you take a trip to New York City, don't sleep on these iconic desserts, including world-famous cupcakes from Magnolia ..."
  ],
  [
    "New York City Food - GIANT SEA CLAMS AND LOBSTER VERMICELLI Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "The Seafood Queen of Harlem | Street Food Icons",
    "Chef Tami Treadwell, known as “The Seafood Lady” to her customers, serves up soul food and Black excellence to the people of ..."
  ],
  [
    "American Street Food - The BEST HOT DOGS in New York City! Nathan’s Famous Brooklyn NYC",
    ""
  ],
  [
    "VEGAN FOOD IN NEW YORK CITY",
    "I EAT LOTS OF VEGAN FOOD IN New York CITY. Heres my top restaurant picks!! Subscribe ..."
  ],
  [
    "NYC Cheap Eats• Harlem #shorts #nyc #food #harlem",
    ""
  ],
  [
    "The Best Chocolate Chip Cookie In NYC | Best Of The Best",
    "INSIDER's Herrine Ro and Alana Yzola visit four of the best places to get chocolate chip cookies in New York City. They visit ..."
  ],
  [
    "New York’s Best Bar Food Will Satisfy Every Craving",
    "Bar food usually means burgers, fries, and wings. At Bar Goto, owner Kenta Goto is doing things a little differently. He told Grub ..."
  ],
  [
    "New York City Food - The BEST PHILLY CHEESESTEAKS in NYC! Fedoroff’s Roast Pork Sandwiches",
    ""
  ],
  [
    "The Famous Roasted Nut Carts of New York City | Street Food Icons",
    "With over 60 vendors throughout Manhattan, the Nuts 4 Nuts carts are a New York City street food staple. Co-owner Alejandro ..."
  ],
  [
    "Does QUEENS Have The BEST FOOD in NEW YORK? (Flushing Crawl)",
    "What other new spots in Flushing, Queens did we miss? Perry Stacks http://instagram.com/perrystacks Rolls Rice ..."
  ],
  [
    "NYC VLOG PART ONE | brooklyn, soho, night out, broadway and food ofc | WEAR.JUTI.EATS",
    "So sorry it took so long but I hope you love it! Part two coming sunday xxxxx Follow Me: INSTAGRAM ..."
  ],
  [
    "😋 FOOD at New York New York Las Vegas 2022 - Where to Eat",
    "We recently stayed at New York New York in Las Vegas and really liked all of the FOOD options. In this video we share all of the ..."
  ],
  [
    "NEW ASIAN Food You CANNOT MISS In NEW YORK!",
    "Follow 5ive Spice and our social to see what dishes we come up with! http://instagram.com/5ivespicenyc ..."
  ],
  [
    "How One of New York’s Best Indian Restaurants Makes Dosas — Plateworthy with Nyesha Arrington",
    "On this episode of Plateworthy, chef Nyesha Arrington learns how to make one of NYC's latest must-have dishes: the gunpowder ..."
  ],
  [
    "Top 10 Indian Restaurants in New York | Indian Food NYC | Knowledge World",
    "Here is the list of the top 10 Indian restaurants in New York by Knowledge World. Indian food-considered is the most delicious ..."
  ],
  [
    "NEW YORK CITY FOOD TOUR! Feast of San Gennaro | Little Italy &amp; Chinatown",
    "Join us for the ultimate food tour of lower Manhattan — specifically, Little Italy & Chinatown. Including a stop at the legendary feast ..."
  ],
  [
    "NYC Restaurant Serves All Vegan, Homestyle Food",
    "Seasoned Vegan is a NYC-based restaurant that aims to combine homestyle meals with healthy, nutritious food. You'll be ..."
  ],
  [
    "Food On The World&#39;s Longest Flight😱 19 Hours - New York to Singapore!",
    "Airline catering out of New York is a bigger deterrent from moving there than the rats imo     #airlines #singaporeairlines #flying ..."
  ],
  [
    "EATING NYC DELI FOOD FOR 24 HOURS... was this a mistake?",
    "I decided to only eat food from the deli aka the cornerstore for a whole day... bro MERCH: https://teespring.com/stores/fanumyktv ..."
  ],
  [
    "Inside Midtown&#39;s New Food Hall Boasting Vibrant Flavor and Design | NBC New York",
    "New York City welcomes a new food hall with nearly 20 restaurants showcasing unique cuisines that capture the heart and ..."
  ],
  [
    "Cooked At A NYC Michelin Indian Restaurant Yesterday",
    "If youre ever in NYC check out Chef Akshay at Junoon hey ! Subscribe and Hit The Bell, It really helps me out :) #shorts ..."
  ],
  [
    "Eating at Wah Fung Fast Food. NYC. An Iconic Chinatown Cheap Eat",
    "I eat and review Wah Fung No. 1 Fast Food in New York City's Chinatown. The Chinese restaurant serves some of the best cheap ..."
  ],
  [
    "THE BEST FOOD OF MY ENTIRE LIFE... NYC food tour vlog!!",
    "SHOP MERCH HERE!! https://shopremicruz.com/ WATCH MY MAIN CHANNEL HERE!"
  ],
  [
    "The Best Food in New York City (BEST pizza, bagels, sandwiches, pasta, deserts)",
    "Hiiiii guys! Here is almost everything I ate while in NYC. I will have all the food places in my highlights on my IG ..."
  ],
  [
    "Top 5 NYC Foods You MUST Try- What To Eat in New York City !",
    "What are the Top 5 Foods you MUST Try when you visit New York City? Plan the Ultimate NYC Trip! Shop our NEW ..."
  ],
  [
    "Best Food Trucks in NYC",
    ""
  ],
  [
    "Best $30 Italian Food in New York City | @vivecachow #shorts #nyc",
    ""
  ],
  [
    "Is New York the Next BIG Mexican Food Destination?",
    "We're going on a Mexican Street Food Crawl in Sunset Park, Brooklyn. This neighborhood has a large Latino population and ..."
  ],
  [
    "NYC Live 🗽 Dinner Time! #newyork #food #nyc",
    "dinner #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "NYCS BEST VEGAN STREET FOOD (ny dosa) #shorts #nyc",
    ""
  ],
  [
    "&quot;Food deserts&quot; continue to be a problem in New York City",
    "As CBS2's Lisa Rozner investigates, the inequitable access to healthy and affordable food is something that more than two dozen ..."
  ],
  [
    "BEST &amp; WORST Food at LEGOLAND New York FOOD REVIEW!",
    "Use the Code “FRIDAY2021” before November 28th to get more FREE Japanese home goods with your first Sakuraco box!"
  ],
  [
    "NEW ASIAN Food You Can ONLY Find in NEW YORK! (Lobster Ramen)",
    "Drunken Dumpling https://www.yelp.com/biz/drunken-dumpling-new-york-3 Ed's Lobster Bar ..."
  ],
  [
    "The Jerk Chicken Queen of the Bronx | Street Food Icons",
    "Fauzia Abdur-Rahman has been serving Jamaican food in the South Bronx from her cart Fauzia's Heavenly Delights, right outside ..."
  ],
  [
    "The Best Chelsea Market Food Tour New York City Foodies Adventures with @NYCgo",
    "In Partnership with @NYCgo https://www.nycgo.com/ Fun FACT, did you know Google owns Chelsea Market? Me and Ian explore ..."
  ],
  [
    "AMAZING BAOS FOR $2.30! NYC Food Adventures pt 7: 📍 Mei Lai Wah",
    ""
  ],
  [
    "One Milk Per Baby: Migrant Toddlers Are Facing Lack of Food in NYC Shelters | NBC New York",
    "Asylum seeker families say they are struggling to keep their children adequately fed in the NYC shelters, Melissa Russo reports."
  ],
  [
    "BEST INDIAN RESTAURANT in NEW YORK - New York Food Guide - Bukhara Grill",
    "A New York City Travel Guide to the best Indian Restaurant in Manhattan New York City. If you're living in New York City, or taking ..."
  ],
  [
    "This Chopped Cheese Food Truck Reps New York’s Iconic Sandwich | Hungry For More",
    "Originating in NYC, the chopped cheese is an iconic bodega sandwich consisting of a chopped up cheeseburger with lettuce, ..."
  ],
  [
    "EATING STREET FOOD IN TIMES SQUARE NEW YORK",
    "howto #newyork #streetfood #whereto #travel #Covidtime."
  ],
  [
    "Priyanka Chopra&#39;s SONA Restaurant in New York | Best place for Indian Food in NYC | Birthday Vlog 3",
    "Hello guys, this is a continuation of my birthday vlog, ending my day with having dinner at Priyanka Chopra's restaurant SONA in ..."
  ],
  [
    "NYC $5 Food Guide: Brooklyn’s Best NEW Cheap Eats!",
    "Where are the best new Cheap Eats Spots in Brooklyn, New York in 2023? Best Pizza & Other NYC Guides: ..."
  ],
  [
    "The Best Food in New York City (BEST pizza, bagels, sandwiches, pasta, deserts)",
    "Hiiiii guys! Here is almost everything I ate while in NYC. I will have all the food places in my highlights on my IG ..."
  ],
  [
    "Eating at Wah Fung Fast Food. NYC. An Iconic Chinatown Cheap Eat",
    "I eat and review Wah Fung No. 1 Fast Food in New York City's Chinatown. The Chinese restaurant serves some of the best cheap ..."
  ],
  [
    "New York City Food - The BEST ITALIAN SANDWICHES in NYC! Casa Della Mozzarella",
    ""
  ],
  [
    "You Will Fall in Love with this Taco | NYC Food Trucks | Eater&#39;s Guide to the World",
    "It's Taco Time! You're lying if you're not hungry by the end of this. Eater's Guide To The World journeys to Jackson Heights in ..."
  ],
  [
    "Where To Eat in Chinatown NYC ? 10 BEST Cheap Food Joints  ! 🍜",
    "Where can you get the best cheap eats in Chinatown NYC ? Plan the Ultimate NYC Trip! Shop our NEW Guides/Itineraries: ..."
  ],
  [
    "BEST &amp; WORST Food at LEGOLAND New York FOOD REVIEW!",
    "Use the Code “FRIDAY2021” before November 28th to get more FREE Japanese home goods with your first Sakuraco box!"
  ],
  [
    "The NYC restaurant I can recommend to EVERYONE - GAZAB (best Indian food in NYC.)",
    "GAZAB is the PERFECT restaurant for girls night, date night, birthday parties, you name it! Could this be the BEST INDIAN ..."
  ],
  [
    "New York Food - GIANT FRIED LOBSTERS WITH EGGS Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "Best NYC FOOD TRUCKS &amp; FOOD CARTS 🌯! New York Street Food Pt. 2 🍕",
    "NEW YORK CITY FOOD TRUCKS TOUR continues as we try noodles, falafel, empanadas, street food BBQ! The first 1000 ..."
  ],
  [
    "24 Hours in NYC Food Tour: What to Eat in New York City Manhattan&#39;s CHINATOWN! (Meals &amp; Desserts)🗽",
    "We're eating in Chinatown for reeeaaal Can't get enough of Chinatown - there's just so many delicious foods and places to eat ..."
  ],
  [
    "American Food - GIANT ONE POUND HAMBURGERS Jackson Hole Burgers NYC",
    ""
  ],
  [
    "BEST FILIPINO FOOD in NEW YORK",
    "Filipino Food in Brooklyn - Purple Yam Restaurant in Flatbush in New York. Check out Filipino Food in LAS VEGAS!"
  ],
  [
    "Homeless Couple Takes Man Food On NYC Train",
    ""
  ],
  [
    "NYC Live 🗽 Dinner Time! #newyork #food #nyc",
    "dinner #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "How Coronavirus Has Hurt This NYC Food Truck",
    "Food truck co-owners Howard Jeon, Christopher Yu and Jeffrey Fann were set to expand their business and open a restaurant in ..."
  ],
  [
    "THE BEST FOOD IN NEW YORK! - Fung Bros Food",
    "We left out a lot of places because we couldn't have gone everywhere. In the comments below let us know where we should go ..."
  ],
  [
    "One Milk Per Baby: Migrant Toddlers Are Facing Lack of Food in NYC Shelters | NBC New York",
    "Asylum seeker families say they are struggling to keep their children adequately fed in the NYC shelters, Melissa Russo reports."
  ],
  [
    "$8 Plates Of Ukrainian Food In NYC Are Hidden In A Chiropractor&#39;s Basement",
    "In the East Village of New York City, just six blocks from Washington Square Park, there's a chiropractor's office. And if you follow ..."
  ],
  [
    "New York Street Food - INDIAN MASALA DOSA and Young Coconut Water",
    "Dosa is a kind of pancake made from a fermented batter. Its main ingredients are rice and urad beans. Dosa is part and parcel of ..."
  ],
  [
    "Food On The World&#39;s Longest Flight😱 19 Hours - New York to Singapore!",
    "Airline catering out of New York is a bigger deterrent from moving there than the rats imo     #airlines #singaporeairlines #flying ..."
  ],
  [
    "ULTIMATE FILIPINO FOOD FEAST in LITTLE MANILA New York!",
    "Went to Little Manila for the first time in Queens New York to try out some of the most authentic Filipino food in the country."
  ],
  [
    "BEST food in New York City - Top 10 Foods to try in NYC",
    "BEST food in New York City - Top 10 Foods to try in NYC. Today well show you the yummiest food you need to try across New ..."
  ],
  [
    "Popular PH street food resto ‘Dollar Hits’ opens in NYC | TFC News New York, USA",
    "Popular Pinoy restaurant 'Dollar Hits' brings Filipino street food closer to New York City residents as it opens a store in the city's ..."
  ],
  [
    "QUEENS BEST KEPT Food Secret? (Elmhurst, NYC)",
    "Let's explore the Thai Town area of Elmhurst, Queens NYC... the best place in New York City to eat and experience the culture of ..."
  ],
  [
    "Best pizza in NYC #shorts #foodinsider #nyc #foodies #pizza #nyceats",
    "Insider is great journalism about what passionate people actually want to know. That's everything from news to food, celebrity to ..."
  ],
  [
    "Kotti Berliner Doner Kebab New York City - NYC German Street Food 2022 March 23 Real Sounds Unedited",
    "Kotti Berliner Doner Kebab New York City - NYC 2022 March 23 #streetfood #germany #newyork."
  ],
  [
    "New York City Food - BUTTER CHICKEN &amp; NAAN GupShup Indian NYC",
    ""
  ],
  [
    "New York City Food - STEAK AND BURGER RACLETTE Garlic Butter Filet Mignon NYC",
    ""
  ],
  [
    "The Best THAI Restaurant In NEW YORK CITY | NYC Food Vlog 2021",
    "The Best THAI Restaurant In NEW YORK CITY | NYC Food Vlog 2021. Our fifth day in New York City, we decided to have our last ..."
  ],
  [
    "Peruvian Food Tour in NYC w/ Danny Falla | JENK TV",
    "Welcome back to Jenk TV! For this episode, we go with 5Boro OG Danny Falla to sample some Peruvian food in NYC. His new ..."
  ],
  [
    "The Amazing $5 Indian Lunch Hidden In An NYC Grocery Store ! 😱 (Living Cheap in New York)",
    "Living Cheap in NYC isn't always easy.. but places like Punjabi Deli and Grocery, in the East Village of Manhattan make life a little ..."
  ],
  [
    "WHICH DISH? 🍛 Great THAI FOOD in New York City at Up Thai restaurant #shorts",
    "WHICH DISH? Up Thai is a great Thai food restaurant in New York City. Join me for the Food Travel! #shorts #foodtravel ..."
  ],
  [
    "This NYC food stall puts gooey cheese on all its sandwiches",
    "Baked Cheese Haus serves sizzling sandwiches at Bryant Park's Winter Village."
  ],
  [
    "NYC HAPPY HOUR FOOD TOUR! CHEAP Sushi Rolls &amp; FRESH Oysters in New York",
    "NEW YORK HAPPY HOUR FOOD! Go to https://casetify.com/cupoftj to save 15% off your order! Checking out NYC bars and ..."
  ],
  [
    "BEST street food in New York - NYC street food",
    "Consider this your essential NYC food guide. What is your favourite street food? New York Street food is great and New York food ..."
  ],
  [
    "BEST NEW YORK Jewish Food Tour!",
    "Let's explore NYC's Jewish history with a food tour in the Lower East Side of Manhattan.. from a Hasidic Bakery to Kosher Pickles, ..."
  ],
  [
    "Street Food in New York - Italian Panini",
    "While monitoring the filmworthiness of a Pizza place in Manhattan, I stumbled across an Italian street food joint that I filmed a few ..."
  ],
  [
    "$1 Food vs $200 Food in New York Challenge!",
    "Today John, Kyle, and I ate Breakfast Lunch and dinner on 3 different budgets! One of us had $10, one had $50 and the other had ..."
  ],
  [
    "NEW YORK&#39;S BEST CHEAP EATS? Chinatown Flushing, Queens Food Crawl!",
    "Join us on an amazing Cheap Street Food Tour of Flushing, Queens NYC! Tell us in the comments where you'd eat? NYC ..."
  ],
  [
    "Calorie Detective: The Real Math Behind Food Labels | Op-Docs | The New York Times",
    "With the help of a science lab, the filmmaker Casey Neistat finds that calorie listings on food labels can be highly inaccurate."
  ],
  [
    "48 Hours of Albanian Food in NYC! (Full Documentary) Albanian Food Tour of New York City!",
    "CHECK OUT MY TRAVEL BLOG: https://davidsbeenhere.com/ NICK: https://www.instagram.com/breadsaltandhearth ..."
  ],
  [
    "EPIC Greek Food Tour of Astoria Queens NYC: GREEK Food in New York City",
    "GREEK Food in New York City | NYC Greek Food Tour in Astoria Greek Community Astoria has the largest Greek community in ..."
  ],
  [
    "New York Food Court in Flushing",
    "We ate at the New York Food Court in Flushing and quite enjoyed it. This is a great place to sample a wide variety of flavorful ..."
  ],
  [
    "New York Style Food in Delhi Ncr | Taste of New York Street Food in our Country | India",
    "What up Peeps, After a long time I am doing an American Cuisine. We all love Indian Food however it is always good to cherish ..."
  ],
  [
    "The MOST HYPED Ramen In NYC and More!",
    "Chef Huang https://www.yelp.com/biz/chef-huang-jian-bing-and-peking-duck-new-york Okiburo ..."
  ],
  [
    "EATALY NYC | Incredible Italian Food in New York City | What to do in NYC",
    "Looking for something to do in NYC? Visit Eataly for a food lovers dream! With almost every Italian food you could imagine, there ..."
  ],
  [
    "New York&#39;s Best Pinoy Food | The Crawl New York",
    "The Crawl New York discovers the best Filipino-inspired food in NYC! Subscribe to Metro.Style YouTube channel ..."
  ],
  [
    "THE BEST ASIAN FOOD IN NYC #shorts",
    "so many good food places in flushing!! Have you guys tried any of these places? For more follow me on tiktok and instagram!"
  ],
  [
    "Adam Richman&#39;s Take on NYC&#39;s Bagels &amp; Lox || Food/Groups",
    "Like most New Yorkers -- natives, transplants, whomever -- we love bagels. We love bagels so much that we did a whole episode ..."
  ],
  [
    "ULTIMATE FILIPINO FOOD FEAST in LITTLE MANILA New York!",
    "Went to Little Manila for the first time in Queens New York to try out some of the most authentic Filipino food in the country."
  ],
  [
    "Chasing Outbreaks: How Safe Is Our Food? | Retro Report | The New York Times",
    "A 1993 E. coli outbreak linked to Jack in the Box hamburgers sickened 700 people and drew new attention to the dangers of ..."
  ],
  [
    "She Spends $1,000 A Month On Food In NYC #shorts #nyc",
    "Recipe: 1 cup Farfalle - $.50 1/3 can garbanzo - $1 1 can tomatoes - $1.25 1/3 can navy beans - $1.25 Pinch of salt & pepper ..."
  ],
  [
    "The Amazing $5 Indian Lunch Hidden In An NYC Grocery Store ! 😱 (Living Cheap in New York)",
    "Living Cheap in NYC isn't always easy.. but places like Punjabi Deli and Grocery, in the East Village of Manhattan make life a little ..."
  ],
  [
    "EATALY NYC | Incredible Italian Food in New York City | What to do in NYC",
    "Looking for something to do in NYC? Visit Eataly for a food lovers dream! With almost every Italian food you could imagine, there ..."
  ],
  [
    "New York City Food - INDIAN FRIED CHICKEN, CHEESE ROLLS, LAMB BURGER GupShup NYC",
    ""
  ],
  [
    "Can You Find Authentic Italian Food at Eataly in NYC?",
    "We're in New York City Ragazzi! We can't wait to eat our way around the city, but of course, our first stop HAD to be Eataly."
  ],
  [
    "The Best THAI Restaurant In NEW YORK CITY | NYC Food Vlog 2021",
    "The Best THAI Restaurant In NEW YORK CITY | NYC Food Vlog 2021. Our fifth day in New York City, we decided to have our last ..."
  ],
  [
    "New York City - Street food - NYC always amazing NY USA Travel vlog",
    "newyork #newyorkcity #nyc New York City - Street food - NYC always amazing NY USA Travel vlog."
  ],
  [
    "New York Style Food in Delhi Ncr | Taste of New York Street Food in our Country | India",
    "What up Peeps, After a long time I am doing an American Cuisine. We all love Indian Food however it is always good to cherish ..."
  ],
  [
    "BEST FILIPINO FOOD in NEW YORK",
    "Filipino Food in Brooklyn - Purple Yam Restaurant in Flatbush in New York. Check out Filipino Food in LAS VEGAS!"
  ],
  [
    "Street Food in New York - Italian Panini",
    "While monitoring the filmworthiness of a Pizza place in Manhattan, I stumbled across an Italian street food joint that I filmed a few ..."
  ],
  [
    "Singaporean ‘hawker’ food spices up New York’s food scene",
    "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtube Serving up chilli crabs and pepper prawns in the ..."
  ],
  [
    "$1 Food vs $200 Food in New York Challenge!",
    "Today John, Kyle, and I ate Breakfast Lunch and dinner on 3 different budgets! One of us had $10, one had $50 and the other had ..."
  ],
  [
    "American Food - The BEST BRAZILIAN BARBECUE MEATS in New York! Fogo de Chão Steakhouse",
    ""
  ],
  [
    "Food Diary: New York City • #Shorts",
    "Big Apple, big appetite Here's where I ate in New York City. Featured restaurants: Kung Fu Kitchen Luke's Lobster Somtum Der ..."
  ],
  [
    "American Food - AMAZING CHEESESTEAKS &amp; CHICKEN SANDWICHES Krave It NYC",
    ""
  ],
  [
    "American Food - The BEST BREAKFAST PANCAKES and FRENCH TOAST in New York City! Clinton Street Baking",
    ""
  ],
  [
    "FOOD that you can&#39;t resist during holiday season #happynewyear #newyork  #food #yearofthetiger",
    "Especial Meatballs for New Year food to cook. In this year 2022 is a year of the “Tiger ”. Tiger, dragon and phoenix mean symbols ..."
  ],
  [
    "The Jerk Chicken Queen of the Bronx | Street Food Icons",
    "Fauzia Abdur-Rahman has been serving Jamaican food in the South Bronx from her cart Fauzia's Heavenly Delights, right outside ..."
  ],
  [
    "Where To Eat in Chinatown NYC ? 10 BEST Cheap Food Joints  ! 🍜",
    "Where can you get the best cheap eats in Chinatown NYC ? Plan the Ultimate NYC Trip! Shop our NEW Guides/Itineraries: ..."
  ],
  [
    "THE BEST FOOD OF MY ENTIRE LIFE... NYC food tour vlog!!",
    "SHOP MERCH HERE!! https://shopremicruz.com/ WATCH MY MAIN CHANNEL HERE!"
  ],
  [
    "Priyanka Chopra&#39;s SONA Restaurant in New York | Best place for Indian Food in NYC | Birthday Vlog 3",
    "Hello guys, this is a continuation of my birthday vlog, ending my day with having dinner at Priyanka Chopra's restaurant SONA in ..."
  ],
  [
    "VIBE WITH US IN NYC FOR THE WEEKEND vlog | eating good food, crystal shopping, dog parks",
    "if u guys ever see us in nyc please say hi!! I love u guys so much !!! *update* AHHH!!! Thank you to everyone for letting us know ..."
  ],
  [
    "Singapore food vendors launch first hawker centre in New York",
    "Could Singaporean food be as ubiquitous as pizza and bagels in the Big Apple one day? The opening of Urban Hawker, ..."
  ],
  [
    "Brookfield Place Food Court NYC (Walking Tour for Tour Guides)",
    "A good option for feeding large groups while in Lower Manhattan, Brookfield Place has a food court that can be accessed from ..."
  ],
  [
    "Romualdez enjoys Pinoy food truck fare with Marcos in New York",
    "House Speaker Martin Romualdez looked like he was having the time of his life early Saturday morning (Philippine) Sept."
  ],
  [
    "how food poisoning nearly ruined fashion week... nyc vlog",
    "well that was an unexpected end to fashion week... but in 2022 fashion .. expect the damn unexpected. that's been my biggest ..."
  ],
  [
    "BEST NEW YORK Jewish Food Tour!",
    "Let's explore NYC's Jewish history with a food tour in the Lower East Side of Manhattan.. from a Hasidic Bakery to Kosher Pickles, ..."
  ],
  [
    "New York&#39;s Best Pinoy Food | The Crawl New York",
    "The Crawl New York discovers the best Filipino-inspired food in NYC! Subscribe to Metro.Style YouTube channel ..."
  ],
  [
    "The Seafood Queen of Harlem | Street Food Icons",
    "Chef Tami Treadwell, known as “The Seafood Lady” to her customers, serves up soul food and Black excellence to the people of ..."
  ],
  [
    "Adam Richman&#39;s Take on NYC&#39;s Bagels &amp; Lox || Food/Groups",
    "Like most New Yorkers -- natives, transplants, whomever -- we love bagels. We love bagels so much that we did a whole episode ..."
  ],
  [
    "New York Wine &amp; Food Festival Is Back! | New York Live TV",
    "Lauren Scala was a judge this year for the 15th Annual Blue Moon Burger Bash and she took us along with her to experience the ..."
  ],
  [
    "New York City Food - 24 LAYER CHOCOLATE CAKE Maison Pickle NYC",
    ""
  ],
  [
    "Homeless Man Takes Woman Food On Nyc Train! #shorts #nyc",
    ""
  ],
  [
    "NEW YORK&#39;S CHEAPEST FOODIE HEAVEN! $5 Flushing Food Tour",
    "Try New York's best cheap eats! Here's what to eat in Flushing for $5-7! Join Vlogger Academy (details at 19:40) & let's grow your ..."
  ],
  [
    "Massive MEXICAN FOOD Tour In NEW YORK!",
    "RESTAURANTS WE VISITED Barrio Chino https://www.yelp.com/biz/barrio-chino-new-york?osq=barrio+chino Cuatla Morelos ..."
  ],
  [
    "WEEKEND IN NYC | exploring New York City, best food spots, romantic things to do, a travel vlog!",
    "a weekend in NYC! in this vlog, we spend a romantic weekend in New York City for our anniversary... we explore all our favorite ..."
  ],
  [
    "EPIC Greek Food Tour of Astoria Queens NYC: GREEK Food in New York City",
    "GREEK Food in New York City | NYC Greek Food Tour in Astoria Greek Community Astoria has the largest Greek community in ..."
  ],
  [
    "New York City Food - STEAK AND BURGER RACLETTE Garlic Butter Filet Mignon NYC",
    ""
  ],
  [
    "GIRLS DAY IN NEW YORK CITY | Vlogmas Day 21!",
    "vlogmas day 21! girls day in nyc w mama laeno! watched a broadway show, went shopping, & got dinner! best trip ever omg   ..."
  ],
  [
    "New York City Food - SIZZLING BEEF STEAK Park Asia Brooklyn NYC",
    ""
  ],
  [
    "Bubby’s Pancakes Make It The Best Brunch In NYC | Superlatives",
    "Owner Ron Silver started Bubby's in 1990 by selling pies to other NY restaurants for Thanksgiving Day, and it has grown to ..."
  ],
  [
    "NYC 2022 SuperMarket Tours: Food Bazaar Supermarket Grand Tour 2022 (Bushwick Brooklyn) 4K HDR",
    "foodbazaar #bushwickbrooklyn #newyorkcity DISCLAIMER: I OWN THE RIGHTS TO THIS VIDEO ..."
  ],
  [
    "Trying The Most Popular New York Mets Food At Citi Field | Delish",
    "Welcome back to Stadium Eats! We asked YOU which stadium you wanted to see next… and we delivered! This episode, Jackie ..."
  ],
  [
    "THE BEST FOOD IN NEW YORK! - Fung Bros Food",
    "We left out a lot of places because we couldn't have gone everywhere. In the comments below let us know where we should go ..."
  ],
  [
    "trying NYC BEST restaurant!🤩 #shorts #nyc",
    ""
  ],
  [
    "NEW YORK INDONESIAN FOOD TOUR 🇮🇩 BEST NYC Indonesian street food &amp; restaurants!",
    "Trying INDONESIAN FOOD in NEW YORK! Elmhurst, New York has some of the most delicious Indonesian cuisine and markets."
  ],
  [
    "This NEW YORK FOOD COURT is FOODIE HEAVEN! Flushing Food Tour",
    "ASIAN FOOD HEAVEN! Today's Flushing food tour we visit a food court PACKED with stalls of Chinese food from dumplings to ..."
  ],
  [
    "New food delivery worker protections take effect in NYC",
    "The people who bring us restaurant meals and other items fought for better working conditions. CBS2's Elijah Westbrook has ..."
  ],
  [
    "New York City food trends",
    "Korean and Cantonese food is a hot dining trend in New York City."
  ],
  [
    "NYC Street Food Scam EXPOSED!",
    "CHEAPEST Way To Book NYC Attractions: https://gyg.me/IGzUX75T ⭐ CHEAPEST Way To Book NYC Attractions: ..."
  ],
  [
    "Homeless Man Takes Woman Food On Nyc Train! #shorts #nyc",
    ""
  ],
  [
    "New York City struggling to process applications for food stamps",
    "A City Council Member says the Human Resources Administration doesn't have enough workers to process the paperwork, ..."
  ],
  [
    "American Food - DRY AGED PORTERHOUSE STEAK Lobster Surf and Turf Tuscany Steakhouse NYC",
    ""
  ],
  [
    "Bubby’s Pancakes Make It The Best Brunch In NYC | Superlatives",
    "Owner Ron Silver started Bubby's in 1990 by selling pies to other NY restaurants for Thanksgiving Day, and it has grown to ..."
  ],
  [
    "New York Food - FRIED RICE STUFFED FRIED CHICKEN Park Asia Brooklyn NYC",
    ""
  ],
  [
    "The only way to do New York at Christmas🗽🎄 #nyc #christmasinnyc #nycfood",
    ""
  ],
  [
    "Inside Spanish Harlem NYC! (Puerto Rican Food + More!)",
    "Let's tour Spanish Harlem aka \"El Barrio\" in the East Harlem Neighborhood of Manhattan, NYC. The area was once home to the ..."
  ],
  [
    "Now on View: Food in New York",
    "Visit the exhibition and see how New York eats. Get tickets: https://www.mcny.org/visit See the full exhibition description below."
  ],
  [
    "Eating at Carbone. Most OVERRATED NYC Restaurant? Amazing Italian American Food?",
    "I eat and review one of the most difficult New York City restaurants to get a reservation at, Carbone in Greenwich Village."
  ],
  [
    "New York City Food - GIANT BLACK PEPPER LOBSTER Laut Seafood NYC",
    ""
  ],
  [
    "Egyptian Food for the first time in New York City.",
    "Food. Travel. Toilets travels to New York City for some Egyptian street food from Zooba in Manhattan. TikTok: @foodtraveltoilets ..."
  ],
  [
    "HALAL FOOD CART of New York!!",
    "I travelled to USA aftre 7 years. I really love this country, mainly the New York city. Everyday you get to see something interesting ..."
  ],
  [
    "THE BEST ASIAN FOOD IN NYC #shorts",
    "so many good food places in flushing!! Have you guys tried any of these places? For more follow me on tiktok and instagram!"
  ],
  [
    "What I Eat in a Week NYC: Asian Food Tour",
    "Just me and the boys having a great time, hope you guys enjoy this video, I personally had a lot of fun filming and making it!"
  ],
  [
    "New York City Food - SHRIMP FRIED RICE &amp; CASHEW CHICKEN Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "Food Tour: Upper East Side, NYC",
    "In this Upper East Side #food tour, we visit many old-school independently-owned food businesses and try some of the specialties ..."
  ],
  [
    "First Time Eating Romanian Food in Queens, NYC - Fried Cheese, Pork “Butt”, Cheese Pie",
    "In this episode of \"New York Restaurant Week\", I ventured further into Sunnyside Queens for its regional restaurant week event."
  ],
  [
    "New York City Food - GIANT SALT BAKED CHICKEN Park Asia Brooklyn NYC",
    ""
  ],
  [
    "The Best Food in New York City (BEST pizza, bagels, sandwiches, pasta, deserts)",
    "Hiiiii guys! Here is almost everything I ate while in NYC. I will have all the food places in my highlights on my IG ..."
  ],
  [
    "NYC recap 🔥. Fits, food, &amp; vibes. #ootd #nyc #nycvlog #foodie #newyork #manhattan",
    ""
  ],
  [
    "‘The Five’ talks how migrants in NYC are lining up for food and phones",
    "'The Five' discusses how illegal migrants in NYC bussed from Texas are lining up to receive food, phones, medical care, and ..."
  ],
  [
    "American Food - JAMAICAN JERK CHICKEN and BEEF OXTAIL STEW Peppa’s Brooklyn NYC",
    ""
  ],
  [
    "REAL Jamaican Food TOUR in NEW YORK (Jerk Chicken, Ackee Salt Fish, Beef Patty)",
    "If you like comfortable high quality jeans check out Revtown: bit.ly/3aKwgCM Follow Vince!!! http://instagram.com/vincechang21 ..."
  ],
  [
    "THAI FOOD TOUR in NYC (24 Hours Eating Thai Food in New York) Thai Ramen, Thai Hot Pot, Thai Seafood",
    "Traveling through the NYC boroughs again because it's Thai-me to feast on one of Ming's favorite cuisines - Thai food!"
  ],
  [
    "Undefeated Messy Plate Food Challenge in Rochester, New York!!",
    "A&Z #776 - Atlas and Joel Hansen each vs Mr. Theo's 7lb Undefeated Messy Plate Challenge at Mr. Theo's Restaurant and ..."
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "Traditional ALBANIAN FOOD in MANHATTAN!! Elbasan Tava, Qebapi &amp; Fli | NYC",
    "DIANA: https://www.instagram.com/dijmenezr DUA KAFE: https://www.instagram.com/duakafe ✈️ CHECK OUT MY ..."
  ],
  [
    "Back in NYC | Food + Shopping Haul // Romee Strijd VLOGS",
    "Hi guys, we got back in NYC last week and I did a little Food & Shopping Haul. Laurens gave a little update about his stomach and ..."
  ],
  [
    "The best bagel in NYC #shorts #foodinsider #bagels #foodies #nyc",
    "Insider is great journalism about what passionate people actually want to know. That's everything from news to food, celebrity to ..."
  ],
  [
    "NYC Live 🗽 Dinner Time! #newyork #food #nyc",
    "dinner #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "NEW ASIAN Food You Must Try In New York! ($19 KOBE BEEF)",
    "Try Kyuramen's omurice, rice burgers and ramen! https://www.kyuramen.com/ RESTAURANTS Kyuramen ..."
  ],
  [
    "So Sarap NYC offers authentic Pinoy street food in the Big Apple",
    "So Sarap NYC is the latest Pinoy pop-up craze to hit the Big Apple. Foodies travel from all the New York boroughs for a taste of ..."
  ],
  [
    "New York City Food - The BEST BAGELS in NYC! Russ &amp; Daughters",
    ""
  ],
  [
    "Dollar Hits (Filipino Street Food) NYC Grand Opening Day",
    "Dollar Hits (Filipino Street Food) NYC Grand Opening Day Highlights, Preparations, First Taste, First Grill, Reactions #streetfood ..."
  ],
  [
    "Best Food Near Central Park NYC| Ladurée macaron bakery, Chacha Matcha, Demitassee Coffee &amp; Tea",
    "Subscribe & Travel to NYC with us! In today's video we will visit the Central Park New York and try out the best Coffee and brunch ..."
  ],
  [
    "NEW YORK’S BEST FOOD HALL? (DeKalb Market in BROOKLYN!)",
    "Let's visit a famous food hall in Downtown Brooklyn, NYC (DeKalb Market) which gets overlooked far too often by tourists and ..."
  ],
  [
    "How New York’s Favorite Hot Dog is Made | On the Job | Priya Krishna | NYT Cooking",
    "In this episode of “On the Job,” Priya shows you how the sausage gets made. Or in this case, the hot dog. But not just any hot dogs ..."
  ],
  [
    "New York City Food - SWEET AND SOUR PORK &amp; MUSHROOM CHICKEN Park Asia Brooklyn NYC",
    ""
  ],
  [
    "New York Food - STUFFED FRIED CHICKEN WINGS Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "New York Style Hot Dog | Food Busker",
    "'It's all about the toppings!'. Spicy mustard, the sweetest crispy onions and a deliciously smoked frankfurter, this hot dog recipe will ..."
  ],
  [
    "Tapsilog (Beef Tapa Silog) in Little Manila NYC 🇵🇭 | Trying Filipino Food Jackson Heights Queens",
    "I traveled to Jackson Heights in Queens to try Filipino foods for the first time. Watch me react to tapsilog (beef tapa, garlic rice and ..."
  ],
  [
    "New York City Food - $400 GIANT LOBSTER Seafood Salad Park Asia NYC",
    ""
  ],
  [
    "Commodore’s Hot Breast is Back! nyc newyork food foodie foodies brookly #Short #Shorts",
    "Photography #learnphotography #photographytutorial #landscapephotography #Photoshop #fyp #fypシ."
  ],
  [
    "new York style pizza #pizza #newyork #food #foodworld #foodie #foodgasm #foodlover #bts #btsarmy",
    ""
  ],
  [
    "NYC&#39;s Best Kosher Pizza Is Legitimately Delicious || Food/Groups",
    "The words \"kosher pizza\" may not make sense together most places, but they do in Midwood, Brooklyn, home to one of NYC's ..."
  ],
  [
    "Cheap restaurants in NYC - Kalye Bistro #trending #nyc #food",
    ""
  ],
  [
    "AMAZING BAOS FOR $2.30! NYC Food Adventures pt 7: 📍 Mei Lai Wah",
    ""
  ],
  [
    "The Future of NEW YORK&#39;S Little Italy Food (Authentic &amp; Asian)",
    "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/fungbros04211 MARCO ..."
  ],
  [
    "This is NEW YORK&#39;S INDOMIE HEAVEN! NYC Indonesian Food Tour 🇮🇩",
    "INDONESIAN FOOD in Manhattan, New York! Try classic Indonesian instant noodles mi goreng to fusion Indonesian food in NYC ..."
  ],
  [
    "The Future of NEW YORK&#39;S Little Italy Food (Authentic &amp; Asian)",
    "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/fungbros04211 MARCO ..."
  ],
  [
    "BEST Dominican Food in NYC: Tres Golpes, Tres Leches | Washington Heights Food Tour",
    "This is some of the BEST Dominican Food in NYC! Malecon, El Panadero & Mambi Steakhouse are where we adventure to and ..."
  ],
  [
    "Why the Jamaican Beef Patty Is a NYC Icon | Food Grails",
    "Welcome to Food Grails, a new First We Feast travel series hosted by Miss Info. As a music journalist, she's travelled the world ..."
  ],
  [
    "The Greek Food Trucks of New York City",
    "http://GreekReporter.com - Serving up classic Greek dishes ranging from gyros to authentic pitas, Greek food trucks and their ..."
  ],
  [
    "#saltbae #saltlife #nusret #food #foodie #salt #berger #shorts #lasvegas #dubai #newyork is",
    ""
  ],
  [
    "BEST SUSHI OMAKASES in NYC FOOD REVIEW Part 1",
    "Want to eat omakase but can't afford that overpriced fish at Nakazawa? I got you, here are 3/6 of the best, \"affordable\" omakase ..."
  ],
  [
    "Albanian Food In New York City",
    ""
  ],
  [
    "NYC Dinner at Sala Thai #Food #nyc #newyork",
    "travel #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "Finding the best burger in NYC. #burger #NYC #juicy #cheese",
    "Insider is great journalism about what passionate people actually want to know. That's everything from news to food, celebrity to ..."
  ],
  [
    "BEST CHINATOWN BBQ PORK! (Wah Fung NYC) - Fung Bros Food",
    "Shot by: Will Chang, Ryan Huie Edited by: Joseph Albano Subscribe Here! http://bit.ly/FungBrosSub Check out my top videos!"
  ],
  [
    "New York City Food - GIANT ALASKAN KING CRAB Fried Rice Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "Americans Try INDIAN Food In NYC For The First Time! *Amazing*",
    "Americans try Indian food for the first time in Brooklyn NYC and it was so good! Comment down below other food places you guys ..."
  ],
  [
    "New York City Food - GENERAL TSO’S CHICKEN &amp; FRIED RICE Park Asia Brooklyn NYC",
    ""
  ],
  [
    "American Food - LATKES &amp; PASTRAMI SANDWICHES PJ Bernstein Deli NYC",
    ""
  ],
  [
    "Best Thai Food In New York City",
    "The Nuaa Thai Restaurant: 1122 1st Avenue, New York, NY 10065 http://www.thenuaa.com Dishes: 1. Tom Yum: spicy and sour ..."
  ],
  [
    "Food Events in NYC Spring 2022",
    "PIG BEACH BBQ BENEFIT - APRIL 30TH in Queens NOMA POP UP DUMBO - MAY 16TH - 20TH FESTA DI PRIMAVERA- APRIL ..."
  ],
  [
    "Guy Fieri&#39;s New York Times Food Critic Review Slams New Eatery",
    "New York Times food critic gives bad review to Food Network star Guy Fieri."
  ],
  [
    "NYC FOOD | Gelato",
    "shorts || ANITA'S: https://www.yelp.com/biz/anita-gelato-new-york || MUSIC || Song: Lower Brinstar - Chewie Lofi Remix || Artist: ..."
  ],
  [
    "You need to try if you’re in #newyork #food #doughnuts #foodcoma #desserts #traveltips",
    ""
  ],
  [
    "Afghan Food in New York",
    "Astoria Queens, so this is me in NY for Christmas with the kids, its been a while since i had uploaded when i made this just this ..."
  ],
  [
    "The Best Bolivian Food In NYC Is Served In A Subway",
    "Underneath the 8th Avenue side of the Columbus Circle subway station lives an underground food hall known as Turnstyle."
  ],
  [
    "Casa Adela - PUERTO RICAN FOOD FEAST in NEW YORK CITY with Carla Rupp - #puertorico",
    "I was missing my trip and the food in Puerto Rico. So, I decided to take trip to New York and get the best authentic Puerto Rican ..."
  ],
  [
    "The Plaza Food Hall, New York",
    "If you had only one day to eat in New York City, you'd go dizzy trying to sample all its best restaurants. Luckily, there's a place ..."
  ],
  [
    "American Street Food - The BEST HOT DOGS in Chicago! Jim’s Original Sausages, Burgers, Pork Chops",
    ""
  ],
  [
    "American Food - The BEST BURGERS in New Jersey! White Manna Hamburgers",
    ""
  ],
  [
    "New York City Street Food | ULTIMATE Bronx Bodega food | Chopped cheese MONSTER Sandwiches",
    "Welcome to the start of this channel and sit tight because is going to be a delicious ride. Today we go eat at a local Bodega!"
  ],
  [
    "Best food in NYC’s Chinatown?",
    "This might be the best dish in Chinatown. What do you think? Let me know in comments below! #chinatown #nyc #nycfood #short ..."
  ],
  [
    "American Food - The BEST CHALLAH BREAD in New York City! Russ &amp; Daughters NYC",
    ""
  ],
  [
    "The Burger Place Hidden in a Fancy NYC Hotel (with @GoLuisGusto)",
    ""
  ],
  [
    "Indian Food - WHOLE GOAT Cooked Two Ways Sapphire Cuisines of India NYC",
    ""
  ],
  [
    "Mexican Food - The BEST BEEF SUADERO TACOS in New York City! Taqueria Ramirez",
    ""
  ],
  [
    "JQ visits Ichiran in Times Square #food #ramen #nyc #newyork #foodie #foodlover #foodblogger",
    ""
  ],
  [
    "EPIC DOMINICAN FOOD TOUR IN NEW YORK CITY!",
    "For more info of the Rad Runner 1 by RAD POWER BIKES https://www.radpowerbikes.com/products/radrunner-electric-utility-bike ..."
  ],
  [
    "Why food deserts persist in low-income NYC neighborhoods",
    "Hundreds of thousands of people in the New York City area live in so-called food deserts -- low-income neighborhoods that lack ..."
  ],
  [
    "vlog #3: new york city | line friends, muji, good food",
    "omgggg i'm so happy to finally finished this video and get it up!! i've been procrastinating on this for a while now LOL.. but I hope ..."
  ],
  [
    "A staple on our food tour, Ferrara’s Bakery 🧁 🍰🍴#shorts #newyork #newyorkcity #food #bakery",
    ""
  ],
  [
    "CHRISTMAS IN NYC 2022  VLOG | 4-day Itinerary, What to Do, Food, Shopping and more!",
    "Hello everyone and welcome back to my channel! Today's video is all about what to do in nyc when visiting for the holidays."
  ],
  [
    "FOOD that you can&#39;t resist during holiday season #happynewyear #newyork  #food #yearofthetiger",
    "Especial Meatballs for New Year food to cook. In this year 2022 is a year of the “Tiger ”. Tiger, dragon and phoenix mean symbols ..."
  ],
  [
    "Crossing Guangzhou China off my NYC Food Map",
    "Nom Wah Tea Parlor is the oldest continually operating restaurant in Manhattan's Chinatown! It definitely lives up to the hype!"
  ],
  [
    "Fast Food Worker | New York Goes To Work | Episode 8 | OMG!RLY!?",
    "New York is excited about work for the first time this season when she finds out she's been given the job she wanted: fast food ..."
  ],
  [
    "New York City Food - MAC ’N’ CHEESE BURGER The Bedford NYC",
    ""
  ],
  [
    "#shorts #explore #hack #foodie #food #nyc #rooftop #fun #hidden #coffee #newyork #travel #city",
    "tis the season for #fall #autumn #hacks and tips and tricks. this #secret #bar and drink #recommendations for #brooklyn #city ..."
  ],
  [
    "₹2500 Beef Sandwich With Sarah | Newyork 🇺🇲 - Irfan&#39;s View",
    "irfansview #beef #usa Check Out : Sarah Funk | NYC Show Host https://youtube.com/@SarahFunky ..."
  ],
  [
    "WHAT I EAT IN A WEEKEND | korean bbq, nyc eats, korean food",
    "FOLLOW ME!! instagram: erica.ha https://www.instagram.com/invites/contact/i=oqar1lwokhhu&utm_content=gyi34t tiktok: ..."
  ],
  [
    "Pinoy Cuisine: A Journey Through Filipino Food TOUR in NYC (24 Hours Eating NYC- Kabisera, Jollibee)",
    "Filipino Food Tour in NYC? We got ube Make sure to check these great spots out so u-be the judge! 24 Hours Eating ..."
  ],
  [
    "HALAL FOOD CART IN NYC (WE EAT THE WHOLE MENU) - Fung Bros Food",
    "Shot by: Will Chang, Chris Chinn Edited by: Edeny Tran Subscribe Here! http://bit.ly/FungBrosSub Check out my top videos!"
  ],
  [
    "American Food - AMAZING WHOLE ROAST DUCK Manhattan NYC",
    ""
  ],
  [
    "Mike Colameco&#39;s Real Food  NYC Seafood",
    "Seamore's, Cervo's and Chamusca, all seafood restaurants. Seamore's is a mini chain concept, Chaumsca a one off and Cervo's ..."
  ],
  [
    "MOST Expensive CHINESE FOOD in NEW YORK! $150 MEAL",
    "Chinese food in America can cost $3 all the way to $300. Is this the way it should be? Che Li ..."
  ],
  [
    "NYC FOOD | Gelato",
    "shorts || ANITA'S: https://www.yelp.com/biz/anita-gelato-new-york || MUSIC || Song: Lower Brinstar - Chewie Lofi Remix || Artist: ..."
  ],
  [
    "Best food in NYC’s Chinatown?",
    "This might be the best dish in Chinatown. What do you think? Let me know in comments below! #chinatown #nyc #nycfood #short ..."
  ],
  [
    "Eating ENTIRE JOLLIBEE MENU! JOLLIBEE New York VS. Philippines FOOD REVIEW",
    "Get Surfshark VPN at https://Surfshark.deals/dumpling and enter promo code DUMPLING for 83% off and 3 extra months for free!"
  ],
  [
    "New York Street Food 🌭🍔 #short",
    "New York Street Food #short #4Kwalk #Walkingvideo #Relax #NewYorkCity #NewYork #NYCWalking #NYC4kvideo ..."
  ],
  [
    "DIRTY NYC Street Food Vendors",
    "INSIDE EDITION catches NYC food vendors scratching their butt,picking their nose,not wearing gloves,not washing hands."
  ],
  [
    "FOOD that you can&#39;t resist during holiday season #happynewyear #newyork  #food #yearofthetiger",
    "Especial Meatballs for New Year food to cook. In this year 2022 is a year of the “Tiger ”. Tiger, dragon and phoenix mean symbols ..."
  ],
  [
    "Japanese Food - LOBSTER BLACK RICE Mifune New York City Seafood NYC",
    ""
  ],
  [
    "American Food - MACARONI AND CHEESE Cajun Mac &#39;n&#39; Cheese S’MAC NYC",
    ""
  ],
  [
    "#chinatown #chinatownnyc #newyork #newyorkcity #vanlife #food #couple #eating #foodie #dumplings",
    ""
  ],
  [
    "A staple on our food tour, Ferrara’s Bakery 🧁 🍰🍴#shorts #newyork #newyorkcity #food #bakery",
    ""
  ],
  [
    "MOST Expensive CHINESE FOOD in NEW YORK! $150 MEAL",
    "Chinese food in America can cost $3 all the way to $300. Is this the way it should be? Che Li ..."
  ],
  [
    "NEW YORK FOOD | ICH ESSE BEI THE HALAL GUYS ? حلال 🇺🇸",
    "foodie #newyorkfood #essen #halalguys #mukbang The Halal Guys 6th Avenue &, W 53rd St, New York, 10019."
  ],
  [
    "The Best Bolivian Food In NYC Is Served In A Subway",
    "Underneath the 8th Avenue side of the Columbus Circle subway station lives an underground food hall known as Turnstyle."
  ],
  [
    "This NYC Pub Used to Not Allow Any Women! (with @G_Gatto)",
    ""
  ],
  [
    "Finding the best burger in NYC. #burger #NYC #juicy #cheese",
    "Insider is great journalism about what passionate people actually want to know. That's everything from news to food, celebrity to ..."
  ],
  [
    "best new york food vlog #newyorkcity #newyork #beautiful #food #dimsum #asian #koreanfood",
    ""
  ],
  [
    "What I ate in NYC - TOURIST EDITION 🧳🗽 #shorts #travel #food #newyork #foryou #bucketlist #city",
    ""
  ],
  [
    "Best 1$ pizza in New York from Two Bros. #food #newyork #streetfood #travel #pizza",
    ""
  ],
  [
    "NYC Live 🗽 Dinner at the Diner! #newyork #food #friday",
    "Join me for a Conversation with a View! A Big Thank You to all of the members of the Yo Club Join this channel to get access ..."
  ],
  [
    "NYC Dinner at Sala Thai #Food #nyc #newyork",
    "travel #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "He Spends $2,000 A Month On Food In NYC #shorts #nyc",
    ""
  ],
  [
    "pepperoni pizza #pizza #pizzarecipe #pepperonipizza #food #foodie #newyork #food #foodie",
    ""
  ],
  [
    "Mike Colameco&#39;s Real Food  NYC Seafood",
    "Seamore's, Cervo's and Chamusca, all seafood restaurants. Seamore's is a mini chain concept, Chaumsca a one off and Cervo's ..."
  ],
  [
    "Legendary Temaki Hand Rolls at Nami Nori! #newyork #food #travel #recommended #shorts",
    "If you're ever in New York, be sure to stop by Nami Nori for some legendary Temaki Hand Rolls! These rolls are sure to fill you up ..."
  ],
  [
    "New York City Street Food - FILIPINO CHICKEN BBQ So Sarap NYC",
    ""
  ],
  [
    "Newyork katz’s  #nyc #food",
    ""
  ],
  [
    "BEST FOOD IN NYC?!?! FOOD GUIDE WITH @MANNYEXPLORES | JACKSON HEIGHTS, QUEEN",
    "This week I went on a special trip to the big apple NYC and had such an amazing food tour around the greatly diverse Jackson ..."
  ],
  [
    "What I spend on FOOD in NYC! #shorts #youtubeshorts",
    ""
  ],
  [
    "The Plaza Food Hall, New York",
    "If you had only one day to eat in New York City, you'd go dizzy trying to sample all its best restaurants. Luckily, there's a place ..."
  ],
  [
    "Crossing Guangzhou China off my NYC Food Map",
    "Nom Wah Tea Parlor is the oldest continually operating restaurant in Manhattan's Chinatown! It definitely lives up to the hype!"
  ],
  [
    "New York City Food - JAPANESE COLD CRABS Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "New York City Food - PRAWN FRIED RICE Seafood Nasi Goreng Laut NYC",
    ""
  ],
  [
    "NYC Food – Little Italy: April 2021",
    "Let's see how much food we can get for $20 in little Italy   Restaurants mentioned in the video: Manero's Ferrara Bakery ..."
  ],
  [
    "34th st and 8th Avenue, New York City Street Food Vendor",
    "At 34th st and 8th Avenue, in New York City. Street Food Vendor at work. #34thstreet."
  ],
  [
    "New York l #saltbae #saltlife #nusret #food #salt #shorts #dubai #lasvegas #newyork",
    ""
  ],
  [
    "Why food deserts persist in low-income NYC neighborhoods",
    "Hundreds of thousands of people in the New York City area live in so-called food deserts -- low-income neighborhoods that lack ..."
  ],
  [
    "Indian-American Food Delivery Agent Stabbed In New York, Raises Hate Crime Concerns",
    "Indians have continued to be targets of racism, abuses and violence in the US. Indians living in the US have been subjected to ..."
  ],
  [
    "EPIC INDONESIAN FOOD TOUR in New York (Most Authentic in USA?) @YamibuyTV",
    "Don't miss our HUGE Yamibuy giveaway livestream today at 5pm PST on http://youtube.com/yamibuytv. Tune in for a chance to ..."
  ],
  [
    "BEST Hand Pulled Beef Noodles in New York! Chinese Food Court",
    "These are some of my favorite noodle dishes in New York. Big Plate of Beef with Hand Pulled Noodles Liang Pi - Cold Skin ..."
  ],
  [
    "The BEST PIZZA in New York! #pizzalover  #pizza #newyorkpizza #newyorkfood #streetfood #foodshorts",
    ""
  ],
  [
    "George&#39;s in New York City! #Explore #breakfast #50s #nyc #newyork #newyorkcity #food #restaurant",
    ""
  ],
  [
    "Union Square NYC Greenmarket Food Tour: Farmers Market",
    "In this outdoor Food Tour, we visit the Union Square Greenmarket in NYC and get to know many of the farmers, bakers and fishers ..."
  ],
  [
    "Food Truck Morocho Peruvian Fusion - New York, NY",
    "Food Truck Morocho Peruvian Fusion 1301 6th Ave. Nortwest corner of 52nd St. and 6th Ave. New York, NY 10019 (646) ..."
  ],
  [
    "trying NYC BEST restaurant!🤩 #shorts #nyc",
    ""
  ],
  [
    "24 Hours Eating in Manhattan&#39;s CHINATOWN (Cantonese Food) | NYC Chinatown Food Tour",
    "We're spending a lot of time in Chinatown these days. Appreciating this evocative neighborhood more and more every day! NYC's ..."
  ],
  [
    "New York City Food - JAPANESE OMELETTE FRIED RICE &amp; RAMEN Kyuramen NYC",
    ""
  ],
  [
    "3 women arrested after violent food fight at Lower East Side restaurant",
    "Three women have been arrested and charged after allegedly attacking employees at Bel Fries on the Lower East Side after ..."
  ],
  [
    "New York City Food - CHOCOLATE BABKA BREAD Russ &amp; Daughters NYC",
    ""
  ],
  [
    "The Burger Place Hidden in a Fancy NYC Hotel (with @GoLuisGusto)",
    ""
  ],
  [
    "Mike Colameco&#39;s Real Food  NYC BURGERs",
    "We cover the early days of the NYC Burger craze starting with NY legacy butchers LaFrieda who supplied Shake Shack and many ..."
  ],
  [
    "Korean BBQ in NYC, Gaonnuri (Food Shelf Chapter 7)",
    "Exploring more and more Korean BBQ places in NYC is one of my passions. And today I got to eat at Gaonnuri NYC Korean ..."
  ],
  [
    "Must Eats in New York City | New York City FOOD TOUR",
    "New York City is home to endless opportunities for some great food. From bagels and pastrami sandwiches to pizza, New York ..."
  ],
  [
    "24 Hours Eating in Manhattan&#39;s CHINATOWN (Cantonese Food) | NYC Chinatown Food Tour",
    "We're spending a lot of time in Chinatown these days. Appreciating this evocative neighborhood more and more every day! NYC's ..."
  ],
  [
    "New York City Food - TRUFFLE FRIED CHICKEN 375° Chicken &#39;n Fries NYC",
    ""
  ],
  [
    "One of NYC’s Oldest Steakhouse (Peter Luger Steakhouse) #shorts",
    "TikTok: https://www.tiktok.com/@andersonnguyener Facebook: https://www.facebook.com/anderson.nguyen.98/ Instagram: ..."
  ],
  [
    "#pizza#pizzafacts#factsaboutpizza#dominoes#kfc#mcdonalds#bigpizza#facts#newyork#food#review#foodfact",
    ""
  ],
  [
    "ASIAN FOOD CRAWL - Flushing, Queens NYC | Fung Bros",
    "This video was filmed this summer in NYC. Shout out to everybody we met there! FUNG BROS SHIRTS: ..."
  ],
  [
    "Indian-American Food Delivery Agent Stabbed In New York, Raises Hate Crime Concerns",
    "Indians have continued to be targets of racism, abuses and violence in the US. Indians living in the US have been subjected to ..."
  ],
  [
    "New York Food - CHINESE SPICY LAMB NOODLES Xi’an Famous Foods NYC",
    ""
  ],
  [
    "This NYC Pub Used to Not Allow Any Women! (with @G_Gatto)",
    ""
  ],
  [
    "New York City Food - GIANT SEAFOOD PAELLA Socarrat NYC",
    ""
  ],
  [
    "Tamil Dosa Man in America | Newyork Street Food - Irfan&#39;s View#madhuravayalfoodreview#",
    ""
  ],
  [
    "New York City Food - CHOCOLATE BABKA BREAD Russ &amp; Daughters NYC",
    ""
  ],
  [
    "Feeding People in the East Village #food #foodrescue #nyc",
    ""
  ],
  [
    "New York City Food - PIG HEAD TACOS Pork Terrine Palo Santo Brooklyn NYC",
    ""
  ],
  [
    "EPIC INDONESIAN FOOD TOUR in New York (Most Authentic in USA?) @YamibuyTV",
    "Don't miss our HUGE Yamibuy giveaway livestream today at 5pm PST on http://youtube.com/yamibuytv. Tune in for a chance to ..."
  ],
  [
    "Best Home made Biriyani Cuisine of India #shorts #trending #viral #newyork #food",
    ""
  ],
  [
    "The Garbage Plate of Rochester, New York - Best Food in New York!",
    "One of the most iconic dishes in New York is The Garbage Plate! This iconic plate was created in Rochester, New York and it is ..."
  ],
  [
    "New York Street Food",
    ""
  ],
  [
    "Baked Cheese Haus Raclette #bryantpark #wintervillage #raclette #food #foodvlog #nyc #newyork #yummy",
    ""
  ],
  [
    "American Food - MACARONI AND CHEESE Cajun Mac &#39;n&#39; Cheese S’MAC NYC",
    ""
  ],
  [
    "New York l #saltbae #saltlife #nusret #food #salt #shorts #dubai #lasvegas #newyork",
    ""
  ],
  [
    "Japanese Food - MANTIS SHRIMP, EEL, RAZOR CLAMS Kaiseki Omakase Koyo NYC",
    ""
  ],
  [
    "I&#39;M ON A TIMES SQUARE BILLBOARD!!! Vlogmas Day 20!",
    "vlogmas day 20! IM A TIMES SQUARE BILLBOARD BABY! thank you so much canon for this amazing opportunity honored to ..."
  ],
  [
    "Don&#39;t Avoid This In Queens Night Market! | NYC Street Food",
    "This might be the best place to eat street food in New York City. A sprawling market of 100 independent vendors, Queens Night ..."
  ],
  [
    "Exposing the Russian Military Unit Behind a Massacre in Bucha | Visual Investigations",
    "We spent months in Ukraine, investigating who killed dozens of civilians along one street in Bucha, a normally quiet town on the ..."
  ],
  [
    "Who does love meat🤤#newyork #ny #nyc #newyorkfood #nyfood #food #foodporn #koreanfood #meat #meats",
    "Yummmm — Subscribe to Foodporn: http://shorturl.at/vyT24 Do you have any questions or suggestions? Leave them in the ..."
  ],
  [
    "🐣🐣#nycfood#nyceats#nyc#nycfoodie#foodie#foodporn#food#nycrestaurants#newyork#newforkcity#foodstagram",
    "nycfood #nyceats #nyc #nycfoodie #foodie #foodporn #food #nycrestaurants #newyork #newforkcity #foodstagram ..."
  ],
  [
    "Best Spanish Food Restaurant In New York !!  #Malecon",
    ""
  ],
  [
    "Best food in NEW YORK!🍖🍲",
    ""
  ],
  [
    "Cheese garlic bread😍 preparation#shorts#Newyork food",
    ""
  ],
  [
    "5 NYC Food Hot Spots You Must Definitely Try #shorts",
    "credit: theshayspence."
  ],
  [
    "NYC Compost Project Food Scrap Drop-Off Program",
    ""
  ],
  [
    "NYC Korean #bbq #food #steak #koreanbbq #nyc #yakuvibes #yakuvlogs #iphone14promax #blogger",
    ""
  ],
  [
    "From New York to Honolulu / In-flight meal /Miniature airplane food  लघु Miniatur বিমান غذاء #shorts",
    "Puchi Rement Airlines Meal 2008 Full Box Unboxing From New York to Honolulu / In-flight meal /Miniature Airline food Re-ment ..."
  ],
  [
    "NYC Live 🗽 Little Italy &amp; Lombardi’s 🇮🇹 #nyc #newyork #food",
    "newyork #foodie #food A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "New York City Food - KING SALMON COULIBIAC Russian Fish Pie The Clocktower NYC",
    ""
  ],
  [
    "Newyork burger |burger | #newyork  #burger #newyorkfood #shorts #kfc  #short #america",
    ""
  ],
  [
    "Japanese Food - FRIED PORK CUTLETS Tonkatsu Ootoya NYC",
    ""
  ],
  [
    "NYC Thai #food #newyork # dinner",
    "travel #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "Day 28 in the life of an NYC Culinary Student - Grilling Pork &amp; Salmon",
    "shorts #culinaryschool #culinarystudent #chefintraining #nycchef #grilling."
  ],
  [
    "IMPOSSIBLE 13LB CHEESESTEAK CHALLENGE | With Spicy Chicken &amp; Gyro&#39;s | NYC Street Food",
    "I THINK IT IS IMPOSSIBLE... TRULY THIS IS TOO BIG. Today we take on one of the BIGGEST food challenges I have ever ..."
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "NEWYORK.. FIRST FEMAL RESTURENT IN BAIT EVENUE.DELICIOUS PAK/ INDAIN FOOD..SEE  REPORT ON MARDAN TV",
    "femal #resturent# newyork#"
  ],
  [
    "#breadrollrecipe#breadroll#newyorkfood #usafood#ब्रेड#ব্রেড#নাস্তা#cooking#homemade#2minuterecipe",
    ""
  ],
  [
    "New York City Food - JAPANESE OMELETTE FRIED RICE &amp; RAMEN Kyuramen NYC",
    ""
  ],
  [
    "New York Food Stamp Fraud Lawyer Explains Food Stamp Fraud Investigation Process",
    "https://www.nycriminallawyers.com/practice-area/food-stamp-fraud-lawyer/ Alice Lee, a Food Stamp fraud lawyer with an NYC law ..."
  ],
  [
    "NYC Mishka SoHo #food #newyork #nyc",
    "travel #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "I love a NYC #streetdog! | Naima’s Food Adventures #shorts #streetfood",
    "After a photo shoot I enjoyed a yummy street dog! #kidsvideo."
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "New York City Food - KING SALMON COULIBIAC Russian Fish Pie The Clocktower NYC",
    ""
  ],
  [
    "American Food - STEAK AND EGG CHEESE BOATS Cheeseboat Brooklyn NYC",
    ""
  ],
  [
    "Newyork burger |burger | #newyork  #burger #newyorkfood #shorts #kfc  #short #america",
    ""
  ],
  [
    "IMPOSSIBLE 13LB CHEESESTEAK CHALLENGE | With Spicy Chicken &amp; Gyro&#39;s | NYC Street Food",
    "I THINK IT IS IMPOSSIBLE... TRULY THIS IS TOO BIG. Today we take on one of the BIGGEST food challenges I have ever ..."
  ],
  [
    "Day 28 in the life of an NYC Culinary Student - Grilling Pork &amp; Salmon",
    "shorts #culinaryschool #culinarystudent #chefintraining #nycchef #grilling."
  ],
  [
    "CHICKEN WINGS was Invented in #Japan &amp; not in #NewYork!😌 #shorts #food",
    "CHICKEN WINGS was Invented in #Japan & not in #NewYork!   #shorts #food Like and subscribe for more videos! This is the ..."
  ],
  [
    "NEWYORK.. FIRST FEMAL RESTURENT IN BAIT EVENUE.DELICIOUS PAK/ INDAIN FOOD..SEE  REPORT ON MARDAN TV",
    "femal #resturent# newyork#"
  ],
  [
    "Japanese Food - FRIED PORK CUTLETS Tonkatsu Ootoya NYC",
    ""
  ],
  [
    "New York City Food - JAPANESE OMELETTE FRIED RICE &amp; RAMEN Kyuramen NYC",
    ""
  ],
  [
    "Pier 16, New York City#shorts #newyork#food",
    "New York City#shorts #newyork."
  ],
  [
    "NYC Mishka SoHo #food #newyork #nyc",
    "travel #nyc #newyork A Big Thank You to all of the members of the Yo Club Join this channel to get access to perks: ..."
  ],
  [
    "#breadrollrecipe#breadroll#newyorkfood #usafood#ब्रेड#ব্রেড#নাস্তা#cooking#homemade#2minuterecipe",
    ""
  ],
  [
    "Don&#39;t Avoid This In Queens Night Market! | NYC Street Food",
    "This might be the best place to eat street food in New York City. A sprawling market of 100 independent vendors, Queens Night ..."
  ],
  [
    "HUNTING HALAL FOOD IN NYC | PART 8 : BURGER MANIA IN MANHATTAN #halal #food #shorts",
    "Hello everyone..., on our 8th youtube shorts we would like to share a halal burger resto, BURGER MANIA . It is located in ..."
  ],
  [
    "I love a NYC #streetdog! | Naima’s Food Adventures #shorts #streetfood",
    "After a photo shoot I enjoyed a yummy street dog! #kidsvideo."
  ],
  [
    "Japanese Cheesecake #newyorkfood #nyc",
    ""
  ],
  [
    "New York Food - CHEWY MOCHI DONUTS The Dough Club Manhattan NYC",
    ""
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "American Food - The BEST CHEESESTEAKS in New Jersey! Donkey’s Place Steaks",
    ""
  ],
  [
    "#plumcake#christmascake#christmasplumcake#newyorkfood#eat#foodlover#christmaseve#কেক#केक#cooking#yum",
    ""
  ],
  [
    "Trip To New York🌆|| @how.kev.eats #newyork #foodtiktok #food",
    "If you're heading to New York, the best meal you had while travelling. Credit @how.kev.eats."
  ],
  [
    "NYC famous Halal Guys! #newyork #nyc #short #shorts #food #foodie #halalguys #viral #foodblogger",
    "viral #viralvideo #shorts #short #newyork #newyorkcity #nyc #halalguys #food #foodie #foodreview #foodblogger #travel ..."
  ],
  [
    "New York: Fast Food, Street Food at Time Square...",
    "Mrs B.K Grover."
  ],
  [
    "CBS2 teams up with New York Common Pantry for food drive",
    "Saturday morning, CBS2 teamed up with New York Common Pantry to fight food insecurity during the holidays."
  ],
  [
    "STREET FOOD &amp; SHOPPING IN NYC @ JAPANFES 🧋🍱🍡",
    "Music: Apart Musician: @iksonmusic."
  ],
  [
    "Vegetable Biryani #vegetablebiryani #biryani #food #newjersey #newyork #indianvlogger #india",
    ""
  ],
  [
    "New York City Food - LOBSTER ROLLS AND NACHOS Ed&#39;s Lobster Bar Seafood NYC",
    ""
  ],
  [
    "New York City Food - GIANT LOBSTER AND GARLIC EGG NOODLES Madame Vo NYC",
    ""
  ],
  [
    "Dallas l #saltbae #saltlife #nusret #food #salt #shorts #dubai #lasvegas #newyork",
    ""
  ],
  [
    "Good American food in New York, Manhattan - Memo Shish Kebab",
    "Enjoy watching! The channel where you will see how professionals cook delicious food! Please also check our new channel: ..."
  ],
  [
    "New York City Food - SEAFOOD BIRD’S NEST and SPECIAL FRIED RICE Park Asia Brooklyn NYC",
    ""
  ],
  [
    "Japanese Street Food - OCTOPUS BALLS Osaka Style Takoyaki Karl’s Balls NYC",
    ""
  ],
  [
    "New York City Food - GIANT ALASKAN KING CRAB Cooked Three Ways Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "What’s your favourite brunch spot in New York? #food #foodie #foodreview #brunch #breakfast #eating",
    ""
  ],
  [
    "NYC Live 🗽 Sloppy Joe’s Slop Stop??? What is this?! #Yonkers #SloppyJoes #food",
    "After doing a day of errands, Joe's hungry and we find this little gem of a spot! It's tiny but serves up some great nibbles. Sloppy ..."
  ],
  [
    "#shorts #explore #hack #foodie #food #nyc #drink #fun #hidden #cocktail  #newyork #travel #city",
    ""
  ],
  [
    "American Food - GIANT RED AUSTRALIAN LOBSTERS Park Asia Brooklyn Seafood NYC",
    ""
  ],
  [
    "New York City Food - JAPANESE RAMEN BURGER Soft Shell Crab Kyuramen NYC",
    ""
  ],
  [
    "Day 27 in the life of an NYC Culinary Student - Grilling Steak &amp; Chicken",
    "shorts #culinaryschool #culinarystudent #chefintraining #nycchef #grilling."
  ],
  [
    "American Food - CHICAGO HOT DOGS, SAUSAGES, ITALIAN BEEF SANDWICHES Dog Day Afternoon NYC",
    ""
  ],
  [
    "New York City Food - DOMINICAN SUSHI AND PIZZA Chef Papi Latin Food NYC",
    ""
  ],
  [
    "Street Food in New York. Raclette, Sausages, Skewers, Tacos, Jerk Chicken, Gozleme, Quesadilla",
    "https://www.youtube.com/channel/UCdNO3SSyxVGqW-xKmIVv9pQ/join www.settime2588.com www.facebook.com/settime2588 ..."
  ],
  [
    "American Food - BUTTER PULL APART BREAD Maison Pickle NYC",
    ""
  ],
  [
    "Ice cream #shorts #asmr#cold  #california #newyork #kannada #karaoke #australia #sydney #food",
    ""
  ],
  [
    "lcecream#washington  #shorts#california #newyork #food #cold #kannada #trending #sydney  #asmr",
    ""
  ],
  [
    "#shorts #explore #hack #foodie #food #nyc #coffeelover #fun #hidden #coffee #newyork #travel #city",
    "tis the season for #fall #autumn #hacks and tips and tricks. this #secret #coffeeshop and drink #recommendations for #brooklyn ..."
  ],
  [
    "Where to eat good American food in New York, Manhattan - Memo Shish Kebab",
    "Enjoy watching! The channel where you will see how professionals cook delicious food! Please also check our new channel: ..."
  ],
  [
    "Spanish Food - SQUID INK SEAFOOD PAELLA Casa Dani Manhattan NYC",
    ""
  ],
  [
    "US vs. India Subway | Food Wars | Food Insider",
    "From exclusive items to portion sizes, we wanted to find all the differences between Subway in the US and India. This is Food ..."
  ]
]