[
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "36 Turkish STREET FOODS Across Turkey!! GAZIANTEP Baklava, ISTANBUL Döner + ADANA Kebab",
    "TURKEY is a country full of adventure, culture, history and AMAZING FOOD! We have had the opportunity to deeply explore ..."
  ],
  [
    "DEEPEST Street Food Tour of Turkey - 5 UNIQUE Street Foods + BEST Hummus Masters!",
    "Get ready for the ULTIMATE Turkish street food tour of Antakya, Hatay Region in Southeast Turkey! Thanks to Turkiye Tourism ..."
  ],
  [
    "Eating Turkish Street Food For 24 Hours in Istanbul!! Is This Asian Food??",
    "WATCH OUR MAIN CHANNEL » http://bit.ly/BestEverFoodReviewShow BEFRS MERCH » https://bit.ly/ShopBEFRS ..."
  ],
  [
    "ISTANBUL STREET FOOD will BLOW YOU AWAY!! Turkish Street Food HEAVEN - Adana Kebab + Pickle Juice!",
    "Kemeraltı Bazaar in Izmir: https://youtu.be/Im2gVWc2-hU Iskender Kebab in Bursa : https://youtu.be/RUFI3_IUDCs Amazing street ..."
  ],
  [
    "ULTIMATE STREET FOOD OF ISTANBUL! 🇹🇷 Turkish Food Tour | Hindi",
    "Turkish Food tour in Istanbul. To book a tour with Latif: https://www.istanbullayovertours.com/ Follow me on Instagram: ..."
  ],
  [
    "Most Famous Turkish Fast Food | Toast Sandwich With Sujuk, Cheese And Eggs | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. Location and Price Infromations Tostçu Mahmut Gaziantep, Turkey Toast ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul | November 2021",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Turkish Street Food in Istanbul!! BAKLAVA HEAVEN + Street Food Tour in Türkiye Bazaar!",
    "This is episode 4 of my 2022 STREET FOOD IN TURKEY series! This time I'm in Istanbul again and taking you for some seriously ..."
  ],
  [
    "Turkey Street Food | CZN Burak Restaurant | Old Istanbul &amp; Taksim Square | Kebabs, Doner &amp; More",
    "So here is the first episode of the Turkey series, The first day went pretty good, we visited historic Hagia Sofia, Blue Mosque, ..."
  ],
  [
    "INSANELY delicious TURKISH STREET FOOD in Istanbul, Turkey",
    "We are trying the most INSANELY delicious TURKISH STREET FOOD in Istanbul, Turkey! These foods are positively ..."
  ],
  [
    "Incredibly DELICIOUS Turkish STREET FOOD In ISTANBUL, Turkey (must eat)",
    "Hey! Thanks for watching! We were super lucky for the opportunity to work with Vuse here in Istanbul, Turkey! Today is our very ..."
  ],
  [
    "Top of the BEST Street Food in Turkey! Compilation of the best restaurants in Istanbul",
    "Top of the best Street food in Turkey! Compilation of the best restaurants in Istanbul Thank you for watching! Other video: This ..."
  ],
  [
    "EXTREME Street Food in Turkey - BABY DINOSAUR BBQ + Turkish Street Food Tour of Istanbul, Turkey!!!",
    "ExpressVPN: Protect yourself and unblock any site. https://expressvpn.com/thefoodranger Get 3 months free and 49% off!"
  ],
  [
    "ULTIMATE street food tour in TURKEY (10+ dishes) 🇹🇷",
    "We tried top rated famous Turkish street food in Istanbul! We guarantee mouth-watering satisfaction. Turkish food is insanely ..."
  ],
  [
    "Turkish Food Tour in Istanbul - BEST Kebabs of My Life, AMAZING Seafood, and Turkish Ice Cream!",
    "Check out my Istanbul Travel Food Guide: https://goo.gl/gRsk6W ▻Subscribe to my videos: http://bit.ly/MarkWiensSubscribe ..."
  ],
  [
    "$2 Turkish Street Food in Istanbul 🇹🇷",
    "What started off as a doner kebab hunt ended up with us trying some completely different Turkish foods. The popular doner ..."
  ],
  [
    "TURKISH STREET FOOD #1 Street Food Guide to Antalya, Türkiye!! LEGENDARY Börek + Piyaz!",
    "Welcome back to the home of the world's juiciest kebabs, best breakfast's and strongest coffee! This is TÜRKIYE in 2022!"
  ],
  [
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey",
    "Street Food in Turkey - Today I will take you on an Insane street food tour in Istanbul where we gonna eat a whole lamb bbq and ..."
  ],
  [
    "ISTANBUL Street Food Guide - Delicious Turkish Meat, Doner Platter &amp; Turkish Ice Cream",
    "MUSIC CREDITS Epidemic https://www.epidemicsound.com/browse/ Momma I've got a feeling ..."
  ],
  [
    "Turkey&#39;s RECORD BREAKING Kebab!! Istanbul Street Food Meat Tour!!",
    "WATCH OUR MAIN CHANNEL » http://bit.ly/BestEverFoodReviewShow BEFRS MERCH » https://bit.ly/ShopBEFRS ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | 2022 [120 min]",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "ISTANBUL STREET FOOD will BLOW YOUR MIND!! Turkish Street Food HEAVEN + Seafood in Kadıköy!",
    "Thank you to our video's sponsor, ExpressVPN. https://www.expressvpn.com/chopsticktravel - Get 3 months free with a 12-month ..."
  ],
  [
    "CRAZY street food tour in ADANA, TURKEY 🇹🇷 Unbelievably Tasty! Don’t Miss This!",
    "Salam   Bohemian Family We are in Gaziantep, Turkey!! Thanks To : 1. Şen Ocakbaşı Çorba Ve Kebap Salonu 2. Tostçu Mahmut ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul |August 2021|4k UHD 60fps",
    "Turkish food tour in Istanbul is very exciting for any tourist.Turkish food tastes great and you enjoy eating it very much There is a ..."
  ],
  [
    "Turkey Food &amp; Travel | Delicious Lunch &amp; Turkish Tea with Locals | Most Amazing Places of Antalya",
    "Full-Day in Antalya... The Food and Sightseeing !! Hope you like the video! Please Subscribe!!!"
  ],
  [
    "INSANE Street Food in Turkey!!! 5 LEVELS!!! The BEST Street Food of Gaziantep, Turkey!!!",
    "ExpressVPN: Protect yourself and unblock any site. https://expressvpn.com/thefoodranger Get 3 months free and 49% off!"
  ],
  [
    "ISTANBUL Street Food Tour - Biggest Kahvalti &amp; Meat Heaven in Turkey",
    "Must Subscribe Turkan Atay https://youtube.com/c/T%C3%BCrkanAtay Must Subscribe for Mazy Mazy Ki Videos ..."
  ],
  [
    "Istanbul Street Food - DELICIOUS Turkish Kofte and Breakfast on Turkish Airlines!",
    "Check out my Istanbul travel food guide: https://goo.gl/WVJqhb ▻Subscribe to my videos: http://bit.ly/MarkWiensSubscribe ..."
  ],
  [
    "It&#39;s Amazing! - Lamb Intestines Like Chimney - Turkish Street Food",
    "This Turkish Master prepares delicious lamb intestines, it is called kokorec. Follow our channel for the best street food."
  ],
  [
    "GOD LEVEL Street Food in Turkey - The ULTIMATE Istanbul Street Food ADVENTURE with Mr.Taster!!!",
    "ExpressVPN: Protect yourself and unblock any site. https://expressvpn.com/thefoodranger Get 3 months free and 49% off!"
  ],
  [
    "This Master Prepares Doner Kebab with a Unique Method - Turkish Street Food",
    "This master prepares doner kebab with a unique method and this master is very famous. Follow our channel for the best street ..."
  ],
  [
    "TURKISH STREET FOOD : You&#39;ve NEVER Seen this Before!!! KEBAB HEAVEN + Street Food in Izmir Turkey",
    "Kemeraltı Bazaar Street Food tour in IZMIR, TURKEY Welcome to the first episode of our Turkey street food series. historical ..."
  ],
  [
    "This Kebab Master Sells 500 Kebabs a Day! - Turkish Street Food",
    "This is a very small place but sells 500 kebabs a day here. Follow our channel for the best street food. Instagram: ..."
  ],
  [
    "Process of Making Legendary Turkish Baklava | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #baklava #dessert."
  ],
  [
    "🇹🇷 Delicious Turkish Street Food Tour In Istanbul |4k UHD 60fps",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "We Tried Turkish Street Food in Istanbul",
    "Trying Turkish food in Istanbul. We have just arrived in Turkey and you know how much we love finding local food, so we are ..."
  ],
  [
    "LEVEL 9999 STREET FOOD IN ISTANBUL, TURKEY!!! NEXT LEVEL LAMB MEAT + STREET FOOD IN ISTANBUL, TURKEY",
    "LEVEL 9999 STREET FOOD IN TURKEY - Today I will take you on a level 9999 street food tour in Istanbul, Turkey, and we will ..."
  ],
  [
    "Amazing &amp; Delicious Turkish Street Food! #Shorts",
    "Traditional Turkish cuisine."
  ],
  [
    "Turkish Street Food in Istanbul | Delicious Turkish Kebabs",
    "An Istanbul restaurant with Turkish dishes Thanks for watching our video. Don't forget to like and subscribe to our channel."
  ],
  [
    "MASSIVE Turkish Breakfast in Istanbul + Turkish Delight Factory!! (SUPER SATISFYING)",
    "Try the Turkish food in this video yourself @ https://www.buyinturkey.com Join me on an adventure in Istanbul exploring Turkish ..."
  ],
  [
    "Iron Toast With 1000 Eggs a Day - Turkish Street Food",
    "He cooks iron toast with 1000 eggs a day. Popular and delicious street food. Follow our channel for the best street food."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul | Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "5 Turkish Meals for Less Than $2 (Insanely Cheap)",
    "SUBSCRIBE for more travel videos: http://bit.ly/2hyQnZ1 HELLO FROM TURKEY!! It's so wonderful to be back here, one of ..."
  ],
  [
    "Chiken Doner Kebab in 4 Different Restaurants | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us."
  ],
  [
    "🇹🇷 Most Famous Turkish Fast Food |Turkish Street Food Tour Istanbul Turkey | 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "🔥Compilation Of The Best Turkish Street Food 2022🔥 I&#39;m drooling from such food",
    "Compilation Of The Best Turkish Street Food! I'm drooling from such food Thank you for watching! Other video: This institution ..."
  ],
  [
    "Most UNIQUE Street Food in Turkey - UNDERGROUND Kokorec FACTORY + Street Food Tour of Istanbul!!!",
    "Get 1 Month Free at CuriosityStream Here: http://curiositystream.com/foodranger ▻Street Food in Turkey is INSANE! Today, with ..."
  ],
  [
    "Eating Only Turkish Street Food for 10 Days 🇹🇷 Massive 51 Dishes in Istanbul, Izmir and Hatay",
    "Salam   Bohemian Family We are going to show you our Turkish food compilation Video!! Thanks To : 1. Karakoy muhallebicisi 2."
  ],
  [
    "The most delicious Shawarma of Turkey! Istanbul&#39;s Incredible Street Food",
    "The most delicious Shawarma of Turkey! Istanbul's Incredible Street Food Bereket Döner- Hacı Kadın, Tavanlı Çeşme Sk. No:2, ..."
  ],
  [
    "20 UNBELIEVABLE Turkish Street Foods You Must Try in Istanbul, Turkey",
    "While in Istanbul, I hunted down all of the best, must-try foods, drinks, and desserts that Turkey has to offer. In this ultimate full ..."
  ],
  [
    "EXTREME TURKISH STREET FOOD 🇹🇷  Istanbul Exotic Meat Party!",
    "Salam   Bohemian Family We are in Istanbul, Turkey!! Thanks To : 1. Çimen 2. Şehzade Cağ Kebap 3. Şırdancı Mehmet 4."
  ],
  [
    "PAKISTANI TRY TURKISH STREET FOOD IN ISTANBUL *SHOCKED*",
    "PAKISTANI TRY TURKISH STREET FOOD IN ISTANBUL *SHOCKED* Turkish cuisine extreme Turkish Istanbul street food tour ..."
  ],
  [
    "ISTANBUL TOP 10 TURKISH STREET FOOD!!! You will be BLOWN AWAY!!!",
    "ISTANBUL TOP 10 TURKISH STREET FOOD! I made a list of my 10 favouvite Turkish foods that I think you must try while in ..."
  ],
  [
    "10 TURKISH Street Foods in ADANA, TURKEY! MUST TRY TURKISH UNIQUE FOODS 👌 (INSANELY Delicious!)",
    "Come and try TURKISH STREET FOOD IN ADANA, TURKEY WITH US! We were thrilled to finally make it to another new city in ..."
  ],
  [
    "We Tried Turkish Street Food in Istanbul",
    "Trying Turkish food in Istanbul. We have just arrived in Turkey and you know how much we love finding local food, so we are ..."
  ],
  [
    "Process of Making Legendary Turkish Baklava | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #baklava #dessert."
  ],
  [
    "This Kebab Master Sells 500 Kebabs a Day! - Turkish Street Food",
    "This is a very small place but sells 500 kebabs a day here. Follow our channel for the best street food. Instagram: ..."
  ],
  [
    "Most UNIQUE Street Food in Turkey - UNDERGROUND Kokorec FACTORY + Street Food Tour of Istanbul!!!",
    "Get 1 Month Free at CuriosityStream Here: http://curiositystream.com/foodranger ▻Street Food in Turkey is INSANE! Today, with ..."
  ],
  [
    "🇹🇷 Most Famous Turkish Fast Food |Turkish Street Food Tour Istanbul Turkey | 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Street Food Turkiye🇹🇷 DONER, Famous KOFTE Types!",
    "As a local I am showing local places for doner and kofte, covering the different types and places where you can eat like a local in ..."
  ],
  [
    "5 Turkish Meals for Less Than $2 (Insanely Cheap)",
    "SUBSCRIBE for more travel videos: http://bit.ly/2hyQnZ1 HELLO FROM TURKEY!! It's so wonderful to be back here, one of ..."
  ],
  [
    "Kebab Kingdom! - 2000 Pieces Kebab Sales per Day - Turkish Street Food",
    "This kebab is so delicious that 2000 pieces are sold every day. Follow our channel for the best street food."
  ],
  [
    "Lahmacun ❤ Doner Kebab Wedding  | Turkish Street Foods",
    "Thanks for watching our video. Don't forget to like and subscribe to our channel. We will make big surprises for you. :) :) Thanks ..."
  ],
  [
    "Best Turkish Kebabs | Adana Kebab Making | Turkish Street Foods",
    "How many types of kebabs are there? In this video, you will be able to see the making of all types of kebabs. Adana kebab making ..."
  ],
  [
    "turkish food || most popular turkish food || turkish street food",
    "turkish food : https://youtu.be/C4lQkp5fYj4 adana kabab : https://youtu.be/7a_w6bBda9c beef tagliata ..."
  ],
  [
    "Turkey Street Food | Turkish street Food",
    "More Food Videos https://youtube.com/playlist?list=PLtfwS92QbZ31WevR75xL4Xh_z-HIaeCbX instagram: Naa Anveshana ..."
  ],
  [
    "Crazy $0.7 Kebab in Istanbul 🇹🇷 Hidden Local Street Food Tour in Turkey",
    "Salam   Bohemian Family We are in Istanbul, Türkiye!! Thanks To : 1. Padişah Sofrası Şişli 2. Saray Muhallebicisi Bağcılar 3 ..."
  ],
  [
    "Turkish Street Food Days | Mouthwatering Kebabs and Local Dishes",
    "At the local flavors fair held in Istanbul. The dishes of Bitlis province of Turkey were presented. In addition to Turkish street food, ..."
  ],
  [
    "Mouth Watering Tantuni 🥵🥵 Turkish Street Foods",
    "Tantuni, which has an important place among Turkish street food Thanks for watching our video. Don't forget to like and subscribe ..."
  ],
  [
    "Amazing Traditional Turkish Katmer | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. Gap Yazicik- Gaziantep, Turkiye https://goo.gl/maps/Z4UdNh3ukX5sQmcg7 ..."
  ],
  [
    "TURKISH STREET FOOD - Adana Kebab + Crazy Şırdan! AMAZING Street Food in Adana, Turkey!!",
    "HATAY STREET FOOD :https://youtu.be/irhU-uz2Frg SUPPORT US : https://www.patreon.com/join/chopsticktravel?"
  ],
  [
    "Eating Only Turkish Street Food for 10 Days 🇹🇷 Massive 51 Dishes in Istanbul, Izmir and Hatay",
    "Salam   Bohemian Family We are going to show you our Turkish food compilation Video!! Thanks To : 1. Karakoy muhallebicisi 2."
  ],
  [
    "Amazing TURKISH STREET FOOD MASTERS | Unusual Istanbul STREET FOOD tour- SHEEP&#39;S HEAD, Bici Bici...",
    "ISTANBUL STREET FOOD | Quirky + UNUSUAL ISTANBUL FOOD | TURKISH STREET FOOD specialities We're in Istanbul, ..."
  ],
  [
    "World&#39;s Best Kunefe  | Turkish Desserts Heaven in Gaziantep | Turkish Street Food",
    "Welcome To Kebab Baba Channel Your Taste Guide In Turkey Hope you like the video You can subscribe to join us. Want to eat ..."
  ],
  [
    "Chestnut In Taksim Square Istanbul | Istanbul Street Food Turkey Turkish Street Food Tour",
    "In Turkish Street Food Tour this is our first video and this is the arrival day in Istanbul. I roamed around in Streets Of Istanbul ..."
  ],
  [
    "Unusual TURKISH STREET FOOD | ROASTED SHEEP&#39;S HEAD + Chicken breast pudding | TURKISH FOOD",
    "ISTANBUL STREET FOOD | Massive MEZZE feast, ROASTED SHEEP'S HEAD | Delicious TURKISH FOOD We're in Istanbul, ..."
  ],
  [
    "9999 Level Turkish Foods and Kebabs  | Turkish Street FOOD in ISTANBIL",
    "We visited the provincial promotion days held in Istanbul. We tasted Turkish dishes and Turkish kebabs from the cities of Elazig ..."
  ],
  [
    "HUGE TURKISH STREET FOOD TOUR In Istanbul, Turkey! 🇹🇷",
    "Greetings from Turkey! HUGE TURKISH STREET FOOD TOUR In Istanbul, Turkey! Hope you've got a snack in hand for this ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul June 2021 |4k UHD 60fps",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Turkish Food is very diverse and different cities in Turkey ..."
  ],
  [
    "WE TRIED TURKISH STREET FOOD IN ISTANBUL 🇹🇷",
    "FIRST TIME TRYING TURKISH STREET FOOD IN ISTANBUL TURKEY TURKEY TRAVEL VLOG We've arrived in Turkey ..."
  ],
  [
    "TURKISH STREET FOOD IN BURSA - Real Iskender Kebab &amp; Ottoman’s Breakfast.",
    "Turkey Series Ep 01 - https://youtu.be/RZRBlX_TKk8 Ep 02 - https://youtu.be/avA8l-sCGC4 Ep 03 - https://youtu.be/KxAQGFjfYAo ..."
  ],
  [
    "LEVEL 9999 STREET FOOD IN ISTANBUL, TURKEY!!! NEXT LEVEL LAMB MEAT + STREET FOOD IN ISTANBUL, TURKEY",
    "LEVEL 9999 STREET FOOD IN TURKEY - Today I will take you on a level 9999 street food tour in Istanbul, Turkey, and we will ..."
  ],
  [
    "Turkish street food Kokorec banned in Europe! #streetfood",
    "The indispensable street flavor of the Turks, kokoreç… You should definitely try this street flavor made from lamb intestines."
  ],
  [
    "Doner Kebab King! - Appetizing Turkish Street Food Compilation",
    "It's so appetizing, best Turkish street food compilation in Istanbul, delicious doner kebab, desserts, pita and iron toast. Follow our ..."
  ],
  [
    "🇹🇷 [4k] Huge and Mouthwatering Turkish Street Food Tour Istanbul Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "🇹🇷 Delicious Turkish Street Food Tour In Istanbul |4k UHD 60fps",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "TURKISH STREET FOOD TOUR in ISTANBUL, TURKEY (ultimate guide)",
    "We have made it to COUNTRY #9– TURKEY! Our very first stop was Istanbul, where we decided to locate a handful of cheap and ..."
  ],
  [
    "FULL REOPENING! Antalya Turkish Street Food Tour June 2021 |4k UHD 60fps",
    "Delicious Turkish Street food tour in Antalya is really enjoyable! Once fully reopened in all Turkish cities, Antalya will host ..."
  ],
  [
    "It&#39;s Crazy! - 500 Kilos of Doner Kebab Sales per Day - Turkish Street Food",
    "It's so delicious that it sells 500000 pieces per day. This doner kebab is marinated with a special mixture. Follow our channel for ..."
  ],
  [
    "KÜNEFE KING of TURKEY - Gaziantep Street Food : World&#39;s BEST Künefe | TURKISH STREET FOOD 2020",
    "Gaziantep Street Food : https://youtu.be/rq4q9ES5nz0 SUPPORT US : https://www.patreon.com/join/chopsticktravel?"
  ],
  [
    "Kebab King! - 4000 Pieces Kebab Sales Per Day! - Amazing Turkish Street Food",
    "Very Delicious kebab and doner, best Turkish Street Food compilation Follow our channel for the best street food."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | September 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "How To Roast Chestnut! Famous Turkish Street Food #shorts",
    "It is easier than you think to roast chestnuts as they do on the street in Turkey!"
  ],
  [
    "Turkish Street Food Tour in Istanbul Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Turkish food is deifinitely the best food on earth 😆",
    ""
  ],
  [
    "#turkish #food #tandoori #paneer#pizza 🍕#yummy🥵#trendingshorts #indianfood #shortvideo #FooD#GalA",
    ""
  ],
  [
    "UNKNOWN street food in Turkey - TURKISH FOOD YOU&#39;VE NEVER HEARD OF + Street food in AFYON, Turkey",
    "Street food in Turkey - In this video, I will take you on a street food tour of Afyon in search of Turkish food you've never heard of."
  ],
  [
    "Diese Meister nehmen 50 Kebab-Bestellungen pro Stunde entgegen - Türkisches Street Food",
    "Sie sind Fleischmeister und machen köstliche Kebabs. Folgen Sie unserem Kanal für das beste Street Food."
  ],
  [
    "Street Food Heaven! - People Come To Eat These Most Delicious Turkish Kebabs",
    "Most delicious street food, fastest and most talented masters are in this video. Follow our channel for the best street food."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | Food Tour 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "How Turkish Street Food Kokorech is Made | Kokoreç | Lamb Intestine Sandwich",
    "Turkish Kokorech, locally known as Kokoreç, is a typical Turkish dish made from lamb intestines! That's right, the intestines of ..."
  ],
  [
    "Amazing Tulumba And Lokma Desserts | Turkish Street Foods",
    "Welcome To Kebab Baba Channel Your Taste Guide In Turkey Hope you like the video You can subscribe to join us. Want to eat ..."
  ],
  [
    "It&#39;s Crazy! - 500 Kilos of Doner Kebab Sales per Day - Turkish Street Food",
    "It's so delicious that it sells 500000 pieces per day. This doner kebab is marinated with a special mixture. Follow our channel for ..."
  ],
  [
    "33 Incredible Street foods around Turkey - 1 YEAR OF EATING TURKISH FOOD + From BURSA to ADANA",
    "Street foods around Turkey - As most of you already know, I've been travelling around Turkey for about 1 year in search of the ..."
  ],
  [
    "Popular Pita Restaurants in Istanbul - Turkish Street Food",
    "We visited the pide restaurants of Istanbul for you. Crispy, delicious pitas, also known as Turkish pizza, are indispensable for ..."
  ],
  [
    "Amazing Turkish Shawarma | Iskender Kebab | Istanbul Street Foods",
    "Hope you like the video You can subscribe to join us. Price And Location Sarayli Doner - Istanbul/Turkiye ..."
  ],
  [
    "INSANELY DELICIOUS TURKISH STREET FOOD: MIDYE #shorts #youtubeshorts #shortsyoutube #shortvideos",
    "INSANELY DELICIOUS TURKISH STREET FOOD: MIDYE."
  ],
  [
    "Amazing Street Food of Istanbul #shorts",
    "Turkish Food: Istanbul City, (Turkey) Daily Sale It's Very Tasty Street Food You Can Visit Eating This Tasty Food Starting Price ..."
  ],
  [
    "Mouth Watering Tantuni 🥵🥵 Turkish Street Foods",
    "Tantuni, which has an important place among Turkish street food Thanks for watching our video. Don't forget to like and subscribe ..."
  ],
  [
    "Turkish Street Food वाणिज्य",
    "Asmr dessert, Turkish street food #dessert #asmr #streetfood #shorts."
  ],
  [
    "My Delicious Trips For Best Turkish Street Food Tour In Turkey Istanbul City 2022 4k UHD 60FPS #fyp",
    "Being the busiest city of Turkey population-wise, Istanbul offers one of Turkey's most perse food choices. Majority of the people ..."
  ],
  [
    "🇹🇷 [4k] Huge and Mouthwatering Turkish Street Food Tour Istanbul Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Turkish Street Food and High Class Dumplings in Istanbul",
    "Check out https://ExpressVPN.com/thefoodranger for 3 months free w/ 1 year pack and 49% OFF! FOOD RANGER MERCH NOW ..."
  ],
  [
    "It&#39;s Really Amazing! - 100,000 Visitors per Month! - Best Turkish Doner Kebab",
    "This is the best Turkish Doner Kebab. It name is Agababa Doner. Follow our channel for the best street food."
  ],
  [
    "Doner Kebab King! - Appetizing Turkish Street Food Compilation",
    "It's so appetizing, best Turkish street food compilation in Istanbul, delicious doner kebab, desserts, pita and iron toast. Follow our ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul City September 2021|4k UHD 60fps",
    "Turkish food is very tasty and many tourists go to Istanbul and other Turkish cities to try it. It can be said that you can see cafes and ..."
  ],
  [
    "Best Buryan Kebab Restaurants in Istanbul Fatih - Turkish Street Food",
    "Kebab is indispensable for Turkish cuisine and Turkish street food. We visited the restaurants that make the best Büryan kebab, ..."
  ],
  [
    "🇹🇷 INSANELY delicious TURKISH STREET FOOD in Istanbul, Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | Food Tour 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Best Turkish Street Food Tour | Turkey Istanbul City Center | 8 Jnuary 2022 | 4k UHD 60 FPS #fyp",
    "Istanbul is a street food lover's paradise. The street food of Istanbul is diverse and delicious, made with fresh ingredients and ..."
  ],
  [
    "Most Different Lahmacun With Walnuts And Pomegranate Molasses | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. Location And Price: Altun Et Kebap Gaziantep, Turkey ..."
  ],
  [
    "Only 1$ - Best Turkish street food - Thin Turkish Pizza #foodshorts #shorts",
    "Extremely delicious Turkish Street Food Lahmacun cooked in wood fire! Sold for only $1, this delicious Turkish street food is ..."
  ],
  [
    "TURKISH STREET FOOD - Kebab Ninja of Turkey!! HUMMUS + AMAZING Street Food in Antakya, Hatay!",
    "Gaziantep Street Food :https://youtu.be/9nyAupZiJWA SUPPORT US : https://www.patreon.com/join/chopsticktravel?"
  ],
  [
    "Compilation Of The Most Delicious Street Food In Turkey! The Best Places In Turkey!",
    "Compilation of the most delicious street food in turkey! The best places in turkey! Thank you for watching! Other video: This ..."
  ],
  [
    "Istanbul Street Food 🇹🇷 Delicious Turkish Street Food Tour | shawarma 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Amazing Doner Kebab and Lahmacun - Made With an Incredible Technique - Turkish Street Food",
    "There are talented chefs here and they prepare delicious Turkish lahmacun and doner kebab. Follow our channel for the best ..."
  ],
  [
    "People Come From Other Countries For This Kebab - Turkish Street Food",
    "People come from other countries because this kebab is so delicious. Follow our channel for the best street food."
  ],
  [
    "Turkish street food",
    ""
  ],
  [
    "Turkish Street Food in Istanbul | Delicious Turkish Kebabs",
    "An Istanbul restaurant with Turkish dishes Thanks for watching our video. Don't forget to like and subscribe to our channel."
  ],
  [
    "CAPPADOCIA STREET FOOD!! Hot Air Balloon + FLAMING Testi Kebab | BEST Turkish Food in Cappadocia!",
    "https://www.expressvpn.com/chopsticktravel Thank you to our video's sponsor, ExpressVPN. Get 3 months free with a 12-month ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul City May2021|4k UHD 60fps",
    "Again an attractive Turkish Street Food Tour in Istanbul City! Turkish food in Istanbul is really delicious and you are really satisfied ..."
  ],
  [
    "Turkish Food Compilation! #17",
    "Turkish Food Compilation! #17. Turkish Food Compilation! #17 How to make the best BBQ:https://bit.ly/32lvHIO The Best ..."
  ],
  [
    "Old Style Giant Doner Kebab in Wood Fire - Turkish Street Food",
    "This master is 65 years old and makes old style doner kebab. Follow our channel for the best street food."
  ],
  [
    "🇹🇷 Turkish Street Food #shorts #streetfood #food #cooking #recipe",
    "shorts #streetfood #food."
  ],
  [
    "Turkish Kebab | Turkish Street Food | Satisfying Food Video",
    ""
  ],
  [
    "I Tried TURKISH Street Food (Istanbul)",
    "Social Media Links     Instagram: https://www.instagram.com/blatantreviewz/?hl=en TikTok: ..."
  ],
  [
    "Halwa, one of most famous Turkish Dessert (Turkish Street Food)",
    "Hello This is the \"Taste and Culture Stories\" channel. it is a channel with the purpose of introducing various food and street food ..."
  ],
  [
    "UNKNOWN street food in Turkey - TURKISH FOOD YOU&#39;VE NEVER HEARD OF + Street food in AFYON, Turkey",
    "Street food in Turkey - In this video, I will take you on a street food tour of Afyon in search of Turkish food you've never heard of."
  ],
  [
    "𝑻𝑹 Most Amazing Turkish Street Food 3 - #shorts",
    ""
  ],
  [
    "Turkish street food Kokorec banned in Europe! #streetfood",
    "The indispensable street flavor of the Turks, kokoreç… You should definitely try this street flavor made from lamb intestines."
  ],
  [
    "BEST Turkish Street Food TOUR in GAZIANTEP TURKEY #Turkey #turkishstreetfood #baklava #gaziantep",
    "FULL VIDEO: https://youtu.be/nNutvevWvf0 Come and try 24 INSANE Street Foods in Gaziantep (Antep) Turkey with us when we ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | 2022 Most Famous Turkish Fast Food",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Best Turkish Street Food Tour Istanbul Sirkeci Eminonu Restaurants | 4K UHD 60FPS | JULY 2022",
    "Istanbul is a street food lover's paradise. The street food of Istanbul is diverse and delicious, made with fresh ingredients and ..."
  ],
  [
    "Turkish Street Food Tour with @TurkanAtay",
    "Turkish Street Food Tour with @Türkan Atay."
  ],
  [
    "Amazing Turkish Sarma Baklava | Turkish Street Food",
    "Hope you like the video Please subscribe to support us. #baklava #turkishfood #streetfoods."
  ],
  [
    "Ultimate TURKISH STREET FOOD tour in ISTANBUL, Turkey | Börek, Dürüm + BEST Turkish breakfast",
    "Istanbul is a city that stirs the imagination. Where East meets West, this city's diverse heritage is reflected in its incredible food ..."
  ],
  [
    "Turkish Street Food Part 2 #turkey #istanbul #taksim #turkishstreetfood #eminönü",
    "Turkish Street Food Part 2 #turkishstreetfood #istanbul #turkey."
  ],
  [
    "5 Best Turkish Desserts | Best Turkish Baklava | Baklava | Kunefe | Kunafa  | Turkish Street Food",
    "Street food in depth and not boring! Baklava, Turkish Baklava, Kunafa, Kunefe, Künefe, Ottoman's Turkish Baklava and Künefe, ..."
  ],
  [
    "Turkish Doner Kebab on Rice | #shorts",
    "Eat More Youtube Shorts Video Series Turkey's most famous street food doner kebab. Hope you would enjoy it and subscribe to ..."
  ],
  [
    "There Is No Stopping The Juice From This Doner! Incredible Turkish Street Food",
    "There Is No Stopping The Juice From This Doner! Incredible Turkish Street Food Thank you for watching! Other video: This ..."
  ],
  [
    "GAZIANTEP STREET FOOD : Turkish Viagra + Kebab HEAVEN!! Turkish Street Food in UNKNOWN Turkey!!",
    "Istanbul Street Food : https://youtu.be/GOZewFqA7Yc SUPPORT US : https://www.patreon.com/join/chopsticktravel?"
  ],
  [
    "Turkish Street Food Tour | Ankara, Ulus Walking Tour | Eat More Street Food",
    "Ankara street food tour. Today we wandered around the Ulus district of Ankara city for you. We tried delicious street food. If you're ..."
  ],
  [
    "Turkish Lahmacun Thin, Crunchy And Tasty | How It&#39;s Made? | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. Kasap Halil Usta - Gaziantep, Turkey Location ..."
  ],
  [
    "Eating Turkish Street Food in Istanbul. Massive Feast! 😋 Foreigners Try Street Food in Turkey 🇹🇷",
    "This week we're finally trying Turkish street food in Istanbul! We start things off we something we never expected to have in Turkey ..."
  ],
  [
    "Best Turkish Street Food Tour Beşiktaş Bazaar Istanbul | JUNE 2022 | 4K UHD 60 FPS",
    "You will quickly notice that in Turkey and especially in Istanbul, there is not a settled time to eat. Restaurants are open at any time ..."
  ],
  [
    "5 MOUTHWATERING Turkish STREET FOODS in Istanbul Turkey | Kadıköy Istanbul Street Food Tour",
    "In this episode, we are eating some phenomenal Turkish street food in Istanbul, Turkey! This is the first episode of our new Turkey ..."
  ],
  [
    "This Master Sells Delicious Whole Chicken for $2 - Turkish Street Food",
    "This master shows how to make whole chicken also sells delicious kebabs for $1. Follow our channel for the best street food."
  ],
  [
    "Turkish Kebab | Turkish Street Food | Satisfying Food Video",
    ""
  ],
  [
    "Turkish Street Food You MUST Eat in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "Istanbul Street Food Tour- May 2022",
    "Thanks for Watching and stay tuned for new videos every day! Book a Trip to beautiful Istanbul with great deals on Hotels.com ..."
  ],
  [
    "Turkish Street Food! #Shorts",
    "delicious and Tempting Turkish Food you will want to try now!"
  ],
  [
    "Most Famous Turkish Street Food",
    "This restaurant serves lahmacun, which is known as Turkish pizza around the world. Also, lamb kebabs and lamb head! I hope ..."
  ],
  [
    "TURKISH STREET FOOD at home | Cooking a kebab platter fit for a king | Making Istanbul street food",
    "Want this recipe? BUY our Chasing a Plate: Street Food at Home e-Cookbook for $2.99! https://payhip.com/ChasingaPlate ..."
  ],
  [
    "TURKISH STREET FOOD in ISTANBUL: Pit Roast Lamb Büryan Kebab!! Turkey&#39;s #1 Street Food!",
    "ISTANBUL'S BEST STREET FOOD GUIDE 2020! SUPPORT US : https://www.patreon.com/join/chopsticktravel? BECOME A ..."
  ],
  [
    "Amazing Turkish Street Food | Istanbul Street Food | Best Turkish Street Food",
    "Amazing Turkish Street Food | Istanbul Street Food | Best Turkish Street Food Please Subscribe my Channel: ..."
  ],
  [
    "Street Food in Turkey | İZMİR KEMERALTI BAZAAR + BEST KAZANDIBI &amp; ŞAMBALI | Turkish Street Food Tour",
    "Street food in Turkey. Today we went to the Izmir Kemeralti Bazaar to try some awesome street food, including the best kazandibi ..."
  ],
  [
    "Deep-Fried Turkish Desserts | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #desserts #streetfood."
  ],
  [
    "ISTANBUL Street Food Guide - Delicious Turkish Meat, Doner Platter &amp; Turkish Ice Cream",
    "MUSIC CREDITS Epidemic https://www.epidemicsound.com/browse/ Momma I've got a feeling ..."
  ],
  [
    "🇹🇷 Turkish Street Food #shorts #streetfood #food #cooking #recipe",
    "shorts #streetfood #food."
  ],
  [
    "Iconic Vegetarian Turkish Street Food in Istanbul 🇹🇷 Vegan Turkish Food",
    "It is not always easy to find vegetarian Turkish food, but there is one iconic vegetarian Turkish street food you can find all over ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul  | 2022 | 4K",
    "Delicious Turkish Street Food Tour In Istanbul | 2022 | 4K Date record : 2022 Turkish Street Food Tour In Istanbul Turkish cuisine ..."
  ],
  [
    "Turkish Street Food - Lamb Heart",
    "In the center of Ankara, Ulus Region, the salesman Mustafa bey has been selling lamb heart more than 30 years. He may be ..."
  ],
  [
    "Turkish Street Food - Just a Small Taste",
    "turkish #StreetFood #istanbul."
  ],
  [
    "UNBELIEVABLE TURKISH STREET FOOD in ANTAKYA 🇹🇷  HATAY TURKEY",
    "Ask any Turk where in Turkey has the BEST street food and their answer always includes Antakya in Turkey's Hatay region."
  ],
  [
    "🇹🇷 Most Famous Turkish Street Food Tour Istanbul Turkey",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022  4k HDR",
    "Donerkebab is one of the most popular Turkish dishes that many tourists come to Turkey to eat this delicious dish Doner Kebab ..."
  ],
  [
    "Istiklal Street |Night Walking Tour In The Beating heart Of Istanbul 17July 2021 |4k UHD 60fps",
    "The liveliest street in Istanbul at night can be said to be Istiklal. Istiklal Street near Taksim Square can be called the beating heart ..."
  ],
  [
    "UNSEEN TURKISH STREET FOOD TOUR in IZMIR, TURKEY | TURKISH SANDWICHES YOU&#39;VE NEVER SEEN (MUST TRY)",
    "As a Turkish and American couple, we show you the most UNSEEN TURKISH STREET FOOD TOUR in IZMIR, TURKEY. What Do ..."
  ],
  [
    "Rice Pilav with Chicken &amp; Chickpeas / Turkish Street Food At Home",
    "Trying Turkish street food in Istanbul with tips as a local Turkish lady. I am going to take you to the part of Istanbul you probably ..."
  ],
  [
    "Turkish Doner",
    "viralvideo #asmr #food #shorts #viralshorts #tiktok #tiktokvideo #viral #youtubeshorts No copyright infringement intended Video ..."
  ],
  [
    "4 INCREDIBLY Delicious TURKISH STREET FOODS in ISTANBUL, Turkey | Istanbul Street Food in Turkey",
    "In this episode, we are off to eat some delicious Turkish street food in Istanbul, Turkey! We head to the European side of Istanbul ..."
  ],
  [
    "Amazing Istanbul Street Food | Döner Kebab vs Cağ Kebab | Turkish Street Food in Istanbul, Turkey",
    "Amazing Istanbul Street Food. In this Turkish street food tour in Istanbul, Turkey, we taste the difference between Döner Kebab ..."
  ],
  [
    "Turkish Street Food",
    ""
  ],
  [
    "Turkish Street food - Street food in Turkish",
    "Turkish Street food - Street food in Turkish #shorts #youtubeshorts."
  ],
  [
    "EXTREME STREET FOOD IN TURKEY!! KEBAB KING OF TURKEY + TURKISH STREET FOOD TOUR IN ANKARA, TURKEY",
    "EXTREME STREET FOOD IN TURKEY - Today I'm going to take you on a street food adventure in Ankara to see the kebab king of ..."
  ],
  [
    "$2 Popular Turkish Street Food - TANTUNI",
    "Please subscribe: https://bit.ly/FOUsubscribe There is always food to discover in Turkey. This time FOU's camera focuses on the ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD Video Equipment Camera : Dji Osmo Pocket 2 - GoPro Max Gimbal : Dji ..."
  ],
  [
    "KING of İSKENDER KEBAB - 150 Year Old TURKISH Street Food in Bursa!! BEST Street Food in Turkey 2019",
    "Ottoman Street Food in Bursa, Turkey! (BUTTER ALERT!!!) Izmir Street Food ..."
  ],
  [
    "Eating UNIQUE Turkish Street Food in Bodrum | Brit tries Kokoreç | Turkish Food",
    "We couldn't avoid eating this unique Turkish street food after promising to give it a go. Did we like it and would you be brave ..."
  ],
  [
    "World Famous Street Food! Celebrities are running in this Restaurant! Turkish Street Food",
    "World Famous Street Food! Celebrities are running in this Restaurant! Turkish Street Food #streetfood #kebab #turkishfood."
  ],
  [
    "Great Taste on the Street: Kokorech - Delicious Turkish Street Food",
    "Amazing street food in the middle of the street in Adana. Kokorech is the most consumed street food in Turkey. Thanks for ..."
  ],
  [
    "The Most Amazing TURKISH street food KOKOREC, STREET FOOD",
    "STREET FOOD,The Most Amazing and Delicious TURKISH street food is KOKOREC. It is made by lamb. 100 meter small intestine ..."
  ],
  [
    "What is TURKISH STREET FOOD like?",
    "Street Food is amazing. Turkey is especially known for it. Today we will explore more of the Fast Food places. Turkish Food."
  ],
  [
    "Er verkauft 300 Dönerkebabs pro Tag auf der Straße – Erstaunliches türkisches Streetfood",
    "Er macht leckeren und günstigen Döner auf der Straße. Folgen Sie unserem Kanal für das beste Street Food. Adres: Bey, 16042."
  ],
  [
    "The Most Delicious Turkish Street Food In Istanbul City 2021|4k UHD 60fps",
    "In this video, We still have a different tour of Istanbul City Today, from the third series of food tour videos, we are going to go to ..."
  ],
  [
    "TURKISH STREET FOOD, FIRST DAY IN ISTANBUL, WALKING AROUND ISTIKLAL AVENUE, TURKISH CHICKEN KEBAB",
    "TURKISH STREET FOOD, FIRST DAY IN ISTANBUL, WALKING AROUND ISTIKLAL AVENUE, TURKISH CHICKEN KEBAB, ..."
  ],
  [
    "istanbul​ Street Food in turkey 2021 | Street Foods In istanbul turkey  | istanbul street food 2021",
    "istanbul​ Street Food in turkey 2021 Amazing Street Foods In istanbul turkey 2021 istanbul street food 2021 #shorts​​ ..."
  ],
  [
    "Turkish Street Food in Antalya (May 2022) Antalya City Tour",
    "Turkish Street Food in Antalya (2 May 2022) Antalya City Tour This Turkish street food tour was filmed in Antalya. Turkish street ..."
  ],
  [
    "Chicken Doner &amp; Lavash Bread Recipe | Turkish Street Food",
    "Let's make Chicken Doner Kebab (the best Turkish street food) with home-made lavash wrapping bread. You can freeze the ..."
  ],
  [
    "Turkish Street Food",
    ""
  ],
  [
    "THE ULTIMATE STREET FOOD TOUR IN ISTANBUL | KEBAB KING +  INSANE STREET FOOD IN TURKEY",
    "THE ULTIMATE STREET FOOD TOUR IN ISTANBUL - In this video I will take you on the ultimate street food tour in Istanbul to try ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022  4k HDR",
    "Donerkebab is one of the most popular Turkish dishes that many tourists come to Turkey to eat this delicious dish Doner Kebab ..."
  ],
  [
    "INSANE !!! Turkish Street Food Tour in Istanbul",
    "Hey guys in this video me and My friends from Pakistan have tried some of the most famous Turkish street food in Istanbul. Hope it ..."
  ],
  [
    "Turkish Street Food In Istanbul #shorts #istanbul #turkishfood",
    "Life Is Short But We Do Everything To Enjoy It! #istanbul #turkishfood #shorts #walkingtour #istanbul2021."
  ],
  [
    "GAZIANTEP STREET FOOD : Turkish Viagra + Kebab HEAVEN!! Turkish Street Food in UNKNOWN Turkey!!",
    "Istanbul Street Food : https://youtu.be/GOZewFqA7Yc SUPPORT US : https://www.patreon.com/join/chopsticktravel?"
  ],
  [
    "Turkish Street Food You MUST Eat in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "TURKISH STREET FOOD, FIRST DAY IN ISTANBUL, WALKING AROUND ISTIKLAL AVENUE, TURKISH CHICKEN KEBAB",
    "TURKISH STREET FOOD, FIRST DAY IN ISTANBUL, WALKING AROUND ISTIKLAL AVENUE, TURKISH CHICKEN KEBAB, ..."
  ],
  [
    "Grand Bazaar 🇹🇷 Turkish Street Food 🥨 Istanbul Spice Market 🌰🍯",
    "Hello! Today I got out of my kitchen and took myself (and you guys) to one of the oldest and largest closed bazaars in the world; ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD Video Equipment Camera : Dji Osmo Pocket 2 - GoPro Max Gimbal : Dji ..."
  ],
  [
    "Delicious Turkish Street Food in Ankara - Popular Meatballs Restaurant",
    "A street food restaurant with rows in front of Ankara auto industry Thanks for watching our video. Don't forget to like and subscribe ..."
  ],
  [
    "Turkish Street Food Tour Fish Sandwich In Istanbul 2022 4k Ultra HD",
    "Street food is very popular in Istanbul One of the most popular dishes is fish sandwich The fish are all fresh, and this fish sandwich ..."
  ],
  [
    "World&#39;s Biggest Döner Kebab MASTER CUTTING SKILLS Istanbul - Turkish Street Food",
    "World's Biggest Döner Kebab MASTER CUTTING SKILLS Istanbul - Turkish Street Food #donerkebab #streetfood #turkishfood ..."
  ],
  [
    "Spice Up Your Life with This Spicy Turkish Tantuni Wrap | Turkish Street Food",
    "Tantuni is a typical Turkish street food usually eaten after long nights out. Turkish Tantuni is the favorite Turkish dish of many ..."
  ],
  [
    "BTS: Churro Surprise 😍 |  Lokmas | Turkish Street Food #shorts",
    "Turkish Lokma BTS stands for “Behind The Scenes” Feel free to like and subscribe so we can continue to share more food with ..."
  ],
  [
    "Traditional Turkish Pita Bread | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. https://goo.gl/maps/ja6Xg98GBx8P4aky9 #streetfood #bakery #turkishfood ..."
  ],
  [
    "Amazing Turkish Toast Sandwich with Cheese and Sausage | Turkish Street Foods",
    "Welcome To Kebab Baba Channel. Your Taste Guide In Turkey. Hope you like the video You can subscribe to join us. Tostçu Erol ..."
  ],
  [
    "Eating Turkish Street Food in Istanbul. Massive Feast! 😋 Foreigners Try Street Food in Turkey 🇹🇷",
    "This week we're finally trying Turkish street food in Istanbul! We start things off we something we never expected to have in Turkey ..."
  ],
  [
    "Tostçu Mahmut |Turkish street food",
    "food #tostcumahmut #streetfood Tostçu Mahmut Müslüm Baba anısına tost dağıtıyor https://youtu.be/c59RwFPLC1Y Tostçu ..."
  ],
  [
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey",
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey INSANE Street Food in ..."
  ],
  [
    "Istiklal Street |Night Walking Tour In The Beating heart Of Istanbul 17July 2021 |4k UHD 60fps",
    "The liveliest street in Istanbul at night can be said to be Istiklal. Istiklal Street near Taksim Square can be called the beating heart ..."
  ],
  [
    "Trying Out Turkish Street Food 🌯 | Most Delicious Street Foods in Turkey 🇹🇷",
    "Watch out! This video can make you feel hungry! In this video, Resh will try out every delicious Turkish food that the Turkish street ..."
  ],
  [
    "Delicious Turkish Street Foods 2 ...",
    ""
  ],
  [
    "Turkish Street Food You must try in Istanbul",
    "I tried some of Turkish Street Food in Istanbul. Enjoy Turkish food with me :) http://en.universewithme.com ..."
  ],
  [
    "Crazy baker sells 10000 bread a day! Delicious Turkish street food bread recipe!",
    "This bakery makes a wide variety of breads. Even though I can't eat all the bread, Italian bread with olives and Turkish bread taste ..."
  ],
  [
    "Er verkauft 300 Dönerkebabs pro Tag auf der Straße – Erstaunliches türkisches Streetfood",
    "Er macht leckeren und günstigen Döner auf der Straße. Folgen Sie unserem Kanal für das beste Street Food. Adres: Bey, 16042."
  ],
  [
    "Turkish Doner",
    "viralvideo #asmr #food #shorts #viralshorts #tiktok #tiktokvideo #viral #youtubeshorts No copyright infringement intended Video ..."
  ],
  [
    "Best Turkish Street Food Tour Beşiktaş Bazaar Istanbul | JUNE 2022 | 4K UHD 60 FPS",
    "You will quickly notice that in Turkey and especially in Istanbul, there is not a settled time to eat. Restaurants are open at any time ..."
  ],
  [
    "Lunch with 5 Euro in Turkey! What Did i Get? Turkish Street Food Prices 🔥",
    "In this video we're discovering Turkish food prices and experimenting Lunch in Turkey with only 5 Euros! Interested in buying ..."
  ],
  [
    "The Most Delicious Turkish Street Food In Istanbul City 2021|4k UHD 60fps",
    "In this video, We still have a different tour of Istanbul City Today, from the third series of food tour videos, we are going to go to ..."
  ],
  [
    "Turkish Street Food Part 3 #turkey #istanbul #taksim #turkishstreetfood #eminönü",
    "Turkish Street Food Part 3 #turkey #istanbul #taksim #turkishstreetfood #eminönü."
  ],
  [
    "World Famous Street Food! Celebrities are running in this Restaurant! Turkish Street Food",
    "World Famous Street Food! Celebrities are running in this Restaurant! Turkish Street Food #streetfood #kebab #turkishfood."
  ],
  [
    "TURKISH STREET FOOD in ISTANBUL: Pit Roast Lamb Büryan Kebab!! Turkey&#39;s #1 Street Food!",
    "ISTANBUL'S BEST STREET FOOD GUIDE 2020! SUPPORT US : https://www.patreon.com/join/chopsticktravel? BECOME A ..."
  ],
  [
    "Turkish Street food - Street food in Turkish",
    "Turkish Street food - Street food in Turkish #shorts #youtubeshorts."
  ],
  [
    "TURKISH STREET FOOD IN ISTANBUL, TURKEY | BIGGEST ADANA KEBAB WRAP EVER + STREET FOOD IN TURKEY",
    "TURKISH STREET FOOD IN TURKEY | I went on a Turkish street food tour in Istanbul where I tried the biggest Adana kebab wrap ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 22 March 2022 4k Ultra HD",
    "Simit is a circular bread, typically encrusted with sesame seeds or, less commonly, poppy, flax or sunflower seeds, found across ..."
  ],
  [
    "Turkish Street Food You MUST Eat in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "This Master Sells Delicious Whole Chicken for $2 - Turkish Street Food",
    "This master shows how to make whole chicken also sells delicious kebabs for $1. Follow our channel for the best street food."
  ],
  [
    "Delicious Turkish Street Food from Historical Kebab Restaurants",
    "Adana Kazancılar Çarşısı is famous for its kebab restaurants. If we hadn't eaten these delicious kebabs while we were in Adana, ..."
  ],
  [
    "Iconic Vegetarian Turkish Street Food in Istanbul 🇹🇷 Vegan Turkish Food",
    "It is not always easy to find vegetarian Turkish food, but there is one iconic vegetarian Turkish street food you can find all over ..."
  ],
  [
    "Deep-Fried Turkish Desserts | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #desserts #streetfood."
  ],
  [
    "Turkish Street Foodaholic KOKOREÇ on Different LEVEL! | Most Famous Way for Lamb Intestine Sandwich",
    "What is the name of this restaurant? • Kral Kokoreç Sirkeci Where is it located? • Hobyar, Büyük Postane Cd. No 26/1, 34112 ..."
  ],
  [
    "5 MOUTHWATERING Turkish STREET FOODS in Istanbul Turkey | Kadıköy Istanbul Street Food Tour",
    "In this episode, we are eating some phenomenal Turkish street food in Istanbul, Turkey! This is the first episode of our new Turkey ..."
  ],
  [
    "Istanbul Street Food 2015 - Istanbul Street Food Compilation - Turkish Street Food",
    "Abone Olun ▻goo.gl/xDyp3Y Subscribe ▻goo.gl/xDyp3Y Istanbul Street Food 2015 - Istanbul Street Food Compilation - Turkish ..."
  ],
  [
    "𝑻𝑹 Most Amazing Turkish Street Food 2 - #shorts",
    "Turkey welcomes you to a whole new world of the kebab. At any point of the day, more than one if you fancy, the kebab is street ..."
  ],
  [
    "Turkish street food istanbul",
    ""
  ],
  [
    "Turkish sweets | turkey cuisine | Turkish street food | trying turkish street food",
    "Turkish sweets | turkey cuisine | Turkish street food | trying turkish street food \"Turkish street food\" \"trying turkish street food\" ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Istanbul can be known as the city of delicious food In many neighborhoods and areas of this city, you can find delicious Turkish ..."
  ],
  [
    "Best Doner Kebab in Turkey - Turkish Street Food",
    "This master makes delicious doner kebab. Please follow my Youtube channel for more street food. Thanks for watching."
  ],
  [
    "Bursa Street Food 🇹🇷 | Turkish Street Food | Turkish Doner | Street Food | Halal Food in Turkey",
    "TravelWithImranAlviVlogs #TurkishFood #bursa #istanbul Doner is just one of the kebabs in Turkey. Meat and fat are stacked on a ..."
  ],
  [
    "6 Turkish Street Food Tour In Istanbul | 4K UHD | The Most Delicious Foods In Turkey",
    "Although Türkiye's culinary scene offers a vast selection of local and international restaurants, Turkish street food is also very tasty ..."
  ],
  [
    "Crazy bakers making thousands of Turkish Pizzas! Pide, Lavash, Lahmacun Recipe - Turkish Street Food",
    "Lahmacun is a delicious street food that is cooked in the oven after the material prepared with minced meat, parsley, onion and ..."
  ],
  [
    "Delicious Turkish Street Food from Historical Kebab Restaurants",
    "Adana Kazancılar Çarşısı is famous for its kebab restaurants. If we hadn't eaten these delicious kebabs while we were in Adana, ..."
  ],
  [
    "Istanbul Food Tour With A Local | Turkish Street Food Is Epic | Full Time Travel Vlog 19",
    "Istanbul Food Tour With A Local | Turkish Food Is Epic | Explore the world with Localie ⭐ https://clck.ru/HPsNi - 5% Off Localie ..."
  ],
  [
    "🇹🇷 Delicious Turkish Street Food Tour In Istanbul",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Best Turkish Street Food Tour Istanbul Sirkeci Eminonu Restaurants | 4K UHD 60FPS | JULY 2022",
    "Istanbul is a street food lover's paradise. The street food of Istanbul is diverse and delicious, made with fresh ingredients and ..."
  ],
  [
    "TURKISH STREET FOOD - FISH BREAD",
    "Here is the recipe of a Turkish delightful street food: Balık ekmek(fish bread). In the past, there were fish originating from the ..."
  ],
  [
    "The Most Delicious Turkish Street Food In Istanbul City 2021|4k UHD 60fps",
    "In this video, We still have a different tour of Istanbul City Today, from the third series of food tour videos, we are going to go to ..."
  ],
  [
    "Turkish Halwa (turkish street food)#turkey #bursa #cappadocia #halwa #travel #food",
    ""
  ],
  [
    "Special Sandwich - Crazy Cooking Method - Insane Turkish Street Food",
    "He's making a roadside sandwich in a crazy method. Follow our channel for the best street food. Instagram: ..."
  ],
  [
    "Turkish Pilaf &amp; Ayran Recipe | TURKISH STREET FOOD",
    "Pilaf & Ayran is a typical Turkish meal. It's something that our grandmothers make for us. In this video first I took you to my favorite ..."
  ],
  [
    "Turkish Pottery Kebab Stuffed With Cheese And Covered With Lavash Bread | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. (LAVASH CİĞER) Gaziantep, Turkiye Location ..."
  ],
  [
    "best Turkish street food cig kabab rool 😊😊...",
    ""
  ],
  [
    "Street Food | Seekh Kabab | Turkish Kebab",
    "street food seekh kabab Turkish food."
  ],
  [
    "Turkish Street Food Tour In Istanbul /4k HDR [🎧Binaural City Sounds]",
    "Turkish food, especially street food, is really delicious. Most of the world's citizens come to Turkey only for gastronomic tourism."
  ],
  [
    "This is Best Turkish Kebab In The World | Legendary Turkish Street Food!",
    "This Kebab Master Sells 2000 Amazing Kebabs a Day! Tap like and follow our channel for the best street food. Thank you for ..."
  ],
  [
    "Turkish Street Food At Home - Halka Tatlısı / Turkish Churros",
    "Authentic Turkish street food of all time \"Halka Tatlısı\". It is a very old and popular street food dessert in Turkey and Istanbul. Halka ..."
  ],
  [
    "Turkish Street Food Tour Fish Sandwich In Istanbul 2022 4k Ultra HD",
    "Street food is very popular in Istanbul One of the most popular dishes is fish sandwich The fish are all fresh, and this fish sandwich ..."
  ],
  [
    "Doner Kebab Turkish Street Food Tour In Istanbul 29 March 2022 4k Ultra HD",
    "Doner kebab is a type of kebab, made of meat cooked on a vertical rotisserie. Seasoned meat stacked in the shape of an inverted ..."
  ],
  [
    "Turkish Food Tour in Istanbul 2021 | Street Food 2021 | Turkish Street Food in Istanbul",
    "Turkish Food Tour in Istanbul 2021 Street Food 2021 Turkish Street Food in Istanbul street food travel #shorts​​ ..."
  ],
  [
    "Eating UNIQUE Turkish Street Food in Bodrum | Brit tries Kokoreç | Turkish Food",
    "We couldn't avoid eating this unique Turkish street food after promising to give it a go. Did we like it and would you be brave ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | Food Tour 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "INSANE !!! Turkish Street Food Tour in Istanbul",
    "Hey guys in this video me and My friends from Pakistan have tried some of the most famous Turkish street food in Istanbul. Hope it ..."
  ],
  [
    "Turkish Gozleme Spinach &amp; Feta / Turkish Street Food At Home",
    "Gözleme is a savory, Turkish stuffed flatbread. It's a popular quick meal throughout Anatolia and street food, widely available in ..."
  ],
  [
    "Turkish Street Food In Istanbul | Kokorec,  PICKLE JUICE &amp; So Much More! Best Cuisine In The World?!",
    "On our trips around Turkey we visited the amazing city of Istanbul, as well as viewing all the famous sites we HAD to try the ..."
  ],
  [
    "Delicious and tempting Turkish street food 🤤 || Middle Eastern Foods #shorts #satisfying",
    "Amazing delicious Turkish cuisine."
  ],
  [
    "Turkish street food Kokorec banned in Europe! #streetfood",
    "The indispensable street flavor of the Turks, kokoreç… You should definitely try this street flavor made from lamb intestines."
  ],
  [
    "The BEST Turkish street food in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "How to prepare kebabs. Turkish street food #shorts",
    "How to prepare kebabs. Turkish street food What started off as a doner kebab hunt ended up with us trying some completely ..."
  ],
  [
    "They Have Been Making Doner Kebab For 30 Years - Amazing Turkish Street Food",
    "They have been making delicious doner kebab for 30 years. They sell doner kebab all day long. Follow our channel for the best ..."
  ],
  [
    "Turkey&#39;s Popular Street Snack: Simit | Sesame Rolls | Turkish Street Food |Turkish Food",
    "Meet Turkey's one of the most popular street foods: Simit. Simit is usually consumed on breakfast with a glass of Turkish tea and ..."
  ],
  [
    "Best Turkish Street Food In Istanbul | Turkish Street Food Tour In Istiklal Street | March 2022 | 4k",
    "Turkey and Istanbul have lots of Turkish delicious street foods.there is lots of amazing foods to try more than everywhere around ..."
  ],
  [
    "Awesome Turkish Street Food. #shorts #shots #short #shortvideo #share #turkishfood  #turkishfood",
    ""
  ],
  [
    "Turkish Street Food: FRUIT JUICE",
    "It is possible to come across buffets selling fruit juice from time to time while wandering the streets in İzmir. Here's one of them."
  ],
  [
    "Waffle Turkish Street Food Tour In Istanbul 2022  4k Ultra HD",
    "Video Equipment Camera : Dji Osmo Pocket 2 - GoPro Max Gimbal : Dji Osmo Pocket Extension Rod - Gopro Max Grip + Tripod ..."
  ],
  [
    "Process of Making Turkish Delight | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. https://www.turkobaba.com.tr/tr-TR/ana-sayfa Location: ..."
  ],
  [
    "Amazing Taste - KOKOREÇ and Mussel /Cooking Lamb Intestines / Turkish Street Foods / İstanbul/Turkey",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "EXTREME STREET FOOD IN TURKEY!! KEBAB KING OF TURKEY + TURKISH STREET FOOD TOUR IN ANKARA, TURKEY",
    "EXTREME STREET FOOD IN TURKEY - Today I'm going to take you on a street food adventure in Ankara to see the kebab king of ..."
  ],
  [
    "Turkish Street Food - Lamb Heart",
    "In the center of Ankara, Ulus Region, the salesman Mustafa bey has been selling lamb heart more than 30 years. He may be ..."
  ],
  [
    "Turkish festival  in Germany/Turkish street foods /urdu vlog by seherm vlogs #turkish #food",
    "Turkishfestival cermis is celebrated once in a year.it is family festival and families participate very enthusiastically In this fest.the ..."
  ],
  [
    "UNBELIEVABLE TURKISH STREET FOOD in ANTAKYA 🇹🇷  HATAY TURKEY",
    "Ask any Turk where in Turkey has the BEST street food and their answer always includes Antakya in Turkey's Hatay region."
  ],
  [
    "chicken doner / TURKİSH STREET FOOD",
    "Hello, as you know, Turkish, Japanese, Chinese, Indian, Korean streets have very rich and delicious food. In addition to street ..."
  ],
  [
    "Best of Turkish Dessert | Baklava | Sweets - TURKISH STREET FOOD 2021",
    "Check out this delicious Turkish dessert compilation. if you love baklava and sweets you will like it. Please Subscribe! ❤️ Turkish ..."
  ],
  [
    "Street Food 2018 - Turkish Street Food in Istanbul - Turkish Ice Cream Man Dondurma",
    "Street Food 2018 - Turkish Street Food in Istanbul - Turkish Ice Cream Man Dondurma Subscribe ..."
  ],
  [
    "$2 Popular Turkish Street Food - TANTUNI",
    "Please subscribe: https://bit.ly/FOUsubscribe There is always food to discover in Turkey. This time FOU's camera focuses on the ..."
  ],
  [
    "STREET FOOD, BAKLAVA TURKISH DESSERT MADE IN FRONT OF YOU, TURKISH STREET FOOD, SIRKECI ISTANBUL, 4k",
    "STREET FOOD, BAKLAVA TURKISH DESSERT MADE IN FRONT OF YOU, TURKISH STREET FOOD, SIRKECI ISTANBUL, ..."
  ],
  [
    "A Wonderful Turkish Street Food Restaurant in Tbilisi, Georgia",
    "A Fabulous Turkish Street Food Restaurant in Tbilisi, Georgia. Be sure to visit this restaurant where you can find all kinds of ..."
  ],
  [
    "Turkish wrapped kunafeh (Burmalı Kadayıf) How its made. | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #Baklava #Kadayif #dessert."
  ],
  [
    "4K HDR|Turkish Street Food Tour 2022 In Istanbul 9 January",
    "Doner kebab is one of the most delicious and popular dishes in Turkey This food is very popular even in other countries Many ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 19 March 2022 4k Ultra HD",
    "Turkish food is always very popular among tourists, but it can be said that the delicious sweets of Turkey are also very popular ..."
  ],
  [
    "ÇİĞ KÖFTE: VEGAN RAW TURKISH BULGHUR MEATBALLS 🤩🌱 Favorite Turkish Street Food ❤️",
    "Çiğ Köfte is the bestselling street food and an integral part of our culinary culture. It can be made in two ways, with meat or without ..."
  ],
  [
    "Turkish Street Food in Amsterdam 🍔🇹🇷",
    "Turkish Street Food."
  ],
  [
    "Istiklal Street |Night Walking Tour In The Beating heart Of Istanbul 17July 2021 |4k UHD 60fps",
    "The liveliest street in Istanbul at night can be said to be Istiklal. Istiklal Street near Taksim Square can be called the beating heart ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul Kadikoy 2022 July  4k Ultra HD",
    "Turkish Street Food Tour In Istanbul Kadikoy 2022 July 4k Ultra HD ***************************** Video Equipment Camera : Dji ..."
  ],
  [
    "Most Poupular Taksim Restaurants and Top-Rated Turkish Street Food",
    "We tried delicious Turkish street food in Istanbul Taksim's most popular restaurants. Thanks for watching our video. Don't forget to ..."
  ],
  [
    "INSANELY DELICIOUS Turkish Street Food in Antalya, Turkey | Making Serpme Börek + Patlican Ocakbaşı",
    "Insanely delicious Turkish street food in Antalya, Turkey. The street food in Turkey is always so insanely delicious, and in Antalya ..."
  ],
  [
    "Best Doner Kebab in Turkey - Turkish Street Food",
    "This master makes delicious doner kebab. Please follow my Youtube channel for more street food. Thanks for watching."
  ],
  [
    "Kadıköy, WALK AROUND BUSY STREETS OF ISTANBUL, TURKISH STREET FOOD",
    "Kadıköy, WALK AROUND BUSY STREETS OF ISTANBUL, TURKISH STREET FOOD, Kadıköy, is a large, populous, and ..."
  ],
  [
    "This is Best Turkish Kebab In The World | Legendary Turkish Street Food!",
    "This Kebab Master Sells 2000 Amazing Kebabs a Day! Tap like and follow our channel for the best street food. Thank you for ..."
  ],
  [
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey",
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey Street Food in Turkey ..."
  ],
  [
    "Delicious Turkish Street Food Tour Istanbul TURKEY | April 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "𝑻𝑹 Most Amazing Turkish Street Food 6 - #shorts",
    ""
  ],
  [
    "A Wonderful Turkish Street Food Restaurant in Tbilisi, Georgia",
    "A Fabulous Turkish Street Food Restaurant in Tbilisi, Georgia. Be sure to visit this restaurant where you can find all kinds of ..."
  ],
  [
    "Special Sandwich - Crazy Cooking Method - Insane Turkish Street Food",
    "He's making a roadside sandwich in a crazy method. Follow our channel for the best street food. Instagram: ..."
  ],
  [
    "Two Unique Restaurants and Turkish Street Food in Turkey&#39;s Capital",
    "We visited two unique restaurants in Ankara where you can taste delicious Turkish street food. Doner kebabs, adana kebabs and ..."
  ],
  [
    "Delicious Turkish Street Food from Historical Kebab Restaurants",
    "Adana Kazancılar Çarşısı is famous for its kebab restaurants. If we hadn't eaten these delicious kebabs while we were in Adana, ..."
  ],
  [
    "Turkish street food istanbul",
    ""
  ],
  [
    "Amazing Turkish Food!",
    "Amazing Turkish Food! Check Out: www.streetfooddreamfood.com."
  ],
  [
    "Turkish Gozleme Spinach &amp; Feta / Turkish Street Food At Home",
    "Gözleme is a savory, Turkish stuffed flatbread. It's a popular quick meal throughout Anatolia and street food, widely available in ..."
  ],
  [
    "Turkish Street Food | Friendliest Doner Kebab +  The best BAKERY in Izmir + Antalya Borek 🇹🇷",
    "Another amazing day walking around and eating all kinds of Turkish Street food. This was going to be the last, but I decided to go ..."
  ],
  [
    "AMAZING STREET FOOD IN ISTANBUL, TURKEY! TAKSIM STREET FOOD TOUR + STREET FOOD IN ISTANBUL, TURKEY",
    "AMAZING STREET FOOD IN TURKEY- Today we are going for an amazing Turkish street food tour of Istanbul, Turkey. We are ..."
  ],
  [
    "TURKISH STREET FOOD TOUR - Best KOFTE EKMEK + TURKISH PIDE + BAKLAVA w/ DONDURMA in Fethiye, Turkey!",
    "Fethiye, Turkey - This is a common touristy city where people often come to visit the beautiful seas of Turkey. However, Fethiye is ..."
  ],
  [
    "Best Turkish Street Food Vlog In Beşiktaş Istanbul Turkiye",
    "adil khan turkey adil khan istanbul adil khan adil khan food vlog adil khan nashta vlog adil khan turkey food vlog Turkish food vlog ..."
  ],
  [
    "😋MOUTHWATERING TASTE! | Turkish Street Food #shorts #food",
    "One of the Most Popular Street Foods in Istanbul, Traditional Turkish Dish; Fish and bread. One of Istanbul's favorite lunchtime ..."
  ],
  [
    "Turkish Street Food In Istanbul | Kokorec,  PICKLE JUICE &amp; So Much More! Best Cuisine In The World?!",
    "On our trips around Turkey we visited the amazing city of Istanbul, as well as viewing all the famous sites we HAD to try the ..."
  ],
  [
    "Turkish Street Food Tour In Besiktas Istanbul 2022 4k",
    "Turkish food is very tasty and you can find restaurants selling popular Turkish food on the streets of every district and ..."
  ],
  [
    "GoPro Awards: Turkish Ice Cream Tricks",
    "Testing patience in Turkey with #TripOn GoPro Award recipient, Vedat Dumanli."
  ],
  [
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey",
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey INSANE Street Food in ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022  4k Ultra HD",
    "Turkish sweets are very famous in the world It can be said that it is one of the most famous Turkish baklava sweets that is cracked ..."
  ],
  [
    "An Overview of Turkish Street Food Tour",
    "In this video, we are going to review some of the food videos that we have published on the Tasty Food Tour channel In this video, ..."
  ],
  [
    "Turkish Street Food in Istanbul, Turkey | Künefe Turkish Dessert | Istanbul Street Food",
    "Turkish Street Food in Istanbul, Turkey. Today we set out to try künefe, a really popular Turkish dessert that just so happens to be ..."
  ],
  [
    "Spice Up Your Life with This Spicy Turkish Tantuni Wrap | Turkish Street Food",
    "Tantuni is a typical Turkish street food usually eaten after long nights out. Turkish Tantuni is the favorite Turkish dish of many ..."
  ],
  [
    "GÖZLEME: Favorite TURKISH Street Food - Traditional Ottoman Restaurant in Istanbul",
    "Do not miss the delicious pancakes of the Traditional Ottoman Restaurant in Istanbul. Crispy Turkish street delicacies You can ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul | April 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "Amazing Turkish Midye Baklava How its Made? | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. #baklava #midye #turkishfood."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul  2022",
    ""
  ],
  [
    "Turkish Street Food Tour In Istanbul 19 March 2022 4k Ultra HD",
    "Turkish food is always very popular among tourists, but it can be said that the delicious sweets of Turkey are also very popular ..."
  ],
  [
    "Most Famous Turkish Kebab Varieties | Eggplant Kebab, Adana Kebab... | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. 00:00 Alinazik kebab - (Imam Cagdas) Gaziantep Turkey 11:27 Eggplant ..."
  ],
  [
    "Tarbouche Bangalore || Turkish Street Food in #Bangalore || Istanbul street food || Bangalore food",
    "For #yummy #Turkish #food in #bangalore visit : Visit Tarbouche 76, Jyoti Nivas College Rd, Koramangala Industrial Layout, ..."
  ],
  [
    "DURUM.....Turkish Street Food/ ummmm so delicious/ street food tour Turkey",
    "DURUM is used as street food and main food in Turkey. it is the most popular street food in turkey and i can say that DURUM is ..."
  ],
  [
    "Bursa Street Food 🇹🇷 | Turkish Street Food | Turkish Doner | Street Food | Halal Food in Turkey",
    "TravelWithImranAlviVlogs #TurkishFood #bursa #istanbul Doner is just one of the kebabs in Turkey. Meat and fat are stacked on a ..."
  ],
  [
    "Trying TURKISH STREET FOOD in ISTANBUL! İstanbul yemek turu",
    "Join me in İstanbul for an incredible Turkish street food tour! Today we are visiting both the European and Asian sides of Istanbul, ..."
  ],
  [
    "Do you know Turkish Borek ? Turkish Street Food",
    "Do you know Turkish Borek? Turkish Street Food Hello This is the \"Taste and Culture Stories\" channel. it is a channel with the ..."
  ],
  [
    "INCREDIBLY Delicious Turkish STREET FOOD | Türkiye Food Tour 2022",
    "I went on a solo trip to the Southeast of Türkiye, where I visited Adana, Gaziantep, Sanliurfa, and Diyarbakir. While all of these ..."
  ],
  [
    "Street Food 2018 - Turkish Street Food in Istanbul - Turkish Ice Cream Man Dondurma",
    "Street Food 2018 - Turkish Street Food in Istanbul - Turkish Ice Cream Man Dondurma Subscribe ..."
  ],
  [
    "STREET FOOD, TANTUNI, TURKISH STREET FOOD IN ISTANBUL",
    "STREET FOOD, TANTUNI, TURKISH STREET FOOD IN ISTANBUL, Tantuni is a spicy dish consisting of julienne cut beef or ..."
  ],
  [
    "🇹🇷 Kumpir - Turkish baked potato. Must try street food in Istanbul, Turkey !",
    "Kumpir is one of my favorite meals in Istanbul. Soft fluffy potato with a range of different toppings. Mostly vegetarian. Its available ..."
  ],
  [
    "SPECIAL SANDWICH || BEST SANDWICH || TURKISH STREET FOOD",
    "Best sandwich in Turkey - Izmir, Must try. Deliciously Awesome Hello This is the \"Taste and Culture Stories\" channel. it is a ..."
  ],
  [
    "Turkish street food #youtubeshorts #viral #turkishstreetfood",
    "Delicious Turkish street food #viral #travel #turkey #istanbul."
  ],
  [
    "😍😍😱😱SETKADA KABAB HAZIRDI UJE | KARIŞIK KEBAP | TURKISH STREET FOOD",
    ""
  ],
  [
    "😍😍😱😱SETKADA KABAB HAZIRDI UJE | KARIŞIK KEBAP | TURKISH STREET FOOD",
    ""
  ],
  [
    "Turkish street food #youtubeshorts #viral #turkishstreetfood",
    "Delicious Turkish street food #viral #travel #turkey #istanbul."
  ],
  [
    "SPECIAL SANDWICH || BEST SANDWICH || TURKISH STREET FOOD",
    "Best sandwich in Turkey - Izmir, Must try. Deliciously Awesome Hello This is the \"Taste and Culture Stories\" channel. it is a ..."
  ],
  [
    "Istanbul&#39;s BEST Street Food Guide - TURKISH KEBAB NINJA + Authentic Turkish Street Food in Istanbul",
    "TURKISH STREET FOOD GUIDE to Istanbul 2019 Become a member for exclusive bloopers & private livestream: ..."
  ],
  [
    "Delicious and tempting Turkish street food 🤤 || Middle Eastern Foods #shorts #satisfying",
    "Amazing delicious Turkish cuisine."
  ],
  [
    "Delicious Kebab - Turkish Street Food #shorts",
    "Delicious Kebab - Turkish Street Food."
  ],
  [
    "Kebab King - Turkish Street Food #shorts",
    "Kebab King - Turkish Street Food."
  ],
  [
    "Best of Turkish Dessert | Baklava | Sweets - TURKISH STREET FOOD 2021",
    "Check out this delicious Turkish dessert compilation. if you love baklava and sweets you will like it. Please Subscribe! ❤️ Turkish ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Street food is very popular in Turkey and it can be said that it is one of the most popular foods In every neighborhood you can see ..."
  ],
  [
    "Turkish Pottery Kebab Stuffed With Cheese And Covered With Lavash Bread | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. (LAVASH CİĞER) Gaziantep, Turkiye Location ..."
  ],
  [
    "4K HDR|Turkish Street Food Tour 2022 In Istanbul 9 January",
    "Doner kebab is one of the most delicious and popular dishes in Turkey This food is very popular even in other countries Many ..."
  ],
  [
    "Delicious Kebab - Amazing Turkish Street Food",
    "Delicious Kebab - Amazing Turkish Street Food."
  ],
  [
    "Turkish Coffee Or Magic? #shorts",
    "Is this Turkish Coffee, or Magic? Coffee is an international obsession, and there are dozens and dozens of styles of coffee that we ..."
  ],
  [
    "Eating Turkish Street Food  in Istanbul 😍",
    "Turkish Street Food in Istanbul subscribe my channel #streetfood #food #istanbul #vlog."
  ],
  [
    "delicious turkish street food tour in istanbul",
    "turkish street food tour in istanbul is really enjiyable and delicious! turkish food is very diverse and differnt cities in turkey have ..."
  ],
  [
    "INSANE Turkish Street Food  SIRDAN and KELLE",
    "Sırdan is part of sheep stocmach shape is not pleasant but the taste is epic. Kelle is part of head meet which also delicious."
  ],
  [
    "Turkish Street Food - Sandwiches, Burgers, Shawarma, Beef Intestine",
    "Istanbul is a touristic city where you can find many delicious and authentic food at affordable local prices. In fact most of the ..."
  ],
  [
    "Most Popular Turkish Street Food: CHESTNUT",
    "This time, we went to the most popular street of İstanbul to eat these delicious roasted chestnuts. In Istiklal Street, chestnuts have ..."
  ],
  [
    "Turkey Is Street Food Heaven",
    "Turkey has a lot of street food to offer. The INSIDER team believes that life is an adventure! Subscribe to our channel and visit us ..."
  ],
  [
    "Turkish Street food",
    "At Turkish Street Food, we only use the finest fresh ingredients and all our food is prepared daily to ensure you receive the highest ..."
  ],
  [
    "VEGETARIAN &amp; VEGAN TURKISH STREET FOOD TOUR OF BERLIN!",
    "Where to find some of the best Turkish street foods with veg options in Berlin. Subscribe! ▻ http://bit.ly/2CtNsMb Akin Simit ..."
  ],
  [
    "TURKISH STREET FOOD TOUR - DELICIOUS TANTUNI + CHARCOAL GRILLED KUNEFE in Istanbul, Turkey!",
    "Istanbul, Turkey - This is one of the most food-rich cities in the entire world. In this video, we explore the streets of Istanbul at night ..."
  ],
  [
    "Awesome Turkish Street Food. #shorts #shots #short #shortvideo #share #turkishfood  #turkishfood",
    ""
  ],
  [
    "INCREDIBLY Delicious Turkish STREET FOOD | Türkiye Food Tour 2022",
    "I went on a solo trip to the Southeast of Türkiye, where I visited Adana, Gaziantep, Sanliurfa, and Diyarbakir. While all of these ..."
  ],
  [
    "Turkish Sand Coffee - Istanbul Street Food",
    "Turkish Sand Coffee - Istanbul Street Food Location: Taksim, Istanbul Turkey Price: 5 TRY / 0.87 USD #turkishcoffee #coffee ..."
  ],
  [
    "Amazing Turkish Food | Turkish Street Food | Turkish Food The Best!",
    "Amazing Turkish Food | Turkish Street Food | Turkish Food The Best! Please Subscribe my Channel: ..."
  ],
  [
    "TURKISH STREET FOOD FRENCH FRIES SANDWICH - FAMOUS CHEAP FOOD - GolRoti",
    "TURKISH STREET FOOD FRENCH FRIES SANDWICH - FAMOUS CHEAP FOOD - GolRoti Send me your recipe videos at: ..."
  ],
  [
    "SHISH KEBAP / TURKİSH Street Food",
    "Hello, as you know, Turkish cuisine has very rich and delicious dishes such as meat and chicken. In addition to street food, I am ..."
  ],
  [
    "Best Konya Kitchen Foods | Turkish Street Foods in Istanbul",
    "You will see the most special dishes of Konya cuisine. Delicious meat pitas cooked in the stone oven and Konya oven kebab ..."
  ],
  [
    "The Most Famous Kumpir Restaurants of Istiklal Street - Turkish Street Food Baked Potato",
    "The most famous street food of Taksim Istiklal Street: Kumpir (Baked Potato) Don't miss the potatoes decorated with delicious ..."
  ],
  [
    "Roasted Chestnut Street Food | Turkish style chestnuts",
    "Roasted Chestnuts Street Food Turkish style Chestnuts , Turkish street food, Bursa sokak lezzetleri, what eat in Bursa, Bursa'sa ..."
  ],
  [
    "Doner Kebab Turkish Street Food #shorts #desi #streetfood",
    "Doner Kebab street food #shorts #desi #streetfood Doner Kebab, Kebab, Kebab street food, Turkish Kebab Turkish Street Food, ..."
  ],
  [
    "chicken doner / TURKİSH STREET FOOD",
    "Hello, as you know, Turkish, Japanese, Chinese, Indian, Korean streets have very rich and delicious food. In addition to street ..."
  ],
  [
    "Lahmacun! Turkish Street Food!",
    "Lahmacun! Turkish Street Food! Lahmacun! Turkish Street Food! Don't forget to like the videos and subscribe to the channel!"
  ],
  [
    "KUMPIR 🥔🙈 EXTREME TURKISH STREET FOOD 💯 ISTANBUL 🇹🇷 #4 VLOG",
    "SUBSCRIBE Istanbul, Vlog, av react show, silver button, turkey, travel, Music. Trend, YouTube. Turkey Trend, Turkish music ..."
  ],
  [
    "𝑻𝑹 Most Amazing Turkish Street Food 2 - #shorts",
    "Turkey welcomes you to a whole new world of the kebab. At any point of the day, more than one if you fancy, the kebab is street ..."
  ],
  [
    "Milk Pudding Turkish Desserts / Kazandibi nasıl yapılır? - Turkish Street Food",
    "Street food in depth and not boring! Turkish Desserts , Kazandibi, Milk Pudding, Turkish Dessert , mass production, food factory, ..."
  ],
  [
    "Sizzling Turkish Street Food🔥🌯🇹🇷",
    ""
  ],
  [
    "TURKISH STREET FOOD TOUR - FIRST TURKISH GOZLEME + DELICIOUS LOKANTASI FOOD in Istanbul, Turkey!",
    "Istanbul, Turkey - Istanbul is one of the food capitals in the world. In my previous videos, I've shown all the delicious foods that ..."
  ],
  [
    "Turkish Street Food Handmade Pizza | PANEER PIZZA | PIZZA RECIPE",
    "Turkish Street Food Handmade Pizza PIZZA MAKING IN HOMEMADE OVEN | VEG PIZZA | PANEER PIZZA | PIZZA RECIPE ..."
  ],
  [
    "Amazing Turkish Food!",
    "Amazing Turkish Food! Check Out: www.streetfooddreamfood.com."
  ],
  [
    "Turkish Halwa (turkish street food)#turkey #bursa #cappadocia #halwa #travel #food",
    ""
  ],
  [
    "Turkish Street Food | Seekh Kabab | Turkish Kebab",
    "turkish kebab turkish street food turkish kebap adana kebab seekh kabab beef kabab best kabab #shorts #youtubeshorts."
  ],
  [
    "This popular Turkish street food looks like a bagel",
    "You can get them at Simit & Smith in NYC."
  ],
  [
    "INSANELY delicious TURKISH STREET FOOD in Istanbul | Turkey | Pakistani Reaction | Turkish ENG SUB",
    "Please Like Share And Subscribe. Give us your feedback about our reaction video in the comment section Thank You!"
  ],
  [
    "Turkish Street Food At Night | Best Lamb Kokoreç",
    "Kokoreç comes to mind when it comes to dinner in Turkey. Kokorec is the most famous street food of Turks. There is a kokoreç ..."
  ],
  [
    "TURKISH STREET FOOD -Traditional Ottoman Candy - Stick Candy",
    "Traditional Ottoman Candy - Turkish Street Food Location: Istanbul, Karakoy Price: One Stick = 5 Turkish Liras Subscribe for more ..."
  ],
  [
    "Turkish Street Bazaar - Many Kinds of Different Food Stilen Market /Turkish Street Foods / İstanbul",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "Extreme Turkish Doner / Chicken Doner and Meat Doner / Taksim Meydan/ Turkish Street Food /İstanbul",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "Turkish Street Food Tour Fatih District Street Istanbul Turkey",
    "Turkish Street Food Tour Istanbul Turkey."
  ],
  [
    "Turkish Street food #shorts #foodie #turkey #türkiye #food #kebab #keşfet",
    ""
  ],
  [
    "ITALIAN TRIED ŞIRDAN!!😱😳 INSANE TURKİSH STREET FOOD | #8 🇹🇷İSTANBUL VLOG",
    "SUBSCRIBE Food, Street Food, Atatürk, Istanbul, Vlog, av react show, silver button, turkey, travel, Music. Trend, YouTube."
  ],
  [
    "best Turkish street food cig kabab rool 😊😊...",
    ""
  ],
  [
    "Turkish Street Bazaar - Many Kinds of Different Food Stilen Market /Turkish Street Foods / İstanbul",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "turkish street food tour in alanya 2021 ! alanya antalya turkey holiday 2021 ! turkey travel",
    "We have displayed for you places such as cafes and restaurants that opened their doors with the end of the pandemic bans in ..."
  ],
  [
    "Cold Baklava - Turkish Street Food",
    ""
  ],
  [
    "Turkey Is Street Food Heaven",
    "Turkey has a lot of street food to offer. The INSIDER team believes that life is an adventure! Subscribe to our channel and visit us ..."
  ],
  [
    "Turkish Street Food Tour in Kadikoy | Best Street Foods",
    "We walked among fishermen, pickle sellers and greengrocers in Kadıköy's famous bazaar. We tasted delicious Turkish street food ..."
  ],
  [
    "Turkish kebab | Turkish Street food | Marmaris Turkey | RACE Chicken Turkish kebab",
    "Привет! YoutubeManagerPro i mean ChristinCa tasting Turkish Street food - Marmaris! RACE Chicken Turkish kebab -Turkish ..."
  ],
  [
    "The BEST Turkish street food in Istanbul, Turkey 🇹🇷 #shorts",
    ""
  ],
  [
    "Turkish Street Food | Renshaw Street Food Market Liverpool",
    "Turkish Street Food | Renshaw Street Food Market Liverpool #turkish #turkishstreetfood #food #goodfoodreview #liverpool ..."
  ],
  [
    "Best Turkish Street Food in Istanbul | Gaziantep Food Festival 2019",
    "In this video i visited a street food and cultural event of a city called Gaziantep. The event was held on the Asian side in Maltepe ..."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "One of the areas where you can see the most street food in Istanbul is Fatih district There are many restaurants in this area and ..."
  ],
  [
    "Milk Pudding Turkish Desserts / Kazandibi nasıl yapılır? - Turkish Street Food",
    "Street food in depth and not boring! Turkish Desserts , Kazandibi, Milk Pudding, Turkish Dessert , mass production, food factory, ..."
  ],
  [
    "Turkish street food #youtubeshorts #viral #turkishfood",
    "Delicious Turkish street food #viral #travel #turkey #istanbul."
  ],
  [
    "Turkish Food | Street Food | Turkey&#39;s Food Recipe #turkishfood #turkeystreetfood #streetfood #shorts",
    "Turkish Food | Street Food | Turkey's Food Recipe # turkishfood #streetfood #shorts turkey,Turkish food,street food,street style ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour In Istanbul | 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "400 Kebab Sales a Day! - Amazing Turkish Street Food",
    "This is the kebab kingdom and the masters cook delicious kebabs. Please follow my Youtube channel for more street food."
  ],
  [
    "Super Delicious Street food Of turkey | Turkish food | Street food of Turkey | love turkish cuisines",
    "turkishstreetfood #streetfoodinturkey #turkeystreetfood #streetfood #turkeyfood #istanbulstreetfood #streetfoodturkey #turkishfood."
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Turkish cuisine is very diverse and you can order any kind of food you like in some restaurants in the city There are self-service ..."
  ],
  [
    "testy Turkish Street food 😇😋",
    "The Best #streetfood #istanbul #turkishfood #asianfood #taksim #tasty #istanbulturkey."
  ],
  [
    "Kokoreçci Erdinç Usta Turkish street food in istanbul City #food #foodie #foodblogger #streetfood",
    ""
  ],
  [
    "Amazing baker makes thousands of crispy and delicious bagels! Turkish Street Food bagel recipe",
    "The famous bakery makes thousands of crispy and delicious bagels every day. Delicious bagel recipe. A street delicacy dating ..."
  ],
  [
    "Amazing Turkish dessert recipe! Delicious Turkish street food Tulumba #dessert",
    "Tulumba dessert is a Turkish dessert in which fried dough is served in a sugary syrup. It has an important place in Turkish street ..."
  ],
  [
    "Turkish Street food in Istanbul Turkey 🇹🇷",
    ""
  ],
  [
    "Istiklal Local Street Food | Eating Local Turkish Street Food In Taksim Square, Istanbul",
    "FOODIES!!! Today we go on a unique turkish street food adventure. When you're in Istanbul, without a doubt you will go to Istiklal ..."
  ],
  [
    "Making Cotton Candy / Handmade Turkish Cotton Candy Making - Turkish Street Food",
    "Street food in depth and not boring! Handmade Candy Making, Handmade candy pulling Istanbul street food, Istanbul Candy, ..."
  ],
  [
    "Amazing TURKISH Street Food at MiKSA Restaurant - This is a must try!!! Thanks @Foodie Trekker",
    "This has been be one the best Restaurants I have thusfar tried in Melbourne!! Ismail Tosun(Head Chef) is an acclaimed Turkish ..."
  ],
  [
    "Best Turkish Street Food in Istanbul.",
    ""
  ],
  [
    "Turkish street food, what have you seen?#travel #turkey #turkishfood #streetfood",
    ""
  ],
  [
    "200 Kilos Kebab Sales a Day! - God Level Turkish Street Food",
    "In this video, I will introduce you to one of the most delicious Turkish dishes, kebab, don't forget to subscribe to my channel for ..."
  ],
  [
    "Amazing Turkish Food!",
    "Amazing Turkish Food! Check Out: www.streetfooddreamfood.com."
  ],
  [
    "🇹🇷 Turkish Street Food Tour Istanbul Turkey | 2022",
    "Turkish Street Food Tour Istanbul Turkey."
  ],
  [
    "$2 Turkish Street Food in Istanbul - Chicken",
    "Any street in istanbul Please subscribe if the video helped you Mail Contact: gayrettet@gmail.com."
  ],
  [
    "MOST FAMOUS TURKISH KEBAB TYPES | Turkish Street Foods",
    "Hope you like the video You can subscribe to support us. (Paçacı Şahin Usta Gaziantep-Turkey) ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul  2022 #streetfood #food #istanbul #travel #4kvideo",
    ""
  ],
  [
    "Turkish Street Food You MUST Eat in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "Delicious street food Turkish Kebab - Turkish Street Food",
    "TURKISH STREET FOOD : KEBAB, street food kebab, street food Turkey, Delicious street food Turkish Kebab - Turkish Street ..."
  ],
  [
    "Burak Özdemir Turkish Chef Cooking Amazing Traditional Turkish Food  2019",
    "cznburak,#TurkishFood,#BurakÖzdemir, Burak Özdemir Turkish Chef Cooking Amazing Traditional Turkish Food 2019 Salt Bae ..."
  ],
  [
    "Turkish Street Food",
    "Turkish Street Food."
  ],
  [
    "INSANELY delicious TURKISH STREET FOOD in Istanbul | Turkey | Pakistani Reaction | Turkish ENG SUB",
    "Please Like Share And Subscribe. Give us your feedback about our reaction video in the comment section Thank You!"
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Kokoretsi or kokoreç is a dish of the Balkans and Asia Minor, consisting of lamb or goat intestines wrapped around seasoned offal, ..."
  ],
  [
    "Turkish Street Food#Shorts#streetfood#youtubeShorts",
    "turkishfood#streetfood#Shorts."
  ],
  [
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey",
    "INSANE Street Food in ISTANBUL, Turkey - WHOLE LAMB BBQ + Turkish street food in Istanbul, Turkey INSANE Street Food in ..."
  ],
  [
    "This popular Turkish street food looks like a bagel",
    "You can get them at Simit & Smith in NYC."
  ],
  [
    "The Best Turkish Street Food Festival is the only place to taste delicious food!",
    "Which country do you think has the best street food in the world? Maybe Turkey street food can take the first place in this list with ..."
  ],
  [
    "Turkish street food 2022 - Shawarma                      #shorts #turkish",
    "Turkish street food 2022 - Shawarma #shorts #turkishfood #turkish #shortsclip #shortscraft #youtube #youtuber #subscribe ..."
  ],
  [
    "How to Make Homemade Sesame Bagels I Turkish Street Foods Simit",
    "Making homemade famous sesame bagels simit, Turkish street foods. To watch more similar videos, please subscribe to Rural ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul  2022 |1080P  Super Street Food",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Turkish Food is very diverse and different cities in Turkey ..."
  ],
  [
    "The Ultimate Turkish Street Food Tour Istanbul 🇹🇷",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "MOST FAMOUS TURKISH KEBAB TYPES | Turkish Street Foods",
    "Hope you like the video You can subscribe to support us. (Paçacı Şahin Usta Gaziantep-Turkey) ..."
  ],
  [
    "Turkish Street Food#Shorts#streetfood#youtubeShorts",
    "turkishfood#streetfood#Shorts."
  ],
  [
    "Turkish Doner King! - 5000 Doner Sales Per Day! - Best Turkish Street Food",
    "All guests of Turkey dream of tasting the legendary Turkish shawarma here. This place has a real king of doner kebabs. Tap like ..."
  ],
  [
    "Crazy baker sells 10000 lavash a day! Turkish street food bread recipe! Pita, Lavash and Doner Bread",
    "Chinese street food, Korean street food, Italian street food, Iranian street food, Dakar street food, Thai street food, Mexican street ..."
  ],
  [
    "Delicious Turkish Street Food Tour | Travel Turkey 2021 | Antalya Turkish Street Food Tour | Turkey",
    "About the Video: Turkish Street Food is hands-down delicious! It is also one of the most popular street foods in the world - no ..."
  ],
  [
    "Mısır Çarşısı &#39;&#39;Spice Bazaar&#39;&#39; Grand Bazaar - Turkish Street Food",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "Turkish street food in istanbul city",
    ""
  ],
  [
    "Best Turkish Street Food in Istanbul.",
    ""
  ],
  [
    "5 Unique Turkish Street Food 🇹🇷 | Cafe Inside Graveyard 😱| Juicy Kabab Rolls 🤩| Istanbul Street Food",
    "Hello Friends, if you are someone who enjoys knowing about different cultures and food then you must watch this vlog. I will show ..."
  ],
  [
    "Milk Pudding Turkish Desserts / Kazandibi nasıl yapılır? - Turkish Street Food",
    "Street food in depth and not boring! Turkish Desserts , Kazandibi, Milk Pudding, Turkish Dessert , mass production, food factory, ..."
  ],
  [
    "INSANE Turkish STREET FOOD Tour in Gaziantep! (GIANT Kebab, Katmer, Baklava!) Van Life Turkey",
    "Our East Turkey road trip continues as we leave Hatay behind, taking the road to Gaziantep via the Syrian border. We gatecrash a ..."
  ],
  [
    "Turkey Is Street Food Heaven",
    "Turkey has a lot of street food to offer. The INSIDER team believes that life is an adventure! Subscribe to our channel and visit us ..."
  ],
  [
    "Iskender Kebab with Tomato Sauce and Garlic Yogurt - Turkish Cuisine - Turkish Street Food",
    "Iskender kebab is a traditional Turkish dish and is one of my favourite dishes as well. It is prepared from thinly cut meat with ..."
  ],
  [
    "Tantuni Recipe: Most Famous Turkish Street Food",
    "Today I will share a very easy to make, very delicious, homemade tantuni recipe. Its a very famous Turkish street food Ingredients: ..."
  ],
  [
    "😍😍BU DƏHŞƏTDƏN DAD İSTƏYƏNLƏR KİMLƏRDİ ? | TURKISH STREET FOOD #shorts #outdoorcooking #yemek #kebab",
    ""
  ],
  [
    "Turkish street food liver shish is a great taste. great taste. nice foods.yummy",
    "How to make chicken doner kebab in Turkish street food."
  ],
  [
    "Turkish doner kebab Turkish street food 2021",
    "Bigstreetfood #Turkishfood #turkishkebab BIG STREET FOOD     Subscribe ..."
  ],
  [
    "🇹🇷 Turkish Street Food Tour In Istanbul | 2022",
    "Turkish Street Food Tour in Istanbul is Really Enjoyable and Delicious! Visiting TURKEY, what to see and what to do? ISTANBUL ..."
  ],
  [
    "ISTANBUL STREET FOOD, SHISH KEBAB, ROTISERRIE CHICKEN WITH RICE, CHICKEN KEBAB, TURKISH STREET FOOD",
    "ISTANBUL STREET FOOD, SHISH KEBAB, ROTISERRIE CHICKEN WITH RICE, CHICKEN KEBAB, TURKISH STREET FOOD, ..."
  ],
  [
    "INSANELY delicious TURKISH STREET FOOD in Istanbul | Turkey | Pakistani Reaction | Turkish ENG SUB",
    "Please Like Share And Subscribe. Give us your feedback about our reaction video in the comment section Thank You!"
  ],
  [
    "Turkish Street Food You MUST Eat in Istanbul 🇹🇷 #shorts",
    ""
  ],
  [
    "Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "Kokoretsi or kokoreç is a dish of the Balkans and Asia Minor, consisting of lamb or goat intestines wrapped around seasoned offal, ..."
  ],
  [
    "Most UNIQUE Street Food in Turkey - LAMB INTESTINE SANDWICH (KOKOREC) - TURKISH STREET FOOD",
    "Most UNIQUE Street Food in Turkey - LAMB INTESTINE SANDWICH (KUZU KOKOREC) - TURKISH STREET FOOD Subscribe ..."
  ],
  [
    "Turkish Street Food tour in Istanbul Istiklal street | 4k UHD 60 fps",
    "Turkish food tastes great and you enjoy eating it very much. There is a great variety of Turkish food and sweets and you can easily ..."
  ],
  [
    "Turkish Master Makes Turkish Style Kebab | Best Shawarma Doner | Turkish Street Food",
    "This boy is a 15-year-old doner master. He knows how to make Turkish kebab, doner kebab and iskender. Have you eaten ..."
  ],
  [
    "How to Make EGG STUFFED PARATHA in Turkey? - Turkish style Paratha -Turkish Street Food",
    "Street food in depth and not boring! EGG STUFFED PARATHA in Turkey, Turkish style Paratha is Borek,Turkish Street Food, ..."
  ],
  [
    "Most delicious turkish street food tour in istanbul ,Turkish Food Travel , Turkish street food vlog",
    "The Most delicious turkish street food tour in istanbul , Turkish Food Travel Turkish street food vlog Subscribe for Future videos ..."
  ],
  [
    "💥 ONE DAY In ISTANBUL, Turkish Street, Food, People 🔴 No talking! No commentary! travel video vlog",
    "Istanbul market, Kadikoy District, Eminonu district Turkish Street Food If you're going to have one day in Istanbul should not be ..."
  ],
  [
    "Street Food | Kaleji Fry | Potatoes Fry | Turkish Food #shorts #youtubeshorts",
    "Kaleji fry turkish street food best turkish food."
  ],
  [
    "Turkish Street Food वाणिज्य",
    "Street food, Dessert #asmr #shorts #streetfood #dessert."
  ],
  [
    "Elraenn - 36 Turkish Street Foods Across Turkey!! İzliyor #elraenn #twitch #reddit #fakebit #war #sa",
    "Bu kanalda yayıncıların güzel ve eğlenceli ve komik videolarını / kesitlerini derleyip paylaşıyorum, iyi seyirler. Kanalıma Abone ..."
  ],
  [
    "TURKISH STREET FOOD TOUR - BEST SANDWICHES IN TURKEY + BURNT ICE CREAM + BOREK in Antalya, Turkey!",
    "Antalya, Turkey - Antalya, Turkey is a beautiful city to visit, but it is also a FOOD HAVEN! In this video, we explore the best street ..."
  ],
  [
    "#shorts Turkish streetfood #youtubeshorts #streetfood",
    "shorts #streetfood #food #trending #turkishstreetfood Thanks for watching."
  ],
  [
    "Amazing baker selling 7000 breads a day! How to make Turkish bread? Turkish Street Food Bread Recipe",
    "According to most people, the homeland of bread is Mesopotamia. We have seen this in this bakery that makes amazing breads ..."
  ],
  [
    "Lamb head making in tandoori. Turkish street food. You will love the taste",
    ""
  ],
  [
    "Doner Kebab - Holland Street Food | Dutch Street Food | Turkish Street Food by FTFM",
    "Doner Kebabs are very famous Holland Street Food, found this roadside trailer selling doner kebabs in the street in ..."
  ],
  [
    "How to make Turkish potato easily || Turkish street food || kumpir || without oven",
    "Have you tried Kumpir? Traditional Turkish style baked potatoes that are filled with garlic butter and cheese and mixed until the ..."
  ],
  [
    "TURKISH STREET FOOD🍭OSMANLI MACUNU / OTTOMAN STİCK CANDY🍭",
    ""
  ],
  [
    "HasanAbi reacts to Bizarre Turkish Meats in Istanbul!! This Shouldn’t Be Allowed!!",
    "HasanAbi reacts to Bizarre Turkish Meats in Istanbul!! This Shouldn't Be Allowed!! by @MoreBestEverFoodReviewShow. Hasan is ..."
  ],
  [
    "Amazing Turkish Food!",
    "Amazing Turkish Food! Check Out: www.streetfooddreamfood.com."
  ],
  [
    "Trying Turkish Street Food in Amsterdam : KOKOREC",
    "Join this channel to get access to perks: https://www.youtube.com/channel/UCfLOR-QUmA9TlSqtj4lyvqQ/join Eating Lamb ..."
  ],
  [
    "How to make Turkish Sandwitch | Turkish Street Food",
    "I found this place in the city center and enjoyed this shop's traditional style. They serve all kinds of Turkish sandwiches and also ..."
  ],
  [
    "street food istanbul kadıköy |turkish street food kadıköy2022 4k",
    "Istanbul is the only city in the world that is located in two continents (Asia and Europe), although Istanbul was the capital of many ..."
  ],
  [
    "Izgara Köfte Turkish Street Food Tour In Istanbul 2022 4k Ultra HD",
    "One of the most delicious and oldest Turkish dishes is Izgara kofte, which translates to grilled meatball in English Izgara kofte is ..."
  ],
  [
    "Restaurant  ET - SE ET ŞÜKR - ET |Turkish street food | street food in Istanbul # 2",
    "Restaurant ET - SE ET ŞÜKR - ET |Turkish street food | street food in Istanbul 0538 642 25 65 Göz önünde hizmet Tepsi ..."
  ],
  [
    "Kokoreçci Erdinç Usta Turkish street food in istanbul City #food #foodie #foodblogger #streetfood",
    ""
  ],
  [
    "Turkish Street Food Tour in Naif Deira Dubai",
    ""
  ],
  [
    "The BEST Turkish street food in Istanbul, Turkey 🇹🇷 #shorts",
    ""
  ],
  [
    "Turkish Street Food #5 #shorts #streetfood #turkey",
    ""
  ],
  [
    "Amazing Turkish Menemen With Egg, Pastirma and Cheese | Turkish Street Foods",
    "Hope you like the video You can subscribe to join us. Asker Abinin Yeri Gaziantep, Türkiye ..."
  ],
  [
    "Turkish Street Food Tour in Naif Deira Dubai",
    ""
  ],
  [
    "😋Mouthwatering Flavor!🔥 | Turkish Street Foods #shorts #food",
    "One of the Most Popular Street Foods in Istanbul, Traditional Turkish Dish; Fish and bread. One of Istanbul's favorite lunchtime ..."
  ],
  [
    "Doner Turkish Shawarma   #shorts",
    "this is the way to make shawarma ... believe me it a piece of heaven ... OMG it soooo delecious. Turkish doner Kebab is the best ..."
  ],
  [
    "Turkish Street Food #5 #shorts #streetfood #turkey",
    ""
  ],
  [
    "Turkish Kabab Roll | Turkish Kabab Recipe | Turkish Street Food",
    "Turkish Kabab Roll. Very Delicious Mutton Kabab Roll in Turkish Style."
  ],
  [
    "Cheese Sausage Sandwich - Turkish Street Food",
    "ℹ️ Video Information ━━━━━━━━━━━━━━━━━━━━━━━━ Cheese Sausage Sandwich Filmed in ..."
  ],
  [
    "Turkish Street Food | Simit Big Bread | #turkish #turkey #food #shorts #streetfood",
    ""
  ],
  [
    "TURKISH STREET FOOD | #shorts​ | Street Food You&#39;ve NEVER Seen this Before! Street Food in Istanbul",
    "TURKISH STREET FOOD 2021 shorts​ Street Food You've NEVER Seen this Before Street Food in Istanbul Turkey #shorts​ ..."
  ],
  [
    "Shwarma Stuffed - Turkish Street Food #hungry #tasty #viral",
    "cooking #kitchen #sweet #junkfood #turkish #streetfood #tastyrecipes #shwarma #youtubeshorts."
  ],
  [
    "Turkish Street Food | Renshaw Street Food Market Liverpool",
    "Turkish Street Food | Renshaw Street Food Market Liverpool #turkish #turkishstreetfood #food #goodfoodreview #liverpool ..."
  ],
  [
    "Chicken Doner Kebab Turkey&#39;s Most Popular Dish  How It&#39;s Made? | Turkish Street Food",
    "Different Types of Doner Kebab Chicken Doner Kebab With Lavash Bread Chicken Doner Kebab With Turkish Somun Sandwich ..."
  ],
  [
    "Delicious Turkish Street Foods ...",
    ""
  ],
  [
    "best turkish street food in istanbul , Karadinez Doner , Meat Moot , Safa turkish baklava making",
    "best turkish street food in istanbul Karadinez Doner Meat Moot Safa turkish baklava making Intro 00:00 Safa Baklava 00:37 ..."
  ],
  [
    "TURKISH STREET FOOD TOUR || Walking Tour || The Cave Man #istanbul #turkey #mouthwatering",
    "Turkey's cuisine is wide and varied, from revived Ottoman dishes to the many recipes of the country's many regions. Of course ..."
  ],
  [
    "How to Make Homemade Sesame Bagels I Turkish Street Foods Simit",
    "Making homemade famous sesame bagels simit, Turkish street foods. To watch more similar videos, please subscribe to Rural ..."
  ],
  [
    "Food - Chicken BBQ - Turkish street food - Уличная еда #shorts #food #turkey",
    ""
  ],
  [
    "Turkish Street Food | Turkish Seekh Kebab Wrap #turkishfood #streetfood #shorts #dubai #food",
    ""
  ],
  [
    "Best Turkish Breakfast is Like This!!! | Turkish Street Food",
    "Today I went to a traditional breakfast house in Turkey and found out the owner is a well-known cook. She cooked a fantastic ..."
  ],
  [
    "Turkish Street Food Artist Viral Video #shortsfood #foodlover #foodies #foodstagram #foods",
    "Bansal News is an popular news channel. Streams the news from every section of World and National Topics, Madhya Pradesh, ..."
  ],
  [
    "Delicious Turkish Street Food Tour In Istanbul  2022 #streetfood #food #istanbul #travel #4kvideo",
    ""
  ],
  [
    "STREET FOOD, CAG KEBAP, TURKISH STREET FOOD IN IZMIR, TURKISH KEBAB",
    "STREET FOOD, CAG KEBAP, TURKISH STREET FOOD IN IZMIR, TURKISH KEBAB #streetfood, #turkishfood, #cagkebab, #izmir,"
  ],
  [
    "1480 KG Biggest Giant Chicken Döner Turkish Street Food İstanbul Türkiye",
    "SUBSCRİBE TO OUR CHANNEL PLEASE. KANALIMIZA ABONE OLUN.Herkese iyi seyirler iyi keyifler.Have nice time to ..."
  ],
  [
    "İstanbul Fish Bazaar /Market - Turkish Street Food",
    "Hello Everyone I Share Turkish Street Food on My Channel. I Would Be Happy if You Subscribe. Enjoy Your Meal ... follow me on ..."
  ],
  [
    "Kokoreç - Turkish Street Food    #kokoreç #turkishfood",
    "Please subscribe to FOU - https://bit.ly/FOUsubscribe In this video, FOU finds out about the delicious ''one of a kind'' street food in ..."
  ],
  [
    "Chef Abdulkadir Çetin | Turkish street food | street food in Istanbul",
    "Chef Abdulkadir Çetin | Turkish street food | street food in Istanbul Abdulkadir Çetin Gaziantep Gatem Ayakkabıcılar Sitesi 37 ..."
  ],
  [
    "Kokoreçci Erdinç Usta Turkish street food in istanbul City #food #foodie #foodblogger #streetfood",
    ""
  ],
  [
    "100kg Turkish shawarma every day | Very delicious Turkish Doner | Turkish Street Food",
    "This master cooks 60kg doner kebab alone every day. It's incredibly delicious and sells well. We have prepared doner kebab, one ..."
  ],
  [
    "Amazing Turkish dessert recipe! Delicious Turkish street food Tulumba #dessert",
    "Tulumba dessert is a Turkish dessert in which fried dough is served in a sugary syrup. It has an important place in Turkish street ..."
  ],
  [
    "What Food is This? Top Turkish Street Food",
    "What Food is This? Top Turkish Street Food from Adana. #streetfood #turkishfood #turkishcuisine."
  ],
  [
    "turkish street food #shorts viral food #asmr",
    ""
  ],
  [
    "turkish street food #shorts viral food #asmr",
    ""
  ],
  [
    "AMAZING ITALIAN PASTA, TURKISH STREET FOOD, RAVIOLI, GNOCCHI, LONDON STREET FOOD,  GREENWICH MARKET,",
    "AMAZING ITALIAN PASTA, TURKISH STREET FOOD, RICOTTA AND SPINACH RAVIOLI, GNOCCHI, LONDON STREET FOOD, ..."
  ],
  [
    "istanbul street food | traditional turkish tapas - fried liver (ciger tava)  | turkey street food",
    "Leyla Meyhanesi / Etiler / İstanbul Abone Olun ▻goo.gl/xDyp3Y Subscribe ▻goo.gl/xDyp3Y traditional turkish tapas - ciger tava ..."
  ],
  [
    "CIZZZZ 😍 india and turkish street food shorts #shorts",
    "istanbul turkey indian street food street delicacies sokak yemekleri sokak lezzetleri food shorts #shorts Subscribe now so you ..."
  ],
  [
    "street food istanbul kadıköy |turkish street food kadıköy2022 4k",
    "Istanbul is the only city in the world that is located in two continents (Asia and Europe), although Istanbul was the capital of many ..."
  ],
  [
    "turkish street food #shorts viral food #asmr",
    ""
  ],
  [
    "Amazing baker selling 7000 breads a day! How to make Turkish bread? Turkish Street Food Bread Recipe",
    "According to most people, the homeland of bread is Mesopotamia. We have seen this in this bakery that makes amazing breads ..."
  ],
  [
    "Seekh Kabab | Turkish Kebab | Adana Kebap | Turkish Street Food",
    "street food turkish street food seekh kabab beef kabab adana kebap #shorts #youtubeshorts."
  ],
  [
    "Turkish Street food, Döner Kebab ✌️ #short #shortvideo #shorts",
    "Traditional Turkish street food, döner kebab."
  ],
  [
    "Turkish Street Food | Satisfying Food Video",
    ""
  ],
  [
    "Roasted Corn | Grilled Corn Turkish Street food | Bhutta",
    "Roasted Corn | The Best Way to Grill Corn on the Cob | Bhutta | Roasted Corn Location : Taksim Square Istanbul Turkiye ..."
  ],
  [
    "4 Delicious Sushi Recipes: The Best Sushi Restaurant in Turkey | Turkish Street Food | 4K Video",
    "Sushi, the most famous street food of the Far East cuisine, attracts great attention in the world. Sushi is one of the indispensables ..."
  ],
  [
    "Turkish bakery | Baking 10,000 breads daily ❗❗ Turkish street food bread recipe 💯",
    "joy_of_tastes_street #streetfood #bread Hello, dear viewers, in this video, I went to one of the famous bakeries in Istanbul and ..."
  ],
  [
    "#icecream #turkish #streetfood #chocolate #shorts #hammer #vadilal #yummy #30sec #viralkardo",
    ""
  ],
  [
    "Turkish Street Food❗#shorts #ytshorts #youtubeshorts #shortsvideo #short",
    "Turkish Street Food❗Roasted Chestnut & Sweetcorn! #shorts #ytshorts #youtubeshorts #shortsvideo #short #streetfood ..."
  ],
  [
    "MUST-EAT Famous Dessert! 😋 | Turkish Street Food #shorts #food",
    "Turkish Sweet Churros are one of those very popular street foods or street desserts in Turkey. They are mostly called Halka Tatlisi ..."
  ],
  [
    "The Best kokoreç in Istanbul | Turkish Street Food",
    "The Best kokoreç in Istanbul | Turkish Street Food."
  ],
  [
    "Turkish Street Food Roasted Chestnut",
    "Turkish Street Food Roasted Chestnut Hi guys i was in Istanbul, I've noticed alot of roasted chestnuts stalls. I had to try it out."
  ],
  [
    "Patte wale Chole Kulche 😍 || Dehradun Street food #shorts #cholekulche #foodvideo",
    "foodunlimited #vegfood #dalchawal #corporate #foodvideo #streetfood #shahipaneer #foodrecipe #localfood #gharkakhana ..."
  ],
  [
    "turkish street food kokoreç istanbul|bakırköy yeraltı çarşısı|street food 2022 4k",
    "Bakirkoy district of Istanbul is one of the old districts in the European part. Having restaurants and street food in addition to cheap ..."
  ]
]