[
  [
    "SAMSUNG vs. APPLE | कौन बेहतर है? Samsung Vs. Apple Company Comparison",
    "FamiSafe - The Most Reliable Location Tracker, Try It for free: https://bit.ly/3BDwZAz Enter the campaign of FamiSafe to win an ..."
  ],
  [
    "Who is winning Global Smartphone Race? Apple Vs Samsung in India | UPSC Mains Exam GS3 Paper",
    "Enrol to StudyIQ's Flagship UPSC IAS (Pre + Mains) LIVE Foundation Batch 9. Admissions closing on 10 DEC'22 | Enrol now ..."
  ],
  [
    "Apple vs Samsung - Biggest Fight",
    "Well, Apple & Samsung are the two biggest mobile companies in the world. Tehya r a giant and produces a lot of tech products."
  ],
  [
    "Android vs iPhone - Which is ACTUALLY Better? (ft MKBHD)",
    "Android vs iPhone in 2022 - Who's doing it better? Obviously a controversial topic, but hope you find this useful! Hats off to ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA TEST!",
    "Camera Test comparison of Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - including microphone, night mode, ..."
  ],
  [
    "Samsung या Apple.. कौन है बेहतर? आज जान लो सच्च्चाई | Samsung And Apple Comparison In Hind",
    "Video Title : सैमसंग या एपल.. कौन है बेहतर? आज जान लो सच्च्चाई | Samsung And Apple ..."
  ],
  [
    "Camera Test - iPhone Vs Samsung Vs GoPro",
    "We do camera test of all flagship phones and gopro at the same time - Who will win in this battle - Samsung s22 ultra vs i phone ..."
  ],
  [
    "Apple vs Samsung - Which Is Bigger?",
    "SUBSCRIBE TO OUR NEW CHANNEL: Fuzzy & Nutz 🐿️ ▻▻▻ http://www.youtube.com/fuzzynutz Apple vs Samsung - Which Is ..."
  ],
  [
    "Samsung S22 vs iPhone 13 - Best Pick ?",
    "Hello !! Today in this video I am sharing my opinion about iPhone 13 vs Samsung S22. ( #iphonevssamsung ..."
  ],
  [
    "iPhone 13 Pro VS Samsung Galaxy Fold Hammer Test | Durability Test | #iPhone #samsungfold",
    "Video Courtesy: Techrax Download Anurag Aggarwal's App. for FREE https://play.google.com/store/apps/details?id=co.arya.yqadl ..."
  ],
  [
    "iPhone V/S Samsung - Hammer Test | Mridul Madhok",
    "To get chemical free products visit https://mridulmadhok.in/ If you have enjoyed this video then don't forget to LIKE, SHARE ..."
  ],
  [
    "Apple vs Samsung, किसका mobile है बेहतर? | iphone and Samsung Phones comparison",
    "iphone and Samsung Phones comparison Join Factified Community today to support and access to exclusive perks: ..."
  ],
  [
    "iPhone vs Samsung  - Which one survives a TOASTER!?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Sparkling Water FREEZE Test! What&#39;s Gonna Happen?!",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra sparkling water freeze test! Drop these in freeze temps to test durability."
  ],
  [
    "Samsung makes Fun of Apple#5(You will hate Apple after seeing this)",
    "Subscribe For More!"
  ],
  [
    "The Real KING Phone? - iPhone 14 Pro Max vs Samsung S22 Ultra",
    "In this video, I compare the Samsung Galaxy S22 Ultra and the iPhone 14 Pro Max - The Best of Best Smartphones. You can also ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Which is the Flagship King?",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Apple vs Samsung Rap battle",
    "SUBSCRIBE & Turn POST NOTIFICATIONS on =) follow me on tiktok: https://www.tiktok.com/@dawoodsavager Follow Instagram ..."
  ],
  [
    "Apple vs Samsung Company Comparison in Hindi | Samsung vs Apple #Shorts #Short",
    "Follow me on Instagram https://www.instagram.com/indias_top_facts/ Insta ID : indias_top_facts Join our facebook page ..."
  ],
  [
    "Clear Advice to YOU! - iPhone 13 vs Samsung S22+",
    "In this video, I compare the Samsung Galaxy S22 Plus and the iPhone 13. You can also watch, Samsung Galaxy S22 Ultra vs ..."
  ],
  [
    "Samsung vs iPhone - Which one is more DURABLE?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Iphone VS Samsung I #shorts I #ytshorts I #iPhone I #samsung",
    "Download Anurag Aggarwal's App. for FREE https://play.google.com/store/apps/details?id=co.arya.yqadl Website: ..."
  ],
  [
    "Apple 12 pro Max vs Samsung S21 Ultra vs Mi 11 Ultra zoom test",
    ""
  ],
  [
    "Samsung Galaxy S22 vs iPhone 13 - NOT EVEN CLOSE...",
    "Samsung Galaxy S22 vs iPhone 13. A full early comparison between iPhone 13 vs Galaxy S22 including specs, features, price, ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "5 Reasons Galaxy S22 Ultra DESTROYS the iPhone 14 Pro Max",
    "In this video, I will give you 5 reasons why the Samsung Galaxy S22 Ultra destroys the iPhone 14 Pro Max. Both the Galaxy S22 ..."
  ],
  [
    "iPhone 14 Pro/Max vs Samsung S22 Ultra Detailed Comparison - BEST Flagship for you☝🏼",
    "Hey, Guys, This is the Detailed Comparison between iPhone 14 Pro Max and Galaxy S22 Ultra, Both Phone Cost Upwards of ..."
  ],
  [
    "Galaxy S22 vs iPhone 13 - Which to choose?",
    "Galaxy S22 vs iPhone 13 - Which to choose? Samsung Galaxy S22 is Samsung's latest high-end flagship smartphone and ..."
  ],
  [
    "Apple VS Samsung Bigger Company Comparison 2021",
    "Apple VS Samsung Bigger Company Comparison 2021 #applevssamsung #apple #samsung think media 99 iphone 12 pro max ..."
  ],
  [
    "Samsung Watch or Apple Watch? #samsung #vs #apple #watch #compare #gertieinar",
    ""
  ],
  [
    "Don&#39;t Fight - Microsoft New Commercial Mocks Apple And Samsung",
    "Microsoft creates an Apple vs. Samsung wedding fight for its new Windows Phone ad. Microsoft has tried a number of ways to ..."
  ],
  [
    "iPhone 13 vs S21 FE 5G Camera Test 🔥| Surprising Results! (HINDI)",
    "iPhone 13 vs S21 FE 5G Camera Test | Surprising Results! (HINDI) In this video, I'm Comparing the iPhone 13 with Samsung ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy  S22 Ultra - Which is  BETTER?",
    "Here's a comparison of the iPhone 13 Pro Max vs Samsung Galaxy S22 Ultra. Which would you get from these 2 premium ..."
  ],
  [
    "iPhone vs Samsung 🔥🔥",
    ""
  ],
  [
    "iPhone 14 Pro vs Samsung S22 Ultra - Max Brightness Test 🤯 #shorts",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Maximum Display Brightness Test Subscribe ..."
  ],
  [
    "iPhone 14 vs Samsung S22! कौनसा अच्छा? #shorts #youtubeshorts #tech #iphone14 #apple #s22 #samsung",
    "shorts #youtubeshorts #tech #ytshortsindia #iphone #apple #iphone14 #samsung #s22 #s22ultra #amazon #sale iPhone 14 vs ..."
  ],
  [
    "iPhone vs Samsung Galaxy 2022",
    "iPhone vs Samsung Galaxy 2022 - iPhone vs Galaxy has always been a fierce competition over the years and in this episode, we ..."
  ],
  [
    "S22 Ultra VS iPhone 13 Pro Max!!!",
    "Let me know in the comments section, which you think is better the Samsung Galaxy S22 Ultra VS iPhone 13 Pro Max!"
  ],
  [
    "APPLE vs SAMSUNG🤯 | யாருக்கு தண்ணில🌊 கண்டம் ? #TamilTech #Shorts",
    "iphonevssamsung #iphonevsandriodwatertest #apple #samsung Recent Videos: 1 Click - Smartphone to DSLR Camera *Top ..."
  ],
  [
    "Apple vs Samsung",
    "Ever since the introduction of the Galaxy S series in 2010, Apple and Samsung have vied for smartphone supremacy. Find out all ..."
  ],
  [
    "Apple iPhone 14 Pro Max vs Samsung Galaxy Fold 4 - Zoom Edition",
    "Two phones. Both cost AED 6799 (iPhone 14 Pro Max 1TB and Samsung Fold 4 512GB). Which one takes better pictures across ..."
  ],
  [
    "apple vs Samsung battery life | #shorts",
    "shorts."
  ],
  [
    "Apple Makes Fun Of Android #3",
    "Also check out the NordVpn https://www.youtube.com/watch?v=k56xmepQaJU, ..."
  ],
  [
    "iPhone 14 pro vs Samsung Fold 4 #shorts #youtubeshorts #tech #iphone14 #fold4",
    "shorts #youtubeshorts #tech #iphone #iphone14 #iphone14pro #apple #fold4 #samsung #comparison iPhone 14 pro VS ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S21 Ultra - Which Should You Buy?",
    "Which is the best phone in 2021 - iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra? I compare price, specs, camera, battery ..."
  ],
  [
    "Samsung Galaxy S21 FE vs iPhone 12 Full Comparison | Who Wins? | GT Hindi",
    "Toh doston, aaj ke iss video mei hum karenge Samsung Galaxy S21 FE ko Apple iPhone 12 se compare. Dono hi phone aapko ..."
  ],
  [
    "Apple Watch Series 7 VS Galaxy Watch 4",
    "This is something I get asked all the time… “Which watch is better??” So here you go, check out which one of these watches wins ..."
  ],
  [
    "Samsung Can&#39;t Stop ROASTING iPhone 14 😂😂😂",
    "Samsung is roasting Apple & iPhone 14 again. Samsung trolls apple hard for their lack of innovation. iPhone 15 NO BUTTONS ..."
  ],
  [
    "iPhone 13 Pro VS Samsung S22 Ultra Drop Test | Durability Test | #iPhone #samsung I #droptest",
    "Download Anurag Aggarwal's App. for FREE https://play.google.com/store/apps/details?id=co.arya.yqadl Website: ..."
  ],
  [
    "BEST PHONE ON THE PLANET!! S22 Ultra vs iPhone 14 Pro Max",
    "Should you buy the iPhone 14 Pro Max or the S22 Ultra? The Camera comparison was surprising... ✓ GET your iPhone 14 cases ..."
  ],
  [
    "Samsung Galaxy S7 Edge vs. iPhone 6S Plus Coca-Cola Freeze Test 9 Hours! Will It Survive ?",
    "Thanks for watching this video! I did it a couple of years ago and didn't expect it to become such a major success! Thank you all for ..."
  ],
  [
    "iPhone 14 Vs Samsung Galaxy S22 Comparison #Shorts",
    "Hi Guys, this is a quick comparison video of Apple iPhone 14 and Samsung Galaxy S22, in which I have covered their camera, ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra : le Gros Comparatif !",
    "Lequel choisir ? Galaxy S22 Ultra vs iPhone 13 Pro Max. ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les protections RhinoShield ..."
  ],
  [
    "iPhone 12 vs Samsung Galaxy S20 in Piranha Acid Experiment! Will it Survive?",
    "The new Apple iPhone 12 vs the Samsung Galaxy S20 in a hot piranha solution! Will they survive? FACEBOOK: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra - BIGGEST Comparison #shorts",
    "iphone14promax #Samsungs22ultra #comparison We Will Bring More Video Like This SUBSCRIBE TO OUR CHANNEL For More ..."
  ],
  [
    "iPhone SE (2020) vs Samsung Galaxy A51 : Shocking 😲😲",
    "iphone SE 2020 vs Samsung Galaxy A51 Full Comparison :aaj is video mein ek comparison karne wale hai samsung ke mid ..."
  ],
  [
    "Apple Makes Fun Of Android #3",
    "Also check out the NordVpn https://www.youtube.com/watch?v=k56xmepQaJU, ..."
  ],
  [
    "iPhone 13 Pro vs galaxy s22 ultra zoom test 😳 #iphone13pro #s22ultra #zoomtest",
    ""
  ],
  [
    "I Gave New Phones to Strangers... But Made Them Choose! – iPhone vs Samsung | TechKaboom",
    "If we were to give you the choice between the latest from Apple and the latest from Samsung for free, would you go for the iPhone ..."
  ],
  [
    "On the Fence | Samsung​",
    "It's time to get off the fence."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "Apple vs Samsung: Smartwatch Edition",
    "What happens when two top premium smartwatches go head-to-head? We take a deep dive into their design, display, ..."
  ],
  [
    "Apple vs Samsung Company",
    "In this video I made a comparison between Apple vs Samsung company. We'll see how Steve Jobs's company, Apple, and Lee ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - CAMERA Comparison!",
    "Which Phone has the Best Camera? IPhone 14 Pro / Pro Max vs Samsung Galaxy S22 Ultra! ▷ Try HUEL Today!"
  ],
  [
    "Galaxy S22 Review: The iPhone of Android!",
    "The Samsung Galaxy S22 has cemented itself as the Android default even more than the Pixel That shirt: http://shop."
  ],
  [
    "Let’s Settle It - iPhone 13 vs Galaxy S22",
    "Check out the Anker 521 Charger (Nano Pro): https://ankerfast.club/3MFJ8Lu Big thank you to Anker for sponsoring a portion of ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "Android vs iOS - The TRUTH!",
    "In this video, I compare iOS vs Android - which is the best operating system? You can also watch, Samsung Galaxy S22 Ultra vs ..."
  ],
  [
    "iPhone 12 Pro Max vs Galaxy S21 Ultra! 🔥#shorts",
    "Thanks For Watching This Video. Disclaimer :- Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is ..."
  ],
  [
    "Samsung Galaxy S21 FE vs iPhone 12 Full Comparison | Who Wins? | GT Hindi",
    "Toh doston, aaj ke iss video mei hum karenge Samsung Galaxy S21 FE ko Apple iPhone 12 se compare. Dono hi phone aapko ..."
  ],
  [
    "Apple Vs Samsung Rap Battle",
    "For Paid Promotions : imransavage.inquiries@gmail.com Follow me on my Instagram : https://www.instagram.com/imransavagee ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - NOT EVEN FAIR.",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra. A full early comparison between iPhone 14 Pro Max vs S22 Ultra including ..."
  ],
  [
    "iPhone 14 vs Galaxy S23 - Which One to Wait for?",
    "2 year & 1 month FREE NordPass offer - https://nordpass.com/zoneoftech or use coupon code \"zoneoftech\" Thanks to NordPass ..."
  ],
  [
    "M1 iPad Pro vs Galaxy Tab S7+ // Apple Pencil vs SPEN",
    "Try Surfshark: https://Surfshark.deals/thao Code 'THAO' for 83% off & 3 months FREE! The 12.9 inch M1 iPad Pro from Apple and ..."
  ],
  [
    "Apple VS Samsung and Others (1996-2018)",
    "Apple VS Samsung and Others (1996-2018) With the upcoming release of the Apple iPhone 11, 11 pro, and the 11 pro max, the ..."
  ],
  [
    "iPhone 14 Pro vs Samsung Fold 4 🔥 #shorts",
    "MostTechy Main Channel: https://www.youtube.com/MostTechy Follow me across social media platforms for behind the scenes: ..."
  ],
  [
    "iPhone 13 Pro VS Samsung S22 Ultra Drop Test | Durability Test | #iPhone #samsung I #droptest",
    "Download Anurag Aggarwal's App. for FREE https://play.google.com/store/apps/details?id=co.arya.yqadl Website: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA COMPARISON (in Hindi)",
    "iPhone 14 Pro Max vs Samsung S22 Ultra camera comparison of photos and videos. CONNECT ON INSTAGRAM: ..."
  ],
  [
    "Budget Phone Battle: iPhone SE 2022 vs. Samsung A53 5G",
    "You can see the products featured in this video here iPhone SE: https://bit.ly/3qhaOgi Galaxy A53 5G: https://bit.ly/3Jy68tK ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Test | Hindi",
    "Hello Guys, In this video we have an In-depth camera comparison between the latest flagship phone from Apple, IPhone 14 Pro ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Which is the Flagship KING?",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Apple Fan Boy Unboxes Samsung Galaxy S22+ | Goodbye iPhone!",
    "NEW Wallpapers: https://shevonsalmon.gumroad.com/l/euphoria Day In My Life With S22+ https://youtu.be/r0SeYVKofF0 ..."
  ],
  [
    "iPhone XR vs Galaxy S10+ which one breaks first - “Bend Test” #phones #apple #samsung #galaxy",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra vs. Apple iPhone 13 Pro Max (Deutsch) | SwagTab",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max - Wer ist besser? In diesem Video seht ihr einen ausführlichen Vergleich ..."
  ],
  [
    "Apple vs Android",
    "Listen to the podcast - https://open.spotify.com/episode/1MpzYIN39WG3J0a8piQhXN?si=7fe375f1c92b499e."
  ],
  [
    "Apple vs Samsung vs OnePlus in India! 🔥🔥🔥",
    "Let's talk about the Premium Flagship Smartphone market of India. And see what is the state of the market and which is the best ..."
  ],
  [
    "iPhone 13 Pro Max vs. Galaxy S21 Ultra Speed Test",
    "Speed test between the Apple iPhone 13 Pro Max and the Samsung Galaxy S21 Ultra to see which phone is faster when using ..."
  ],
  [
    "Samsung Galaxy Watch 5 Pro vs Apple Watch Ultra #shorts",
    "This is a short comparison video of the Apple Watch Ultra vs the Samsung Galaxy Watch 5 Pro! #Apple #Samsung #shorts ..."
  ],
  [
    "Apple Ecosystem Vs Samsung Ecosystem! (Comparison) (Review)",
    "Get The Cheapest iPhones Here: https://amzn.to/3JTnWAr Get The Cheapest Androids Here: https://amzn.to/3r2k1st Get ..."
  ],
  [
    "Samsung galaxy vs Apple iPhone comparison #shorts #qualityfacts",
    "Samsung galaxy vs Apple iPhone comparison #shorts #qualityfacts #galaxyvsiphone #galaxyvsiphoneguntest #sansungvsapple ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra 🥵 #shorts",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Quick Comparison with Camera Samples #Shorts #Samsung #iphone."
  ],
  [
    "Dropping Samsung Galaxy Fold vs iPhone 11 Pro Max vs Nokia 3310 Down Spiral Staircase - 20 Stories",
    "I dropped the most iconic smartphones of 2019 to see which one holds up the best in this durability drop test! FACEBOOK: ..."
  ],
  [
    "||iphone vs Samsung ultra 22 camera zooming test😯|| #shorts #iphone #samsung galaxy 22 #ytshorts",
    "iphone vs Samsung galaxy ultra 22 camera zooming test who will win|| related queries:- @bharatbachhwanfact7281 #how to buy ..."
  ],
  [
    "Team Apple 🍏 o Samsung? 🤖",
    ""
  ],
  [
    "iPhone 12 vs Galaxy S21: don’t make a mistake!",
    "Galaxy S21 Ultra vs iPhone 12 Pro Max: https://youtu.be/FKNJqlJ7Yqk Are you debating on getting an Apple iPhone 12 or a ..."
  ],
  [
    "Switching to Galaxy S22 Ultra From iPhone 13 Pro - The BEST &amp; WORST Parts",
    "Buy UGREEN Nexode 200W Charger here(US): https://amzn.to/3tOD4IU Buy UGREEN Nexode 200W Charger here(CA): ..."
  ],
  [
    "Apple iPhone 14 Pro Max Vs Samsung Galaxy S22 Ultra 5G Vs Xiaomi 12S Ultra",
    "Apple iPhone 14 Pro Max Vs Samsung Galaxy S22 Ultra 5G Vs Xiaomi 12S Ultra | Full Comparison | Which one is best for you ?"
  ],
  [
    "Samsung Galaxy: Join the flip side",
    "Sometimes, when you see something new, exciting and visually unique you'll start looking for it everywhere... no matter how hard ..."
  ],
  [
    "Samsung VS Apple I #shorts I #anuragthecoach I #ytshorts I #apple I #samsung",
    "Download link - https://kukufm.sng.link/Apksi/1xtx/ku3r Coupon code - ANURAG50 ..."
  ],
  [
    "iPhone 14 pro Max Vs Samsung Galaxy S22 Ultra || The Best Camera Phone !",
    "My Facebook ID : https://rb.gy/plksne My Facebook Page : https://rb.gy/hawzqg ＬＩＫＥ | ＣＯＭＭＥＮＴ | ＳＨＡＲＥ ..."
  ],
  [
    "Samsung S3 vs iPhone 5 which one turn on first?                #poweron #phones #test #galaxy",
    ""
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra - BIGGEST CAMERA COMPARISON !",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra Ka Biggest Comparison Kiya ..."
  ],
  [
    "Budget Phone Battle: iPhone SE 2022 vs. Samsung A53 5G",
    "You can see the products featured in this video here iPhone SE: https://bit.ly/3qhaOgi Galaxy A53 5G: https://bit.ly/3Jy68tK ..."
  ],
  [
    "How Apple And Samsung Became Rivals",
    "Check out our iGenius Plush Doll: https://www.appleexplained.com/new-products/igenius-plush-doll For early access to all my ..."
  ],
  [
    "Apple VS Samsung Company Comparison | Market Share, Revenue, Ranking, etc. 2022",
    "About: Apple Inc. is an American multinational technology company headquartered in Cupertino, California while Samsung is a ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA COMPARISON (in Hindi)",
    "iPhone 14 Pro Max vs Samsung S22 Ultra camera comparison of photos and videos. CONNECT ON INSTAGRAM: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra - Full Comparison !!",
    "Here are the track links: ⏩Transfer To Your New Phone With One Click : https://bit.ly/3BqCqEt ⏩Get Mobiletrans with 20% Off: ..."
  ],
  [
    "iPhone XR vs Galaxy S10+ which one breaks first - “Bend Test” #phones #apple #samsung #galaxy",
    ""
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs. Apple iPhone 13 Pro Max (Deutsch) | SwagTab",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max - Wer ist besser? In diesem Video seht ihr einen ausführlichen Vergleich ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Which is the Flagship KING?",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Apple vs Samsung: Which One Is Bigger? (2021)",
    "Back in 2007, inventor and entrepreneur Steve Jobs revolutionised the cell phone market with the release of the Apple iPhone."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Test | Hindi",
    "Hello Guys, In this video we have an In-depth camera comparison between the latest flagship phone from Apple, IPhone 14 Pro ..."
  ],
  [
    "iPhone 13 Pro Max vs. Samsung Galaxy S22 Ultra Battery Test 🔋 Subscribe for more 🤝🏼",
    "Full video: https://youtu.be/5TL4HqVlz8M."
  ],
  [
    "Samsung Galaxy: Join the flip side",
    "Sometimes, when you see something new, exciting and visually unique you'll start looking for it everywhere... no matter how hard ..."
  ],
  [
    "Samsung vs Apple   Earnings, Profits, Sales &amp; Which is Bigger?",
    "Samsung vs Apple | Earnings, Profits, Sales & Which is Bigger? It is fair to say there is no love lost between Apple, Inc. and ..."
  ],
  [
    "Dropping Samsung Galaxy Fold vs iPhone 11 Pro Max vs Nokia 3310 Down Spiral Staircase - 20 Stories",
    "I dropped the most iconic smartphones of 2019 to see which one holds up the best in this durability drop test! FACEBOOK: ..."
  ],
  [
    "iPhone Vs Samsung😎🔥 #shorts #iPhone #Samsung",
    "Media Partner : Adada Creators Email : techboss@adadacreators.com Subscribe   : http://bit.ly/2JmvIXb It would make my day ..."
  ],
  [
    "Samsung Galaxy Watch 5 Pro vs Apple Watch Ultra #shorts",
    "This is a short comparison video of the Apple Watch Ultra vs the Samsung Galaxy Watch 5 Pro! #Apple #Samsung #shorts ..."
  ],
  [
    "Samsung vs iPhone - Which one survives a Car CRASH!?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "iOS VS Android - Did You Make The Right Choice?",
    "Whatever you need a website for, create yours today with Wix: https://www.wix.com/go/infographics2019 How do you know ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra | La Batalla",
    "No te pierdas de ningún contenido: https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "Apple iPhone 14 Pro Max Vs Samsung Galaxy S22 Ultra 5G Vs Xiaomi 12S Ultra",
    "Apple iPhone 14 Pro Max Vs Samsung Galaxy S22 Ultra 5G Vs Xiaomi 12S Ultra | Full Comparison | Which one is best for you ?"
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra 🔥 Who is the Real CAMERA KING?",
    "Let's See the Comparison of Samsung S22 Ultra vs Google Pixel 7 Pro vs Apple iPhone 14 Pro Max in Tamil Tech."
  ],
  [
    "IPHONE VS SAMSUNG RAPBATTLE 😱 | TANZVERBOT REAGIERT auf FOUR SEVEN | STREAM HIGHLIGHTS",
    "IPHONE VS SAMSUNG RAPBATTLE | TANZVERBOT REAGIERT auf FOUR SEVEN | STREAM HIGHLIGHTS Zum Video: ..."
  ],
  [
    "iPhone 12 vs Galaxy S21: don’t make a mistake!",
    "Galaxy S21 Ultra vs iPhone 12 Pro Max: https://youtu.be/FKNJqlJ7Yqk Are you debating on getting an Apple iPhone 12 or a ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra Pubg Test, Heating and Battery Test | Shocked 😱",
    "In this video, I will do the pubg/bgmi test comparison between samsung s22 ultra vs iphone 14 pro max and also check out the ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy  S22 Ultra - Which is  BETTER?",
    "Here's a comparison of the iPhone 13 Pro Max vs Samsung Galaxy S22 Ultra. Which would you get from these 2 premium ..."
  ],
  [
    "10 Ways Galaxy S22 is better than iPhone 13!",
    "10 Ways Galaxy S22 is better than iPhone 13! Hello all and welcome to this video about why Samsung Galaxy S22 is better than ..."
  ],
  [
    "Samsung vs Apple vs OnePlus | तीनों में से कौन जीतेगा #shorts #factybrain",
    "Samsung vs Apple vs OnePlus | तीनों में से कौन जीतेगा #shorts #factybrain in this video- Samsung vs apple ..."
  ],
  [
    "Apple Fan Boy Unboxes Samsung Galaxy S22+ | Goodbye iPhone!",
    "NEW Wallpapers: https://shevonsalmon.gumroad.com/l/euphoria Day In My Life With S22+ https://youtu.be/r0SeYVKofF0 ..."
  ],
  [
    "iPhone 13 Pro Max vs. Galaxy S21 Ultra Speed Test",
    "Speed test between the Apple iPhone 13 Pro Max and the Samsung Galaxy S21 Ultra to see which phone is faster when using ..."
  ],
  [
    "Samsung Can&#39;t Stop MOCKING Apple",
    "Samsung has been mocking Apple and the iPhone 14 lineup ever since Apple announced it in September. Samsung is also ..."
  ],
  [
    "Samsung S22 vs iPhone 13 - Camera Test",
    "We tested the iPhone 13 camera against Samsung S22. We Are Hiring! APPLY HERE: https://techwiser.com/we-are-hiring ..."
  ],
  [
    "Apple Fan Boy Switches To Samsung Galaxy S22 Ultra - Goodbye iPhone",
    "CASETiFY has released new cases for the S22, Z Flip and Pixel! Go to http://www.casetify.com/shevonsalmonyt today to get 15% ..."
  ],
  [
    "Samsung Galaxy Buds PRO vs Apple AirPods Pro [Honest Comparison]",
    "PRODUCT LINKS ↘️ GALAXY BUDS PRO PRICE: https://mikeobrienmedia.com/galaxy-buds-pro AIRPODS PRO PRICE: ..."
  ],
  [
    "Apple Watch Series 7 VS Galaxy Watch 4",
    "This is something I get asked all the time… “Which watch is better??” So here you go, check out which one of these watches wins ..."
  ],
  [
    "iPhone vs Samsung 😱 कौन बचाएगा 🤯 acid के कहर से 😲 #shorts",
    "iPhone vs Samsung कौन बचाएगा acid के कहर से #youtubeshorts #ytshorts #iPhonevssamsung -----tags----- ..."
  ],
  [
    "Together I Used all Samsung Devices - The Android Ecosystem !",
    "In this video, I talk about the Samsung Ecosystem - the best android ecosystem. You can also watch, Apple ecosystem ..."
  ],
  [
    "The 2022 KING ? - iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro",
    "In this video, I compare the Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max vs Google Pixel 7 Pro. You can also watch, Moto ..."
  ],
  [
    "Samsung vs iPhone vs WASHING MACHINE!",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Samsung Galaxy S20 vs iPhone 11",
    "Comparing the camera, battery, specs and features of the Galaxy S20 vs iPhone 11. The conclusion here, is perhaps not one you ..."
  ],
  [
    "Apple vs Samsung Company comparison 2022|Samsung vs Apple comparison in Hindi #Shorts #Short #Viral",
    "Apple #Samsung #Samsung_vs_Apple_comparison #Apple_vs_samsung #Youtube_shorts #Shorts #Short_feed #trending ..."
  ],
  [
    "Apple vs Samsung vs OnePlus in India! 🔥🔥🔥",
    "Let's talk about the Premium Flagship Smartphone market of India. And see what is the state of the market and which is the best ..."
  ],
  [
    "Apple Pay vs. Samsung Pay vs. Google Pay: Which is best?",
    "How does Apple Pay compare to its rivals from Samsung and Google? We test them all to find the best mobile payment system."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra CAMERA TEST 🔥",
    "Camera Test comparison - iPhone 13 Pro / 13 Pro Max vs Samsung Galaxy S21 Ultra! Sign up here ..."
  ],
  [
    "iPhone 13 vs S21 FE 5G Camera Test 🔥| Surprising Results! (HINDI)",
    "iPhone 13 vs S21 FE 5G Camera Test | Surprising Results! (HINDI) In this video, I'm Comparing the iPhone 13 with Samsung ..."
  ],
  [
    "Apple vs Google vs Samsung #Shorts",
    "Apple vs Google vs Samsung #Shorts #YoutubeShorts #ShortTechNews #YoutubeShortsFeature #ytShortsIndia Best Deals Here: ..."
  ],
  [
    "Apple VS Samsung and Others (1996-2018)",
    "Apple VS Samsung and Others (1996-2018) With the upcoming release of the Apple iPhone 11, 11 pro, and the 11 pro max, the ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S23 Ultra | Comparison",
    "iPhone 14 Pro Max vs Samsung S23 Ultra | Comparison Please comment, which phone you like the more? #iphone14promax ..."
  ],
  [
    "iPhone 12 vs S21 FE 5G Detailed Comparison &amp; Review | Which Gives More Value in 2022? (HINDI)",
    "iPhone 12 vs S21 FE 5G Detailed Comparison & Review | Which Gives More Value in 2022? (HINDI) This Video is regarding ..."
  ],
  [
    "Who’s The KING? - iPhone 13 Pro Max vs Samsung S22 Ultra",
    "In this video, I compare the Samsung Galaxy S22 Ultra and the iPhone 13 Pro Max - The Best of Best Smartphones. You can also ..."
  ],
  [
    "Which Phone is More Bulletproof? Samsung Galaxy vs iPhone",
    "How Many Samsung Galaxy Phones vs iPhones Does It Take To Stop a Bullet? S7, 6S & More vs FN FAL, AR-15, AK-47 Gun ..."
  ],
  [
    "Samsung TROLLS Apple and iPhone 14 Pro AGAIN!",
    "Samsung is mocking Apple and the iPhone 14 yet again just minutes after the Apple event for the iPhone 14 lineup ended."
  ],
  [
    "iPhone 13 Pro Max vs. Galaxy S21 Ultra Drop Test!",
    "Check out the Anker 511 charger (Nano Pro): https://ankerfast.club/3CIN88k Big thanks to Anker for sponsoring this video!"
  ],
  [
    "100x zooming Moon 🌙 iphone 14 pro max vs samsung s22 ultra  🤕#shorts kon ha winner 🏆",
    ""
  ],
  [
    "Samsung Galaxy S8 Plus vs. iPhone 7 Plus Water Freeze Test 16 Hours! Which Is Best?!",
    "My new website for phone information: http://phoneinf.com/ We are back today with another interesting video for all smartphone ..."
  ],
  [
    "Zoom iPhone vs Galaxy",
    "15x zoom iPhone 14 Pro Max 100x zoom Samsung Galaxy S22 Ultra ✓ Promocje na smartfony ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra - Which is the Flagship KING?",
    "Apple iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Camera Test Comparison",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Detailed Camera Comparison #SuperSafStyle ▻▻▻SUBSCRIBE for ..."
  ],
  [
    "Galaxy Z Flip 4 vs iPhone 13 Pro - Why I&#39;m SWITCHING.. 😍",
    "I've been an iPhone user for the past 6 years, but now I'm finally trying out the Samsung Galaxy Z Flip 4! Let's compare ..."
  ],
  [
    "Apple vs Samsung",
    "Apple vs Samsung. The iPhone vs the Galaxy. IGTV's Victoria Scholar takes a look at the challenges facing the two tech giants to ..."
  ],
  [
    "What Koreans Think of Apple (vs Samsung) | ASIAN BOSS",
    "The opinions expressed in this video are those of individual interviewees alone and do not reflect the views of ASIAN BOSS or the ..."
  ],
  [
    "Buckle Up",
    "What will they not think of next? Explore the head-turning alternatives at https://samsung.com. #withGalaxy."
  ],
  [
    "Vivo X90 Pro+ Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison",
    "Vivo X90 Pro+ Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison. Side-by-side comparison comparing, video, audio, ..."
  ],
  [
    "iPhone 13 Pro Max VS Galaxy S22 Ultra",
    "Alors, iPhone 13 Pro Max ou Samsung Galaxy S22 Ultra ? Mon Instagram : https://www.instagram.com/jbaptisten/ - Abonne-toi ..."
  ],
  [
    "Mercuri_88 Official TikTok - Android VS Apple",
    "mercuri_88 #mercuri88 #manuelmercuri #tiktok #littlebrother #mom #apple #android TikTok: https://vm.tiktok.com/ZMe53FCDa/ ..."
  ],
  [
    "Camera Test ⚡ iPhone 14 Pro Max Vs Samsung S22 Ultra 😱 #shorts #digitechlive",
    "Camera Test iPhone 14 Pro Max Vs Samsung S22 Ultra #shorts #digitechlive #youtubeshorts #shortvideo #mobile #viral."
  ],
  [
    "Why Apple NEEDS Samsung .........?",
    "Apple and samsung is two biggest player in smartphone market. In this video i talked about samsung vs Apple and why Apple ..."
  ],
  [
    "SAMSUNG S22 Ultra vs 13 Pro Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW S22 Ultra 5G (amazon) https://amzn.to/36FJUrf Let's Connect: ..."
  ],
  [
    "Apple iPhone 14 pro Max vs Samsung Galaxy S22 Ultra - Drop Test",
    "The ultimate durability test between the latest Samsung Galaxy Test vs Apple iPhone 14 Pro max. Find out which is more durable."
  ],
  [
    "Galaxy S22 vs iPhone 13 - Which to choose?",
    "Galaxy S22 vs iPhone 13 - Which to choose? Samsung Galaxy S22 is Samsung's latest high-end flagship smartphone and ..."
  ],
  [
    "Apple VS Samsung and Others (1996-2018)",
    "Apple VS Samsung and Others (1996-2018) With the upcoming release of the Apple iPhone 11, 11 pro, and the 11 pro max, the ..."
  ],
  [
    "Apple VS Samsung #Toniolife",
    ""
  ],
  [
    "iPhone 7 vs Samsung Galaxy S7",
    "Apple iPhone 7 vs Samsung Galaxy S7 Full Comparison, what are the key differences in Camera, Display, Build, Battery, and ..."
  ],
  [
    "Samsung vs iPhone - Which one survives a Car CRASH!?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Samsung Galaxy Tab S6 Lite Vs Apple iPad 10.2 - The best tablet?",
    "Here is the Samsung Tab S6 Lite vs the Apple iPad 10.2 comparison. Which Among the two should you buy. During this lockdown ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra | SPEED TEST",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Speed Test Comparison... This video is all about comparing apple iphone 14 ..."
  ],
  [
    "iPhone 12 vs. Samsung Galaxy S20 FE Comparison! Which Is Better?",
    "Product Links! Samsung Galaxy S20 FE (Samsung link): http://techdaily.deals/S20FE Samsung Galaxy S20 FE (Amazon): ..."
  ],
  [
    "IPHONE VS  SAMSUNG:  LA BATALLA DE LOS SMARTPHONES",
    "En el mundo de los teléfonos móviles hay dos marcas compitiendo por la supremacía tecnológica. ¿Cuál ganará? Es momento ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra - Everything New!",
    "The Galaxy S21 Ultra is currently the king on the Android hill: with a gorgeous screen, powerful performance, and a long-range ..."
  ],
  [
    "Nothing Phone (1) vs Pixel 6a vs iPhone SE vs Samsung M53 - BEST 2022 Midrange?",
    "Nothing Phone (1) vs Pixel 6a vs iPhone SE vs Samsung Galaxy M53 - Design, Display, Cameras, Features & more! NEW ..."
  ],
  [
    "Zoom w iPhone vs Galaxy",
    "15x zoom iPhone 13 Pro 100x zoom Samsung Galaxy S22 Ultra ✓ Promocje na smartfony ..."
  ],
  [
    "iPhone 13 Pro vs Galaxy S22 - Was ist besser?",
    "Was ist besser - Samsung oder Apple? ich vergleiche heute ihre kompakten Smartphones! Rhinoshield*: \"alberteinstein\" ..."
  ],
  [
    "iPhone XS Face ID vs Samsung Note 9 Intelligent Scan.",
    "Testing the 2018 iPhone Xs / iPhone XS Max Face ID / Face Scanner against Intelligent Scan on the Samsung Galaxy Note 9!"
  ],
  [
    "APPLE vs SAMSUNG : qui est le roi du smartphone ?",
    "Aujourd'hui, vis le match de deux grandes entreprises de la tech : Apple VS Samsung. Cette vidéo vous explique la création de ..."
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra - BIGGEST CAMERA COMPARISON !",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra Ka Biggest Comparison Kiya ..."
  ],
  [
    "Samsung Galaxy Buds 2 vs Apple AirPods Pro [Honest Comparison]",
    "SAMSUNG GALAXY BUDS2 https://mikeobrienmedia.com/Galaxy-Buds2 APPLE AIRPODS PRO ..."
  ],
  [
    "Apple Watch Series 8 vs Samsung Galaxy Watch 5 Pro",
    "Sign up for my newsletter: https://dopetechdaily.net/newsletter Buy Galaxy Watch 5 Pro here: https://howl.me/ch7MPmVznpb Buy Z ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max - Speaker Quality Comparison",
    "I want you to listen to the Galaxy S22 Ultra and the iPhone 14 Pro Max speakers and tell me which one sounds better and higher ..."
  ],
  [
    "iPhone 13 Pro Max vs. Samsung Galaxy S22 Ultra Battery Test 🔋 Subscribe for more 🤝🏼",
    "Full video: https://youtu.be/5TL4HqVlz8M."
  ],
  [
    "Samsung Galaxy Z Fold 3 VS iPhone 13 Pro Max Review in Hindi",
    "In the world of technology if you talk about flagship smartphones then you have Samsung Galaxy Z Fold3 and iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 14 pro VS Samsung galaxy S22 ultra 😱 #shorts #youtubeshorts",
    ""
  ],
  [
    "iPhone 14 Vs Samsung Galaxy S22! (Comparison) (Review)",
    "Get The iPhone 14 Here: https://amzn.to/3qLgoYc Get The Samsung Galaxy S22 Here: https://amzn.to/3ScD5QM Get The ..."
  ],
  [
    "Display Technology | Samsung vs Apple",
    ""
  ],
  [
    "My Pick! - Samsung Galaxy Buds Pro VS  Apple Airpods Pro",
    "My Pick! - Samsung Galaxy Buds Pro VS Apple Airpods Pro Hey #TechGang This is Samsung Galaxy Buds Pro VS Apple Airpods ..."
  ],
  [
    "Apple iPhone 13 vs Samsung Galaxy S22 Plus: THE BEST!",
    "Get the Samsung Galaxy S22: https://geni.us/galaxys22 Get the iPhone 13: https://geni.us/iphne13 Samsung Galaxy S22 Ultra vs ..."
  ],
  [
    "iPhone 12 Pro Max vs Samsung Galaxy S20 Ultra SPEED TEST!",
    "iPhone 12 Pro Max vs Samsung Galaxy S20 Ultra speed test comparison! Which has fastest specs?! Get the iPhone 12 here: ..."
  ],
  [
    "Comparison: Apple iPad vs. Samsung Galaxy Tab A 10.1 2019",
    "Samsung Galaxy Tab A 10.1 2019 at Amazon: https://geni.us/galaxytaba2019 Apple iPad 6 at Amazon: https://geni.us/ipad2018 ..."
  ],
  [
    "Apple Watch 5 vs. Galaxy Watch Active 2",
    "Purchase Apple Watch Series 5 at Amazon: https://bit.ly/3s1kL0A Purchase Samsung Galaxy Watch Active 2 at Best Buy: ..."
  ],
  [
    "ULTIMATE Camera Comparison! Samsung A52s vs iPhone 12 vs Oneplus Nord 2",
    "Oneplus Nord 2 vs Samsung A52s 5G vs iPhone 12 Camera Comparison. Enjoy the video Like + Comment in this video for ..."
  ],
  [
    "Android phone vs Apple iphone...( part 1)#shorts",
    "Android phone vs Apple iphone...#shorts."
  ],
  [
    "Samsung S21 Ultra vs iPhone Battery Life Test!",
    "Full battery Life Drain Comparison of Samsung Galaxy S21 Ultra vs Samsung galaxy Note 20 Ultra vs Samsung Galaxy S20 Ultra ..."
  ],
  [
    "Samsung Galaxy S21 FE vs iPhone 13 SpeedTest and Camera Comparison",
    "Speed performance and Camera quality comparison of Samsung Galaxy S21 FE 5G with Apple iPhone 13 Galaxy S21 FE has ..."
  ],
  [
    "This Time You Pick! - iPhone 12 Pro Max vs Samsung Galaxy S21 Ultra!",
    "This Time You Pick! - iPhone 12 Pro Max vs Samsung Galaxy S21 Ultra! Hey #TechBarArmy Many of you were asking for this ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Speed Test",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Speed Test including Gaming, camera process test, rendering, apps opening ..."
  ],
  [
    "Which Phone is More Bulletproof? Samsung Galaxy vs iPhone",
    "How Many Samsung Galaxy Phones vs iPhones Does It Take To Stop a Bullet? S7, 6S & More vs FN FAL, AR-15, AK-47 Gun ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra Pubg Test, Heating and Battery Test | Shocked 😱",
    "In this video, I will do the pubg/bgmi test comparison between samsung s22 ultra vs iphone 14 pro max and also check out the ..."
  ],
  [
    "BEST PHONE IN THE WORLD! S22 Ultra or iPhone 13 Pro Max",
    "So, these could be the 2 best phones in the world - I've got the iPhone 13 Pro Max and the Samsung Galaxy S22 Ultra. Both are ..."
  ],
  [
    "நீங்களே சொல்லுங்க😎Apple ah! 🤷‍♂️Samsung ah! #Shorts #Apple #Samsung",
    "Media Partner : Adada Creators Email : techboss@adadacreators.com Subscribe   : http://bit.ly/2JmvIXb It would make my day ..."
  ],
  [
    "Would You Buy SAMSUNG Or APPLE?",
    "Follow me on IG: www.instagram.com/Nike_finesse Follow me on Tiktok: www.tiktok.com/@omgitsnikefinesse Like Comment ..."
  ],
  [
    "Apple iPhone 12 Pro Max vs Samsung Galaxy S21 Ultra in Sri Lanka",
    "Apple iPhone 12 Pro Max vs Samasung Galaxy S21 Ultra in Sri Lanka - Sinhala explain video .. Social Media තුල තමන් ..."
  ],
  [
    "Samsung Galaxy Tab S6 Lite vs Apple iPad 10.2 Full Comparison ⚡⚡⚡ And The Best Tablet Under 30K Is..",
    "Hello Friends Aaj Ke Video Me Hum Kar Rahe Hain Ek Bada Comparison- Samsung Galaxy Tab S6 Lite vs Apple iPad 10.2."
  ],
  [
    "iPhone 13 Pro vs Samsung Galaxy S21 Ultra vs Oneplus 9 Pro vs Xiaomi Mi 11 Ultra PUBG Test",
    "Apple iPhone 13 Pro is here, the company claims that the performance of this phone is 50% better than the competition. So we ..."
  ],
  [
    "Apple vs Samsung - Why the iPhone has better Resale Value in India!",
    "A look at why I feel iPhones in general have better resale values in India. Let me know what you think in the comments below, ..."
  ],
  [
    "Samsung Galaxy S8 Plus vs. iPhone 7 Plus Water Freeze Test 16 Hours! Which Is Best?!",
    "My new website for phone information: http://phoneinf.com/ We are back today with another interesting video for all smartphone ..."
  ],
  [
    "100x zooming Moon 🌙 iphone 14 pro max vs samsung s22 ultra  🤕#shorts kon ha winner 🏆",
    ""
  ],
  [
    "Why OnePlus Can&#39;t Beat Apple &amp; Samsung?",
    "According to the latest report of IDC in Q2 2020 best selling smartphone brand in india at above 50K price point is Apple. OnePlus ..."
  ],
  [
    "Samsung Galaxy Watch 4 VS Apple Watch Series 6 Comparison Review || in Telugu ||",
    "Samsung #GalaxyWatch4 #GalaxyWatch4Classic #apple #applewatchseries6 Watch 4 : https://bit.ly/3A3RAxg Watch 4 classic ..."
  ],
  [
    "Samsung S3 vs iPhone 5 which one turn on first?                #poweron #phones #test #galaxy",
    ""
  ],
  [
    "iPhone 14 vs SAMSUNG Galaxy A73 SPEED TEST",
    "Speed test Apple iPhone 14 and Samsung Galaxy A73 (snapdragon 778G 8/128)"
  ],
  [
    "Samsung Z Flip 4 vs iPhone 13",
    "Aaj humare setup par aagya hai Samsung Galaxy Z flip 4 so humne socha aaplogo ne unboxing to kafi dekhi hongi Kyo na ..."
  ],
  [
    "Galaxy S22 vs iPhone 13 Speed Test!",
    "Galaxy S22 vs iPhone 13 Speed Test! Samsung Galaxy S22 is Samsung's latest high end flagship smartphone and in this video, ..."
  ],
  [
    "Samsung S22 Ultra vs iPhone 13 Pro Max Camera Test",
    "Full Camera test comparison between Samsung Galaxy S22 Ultra and iPhone 13 Pro Max, including Zoom, Macro, 4K video, Mic ..."
  ],
  [
    "iPhone XS Max vs Samsung Galaxy Note 9",
    "Apple iPhone XS Max vs Samsung Galaxy Note 9 Full Comparison including hands-on Size, Design, Camera, S Pen, Battery ..."
  ],
  [
    "S22 Ultra vs iPhone 13 Pro Max – DON&#39;T Make a Mistake!",
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max. Comparing the Design, Display, Camera, Performance, Features, Battery ..."
  ],
  [
    "APPLE vs SAMSUNG",
    "ВКонтакте ▻ http://telblog.net/vk Автор Канала ▻ http://telblog.net/avtor Реклама на канале: ad@telblog.net."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra | SPEED TEST",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Speed Test Comparison... This video is all about comparing apple iphone 14 ..."
  ],
  [
    "Is iPhone 14 Pro Max BETTER Than Galaxy S22 Ultra? | Phone of the Year",
    "Is the new iPhone 14 Pro Max better than the Galaxy S22 Ultra? We'll take a look at the hardware, software, performance (and ..."
  ],
  [
    "Mate 50 Pro vs iPhone 14 Pro vs Pixel 7 Pro vs Galaxy S22 Ultra! Camera Comparison! | VERSUS",
    "Head to https://squarespace.com/versus to save 10% off your first purchase of a website or domain using code “versus”!"
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra In-Depth Comparison &amp; Review",
    "iPhone 13 Pro Max vs Galaxy S22 Ultra In-Depth Comparison & Review | InsideTech Review. Two of the best smartphones of ..."
  ],
  [
    "10 Reasons Why Apple is better than Samsung 2021",
    "10 Reasons Apple is better than Samsung 2021 - Hello all and welcome to this video discussion where I will give you my 10 ..."
  ],
  [
    "SAMSUNG S22 vs iPhone 13 | SPEED TEST",
    "iPhone 13 (amazon) https://amzn.to/2YkPnzX S22 (amazon) https://amzn.to/35txano Let's Connect: Facebook.com/techwisely ..."
  ],
  [
    "iPhone 14 Pro / 14 Plus vs Samsung Galaxy Z Flip 4 - Problem for Apple?",
    "iPhone 14 Pro vs Samsung Galaxy Z flip 4. Early specs based comparison between iPhone 14 Plus vs Galaxy Z Flip 4 including ..."
  ],
  [
    "iPhone SE vs. Galaxy A51 camera comparison",
    "You can buy iPhone SE and Galaxy A51 here... iPhone SE: https://bit.ly/38hukk0 Galaxy A51: https://bit.ly/2Xf9FH3 *CNET may get ..."
  ],
  [
    "iPhone 13 Pro Max vs. Galaxy S21 Ultra Drop Test!",
    "Check out the Anker 511 charger (Nano Pro): https://ankerfast.club/3CIN88k Big thanks to Anker for sponsoring this video!"
  ],
  [
    "iPhone 7 VS Samsung Galaxy S7 : Le Gros Comparatif !",
    "Comparaison en français de l'iPhone 7 d'Apple et du Galaxy S7 de Samsung ! ▻ Abonnez-vous, c'est gratuit | http://bit.ly/jojol67 ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max vs Galaxy S22 Ultra! Camera Comparison Test! | VERSUS",
    "Sony is back once again, looking to leave a mark with the Xperia 1 IV - with better point-and-click opportunities for casual users."
  ],
  [
    "Apple vs Samsung: Which One Is Bigger? (2021)",
    "Back in 2007, inventor and entrepreneur Steve Jobs revolutionised the cell phone market with the release of the Apple iPhone."
  ],
  [
    "iPhone vs Galaxy Z Fold 4 - The Truth",
    "iPhone vs Galaxy Z Fold 4 - The Truth! Apple iPhone vs Samsung Galaxy Z Fold 4 is a comparison for the ages and in this video, ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra Camera Test Comparison",
    "Apple iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra 5G Detailed Camera Comparison #SuperSafStyle ▻▻▻SUBSCRIBE for ..."
  ],
  [
    "Galaxy S22 vs iPhone 13 // Which Phone Should You Buy In 2022?",
    "dbrand // https://dbrand.com/?utm_source=TechNinja&utm_medium=youtube&utm_campaign=s22vsiphone Purchase S22 ..."
  ],
  [
    "BEST Smartphone Display Comparison - OnePlus 10 Pro vs Samsung S22 Ultra / iPhone 13 Pro Max / Mi 12",
    "Best Flagship Smartphone Display Comparison - OnePlus 10 Pro vs Samsung Galaxy S22 Ultra vs Xiaomi 12 Pro vs Apple ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max - Full Comparison",
    "In this video, we will compare the Samsung Galaxy S22 Ultra vs the iPhone 14 Pro Max. These smartphones are the biggest rivals ..."
  ],
  [
    "iPhone Vs Samsung😎🔥 #shorts #iPhone #Samsung",
    "Media Partner : Adada Creators Email : techboss@adadacreators.com Subscribe   : http://bit.ly/2JmvIXb It would make my day ..."
  ],
  [
    "iPhone 14 Pro vs Google Pixel 7 Pro vs Samsung Galaxy S22 vs Nokia 3310 - Which Is More Bulletproof?",
    "The ultimate smartphone shooting test. A single bullet through each of the 4 devices. Will any survive? Time to find out."
  ],
  [
    "Galaxy S22 Ultra vs iPhone 13 Pro Max Camera Video Test Comparison",
    "This is the next video in my Samsung Galaxy S22 Ultra Camera review videos. I wanted to do a separate Galaxy S22 Ultra vs ..."
  ],
  [
    "ECOSYSTEMS COMPARED: Samsung Galaxy vs Google Pixel",
    "Brands love ecosystems, but can you mix and match Google and Samsung products? What advantages are gained within ..."
  ],
  [
    "Samsung vs iPhone - Which one survives a Car CRASH!?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Galaxy S22 vs iPhone 13 - Which to choose?",
    "Galaxy S22 vs iPhone 13 - Which to choose? Samsung Galaxy S22 is Samsung's latest high-end flagship smartphone and ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Total DOMINATION",
    "iPhone 14 Pro Max will be made official today and the Samsung Galaxy S22 Ultra will be a direct competitor to Apple's latest ..."
  ],
  [
    "Samsung Galaxy Watch 5 vs Apple Watch Series 7 (Watch the Reveals)",
    "Samsung just revealed its all-new Galaxy Watch 5. See how the features stack up against the Apple Watch Series 7, revealed in ..."
  ],
  [
    "Samsung S3 vs iPhone 5 which one turn on first?                #poweron #phones #test #galaxy",
    ""
  ],
  [
    "iPhone 12 Pro vs Samsung Galaxy Note 20 Ultra Camera Test Comparison",
    "Apple iPhone 12 Pro vs Samsung Galaxy Note 20 Ultra 5G Detailed Camera Comparison #SuperSafStyle ▻BUY Samsung ..."
  ],
  [
    "BEST Smartphone Display Comparison - OnePlus 10 Pro vs Samsung S22 Ultra / iPhone 13 Pro Max / Mi 12",
    "Best Flagship Smartphone Display Comparison - OnePlus 10 Pro vs Samsung Galaxy S22 Ultra vs Xiaomi 12 Pro vs Apple ..."
  ],
  [
    "iPhone XS Max vs Samsung Galaxy Note 9",
    "Apple iPhone XS Max vs Samsung Galaxy Note 9 Full Comparison including hands-on Size, Design, Camera, S Pen, Battery ..."
  ],
  [
    "Samsung A53 vs iPhone 12 SPEED TEST &amp; CAMERA Comparison | Zeibiz",
    "Here's the speed test, camera test and comparison of the new Samsung A53 5G and Apple iPhone 12. Speed Test includes ..."
  ],
  [
    "Samsung Galaxy S9 Plus vs iPhone X - Sparkling Water FREEZE Test! What’s Gonna Happen?!",
    "Samsung Galaxy S9 vs iPhone X sparkling water freeze test! Drop these in freeze temps to test durability. What will happen?"
  ],
  [
    "Samsung vs iPhone vs WASHING MACHINE!",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "iPhone SE vs. Galaxy A51 camera comparison",
    "You can buy iPhone SE and Galaxy A51 here... iPhone SE: https://bit.ly/38hukk0 Galaxy A51: https://bit.ly/2Xf9FH3 *CNET may get ..."
  ],
  [
    "Samsung vs Apple vs OnePlus | तीनों में से कौन जीतेगा #shorts #factybrain",
    "Samsung vs Apple vs OnePlus | तीनों में से कौन जीतेगा #shorts #factybrain in this video- Samsung vs apple ..."
  ],
  [
    "CHOOSE WISELY! iPhone 14 Pro Max Vs. Galaxy Z Fold 4 HONEST Review!",
    "Whether you're looking for the iPhone 14 Pro Max, or the Galaxy Z Fold 4, today I decided to do an HONEST look at both of these ..."
  ],
  [
    "iPhone ios 16 VS Samsung android",
    "Thanks For Watching! Do Subscribe To Our Channel for Daily Tech Videos: ..."
  ],
  [
    "Apple 60Hz VS Other 120Hz Speed Test #shorts",
    ""
  ],
  [
    "Apple vs Samsung: Which One Is Bigger? (2021)",
    "Back in 2007, inventor and entrepreneur Steve Jobs revolutionised the cell phone market with the release of the Apple iPhone."
  ],
  [
    "iPhone 8 Plus vs Samsung Galaxy S8 Camera Comparison",
    "In this video, I put the camera of the iPhone 8 Plus against the camera of the Samsung Galaxy S8. Both of these are equipped with ..."
  ],
  [
    "Samsung A52 vs iPhone 12 SPEED TEST &amp; CAMERA Comparison | Zeibiz",
    "Here's the speed test, camera test and comparison of the new Samsung A52 and Apple iPhone 12! Let's see if Samsung A52 can ..."
  ],
  [
    "iPhone 12 Pro MAX vs Samsung Galaxy Note 20 Ultra Camera Test Comparison",
    "Apple iPhone 12 Pro Max vs Samsung Galaxy Note 20 Ultra 5G Detailed Camera Comparison #SuperSafStyle ▻BUY Samsung ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra SPEED TEST! Which is Boss?!",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra speed test comparison! Which is faster?! Battery drain has been minimal thus ..."
  ],
  [
    "APPLE vs SAMSUNG : qui est le roi du smartphone ?",
    "Aujourd'hui, vis le match de deux grandes entreprises de la tech : Apple VS Samsung. Cette vidéo vous explique la création de ..."
  ],
  [
    "iPhone vs Samsung 😱 कौन बचाएगा 🤯 acid के कहर से 😲 #shorts",
    "iPhone vs Samsung कौन बचाएगा acid के कहर से #youtubeshorts #ytshorts #iPhonevssamsung -----tags----- ..."
  ],
  [
    "@Apple VS @Samsung I Rating",
    "no hate in this video."
  ],
  [
    "1000 ft Drop Test - iPhone 11 Vs. Samsung S10 Vs. Nokia 3310",
    "Can the iPhone 11 and Samsung S10 beat the unbreakable Nokia 3310? SUBSCRIBE ➤ http://bit.ly/SubHowRidiculous The ..."
  ],
  [
    "Samsung TROLLS Apple and iPhone 14 Pro AGAIN!",
    "Samsung is mocking Apple and the iPhone 14 yet again just minutes after the Apple event for the iPhone 14 lineup ended."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Is It FAIR?",
    "This is NOT gonna end well… So for the longest time it's been Samsung versus Apple, Galaxy versus iPhone, up to the point ..."
  ],
  [
    "iPhone 12 Pro vs Samsung S21 Ultra vs OnePlus 8 Pro vs Google Pixel 5",
    "Instantly Unlock Our Free Filmmaking Workshop \"10 Secrets To Cinematic Shots\": ..."
  ],
  [
    "SAMSUNG S22 Ultra vs 13 Pro Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW S22 Ultra 5G (amazon) https://amzn.to/36FJUrf Let's Connect: ..."
  ],
  [
    "APPLE VS SAMSUNG QUALITY",
    ""
  ],
  [
    "OnePlus 10 Pro vs Samsung Galaxy S22+ vs iPhone 13 | Cell Guru",
    "The OnePlus 10 Pro is now official. The flagship smartphone from OnePlus has a top-notch price to go with it. But does it justify its ..."
  ],
  [
    "Nokia vs Samsung vs iPhone Hydraulic Press meme #Shorts",
    "nokia #samsung #iphone #HydraulicPress #meme."
  ],
  [
    "Samsung A33 vs iPhone 11 Speed Test &amp; Camera Comparison",
    "Samsung A33 vs iPhone 11 Speed Test & Camera Comparison... In this video we are doing speed test between a mid range ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max: Camera Shootout",
    "Samsung Galaxy S22 Ultra and iPhone 13 Pro Max: The best phones Android and iOS users can buy today. Both are packed with ..."
  ],
  [
    "Apple vs Android 🤖 what’s better? iPhone vs Samsung iOS",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max! Battle!",
    "Bugungi videoda Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max o'rtasida battle o'tkazamiz. Izohlarda o'z fikringizni ..."
  ],
  [
    "iPhone 14 Pro Max vs OnePlus 10 Pro vs Samsung S22 Ultra vs Xiaomi 12s Ultra - Charging Speed Test",
    "The Apple iPhone 14 Pro Max with a really 4323mAh battery Size and 27W of Lighting Fast Charging, lets see how it stands up ..."
  ],
  [
    "ANDROID V/S IPHONE (APPLE) FUNNY MEME😂🤣👆👇😂",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra VS Apple iPhone 14 Pro Max Under Water Testing Champ?🤔🧐 #shorts #shortvideo",
    ""
  ],
  [
    "Huawei P40 Pro vs Samsung S20 Ultra vs iPhone 11 Pro Max Camera Test Comparison!",
    "4K Camera Test - Huawei P40 Pro Camera vs Samsung Galaxy S20 Ultra Camera vs iPhone 11 / iPhone 11 Pro Max Camera ..."
  ],
  [
    "Samsung Knox: Official Introduction Film | Samsung",
    "The world changed. Unforeseen threats are everywhere, making it critical you and your mobile life are protected thoroughly."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Camera Test",
    "Camera Comparison between the brand new iPhone 14 Pro Max against its biggest rival the Samsung Galaxy S22 Ultra."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "iPhone 13 pro Max Vs Samsung Galaxy S22 Ultra | কে আসল রাজা !",
    "My Facebook ID : https://rb.gy/plksne My Facebook Page : https://rb.gy/hawzqg ＬＩＫＥ | ＣＯＭＭＥＮＴ | ＳＨＡＲＥ ..."
  ],
  [
    "Samsung MOCKS iPhone 14 Pro",
    "Apple will launch the iPhone 14 lineup in a few days of time and Samsung thinks it's the perfect opportunity to mock Apple and the ..."
  ],
  [
    "Samsung Z Fold 4 vs iPhone 13 Pro Max - SPEED TEST! *SHOCKING*",
    "Apple iPhone 13 Pro Max vs Samsung Galaxy Z Fold 4 OFFICIAL Speed Test Comparison. The Z Fold4 has 12GB RAM and runs ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - SPEED TEST (SHOCKING)",
    "iPhone 14 Pro Max and the Samsung Galaxy S22 Ultra represent the best that Apple and Samsung have to offer. They both have ..."
  ],
  [
    "Apple vs Samsung Company comparison 2022|Samsung vs Apple comparison in Hindi #Shorts #Short #Viral",
    "Apple #Samsung #Samsung_vs_Apple_comparison #Apple_vs_samsung #Youtube_shorts #Shorts #Short_feed #trending ..."
  ],
  [
    "MEJOR CAMARA de MOVIL en 2022!! 🔥 Galaxy S22 Ultra vs iPhone 14 Pro, Huawei Mate 50 Pro, Pixel y ...",
    "Cuál es la mejor camara del año 2022 en un smartphone o teléfono móvil? Comparativa de los test de cámara extremos entre ..."
  ],
  [
    "Samsung and Google are at War.",
    "Samsung and Google hate each other. From the Samsung Galaxy Smartphones to the Google Pixel, they've been waging a war ..."
  ],
  [
    "IPHONE VS  SAMSUNG:  LA BATALLA DE LOS SMARTPHONES",
    "En el mundo de los teléfonos móviles hay dos marcas compitiendo por la supremacía tecnológica. ¿Cuál ganará? Es momento ..."
  ],
  [
    "SAMSUNG VS APPLE | क्यों है इतनी दुश्मनी? Why APPLE &amp; SAMSUNG hate each other",
    "Coding Ninjas - India's leading platform for all coding courses & placement preparations is hosting Scholarship Test on 21st ..."
  ],
  [
    "iPhone 14 Pro Max vs OnePlus 10 Pro vs Samsung S22 Ultra vs Xiaomi 12s Ultra - Charging Speed Test",
    "The Apple iPhone 14 Pro Max with a really 4323mAh battery Size and 27W of Lighting Fast Charging, lets see how it stands up ..."
  ],
  [
    "Samsung Galaxy S22 Ultra VS Apple iPhone 14 Pro Max Under Water Testing Champ?🤔🧐 #shorts #shortvideo",
    ""
  ],
  [
    "Sie hat rasiert!😂 | IPHONE vs. SAMSUNG | Teamnice",
    "Twitch Account | https://www.twitch.tv/ahnicelive Original Video: https://youtu.be/SaOWIfA2EZU Instagram ▻ aahnice Snapchat ..."
  ],
  [
    "iPhone 11 Pro Max vs Samsung Galaxy S10 Plus in late 2022!",
    "Thank you guys for subscribing, rating and commenting my videos in advance. Your support means a lot to me. Welcome to ..."
  ],
  [
    "iPhone 14 PLUS vs Galaxy S22 PLUS!! Apple vs Samsung 2022 🔥",
    "Comparativa del iPhone 14 Plus vs Galaxy S22 Plus!! Apple vs Samsung, iPhone vs Galaxy, además iOS vs Android. Los mejores ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max: Camera Shootout",
    "Samsung Galaxy S22 Ultra and iPhone 13 Pro Max: The best phones Android and iOS users can buy today. Both are packed with ..."
  ],
  [
    "iPhone ios 16 VS Samsung android",
    "Thanks For Watching! Do Subscribe To Our Channel for Daily Tech Videos: ..."
  ],
  [
    "iPhone 7 vs. Samsung Galaxy S7 Water Freeze Test 10 Hours! What Will Happen?!",
    "iPhone 7 (USA Link) - http://amzn.to/2mLSNaP Galaxy S7 (USA Link - http://amzn.to/2lOa7Xx We are back today with another ..."
  ],
  [
    "iPhone vs Samsung - Best Smartphone ? #shorts",
    "Aagar video acchi lage to subscribe or like karna na bhule."
  ],
  [
    "MEJOR CAMARA de MOVIL en 2022!! 🔥 Galaxy S22 Ultra vs iPhone 14 Pro, Huawei Mate 50 Pro, Pixel y ...",
    "Cuál es la mejor camara del año 2022 en un smartphone o teléfono móvil? Comparativa de los test de cámara extremos entre ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - SPEED TEST (SHOCKING)",
    "iPhone 14 Pro Max and the Samsung Galaxy S22 Ultra represent the best that Apple and Samsung have to offer. They both have ..."
  ],
  [
    "Tiles hop  I phone vs Samsung vs Nokia Ringtones remix #tileshop  #iphone #samsung #nokia #musicgame",
    "Tiles hop I phone vs Samsung vs Nokia Ringtones remix #tileshop #iphone #samsung #nokia #musicgame Software :- power ..."
  ],
  [
    "Samsung S21 FE VS Google Pixel 6a | iPhone 12 Buy Or Not? | Best Deal Of The Year | With @Tech4mob",
    "Dosto aaj humne aapki bahot sari confusion dur karne ki koshish ki hai flipkart big billion days me bahot mst offers mil re hai to ..."
  ],
  [
    "iPhone 12 Pro Max vs Samsung Note 20 Ultra / Huawei / Xiaomi / OnePlus Battery Life DRAIN Test.",
    "iPhone 12 Pro Max full battery life test comparison vs Samsung Galaxy Note 20 Ultra, Huawei Mate 40 Pro, Xiaomi Mi 10 Ultra, ..."
  ],
  [
    "Dropping Samsung Galaxy Fold vs iPhone 11 Pro Max vs Nokia 3310 Down Spiral Staircase - 20 Stories",
    "I dropped the most iconic smartphones of 2019 to see which one holds up the best in this durability drop test! FACEBOOK: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max! Battle!",
    "Bugungi videoda Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max o'rtasida battle o'tkazamiz. Izohlarda o'z fikringizni ..."
  ],
  [
    "IPHONE VS  SAMSUNG:  LA BATALLA DE LOS SMARTPHONES",
    "En el mundo de los teléfonos móviles hay dos marcas compitiendo por la supremacía tecnológica. ¿Cuál ganará? Es momento ..."
  ],
  [
    "APPLE vs SAMSUNG : qui est le roi du smartphone ?",
    "Aujourd'hui, vis le match de deux grandes entreprises de la tech : Apple VS Samsung. Cette vidéo vous explique la création de ..."
  ],
  [
    "iPhone vs Nokia vs Samsung on Hydraulic press 😱 | कौन जीतेगा || #shorts",
    "iPhone vs Nokia vs Samsung on Hydraulic press | कौन जीतेगा || #shorts #shorts #viralshorts #trendingshorts ..."
  ],
  [
    "iPhone 12 Pro vs Samsung S21 Ultra vs OnePlus 8 Pro vs Google Pixel 5",
    "Instantly Unlock Our Free Filmmaking Workshop \"10 Secrets To Cinematic Shots\": ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "Google Pixel 7 Pro vs Samsung S22 Ultra / iPhone 14 Pro Max / Xiaomi 12s Ultra - BATTERY DRAIN TEST!",
    "Google Pixel 7 Pro Tensor G2 vs Pixel 6 Pro vs Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra vs OnePlus 10 Pro vs ..."
  ],
  [
    "iPhone 14 vs SAMSUNG Galaxy A53 SPEED TEST",
    "Speed test Samsung Galaxy A53 (exynos 1280 8/256) and iPhone 14."
  ],
  [
    "iPhone X vs Samsung Galaxy S8",
    "Apple iPhone X vs Samsung Galaxy S8 Full Comparison including hands-on Size, Design, Camera, Battery & Price ..."
  ],
  [
    "iPhone 14 Pro vs. S22 Ultra vs. Pixel 7 Pro: 1,000 photos later",
    "This year even the iPhone 14 Pro has a 48MP camera which is still half as many as the 108MP of the Samsung S22 Ultra but ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison",
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison. Which is the best flagship camera setup?"
  ],
  [
    "Apple iPhone 13 Pro Max vs Samsung Galaxy S22 Ultra! Kdo s koho?",
    "Apple iPhone 13 Pro Max - https://www.huramobil.cz/apple-iphone-13-pro-max/ Samsung Galaxy S22 Ultra ..."
  ],
  [
    "Apple vs Android 🤖 what’s better? iPhone vs Samsung iOS",
    ""
  ],
  [
    "iPhone 11 vs Samsung Galaxy S10 Lite | Camera comparison",
    "It's time for another camera comparison and this time we are going to compare the iPhone 11 and the Samsung Galaxy S10 Lite."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra / Xiaomi 12S Ultra / OnePlus 10 Pro - BATTERY DRAIN TEST!",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max vs Xiaomi Mi 12s Ultra vs OnePlus 10 Pro vs ..."
  ],
  [
    "iPhone 13 vs Galaxy S22 Battery Life DRAIN Test",
    "For those curious, the Galaxy S22 used in this video is a U.S. model with the Snapdragon processor. Twitter: ..."
  ],
  [
    "iPhone vs Android - Which one survives FREEZING?",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Galaxy s22 vs iPhone 13",
    "Galaxy S22 vs iPhone 13 startup. The splash screen ruins it."
  ],
  [
    "iPhone vs Samsung Camera Testing 😱😱 #shorts #youtubeshorts #viral #ytshorts",
    ""
  ],
  [
    "Samsung Galaxy S21 FE vs iPhone 13 Camera Test Comparison",
    "As a part of my Samsung Galaxy S21 FE review I wanted to include the Galaxy S21 FE camera vs iPhone 13 camera comparison ..."
  ],
  [
    "Insane iPhone 13 vs Samsung Galaxy S22 Ultra Speed Test! 🤯 (WiFi 6E)",
    "Comparing the speed of the Samsung Galaxy S22 Ultra's WiFi 6E to the iPhone 13 Pro Max WiFi 6. As you can see, WiFi 6E has ..."
  ],
  [
    "Dropping iPhone 11 Pro vs Note 10 vs Huawei Mate 30 Down Spiral Staircase Deep Hole - What Happens?",
    "I found another crazy spiral staircase and decided to drop 3 of the latest smartphones in there! FACEBOOK: ..."
  ],
  [
    "Samsung Knox: Official Introduction Film | Samsung",
    "The world changed. Unforeseen threats are everywhere, making it critical you and your mobile life are protected thoroughly."
  ],
  [
    "Samsung Galaxy Tab S6 Lite vs Apple iPad 10.2 (7th Gen) Comparison 🔥🔥🔥 The Best Tablet Under 30K?",
    "Which is the best Tablet for Students , Teachers , Work , Professionals & Others under Budget of Rs.30000/- Full Comparison with ..."
  ],
  [
    "Samsung Galaxy S21 Ultra vs iPhone 12 Pro Max Camera Test Comparison",
    "Samsung Galaxy S1 Ultra 5G vs Apple iPhone 12 Pro Max Detailed Camera Comparison #SuperSafStyle ▻BUY Samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Speed Test!",
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max Speed Test. Time for the epic S22 Ultra vs iPhone 13 Pro Max Speed Test ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro vs Xiaomi 12S Ultra Camera Test Comparison",
    "Camera Test comparison between the iPhone 14 Pro Max, Samsung Galaxy S22 Ultra, Google Pixel 7 Pro and Xiaomi 12S Ultra ..."
  ],
  [
    "iPhone 14 Pro MAX vs 100X Super Zoom Samsung S22 Ultra Zoom Test",
    "100X Super Zoom - iPhone 14 Pro Max vs Samsung S22 Ultra Zoom Test iPhone 14 Pro MAX Review ..."
  ],
  [
    "Apple vs Samsung &quot;Reklam Savaşları&quot;",
    "Reklam Savaşlarına aynı şekilde devam ediyoruz. Bu videoda konuğumuz Apple ve Samsung. Bu sert mücadeleye gelin birlikte ..."
  ],
  [
    "iPhone 14 Pro vs Samsung S22 Ultra 4K @60FPS Zoom Comparison",
    "iPhone 14 Pro Vs Samsung S22 Ultra Video Zoom Comparison #Shorts Shooting in 4K @60FPS on both. Samsung maxes out at ..."
  ],
  [
    "100X killer Zoom Phone😍  - iPhone 13 Pro Max vs Galaxy S22 Ultra Zoom Test",
    "Detailed Comparison: https://youtu.be/j_maGRIAzLE Hey, Guys, This is the Zoom Test between Samsung Galaxy S22 Ultra and ..."
  ],
  [
    "iPhone vs Samsung - 1% Battery Left | Which will DIE First?",
    "Apple iPhone 14 Pro Max vs Samsung S22 Ultra - 1% Battery Left | Which Lives Longer?"
  ],
  [
    "iPhone 14 pro Max vs Vivo X80 Pro vs Samsung S22 Ultra Camera Test |",
    "Jaldi aur videos bhi aayege Thank you Amlli , Rahul , Aditya . My Vlog Channel - @SauravAnurajVlogs My social media link ..."
  ],
  [
    "iPhone 13 Pro vs Samsung A13 Speed Test",
    "Apple iPhone 13 Pro vs Samsung Galaxy A13 Speed Testing Apple iPhone 13 Pro Amazon Link Click&Buy: ..."
  ],
  [
    "Samsung vs iPhone Camera Zoom! 😱",
    "Do consider subscribing! #shorts #tech #iPhone #Samsung."
  ],
  [
    "Samsung Galaxy S21 Ultra vs iPhone 12 Pro Max Camera Test Comparison",
    "Samsung Galaxy S1 Ultra 5G vs Apple iPhone 12 Pro Max Detailed Camera Comparison #SuperSafStyle ▻BUY Samsung ..."
  ],
  [
    "iPhone vs Nokia vs Samsung on Hydraulic press 😱 | कौन जीतेगा || #shorts",
    "iPhone vs Nokia vs Samsung on Hydraulic press | कौन जीतेगा || #shorts #shorts #viralshorts #trendingshorts ..."
  ],
  [
    "🤷‍♂️ SAMSUNG is BETTER than APPLE ? 🫠",
    "apple #techboss #samsung #studiodisplay Time Stamp ****************************** 00:00 Intro 00:10 Studio Display Unboxing ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Speed Test!",
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max Speed Test. Time for the epic S22 Ultra vs iPhone 13 Pro Max Speed Test ..."
  ],
  [
    "8 Years Old iPhone vs 6 Years Old Samsung - Flagship Phones🔥🔥",
    "Get free Apple stock- https://indmoney.onelink.me/RmHC/3bknil0r Dosto, this is my old flagship smartphone battle Samsung vs ..."
  ],
  [
    "Dropping iPhone 11 Pro vs Note 10 vs Huawei Mate 30 Down Spiral Staircase Deep Hole - What Happens?",
    "I found another crazy spiral staircase and decided to drop 3 of the latest smartphones in there! FACEBOOK: ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra: Spec Comparison",
    "The brand-new flagship iPhone 14 Pro Max is here. Check out the two phones here  : iPhone 14 Pro Max: ..."
  ],
  [
    "iPhone 13 Pro vs Samsung A13 Speed Test",
    "Apple iPhone 13 Pro vs Samsung Galaxy A13 Speed Testing Apple iPhone 13 Pro Amazon Link Click&Buy: ..."
  ],
  [
    "Samsung Knox: Official Introduction Film | Samsung",
    "The world changed. Unforeseen threats are everywhere, making it critical you and your mobile life are protected thoroughly."
  ],
  [
    "iPhone 14 Pro Vs Samsung Galaxy S22! (Comparison) (Review)",
    "Get The iPhone 14 Here: https://amzn.to/3qLgoYc Get The Samsung Galaxy S22 Here: https://amzn.to/3ScD5QM Get The ..."
  ],
  [
    "iPhone vs Samsung Camera Testing 😱😱 #shorts #youtubeshorts #viral #ytshorts",
    ""
  ],
  [
    "Nokia vs Samsung vs iPhone Durability Test meme #Shorts",
    "nokia #samsung #iphone #durability #meme."
  ],
  [
    "Samsung Galaxy S21 FE vs iPhone 13 Camera Test Comparison",
    "As a part of my Samsung Galaxy S21 FE review I wanted to include the Galaxy S21 FE camera vs iPhone 13 camera comparison ..."
  ],
  [
    "BEST Smartphone Display Comparison - OnePlus 9 Pro vs Samsung S21 Ultra / Mi 11 Ultra / iPhone 12",
    "In this Video Let's do the best Flagship Display Comparison, Best Display in a Smartphone. OnePlus 9 Pro vs Samsung Galaxy ..."
  ],
  [
    "Camera Test: OnePlus 9 vs iPhone 12 vs Samsung Galaxy S21!",
    "Product Links! OnePlus 9 (Best Buy): https://techdaily.deals/OnePlus9 Samsung S21 (Amazon): https://geni.us/j2jBFT Samsung ..."
  ],
  [
    "Why I Use a Samsung Phone (and NOT iPhone)",
    "This is why I use a Samsung phone and not an iPhone. I recently got a new phone, the Samsung Galaxy S21. Before getting my ..."
  ],
  [
    "OPPO Reno 8 Pro Camera Test | ft iPhone 13 vs Samsung S22 Ultra",
    "In this video we will do full camera review of of latest @OPPO India OPPO Reno 8 Pro and a detailed comparison along with the ..."
  ],
  [
    "Android vs iPhone: who&#39;s got better INSULTS 😡",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Apple vs. Samsung: Inside the Jury Room",
    "The inside story of how the Apple and Samsung patent verdict came down reveals a group divided on some issues in an ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max Camera Test Comparison",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Detailed Camera Comparison #SuperSafStyle ▻BUY Samsung Galaxy ..."
  ],
  [
    "iPhone SE 2020 or Galaxy S10 Lite - It’s Apple vs Samsung Again!!!",
    "In this video we are going to compare the iPhone SE 2020 with the Samsung Galaxy S10 Lite to find out which device is the better ..."
  ],
  [
    "Z Flip 4 Honest Review after 1 week: Better than iPhone?",
    "I've been an iPhone user for the past 6 years, but I finally decided to DITCH my iPhone for 1 week and see how I like this new ..."
  ],
  [
    "iPhone XR vs. Galaxy S10E camera comparison",
    "The Galaxy S10E has dual rear cameras, one of which uses an ultrawide lens that's insanely fun for photography. So how does ..."
  ],
  [
    "GUERRA DE MARCAS! (Samsung vs Apple)",
    ""
  ],
  [
    "Samsung Watch 4 Vs Apple watch Series 6 | Samsung Vs Apple Smartwatch Speed test #shorts #viral",
    ""
  ],
  [
    "யார்கிட்ட 🧲 MAGNET Power 💪அதிகம்? APPLE VS SAMSUNG | Tamil Tech #shorts #apple #samsung",
    "யார்கிட்ட MAGNET Power அதிகம்? APPLE VS SAMSUNG | Tamil Tech #shorts #apple #samsung ..."
  ],
  [
    "iPhone 12 vs Samsung Galaxy M51 camera comparison - Shocking Results! | Rs 80,000 vs Rs 25,000 phone",
    "In this video we do a very fun iPhone 12 Camera Comparison where we do an iPhone 12 Camera Test vs a Mid Ranger, the ..."
  ],
  [
    "Apple V. Samsung Legal Brawl Continues",
    "The stakes are high, and not just because Apple wants $2.5 billion in damages."
  ],
  [
    "iPhone 14 Pro vs Samsung Galaxy S22 Ultra",
    "iPhone 14 Pro vs Samsung Galaxy S22 Ultra comparison."
  ],
  [
    "iPhone 12 Pro Max VS Galaxy Note 20 Ultra : le Gros Comparatif !",
    "Le gros fight entre : Galaxy Note 20 Ultra et l'iPhone 12 Pro Max ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ J'ai acheté un Faux ..."
  ],
  [
    "iPhone 11 Pro Max vs Samsung Galaxy S20+ Practically Compared",
    "iPhone 11 Pro Max vs Samsung Galaxy S20+ Flagship Smartphones compared including camera comparison with tons of ..."
  ],
  [
    "Samsung Galaxy S22 VS iPhone 13 Camera Comparison!",
    "The Ultimate Camera Comparison between the Samsung Galaxy S22 and the iPhone 13! Throughout this video you will be able ..."
  ],
  [
    "Samsung A73 vs iPhone 11 | SPEED TEST",
    "Samsung A73 vs iPhone 11 Speed Test Compariso... #Samsung#Galaxya73#iPhone SUBSCRIBE our channel for more great ..."
  ],
  [
    "iPhone 14 Pro vs Pixel 7 Pro vs Galaxy S22 Ultra: Camera Test Comparison!",
    "A detailed camera comparison test of the iPhone 14 Pro vs Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra! Let's compare photo ..."
  ],
  [
    "iPhone User Tries Samsung | Z Fold 4 and Z Flip 4",
    "Samsung Z Fold 4 - https://howl.me/ch8VQsXue4k Samsung Z Flip 4 - https://howl.me/ch8VPyQd3TI Save up to $1200 on the new ..."
  ],
  [
    "অ্যাপেল VS স্যামসাং কে পৃথিবীর সেরা কোম্পানি ? 😱😱 || Apple and Samsung comparison in Bangla",
    "অ্যাপেল VS স্যামসাং কে পৃথিবীর সেরা কোম্পানি ? || Apple and Samsung comparison ..."
  ],
  [
    "Samsung All Folding phone VS iphone 13 Pro max",
    ""
  ],
  [
    "Pixel 6 Pro vs iPhone 13 Pro Max vs Galaxy S21 Ultra: Camera Comparison",
    "Buy Google Pixel 6 Pro: https://bestbuy.7tiv.net/b32xbP Buy iPhone 13 Pro Max: https://amzn.to/3GN0pzE Buy Galaxy S21 Ultra: ..."
  ],
  [
    "Samsung vs iPhone vs Car | iPhone vs Samsung #Shorts #Short #iPhonevsSamsungvsCar",
    "Shorts #Short #IPhone #Samsung #iPhonevsSamsung #SamsungvsiPhonevsCar #SamsungvsiPhone samsung galaxy vs ..."
  ],
  [
    "Samsung Galaxy S20 Ultra vs iPhone 11 Pro Max Camera Test Comparison",
    "Samsung Galaxy S20 Ultra 5G vs Apple iPhone 11 Pro Max Detailed Camera Comparison #SuperSafStyle ▻▻▻SUBSCRIBE for ..."
  ],
  [
    "iPhone 11 Pro Max vs Samsung Galaxy Note 10 Plus - CAMERA Comparison! | The Tech Chap",
    "Which phone has the best camera - iPhone 11 Pro Max vs Samsung Galaxy Note 10 Plus? I compare Photos, Videos, Selfies, ..."
  ],
  [
    "Samsung S22 Ultra vs iPhone 13 pro Max Zoom test .",
    "iphone 13 pro max vs samsung s22 ultra zoom test."
  ],
  [
    "Reklam Savaşları (Apple vs Samsung @Tasarımcı Dayı) | RRaenee",
    "iyi seyirler coni Discord'u Yeni Açtık Gel! https://discord.cfyt.me • Beni diğer platformlarda takip et; https://instagram.com/cFyt.avi ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung S22 Ultra Video Zoom Comparison - 4K @30FPS",
    "iPhone 13 Pro Max Vs Samsung S22 Ultra 4K @30FPS Video Zoom Comparison using default settings #Shorts If you think they ..."
  ],
  [
    "Xiaomi 12T Pro Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison",
    "Xiaomi 12T Pro Vs iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Comparison. Does 200MP make a big difference? Which is ..."
  ],
  [
    "Galaxy S21 Ultra VS iPhone 12 Pro Max : le Gros Comparatif ! (lequel acheter ?)",
    "Le gros fight : le Samsung Galaxy S21 Ultra et l'iPhone 12 Pro Max ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ En savoir plus sur ..."
  ],
  [
    "Samsung vs Apple Kiska hai Mast Camera?? S22Ultra vs iPhone 13Pro",
    "Samsung 22 Ultra vs iPhone 13 Pro - Which One is Best For YOU? Full Comparison https://youtu.be/Y1OCfYoU5OE New Gaming ..."
  ],
  [
    "Apple vs. Samsung: Jury Gets Its Final Exam",
    "A federal court jury is set to begin tackling several points in the high stakes patent case between Apple and Samsung, and both ..."
  ],
  [
    "&quot;iPhone vs Android&quot;",
    "You guys asked for it, here it is... fresh out the toaster. If ya like the rap battles please consider supporting: Patreon: ..."
  ],
  [
    "iPhone 14 Pro Max vs. Samsung Galaxy S22 Ultra Charging Test🔌Subscribe for more 🤙🏼",
    "Full video: https://youtu.be/dTQA9sjIIpA."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Xiaomi 13 Pro Vs iPhone 14 Pro Max",
    "Xiaomi 13 Pro Vs S22 Ultra Vs 14 Pro Max | Full Comparison | Which one is best for you ? ▻Please Comment Which Phone is ..."
  ],
  [
    "Samsung Vs IPhone battle 🤞🥳🤪",
    "samsung vs iphone, samsung vs iphone camera, samsung vs iphone camera zoom, samsung vs iphone 14, samsung vs iphone ..."
  ],
  [
    "Iphone 13  VS Galaxy S21 fe zoom Test 🔥🔥 || sajjad parasara",
    ""
  ],
  [
    "অ্যাপেল VS স্যামসাং কে পৃথিবীর সেরা কোম্পানি ? 😱😱 || Apple and Samsung comparison in Bangla",
    "অ্যাপেল VS স্যামসাং কে পৃথিবীর সেরা কোম্পানি ? || Apple and Samsung comparison ..."
  ],
  [
    "iPhone 11 Pro Max vs Samsung Galaxy Note 10 Plus - CAMERA Comparison! | The Tech Chap",
    "Which phone has the best camera - iPhone 11 Pro Max vs Samsung Galaxy Note 10 Plus? I compare Photos, Videos, Selfies, ..."
  ],
  [
    "Samsung Galaxy S20 Ultra vs iPhone 11 Pro Max Camera Test Comparison",
    "Samsung Galaxy S20 Ultra 5G vs Apple iPhone 11 Pro Max Detailed Camera Comparison #SuperSafStyle ▻▻▻SUBSCRIBE for ..."
  ],
  [
    "Android vs iPhone: who&#39;s got better INSULTS 😡",
    "Do consider subscribing to my Shorts Channel! Main Mrwhosetheboss YouTube Channel: ..."
  ],
  [
    "Z Flip 4 Honest Review after 1 week: Better than iPhone?",
    "I've been an iPhone user for the past 6 years, but I finally decided to DITCH my iPhone for 1 week and see how I like this new ..."
  ],
  [
    "iphone users be like",
    "phone users be like."
  ],
  [
    "iPhone 6/6 Plus vs Samsung Galaxy S5 - Camera Test Comparison",
    "Apple iPhone 6/6 Plus vs Samsung Galaxy S5 Hands-On Camera Comparison. Comapring the 720p/1080p front-facing cameras, ..."
  ],
  [
    "Xiaomi 12T Pro Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison",
    "Xiaomi 12T Pro Vs iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Comparison. Does 200MP make a big difference? Which is ..."
  ],
  [
    "The BEST Night Camera! Pixel 7 Pro vs iPhone 14 Pro vs Galaxy S22 Ultra vs Xiaomi 12s Ultra | VERSUS",
    "Head to https://squarespace.com/versus to save 10% off your first purchase of a website or domain using code “versus” Well, ..."
  ],
  [
    "iPhone SE (2020) vs Samsung Galaxy A51 Practically Compared",
    "In this video I compare the new iPhone SE 2 (2020 Edition) with the Samsung Galaxy A51 mid-range android phone to show you ..."
  ],
  [
    "iPhone 13 Pro VS Samsung Galaxy S22 Ultra - CHI VINCE?",
    "Samsung S22: https://amzn.to/3uFNRq0 Samsung S22 Plus: https://amzn.to/3gBKGaG Samsung S22 Ultra: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra / Xiaomi 12S Ultra / OnePlus 10 Pro - BATTERY DRAIN TEST!",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max vs Xiaomi Mi 12s Ultra vs OnePlus 10 Pro vs ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra : le gros comparatif !",
    "Lequel choisir ? Galaxy S22 Ultra vs iPhone 14 Pro Max. ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Acheter les protections ..."
  ],
  [
    "IPhone 13 Pro Max vs Samsung Galaxy Z Flip 3 5G",
    ""
  ],
  [
    "The ULTIMATE Phone Battery Test! (iPhone 14 Pro Max vs Galaxy S22 Ultra vs Pixel 7 Pro...)",
    "Testing 10 Flagship Phones from Apple, Samsung, Google, Xiaomi & OnePlus, Oppo, HONOR, Vivo & ROG to find out which has ..."
  ],
  [
    "HANGİSİ DÖVER: Apple VS Samsung",
    "HANGİSİ DÖVER'in bu bölümünde Samsung ile Apple 'ı telefonları üzerinden kapıştırıyoruz. iPhone Xs ve S10+ ile ön plana ..."
  ],
  [
    "Xiaomi 12S Ultra Review - This is Game-Changing.",
    "Full review of the Xiaomi 12S Ultra, and comparison vs Samsung Galaxy S22 Ultra - including camera, battery, screen, specs, ..."
  ],
  [
    "How Apple and Nike have branded your brain | Your Brain on Money | Big Think",
    "How Apple and Nike have branded your brain Watch the newest video from Big Think: https://bigth.ink/NewVideo Learn skills from ..."
  ],
  [
    "iPhone 6 vs Samsung Galaxy S5 - Speed Test",
    "iPhone 6 vs Samsung Galaxy S5 Speed and performance test, with Geekbench 3 Benchmark, Boot up test, Browser, apps and ..."
  ],
  [
    "¡Esto es MUY DURO! iPhone 14 Pro Max vs Galaxy S22 Ultra",
    "Cómpralos desde aquí: iPhone: https://bit.ly/3DoIlwb Galaxy: https://amzn.to/3dUQmid Descubre nuestra web Compra ..."
  ],
  [
    "Samsung Galaxy Z Flip 4 - Why I NEARLY Switched.",
    "First Impressions Review of the Samsung Galaxy Z Flip 4, including Camera, battery, price and more! Check out dbrand here: ..."
  ],
  [
    "iPhone 13 vs Galaxy S22 Battery Life DRAIN Test",
    "For those curious, the Galaxy S22 used in this video is a U.S. model with the Snapdragon processor. Twitter: ..."
  ],
  [
    "Android vs apple Samsung roast apple 😂😂",
    ""
  ],
  [
    "Google Pixel 7 Pro vs OnePlus 10 Pro vs Samsung S22 Ultra vs iPhone 14 Pro Max - Charging Speed Test",
    "The Google Pixel 7 Pro Charging with a 5000mAh battery Size and 23W of Rapid Fast Charging, lets see how it stands up against ..."
  ],
  [
    "iPhone Xr vs Samsung Galaxy A22 5G",
    "Buy iPhone Xr, https://amzn.to/3KvTE5N Buy A22 5G, https://amzn.to/3MzlZt5."
  ],
  [
    "iPhone VS Samsung user (meme)",
    ""
  ],
  [
    "Samsung vs. Apple: de ultieme smartphone-test",
    "In Hebbeding vandaag de ultieme strijd tussen de smartphones. Mark Hofman testte zowel het vlaggenschip van Samsung als die ..."
  ],
  [
    "🤷‍♂️ SAMSUNG is BETTER than APPLE ? 🫠",
    "apple #techboss #samsung #studiodisplay Time Stamp ****************************** 00:00 Intro 00:10 Studio Display Unboxing ..."
  ],
  [
    "Apple vs. Samsung: Live From the Courthouse",
    "Live from Apple and Samsung's highly-watched trial, AllThingsD's Ina Fried joins digits to update the latest in the high-stakes ..."
  ],
  [
    "Apple vs Samsung 5G Speed Test between iPhone 13 &amp; Galaxy S20 Fe 5G",
    "In this video I have tested 5G Speed of Apple iPhone 13 and Samsung Galaxy S20fe 5G Both are using Airtel 5G Sim."
  ],
  [
    "Does Samsung Now Rival Apple&#39;s &quot;Ecosystem&quot;",
    "Samsung or Apple? LG gram 17 : https://bit.ly/3fN3y4g LG gram 17 on Amazon : https://geni.us/6IIzv Subscribe for more internet + ..."
  ],
  [
    "Samsung Z Fold 4/ Flip 4 Impressions + Watch 5 Pro!",
    "A hands-on with Samsung's new Z Fold 4, Z Flip 4, and Watch 5 Pro! MKBHD Merch: http://shop.MKBHD.com Pre-order the ..."
  ],
  [
    "Samsung Galaxy S8 vs iPhone 7 Plus Camera Test Comparison",
    "Ultimate Samsung Galaxy S8 vs iPhone 7 Plus Camera Test Comparison! How Good Is The S8's Camera? Galaxy S8 vs iPhone ..."
  ],
  [
    "MENDING MANA !!! Samsung S22 vs iPhone 12",
    "TeamSamsung atau #TeamiPhone ?? ------------------------------------------------------------ Barang bekas review saya jual disini ..."
  ],
  [
    "iPhone 14 Pro Review: This Will Be Copied!",
    "iPhone 14 Pro and iPhone 14 Pro Max have 3 main new things. My honest thoughts! New Chevron Hoodie! http://shop."
  ],
  [
    "iPHONE 1000 Pro Max",
    ""
  ],
  [
    "The iPhone 7 VS. Samsung Galaxy S7",
    "Apple's iPhone 7 and the Samsung Galaxy S7 are arguably the two best phones on the planet now. If you're in the market for a ..."
  ],
  [
    "Apple AirPods Pro vs. Samsung Galaxy Buds Live | Not even close",
    "It's time to compare AirPods vs Galaxy buds, again. Given the competition in smartphones between Apple and Samsung, it makes ..."
  ],
  [
    "¡NO TE EQUIVOQUES! Galaxy S22 Ultra vs iPhone 13 Pro Max",
    "Recuerda usar el código Rhinoshield de 20% \"TOPES22\" : https://bit.ly/TOPES22 ✔️✔️Compra los terminales desde aquí: ..."
  ],
  [
    "Samsung Galaxy Z Fold 3 vs iPhone 12 Pro Max - SPEED TEST!",
    "Apple iPhone 12 Pro Max vs Samsung Galaxy Z Fold3 5G OFFICIAL Speed Test Comparison. The Z Fold 3 has 12GB LPDDR5 ..."
  ],
  [
    "IPHONE batteries Vs Samsung",
    "https://www.airfunding.net/project/632535?hl=en&utm_source=copied_url&utm_medium=social&utm_campaign= ..."
  ],
  [
    "POROVNÁNÍ: Samsung S21 Ultra vs Apple iPhone 12 Pro Max! Kdo s koho?",
    "4smarts Forkcord 3v1 - https://www.huramobil.cz/4smarts-forkcord-3v1-kabel-1m-cerny/dp-136177/ Apple iPhone 12 Pro Max ..."
  ],
  [
    "Always On - Episode 11: Apple vs. Samsung Torture Tests",
    "http://cnet.com/alwayson Molly Wood revisits the damage and carnage of torture testing the new iPad, Samsung Galaxy S III, new ..."
  ],
  [
    "Tonio life - Apple Vs Samsung | INFO WORD",
    "Apple Vs Samsung #Toniolife Instagram : Toniolifeoff INFO WORD ..."
  ],
  [
    "Samsung VS iPhone Tech News ! @sadiyakitech",
    "Samsung VS iPhone Tech News ! @sadiyakitech दोस्तो sadiya ki tech चैनल एक फैमिली चैनल है ..."
  ],
  [
    "GUERRA DE MARCAS! (Samsung vs Apple)",
    ""
  ],
  [
    "iPhone 11 Pro Max vs. Galaxy S20 Ultra camera comparison",
    "You can buy the items featured in the video here: iPhone 11 Pro Max: https://bit.ly/3nGWEki Galaxy S20 Ultra: ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra | ¡QUE HUMILLACIÓN!",
    "SORTEO iPhone 14 Pro Max o Samsung S22 Ultra (INTERNACIONAL  ) Participa: SUSCRÍBETE y HAZTE MIEMBRO: ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra vs Pixel 7 Pro Camera Comparison! #shorts #galaxys22ultra",
    "Galaxy S22 Ultra: https://howl.me/ciIxt8PydWe Pixel 7 Pro $899: https://howl.me/ciex8HLT40y My Other Wallpaper Packs: ..."
  ],
  [
    "Samsung VS iPhone Tech News ! @sadiyakitech",
    "Samsung VS iPhone Tech News ! @sadiyakitech दोस्तो sadiya ki tech चैनल एक फैमिली चैनल है ..."
  ],
  [
    "Always On - Episode 11: Apple vs. Samsung Torture Tests",
    "http://cnet.com/alwayson Molly Wood revisits the damage and carnage of torture testing the new iPad, Samsung Galaxy S III, new ..."
  ],
  [
    "iPhone 11 vs Samsung Galaxy A73 - Harga Beda tipis, Mending Mana?",
    "Hari ini kita akan membandingkan iPhone 11 vs Samsung Galaxy A73, karena keduanya harganya beda tipis, kalian pilih mana ..."
  ],
  [
    "Apple vs Samsung",
    "Êtes-vous Apple ou Samsung ? #dropshipping #dropshippingbusiness #shopifydropshipping #ecommercebusiness #shopify ..."
  ],
  [
    "OnePlus 9 Pro vs Samsung S21 Ultra Camera Test Comparison.",
    "Camera Comparison of OnePlus 9 Pro vs Samsung Galaxy S21 Ultra - including night mode, 4k video, zoom, slow mo, selfies etc."
  ],
  [
    "Samsung All Folding phone VS iphone 13 Pro max",
    ""
  ],
  [
    "Apple iPhone 14 PM vs Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra Zangi Incoming &amp; Outgoing Calls",
    "Apple iPhone 14 Pro Max vs Google Pixel 7 Pro and Samsung Galaxy S22 Ultra call each other on the Zangi App. Incoming ..."
  ],
  [
    "Apple AirTag vs. Tile: Battle of the Bluetooth trackers",
    "Apple AirTags and the Tile Mate, Pro, Slim and Sticker are part of a growing category of Bluetooth trackers. You attach them to an ..."
  ],
  [
    "iPhone 12 Vs Samsung Galaxy S10! (Comparison) (Review)",
    "Get The iPhone 12 Here: https://amzn.to/3kyEiBr Get The Samsung Galaxy S10 Here: https://amzn.to/2Ub3yly GET SUPER ..."
  ],
  [
    "Tonio life - Apple Vs Samsung | INFO WORD",
    "Apple Vs Samsung #Toniolife Instagram : Toniolifeoff INFO WORD ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max vs Huawei P50 Pro CAMERA COMPARISON",
    "Putting the Samsung Galaxy S22 Ultra Quad Camera against the iPhone 13 Pro Max and HUAWEI P50 Pro. Includes Blind Test ..."
  ],
  [
    "Samsung Galaxy Z Flip 4 - Why I NEARLY Switched.",
    "First Impressions Review of the Samsung Galaxy Z Flip 4, including Camera, battery, price and more! Check out dbrand here: ..."
  ],
  [
    "Galaxy S23 ULTRA vs Galaxy S22 ULTRA ¿Tiene sentido SAMSUNG ?",
    "Datos que vienen de filtraciones muy fiables. Muchas dudas con los nuevos Samsung Galaxy S23, Galaxy S23 plus y Galaxy S23 ..."
  ],
  [
    "🔋 iPhone 14 Pro Max vs Galaxy S22 Ultra, Xiaomi 12 Pro, Oppo Find X5 Pro...TEST DE BATERIA EXTREMO!!",
    "Comparativa de carga y descarga completa! Test de batería entre el nuevo IPhone 14 Pro Max, Galaxy S22 Ultra vs Xiaomi 12 ..."
  ],
  [
    "Galaxy Buds Pro VS AirPods Pro - Apple VS Samsung..who is the real Pro??",
    "Galaxy Buds Pro VS AirPods Pro - Apple VS Samsung..who is the real Pro?? #galaxybudspro #airpodspro #budsprovsairpodspro ..."
  ],
  [
    "Apple iPhone SE 3 vs Samsung Galaxy Z Flip 4 WhatsApp, Signal, Teleguard Incoming &amp; Outgoing Calls",
    "Apple iPhone SE 3 (iOS 16) vs Samsung Galaxy Z Flip 4 (Android 13) WhatsApp vs Signal vs Teleguard Incoming & Outgoing ..."
  ],
  [
    "Google Pixel 7 Vs Samsung Galaxy S22! (Comparison) (Review)",
    "Get The Google Pixel 7 Here: https://amzn.to/3rWKkAW Get a Samsung Galaxy Here: https://amzn.to/31CuySh Get The Cheapest ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max FREEZE TEST! 🧊",
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max freeze test! Testing durability of these phones. Get the Samsung Galaxy S22 ..."
  ],
  [
    "iPhone 13 vs Samsung Galaxy S22 ¿Cuál es mejor? No todo son especificaciones... 🔥",
    "Comparativa entre el iPhone 13 vs Samsung Galaxy S22, aquí analizo las principales diferencias entre estos dos dispositivos, ..."
  ],
  [
    "iPhone 13 vs Galaxy S22 Battery Life DRAIN Test",
    "For those curious, the Galaxy S22 used in this video is a U.S. model with the Snapdragon processor. Twitter: ..."
  ],
  [
    "This Is The Best Smartwatch - Samsung Galaxy Watch 4 Unboxing🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse Samsung Galaxy Watch 4 aur Galaxy Watch 4 Classic ke baare mein baat ki hai ..."
  ],
  [
    "IPHONE 13 VS SAMSUNG GALAXY S22 - БИТВА ФЛАГМАНОВ! ПОЛНОЕ СРАВНЕНИЕ",
    "Какой флагман круче: Apple iPhone 13 или Samsung Galaxy S22? Сравнение телефонов Купить Redmi Note 11 Pro ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S21 Ultra: Spec Comparison",
    "How does Apple's newest iPhone Pro Max stack up against the Samsung Galaxy S21 Ultra 5G? Let's break it down, spec by spec."
  ],
  [
    "iPhone 5s vs Samsung Galaxy S4 - Hands-on",
    "Apple iPhone 5s vs Samsung Galaxy SIV Review. A hands-on full comparison of the iPhone 5s vs Galaxy S4 looking at Size, ..."
  ],
  [
    "iPhone 13 Pro Review: Better Than You Think!",
    "iPhone 13 Pro is a big jump in 3 key areas, disguised by the same design! The first 1000 people will get a 1 month free trial of ..."
  ],
  [
    "¿Que prefieres IPhone o Android? 👀",
    ""
  ],
  [
    "Samsung vs Apple - The Next Big War",
    "Beyond Galaxy S22 & iPhone 13 Pro. Get ready for the next big war! Samsung vs Apple. Foldable smartphones from Google, ..."
  ],
  [
    "Apple vs. Samsung: Even Steve Jobs Doubted iPhone",
    "Testimony from the first days of the Apple vs. Samsung trial has yielded a behind-the-curtain look for design fans, including the ..."
  ],
  [
    "Saling Sindir Menyindir! Begini Perang Iklan Antara Apple Vs Samsung dan Brand Kompetitor Lainnya",
    "Di dalam kehidupan jaman sekarang, dimana smartphone sudah jadi salah satu benda paling berguna. Pasar dagang dalam ..."
  ],
  [
    "iPhone XS vs Samsung Galaxy S9 Sparkling Water Freeze Test - Which Will Survive?",
    "I placed both the new iPhone XS and the Galaxy S9 in sparkling water then put them in the freezer for around 15 hours to see ..."
  ],
  [
    "iPhone 14 PRO vs Galaxy S22 ULTRA // qual melhor smartphone de 2022? COMPARATIVO!!",
    "onde comprar a iPhone 14 Pro: https://tidd.ly/3fOMfW5 Não Pague mais Caro!! Utilize o COMPARADOR ESCOLHASEGURA!"
  ],
  [
    "IPHONE vs ANDROID : L&#39;ULTIME BATAILLE 🍏",
    "Yo les Trasheurs ! Iphone vs Android, un des débats qui fait le plus de vagues sur internet. Trop chers, manque de contenu, pas ..."
  ],
  [
    "Galaxy S21 ULTRA vs iPhone 12 PRO MAX CONFRONTO al VERTICE",
    "PREZZO AMAZON 12 PRO MAX: https://amzn.to/39czeiZ PREZZO AMAZON S21 ULTRA: https://amzn.to/2McuiRW Eccoli qua, ..."
  ],
  [
    "iPhone 13 vs Samsung S22. S22 vs iPhone 13 что купить?",
    "После выхода Samsung S22, нам очень захотелось его сравнить с iPhone 13, так как это прямые конкуренты! Samsung ..."
  ],
  [
    "Αλλάξαμε ΤΗΛΕΦΩΝΑ για μια εβδομάδα! | Apple vs Android #2",
    "ΓΙΝΕ SUBSCRIBER ΣΤΟΥΣ UNBOXHOLICS ▻ http://bit.ly/uh_sub Το concept δύσκολο σήμερα! Ο Σάκης πήρε το iPhone 12 του ..."
  ],
  [
    "Apple vs. Samsung: क्या आप लोग जानते हैं, सैमसंग वी नूडल्स बेचा करता था | Who is best in the world",
    "Apple vs. Samsung: क्या आप लोग जानते हैं, सैमसंग वी नूडल्स बेचा करता था | Who is ..."
  ],
  [
    "iPhone 12 Pro Max VS Galaxy S21 Ultra - Битката на титаните! - Кой е по-добър?",
    "Днес дойде време да решим кой смартфон е по-добър! Apple iPhone 12 Pro Max или Samsung Galaxy S21 Ultra. Купи ..."
  ],
  [
    "Mending Mana // Iphone 13 Mini VS Samsung S22 Indonesia",
    "Mending Mana // Iphone 13 Mini VS Samsung S22 Indonesia Link pembelian Iphone 13 mini ..."
  ],
  [
    "SIE HAT IHN VÖLLIG ZERSTÖRT !! 🤯🔥 IPHONE vs. SAMSUNG (RAPBATTLE) Reaction",
    "S O C I A L  M E D I A ❌ ➜ Instagram Bzet: https://www.instagram.com/bzet3/ ➜ Instagram Emre: ..."
  ],
  [
    "iPhone 12 Pro Max vs. Galaxy Note 20 Ultra camera comparison",
    "You can buy iPhone 12 Pro Max and Galaxy Note 20 here... iPhone 12 Pro Max: https://bit.ly/3b9JqKn Galaxy Note 20 Ultra: ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22+ | Którego Warto Kupić Aby Się Nie Rozczarować? ❌",
    "Test, Porównanie iPhone 13 Pro Max vs Galaxy S22+ Który Telefon Warto Kupić? W czym iPhone jest lepszy od Samsunga?"
  ],
  [
    "Неэпический Рэп Баттл l Apple VS Samsung",
    "Голосование тут: http://vk.com/Neebicheskiy_Rap_Battle Только на: http://YouTube.com/stilryder Авторы: ..."
  ],
  [
    "Экосистема APPLE vs SAMSUNG vs HUAWEI - чья лучше?",
    "Разбираемся чья экосистема лучше и чем отличаются экосистема Apple, от системы Huawei и Samsung! Подписывайся на ..."
  ],
  [
    "Galaxy S22 Ultra vs iPhone 13 Pro Max!!  Samsung vs Apple 2022",
    "He probado el Samsung Galaxy S22 Ultra, S22 plus y S22. Vuelve el mejor Samsung vs Apple iPhone 13 Pro Max en 2022."
  ],
  [
    "Apple iPhone 14 Pro Max vs. Samsung Galaxy S22 Ultra (Deutsch) | SwagTab",
    "Wer holt sich den Smartphone-Thron? Apple oder Samsung? In diesem Video seht ihr einen ausführlichen Vergleich zwischen ..."
  ],
  [
    "স্যামসাং VS অ্যাপেল😱| কোন কোম্পানি বিশ্বসেরা? | Apple vs Samsung | Phone Company Comparison",
    "স্যামসাং VS অ্যাপেল  | কোন কোম্পানি বিশ্বসেরা? | Apple vs Samsung | Phone Company ..."
  ],
  [
    "Samsung S23 Ultra Vs Samsung S22 Ultra - Real-World Comparison",
    "s23ultra Today we take a real side-by-side look at the S23 Ultra Vs the S22 Ultra and squash some more rumours. If you would ..."
  ],
  [
    "POROVNÁNÍ: Samsung S21 Ultra vs Apple iPhone 12 Pro Max! Kdo s koho?",
    "4smarts Forkcord 3v1 - https://www.huramobil.cz/4smarts-forkcord-3v1-kabel-1m-cerny/dp-136177/ Apple iPhone 12 Pro Max ..."
  ],
  [
    "iPhone vs Samsung - पानी के नीचे Camera Testing 😱🤯 #shorts #iphone #samsung",
    ""
  ],
  [
    "Экосистема APPLE vs SAMSUNG vs HUAWEI - чья лучше?",
    "Разбираемся чья экосистема лучше и чем отличаются экосистема Apple, от системы Huawei и Samsung! Подписывайся на ..."
  ],
  [
    "Apple iPhone 14 Pro Max vs. Samsung Galaxy S22 Ultra (Deutsch) | SwagTab",
    "Wer holt sich den Smartphone-Thron? Apple oder Samsung? In diesem Video seht ihr einen ausführlichen Vergleich zwischen ..."
  ],
  [
    "Apple Vs Samsung😂 Wait for End🤣 Samsung Noodles🍜 Company a?😳 #Shorts",
    "Unbelievable Facts about Samsung : https://youtube.com/shorts/7DoAXT34iIg Apple vanmatha kakkura neram ithu     Old ..."
  ],
  [
    "স্যামসাং VS অ্যাপেল😱| কোন কোম্পানি বিশ্বসেরা? | Apple vs Samsung | Phone Company Comparison",
    "স্যামসাং VS অ্যাপেল  | কোন কোম্পানি বিশ্বসেরা? | Apple vs Samsung | Phone Company ..."
  ],
  [
    "iPhone 14 Pro vs Samsung Galaxy S20 5G Speed Test #speed #test #iphone14pro #samsunggalaxys20",
    ""
  ],
  [
    "Samsung Galaxy S23 Ultra - Samsung Is NOT Following Apple",
    "Samsung Galaxy S23 Ultra will have something that Apple removed from its latest iPhone 14 Pro Max. Samsung Galaxy S23 Ultra ..."
  ],
  [
    "iPhone 14  vs Galaxy S22 Plus 🚀 ES UN ABUSO!!!",
    "Comparativa del iPhone 14 vs Galaxy S22 plus!! Apple vs Samsung, iPhone vs Galaxy y iOS vs Android. Los mejores teléfonos ..."
  ],
  [
    "GALAXY S20 FE VS IPHONE 11 EN 2023 | ¿CUAL ES MEJOR? | AndroOne",
    "Que tal amigos, es esta ocasión tenemos el video de la comparativa de Apple iPhone 11 vs Samsung Galacy S20 FE 5G a finales ..."
  ],
  [
    "iPhone 14 pro max VS Samsung s22 ultra zoom test #shorts #trending #tech #samsung #iphone",
    "iPhone 14 pro max VS Samsung s22 ultra zoom test .NOTE: ALL THE IMAGES/PICTURES SHOWN IN THE VIDEO BELONGS TO ..."
  ],
  [
    "APPLE vs SAMSUNG - Welches Handy ist BESSER?",
    "Hier abonnieren: http://bit.ly/2g3dKut Kontakt: misterblueyt@gmail.com Social Media: Instagram: ..."
  ],
  [
    "SECRET SAMSUNG AND APPLE RELATION !! 😱 IN HINDI",
    "Hello!! Today in this video I am sharing some Secrets about Samsung and Apple Relation. (#samsung #iphone2019 ..."
  ],
  [
    "Samsung Galaxy S23 Ultra Vs Samsung S22 Ultra Vs iPhone 14 Pro Max Vs iPhone 13 Pro Max | Best 2022",
    "Samsung Galaxy S23 Ultra Vs Samsung S22 Ultra Vs iPhone 14 Pro Max Vs iPhone 13 Pro Max | Best 2022 Subscribe To My ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max | ¿Cuál será mejor?",
    "Samsung Galaxy S22 Ultra vs #iPhone 13 Pro Max, review comparativa en español. ¿Cuál será mejor comprar? Ambos son dos ..."
  ],
  [
    "Galaxy S21 ULTRA vs iPhone 12 PRO MAX CONFRONTO al VERTICE",
    "PREZZO AMAZON 12 PRO MAX: https://amzn.to/39czeiZ PREZZO AMAZON S21 ULTRA: https://amzn.to/2McuiRW Eccoli qua, ..."
  ],
  [
    "Galaxy S21 Ultra vs iPhone 12 Pro Max, o melhor APPLE vs o melhor SAMSUNG [Comparativo]",
    "Neste comparativo temos o Galaxy S21 Ultra e o iPhone 12 Pro Max com um visual completamente diferente: o celular da ..."
  ],
  [
    "iPhone 5 Vs Samsung Galaxy S3 Browser Test Head to Head!",
    "We Take the Internet Browsers shipped with the Apple iPhone 5 and the Samsung Galaxy S3 SIII GT-i9300 and compare them ..."
  ],
  [
    "SAMSUNG vs APPLE: ¿Quién hace mejores CELULARES? LA GRAN BATALLA DE NUNCA ACABAR",
    "Quien hace mejores celulares Samsung o Apple? Evaluaremos ambas marcas en distintos aspectos para ver quien es la mejor ..."
  ],
  [
    "¡¡LA GUERRA!! iPhone 13 Pro Max vs Galaxy S21 Ultra",
    "Cómpralos desde aquí: iPhone: ..."
  ],
  [
    "iPhone vs Samsung 😱🔥#shorts #iphone #intrestingfacts",
    "iPhone vs Samsung #shorts #iphone #intrestingfacts #iphonevssamsung #srshiv #intrestingfacts #interestingfacts #instagram ..."
  ],
  [
    "iPhone 14 Pro Max VS Samsung Galaxy S22 ultra #shorts #youtubeshorts",
    ""
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22+ | Którego Warto Kupić Aby Się Nie Rozczarować? ❌",
    "Test, Porównanie iPhone 13 Pro Max vs Galaxy S22+ Który Telefon Warto Kupić? W czym iPhone jest lepszy od Samsunga?"
  ],
  [
    "Apple vs Samsung #subscribe #like #viral",
    ""
  ],
  [
    "iphone 14 pro max Vs Galaxy s22 Ultra 🔥#shorts #ytshorts #protech #subscribe for more..",
    "iphone 14 pro max Vs Galaxy s22 Ultra.. iphone 14 pro max vs galaxy s22 ultra, iphone 14 pro max vs galaxy s22 ultra camera, ..."
  ],
  [
    "Apple VS Samsung Camera Test!",
    "If u like this video then plz like and Subscribe to my channel for more videos. Thanks alot for support and Subscribe. Your Queries: ..."
  ],
  [
    "ECG Watch: How it Works (Apple, Samsung A fib Watches / EKG)",
    "Roger Seheult, MD of MedCram explains how atrial fibrillation can be detected on ECG Smartwatches and the advantages and ..."
  ],
  [
    "ESTO ES UNA PALIZA!!!!!!! Samsung S21 o iPhone 12",
    "Ponemos a prueba el Samsung #GalaxyS21 #GalaxyS21Plus y #GalaxyS21Ultra contra los iPhone 12 • SUSCRIBETE YA A ..."
  ],
  [
    "Что выбрать: iPhone 14 Pro Max против Galaxy S22 Ultra",
    "Сравнение камер iPhone 14 Pro Max и Galaxy S22 Ultra у нас уже вышло https://youtu.be/Ums7xJJNiiM , сегодня сравним ..."
  ],
  [
    "Apple&#39;s 2023 Lineup Will Be INSANE!",
    "Try the new Paperlike 2.1 and get the Digital Pro Planner for FREE, until end of January ..."
  ],
  [
    "iPhone 14 Pro Max VS Samsung S23 Ultra - Complete Specs Comparison",
    "Are you trying to decide between the iPhone 14 Pro Max and the Samsung S23 Ultra? Look no further! In this video, we are going ..."
  ],
  [
    "The Samsung S22 Ultra is secretly AMAZING.",
    "Hands on with the Samsung Galaxy S22 Ultra, including a quick Camera Test, specs, features, price and more. Battery Test and ..."
  ],
  [
    "เต็มข้อ รีวิว iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra เลือกยังไงดี!?",
    "เต็มข้อ รีวิว iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra เลือกยังไงดี!? ช่องใหม่ ที่นี่เลยจ้า ..."
  ],
  [
    "Pixel 6a vs Nothing Phone 1 vs Samsung Galaxy A53 5G | Which is best for you?",
    "Comparing Google's Pixel 6a vs the Nothing Phone 1 vs Samsung's Galaxy A53 5G, testing which mid-range 2022 smartphone is ..."
  ],
  [
    "10 alasan kenapa APPLE adalah brand TERBAIK!",
    "Serasa sales. Buat yang mau dapetin promo pas beli voucher game: http://tkp.me/wintersalegadgetin Barang bekas review ..."
  ],
  [
    "DÜMDÜZ iPhone 13 vs EN PAHALI Samsung S22 Ultra (Hangisi Daha Hızlı?)",
    "DÜMDÜZ iPhone 13 vs EN PAHALI Samsung S22 Ultra (Hangisi Daha Hızlı?) Video hoşunuza gittiyse, abone olarak, beğenerek, ..."
  ],
  [
    "Quel est le Meilleur Smartphone en Photo ? (Apple vs Google vs Samsung vs Xiaomi)",
    "Le Meilleur Smartphone en photo 2021 est... ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ J'ai acheté des Faux AirPods 3 à 17€ !"
  ],
  [
    "iphone 12 pro vs samsung s21 ultra | Camera Test Comparison #iphone12 #samsungs21ultra",
    "review full camera iphone 12 pro https://www.youtube.com/watch?v=mZ_yRn8ZQzM&t=1s full review camera samsung s21 ultra ..."
  ],
  [
    "Αλλάξαμε ΤΗΛΕΦΩΝΑ για μια εβδομάδα! | Apple vs Android #2",
    "ΓΙΝΕ SUBSCRIBER ΣΤΟΥΣ UNBOXHOLICS ▻ http://bit.ly/uh_sub Το concept δύσκολο σήμερα! Ο Σάκης πήρε το iPhone 12 του ..."
  ],
  [
    "who is win Apple vs samsung##",
    ""
  ],
  [
    "Samsung vs Apple ¿CUAL es el MEJOR? 📱 Samsung Galaxy S22+ vs iPhone 13 PRO | COMPARATIVA",
    "Hoy os traigo una comparativa entre 2 de los mejores teléfonos del año, el Samsung Galaxy S22+ y el iPhone 13 PRO ¡La lucha ..."
  ],
  [
    "iPhone 12 Pro Max vs Galaxy S21 Ultra | La batalla",
    "Sígueme en mis redes sociales: https://www.instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "Samsung Galaxy Z Fold 4 Unboxing vs Samsung Galaxy Z Flip 4 Unboxing (ALL COLORS)",
    "Samsung Galaxy Z Fold 4 - https://howl.me/chP12WxLxBf Samsung Galaxy Z Flip 4 - https://howl.me/chP12VSoBTq Samsung ..."
  ],
  [
    "iPHONE 14 PRO vs GALAXY S22 ULTRA: qual è la VOSTRA scelta?!",
    "La sfida si rinnova: Apple iPhone 14 Pro vs Samsung Galaxy S22 Ultra. Da una parte l'ultimo melafonino con fotocamere e ..."
  ],
  [
    "😱i phone 14pro Maxx vs Samsung galaxy S22ULTRA Display  #video #shorts #trending #shorts #youtube",
    "i phone 14pro Maxx vs Samsung galaxy S22ULTRA #shorts #video #shorts #trending #shorts #youtube shorts video trending ..."
  ],
  [
    "Nokia G11 Vs iPhone 13 Vs Samsung #shorts #youtubeshorts",
    "Nokia g11 iPhone samsung."
  ],
  [
    "Apple iPhone 4s versus Samsung Galaxy s II Camera Speed Test",
    "Apple Iphone 4s versus Samsung Galaxy S II camera speed test. Speed testing the two rear cameras. Side by side review."
  ],
  [
    "¿Quién MANDA AQUÍ? Apple, Xiaomi o Samsung",
    "Descubre nuestra web Compra Smartphone: https://bit.ly/396mYAP Aquí encontrarás las MEJORES OFERTAS: ..."
  ],
  [
    "Iphone 11 vs Samsung Galaxy S10+ ¡COMPARATIVA A MUERTE!",
    "Iphone 11 vs Samsung Galaxy S10 Plus, comparativa a fondo punto por punto para ver cuál de los dos es mejor teléfono, y es ..."
  ],
  [
    "Iphone 14 Pro Vs Samsung s22 ultra #shorts #shortsvideo #viral",
    "galaxy s22 galaxy s22 plus galaxy s22 plus review galaxy s22 review galaxy s22 ultragalaxy s22 ultra review galaxy s22 ultra ..."
  ],
  [
    "Jio 5G Speed Test Iphone 14 vs Samsung s22 Smartphone",
    "Dosto is Video Pe Mene Apple iphone 14 vs Samsung Galaxy s22 Smartphone ki jio 5g Speed Test Batay Hai."
  ]
]