[
  [
    "iPhone 14 Pro Max GOLD vs iPhone 14 Pro Max BLACK #shorts #viral",
    "Buy iPhone 14 Pro Max: https://amzn.to/3RPXN8V Business Queries - business@techoob.com Edited By Madhav Jha ..."
  ],
  [
    "iPhone 14, iPhone 14 Pro Max Unboxing &amp; First Impressions⚡Dynamic Island Madness 🏝️",
    "Doston Saal Ka Wo Din Aa Gaya Hain Jab Hum Unbox Karte Hain All New iPhones Ko, Aaj ke Video Me Hum Unbox Kar Rahe ..."
  ],
  [
    "iPhone 14 Pro Max Review: 100 Days Later",
    "iPhone 14 Pro Max 1 TB Space Black Unboxing & Review Upgrading from iPhone 13 Pro Max to iPhone 14 Pro Max iPhone 14 ..."
  ],
  [
    "Apple iPhone 14 Pro Max &amp; 14 Pro Unboxing *Dynamic Island*",
    "Naye Apple aa chuke hain Guys! Subscribe for Tabahi Videos INSTAGRAM ▻ http://instagram.com/techburner TWITTER ..."
  ],
  [
    "₹500,000 Camera vs iPhone 14 Pro Max | Spot the Difference",
    "I compared the iPhone 14 Pro Max with Canon R5 camera, photos and video samples included in this video. Learn Photography ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; First Look - The Dynamic Island Magic🔥🔥🔥",
    "Namaskar Dosto, aaj intezaar ki ghadi khatam ho chuki hai kyuki iss video mein maine share kiya hai unboxing aur ek first ..."
  ],
  [
    "Apple iPhone 14 Pro Max in ₹10,000🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai iPhone 14 Pro Max ke baare mein jaha pe maine isi ke ek clone ki ..."
  ],
  [
    "Introducing iPhone 14 Pro | Apple",
    "What lies beyond a traditional smartphone? Let's find out. This is iPhone 14 Pro. It starts with the Dynamic Island, an interactive ..."
  ],
  [
    "iPhone 14 Pro Max In-Depth Camera Review | New Sensor, New Abilities!",
    "The first iPhone with a 48MP main sensor. The 14 Pro and Pro Max have easily the biggest iPhone camera upgrade in years; not ..."
  ],
  [
    "iPhone 14 Pro Max Long Term Review",
    "Get your $5 now : https://r.honeygain.com/Nabeel , code \"Nabeel\" Buy Here: iPhone 14 Pro Max: https://amzn.to/3PJnUON iPhone ..."
  ],
  [
    "NO COMPRES el iPhone 14 Pro Max sin ver este video",
    "Links de compra Amazon: https://amzn.to/3TYfTGt Linio: https://bit.ly/3Ne7DA3 Claro Shop: https://bit.ly/3Df3NlC ..."
  ],
  [
    "iPHONE 14 PLUS UNBOXING + SETUP",
    "HEYYY today we are back with an iphone 14 plus unboxing! unboxing the new iPhone 14 plus in starlight, red, blue, purple, and ..."
  ],
  [
    "iPhone 14 Pro Max Review - Almost 3 Months Later!",
    "Reviewing and revisiting the iPhone 14 Pro Max a few months later! Long term Review! Buy iPhone 14 Pro Max ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; initial impressions || in Telugu ||",
    "ios 16 Features : https://youtu.be/guSSwYeD5ZI Support me :) (Everytime you buy using the below links I get a small commission ..."
  ],
  [
    "Buying iPhone 14 with Coins | Apple Store पे लड़ाई हो गयी",
    "Hello guys, is video me humne iphone 14 coins se khareeda hai. Our Unboxing Channel- ..."
  ],
  [
    "After 3 Months - iPhone 14 Pro Still Makes NO SENSE!",
    "I won't deny that the iPhone 14 Pro and Pro Max are really good phones. However, after having used it, I've realized that all the ..."
  ],
  [
    "iPhone 14 Pro Max review - 9 THINGS I&#39;VE LEARNED!",
    "This video is sponsored by Synology: https://www.synology.com/en-global/dsm/solution/personal_backup I've been using the ..."
  ],
  [
    "Finally I Bought IPhone 14 Pro Max 🔥❤️",
    "Finally I Bought IPhone 14 Pro Max ❤️ Follow me on Instagram :- https://openinapp.co/instagram/manojd... Thanks for ..."
  ],
  [
    "The Real KING Phone? - iPhone 14 Pro Max vs Samsung S22 Ultra",
    "In this video, I compare the Samsung Galaxy S22 Ultra and the iPhone 14 Pro Max - The Best of Best Smartphones. You can also ..."
  ],
  [
    "iPhone 14 Pro &amp; Pro Max - TIPS TRICKS &amp; HIDDEN FEATURES!!!",
    "Check out these TOP iPhone 14 Pro & Pro Max Tips, Tricks and Hidden Features! Let me know which one you liked the most ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing And Camera Test! - ASMR",
    "Today I will be unboxing the new iPhone 14 Pro Max and testing out its camera. I hope you enjoy! #iphone #unboxing #asmr."
  ],
  [
    "iPhone  Amazing Hidden Features! 😱 Tricks iOS 16 - iPhone 14 Pro Max",
    "iPhone Amazing Hidden Features Fancall: https://ref.fancall.in/?link=https://appfancall.page.link/to9w - for video call with me My ..."
  ],
  [
    "Apple iPhone 14 Pro Max Review | Three Months Later.. Camera, Battery, Gaming &amp; Display",
    "Open your Demat Account Now: ..."
  ],
  [
    "New Iphone 14 Pro Le Liya 😍 1 TB",
    "facebook link - https://www.facebook.com/souravjocvlogs Follow me on Instagram- ..."
  ],
  [
    "iPhone 14 Pro Max Detailed Unboxing and First Impression (Malayalam)",
    "Sharing my Detailed Unboxing and first impression of iPhone 14 Pro Max MY RECOMMENDATIONS ..."
  ],
  [
    "iPhone 14 Pro Max Long Term Review: After 2 Months - I Was Wrong!",
    "A lot of haters are saying that this year's iPhone is not worth upgrading. I completely disagree. Having upgraded from the iPhone ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA TEST!",
    "Camera Test comparison of Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - including microphone, night mode, ..."
  ],
  [
    "iPhone 14 Pro Review: This Will Be Copied!",
    "iPhone 14 Pro and iPhone 14 Pro Max have 3 main new things. My honest thoughts! New Chevron Hoodie! http://shop."
  ],
  [
    "iPhone 14 Pro Max - 3 Months Later - Long Term Review!",
    "Apple in September released the iPhone 14 models, so it's been just about two months since launch. MacRumors videographer ..."
  ],
  [
    "I Phone 14 Pro Max Freezing Test - Will It Survive ?",
    ""
  ],
  [
    "iPhone 14 Pro Max Review After 45 Days... Do You Need It?",
    "In this video, I'm reviewing the iPhone 14 Pro Max. After spending 45 days with the phone, we've come to some conclusions about ..."
  ],
  [
    "ये है ₹10000 का iPhone 14 Pro max पर कैसे 😳😳 #shorts  #apple",
    "ये है ₹10000 का iPhone 14 Pro max पर कैसे #shorts #apple #phone #iphone15 SUBSCRIBE THE CHANNEL ..."
  ],
  [
    "iPhone 14 Pro/Max Detailed Review (Malayalam) with Pros and Cons",
    "Sharing my long term review of iPhone 14 Pro/Max MY RECOMMENDATIONS - https://www.amazon.in/shop/mrperfecttech ..."
  ],
  [
    "First iPhone vs iPhone 14 Pro Max #Apple #iPhone",
    "Apple #TechBar #iPhone #iPhone14ProMax #India #Hindi #shorts == Free Music For Creators ..."
  ],
  [
    "Super Cool All Apple iPhone 14 Pro Max Full Protection Applying #shorts",
    ""
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max in 2023🔥 | 3 Months Later! Best iPhone To Buy? (HINDI)",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max in 2023   | Best iPhone To Buy? Some Unknown Things! (HINDI) This Video is detailed ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA COMPARISON (in Hindi)",
    "iPhone 14 Pro Max vs Samsung S22 Ultra camera comparison of photos and videos. CONNECT ON INSTAGRAM: ..."
  ],
  [
    "IPhone 14 Pro max Second Hand Price",
    ""
  ],
  [
    "Beggar Buying IPhone 14 Pro Max Worth ₹150000  -😝 भिखारी देखकर शोरूम से बाहर निकाल दिया - shocking",
    ""
  ],
  [
    "Apple iPhone 14 Pro - 2 Months Later Review!",
    "Apple iPhone 14 Pro - 2 Months Later Review! RHINOSHIELD X BLACK FRIDAY: https://bit.ly/3gP7MOu Up to 60% off sitewide + ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max  What Should You Buy? What is the Main Difference?  Mohit Balani",
    "14 Pro vs 14 Pro Max | What Should You Buy? | Mohit Balani in this video we will talk about the newly launched apple iPhone 14 ..."
  ],
  [
    "I Bought ₹10,000 iPhone 14 Pro Max!",
    "In this video, I compare the Original iPhone 14 Pro Max with a Fake iPhone 14 Pro max. You can also watch, iPhone 14 Plus ..."
  ],
  [
    "Apple iPhone 14 Pro Max Review | Two Months Later...",
    "Reviewing Apple's iPhone 14 Pro Max (Deep Purple) two months later, to see if the camera performance, iOS 16 experience etc ..."
  ],
  [
    "🍎 iPhone 14 Series - ₹3,50,000 Worth UNBOXING 🫠",
    "iphone #techboss #iPhone14 #iphone14pro #iphone14promax Time Stamp ********************************* 00:00 Intro 00:45 ..."
  ],
  [
    "iPhone 14 pro Max... Thank you all my subscribers..",
    ""
  ],
  [
    "iPhone 14 Pro Max vs. Galaxy S22 Ultra Drop Test!",
    "CASETiFY's iPhone 14 Cases are now available at casetify.com! Go to https://www.casetify.com/phonebuff today to get 15% off ..."
  ],
  [
    "The 2022 KING ? - iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro",
    "In this video, I compare the Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max vs Google Pixel 7 Pro. You can also watch, Moto ..."
  ],
  [
    "iPhone 14 Pro Review - Needs Software Improvements !",
    "Apple iPhone 14 Pro Final Review with Pros and Cons. 00:00 - starting 00:06 - iPhone 14 Pro Video 01:12 - Review 02:47 ..."
  ],
  [
    "WHAT THEY DIDN’T TELL YOU! iPhone 14 - 3 Month Review",
    "Should you even upgrade to the iPhone 14? And if so, which one should you get? ✓ GET your iPhone 14 cases at CASETiFY ..."
  ],
  [
    "iPhone 14 Pro Max 3 Months Later!",
    "iPhone 14 Pro Max 3 Months Later! Hello all and welcome to this video discussion on the iPhone 14 Pro Max 3 Months later and ..."
  ],
  [
    "Is iPhone 14 Pro Max BETTER Than Galaxy S22 Ultra? | Phone of the Year",
    "Is the new iPhone 14 Pro Max better than the Galaxy S22 Ultra? We'll take a look at the hardware, software, performance (and ..."
  ],
  [
    "iPhone 14 Pro Max at ₹10,000| Unboxing | 10,000 രൂപയ്ക്ക് iPhone Clone",
    "Sharing my experience with the fake / clone iphone 14 pro max MY RECOMMENDATIONS ..."
  ],
  [
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch &amp; AirPods Jama Masjid Market",
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch & AirPods Jama Masjid Market Timing : Sunday Early Morning 6:00 AM TO 11 ..."
  ],
  [
    "iPhone 14 pro Max... Thank you all my subscribers..",
    ""
  ],
  [
    "iPhone 14 Pro Max 😆😄 #trending #viral #funny #comedy #shorts",
    ""
  ],
  [
    "A Guided Tour of iPhone 14 &amp; iPhone 14 Pro | Apple",
    "Find a new iPhone 14 that's right for you. We've headed to the Big Apple to tell you all the big news about iPhone 14, iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max - Ultimate Comparison!",
    "Check out the MOFT Snap Stand Power Set: https://bit.ly/3QJi3If No More iTunes, Finder and iCloud Limits, Go With This ..."
  ],
  [
    "I Used iPhone 14 Pro For 15 Days! *Reality*",
    "In this video, you'll see an in-depth review of the iPhone 14 Pro. You can also watch, Moto Edge 30 Ultra Review ..."
  ],
  [
    "iPhone 14 Pro Max proved everyone wrong..",
    "iPhone 14 Pro Max Review - 95 Days Later Thanks to Mailchimp for sponsoring a portion of this video! Get started at: ..."
  ],
  [
    "SURPRISE PARA KAY WIFEY | UMIYAK |  iPhone 14 Pro Max 1TB 😱",
    "1 LIKE = 1 IPHONE GIVEAWAY!! Follow me here: https://www.facebook.com/josephsabellofficial ..."
  ],
  [
    "What I HATE about my iPhone 14 Pro Max After 2 Months..",
    "ESR HaloLock 3-in-1 Charger with CryoBoost: https://bit.ly/3SVm8dq After 2 Months, These are the top things that BUG me about ..."
  ],
  [
    "iPhone 14 Pro Max Hindi Review - Don&#39;t Buy It (Mat Karo Paise Waste)",
    "iPhone 14 Pro Max Hindi Review - Don't Buy It (Mat Karo Paise Waste). If You Like this video, hit the like button, share this video, ..."
  ],
  [
    "iPhone 14 Pro Max Detailed Unboxing  *Dynamic Island Secret*  || The Real BOSS 😎",
    "In this video, we share our experience with this Apple iPhone 14 Pro Max. Watch the video fully and share your thoughts about ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "🍎 iPhone 14 Series - ₹3,50,000 Worth UNBOXING 🫠",
    "iphone #techboss #iPhone14 #iphone14pro #iphone14promax Time Stamp ********************************* 00:00 Intro 00:45 ..."
  ],
  [
    "iPhone 14 Pro Max vs 14 Pro / 14 / 13 / 13 mini / 12 / SE Battery Test!",
    "Battery Life Drain test of the iPhone 14 Pro Max, plus the iPhone 14 Pro, vs iPhone 14, iPhone 13, iPhone 13 Mini, iPhone 12, ..."
  ],
  [
    "Super Cool All Apple iPhone 14 Pro Max Full Protection Applying #shorts",
    ""
  ],
  [
    "I Got iPhone 14 Pro Max for Only ₹8,000🔥🔥🔥",
    "In this video, we share our experience with this Fake iPhone 14 Pro Max. Watch the video fully and share your thoughts about this ..."
  ],
  [
    "iPhone 14 Pro Max REVIEW - Worth The Upgrade? [Shot on iPhone]",
    "My iPhone 14 Pro Max Review - Is the Dynamic Island, A16, Camera & Battery a big upgrade over iPhone 13 Pro Max? ▷ Go to ..."
  ],
  [
    "iPhone 14 Pro Max - 25+ Tips &amp; Tricks!",
    "iPhone 14 Pro Max Tips, Tricks, Hidden Features & First Things to Do! Get 15% off CASETiFY cases: ..."
  ],
  [
    "₹150000💰Phook Diye Finally Iphone 14 Pro Max❤️",
    "Iphone 14 pro max If You Want To Support- UPI ELVISHYADAVFOUNDATION@icici DHOKA 2 - https://youtu.be/iwMqiEg7BwY ..."
  ],
  [
    "Android Fanboy Uses iPhone 14 Pro for 7 Days!",
    "You can get 83% off and 3 extra months for free if you subscribe at https://surfshark.deals/TECHWISER - Enter promo code ..."
  ],
  [
    "Small Apple iPhone 14 Pro Max Unboxing! #shorts",
    ""
  ],
  [
    "iPhone 14 Pro Max at ₹10,999 | Unboxing &amp; Review | iPhone 14 Pro Max Clone Vs Original",
    "Testing iPhone 14 Pro Max Clone. Check the unboxing and overall review Buy Here iPhone 14 Pro Max Clone ..."
  ],
  [
    "iPhone 14 Pro Max lại SỌC MÀN hàng loạt - Lỗi phần mềm, MÀN KHÔNG LỖI, APPLE LỖI!!",
    "CellphoneS hiện đang có loạt deal Tết cực hot đi kèm nhiều combo giá khủng; và đặc biệt có game “ĐÓN LỘC” diễn ra từ ..."
  ],
  [
    "Apple&#39;s iPhone 14 Pro and 14 Pro Max in under 6 minutes",
    "Apple unveiled the iPhone 14 Pro at its 'Far Out' event on September 7, 2022. The flagship handset ditches the notch, and in its ..."
  ],
  [
    "iPhone 14 Pro vs Pro Max - Don&#39;t Choose Wrong! (I did at first)",
    "Should you buy the iPhone 14 Pro or the iPhone 14 Pro Max? Is the Pro Max too big? Is the 14 Pro too small? In this video we ..."
  ],
  [
    "2 months with iPhone 14 Update! What&#39;s on my iPhone!?",
    "Thanks to Mailchimp for sponsoring a portion of this video! Get Started with Mailchimp today by visiting my link here: ..."
  ],
  [
    "iPhone 14 Pro Max One Month Later Review: Do I Regret It?",
    "Buy Ugreen Nexode 140W Charger here: https://amzn.to/3cR8c50 (25% OFF) Buy on Ugreen Official Store: https://bit.ly/3Smrz4C ..."
  ],
  [
    "iPhone 14 Pro Review - Needs Software Improvements !",
    "Apple iPhone 14 Pro Final Review with Pros and Cons. 00:00 - starting 00:06 - iPhone 14 Pro Video 01:12 - Review 02:47 ..."
  ],
  [
    "Original vs Fake iPhone 14 Pro Max || in Telugu ||",
    "Support me :) (Everytime you buy using the below links I get a small commission which will help me make more Product Reviews ..."
  ],
  [
    "Apple iPhone 14 Pro Max Unboxing!",
    "Here is the new flagship phone from Apple - the iPhone 14 Pro Max! A new always on display, Dynamic Island, and more!"
  ],
  [
    "Apple iPhone 14 Pro Max review",
    "The largest and most expensive of all iPhones in the 14 Series, the 14 Pro Max has the spotlight as the best iPhone you can buy ..."
  ],
  [
    "Beggar Buying IPhone 14 Pro Max Worth ₹150000  -😝 भिखारी देखकर शोरूम से बाहर निकाल दिया - shocking",
    ""
  ],
  [
    "iPhone 14 Pro &amp; 14 Pro Max One Month Later - Similar but Different!!",
    "This is a long term review of the new iPhone 14 Pro and 14 Pro Max. In this review, I go over my experience with the iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 14 Plus Full Comparison in Hindi",
    "Visit Croma: https://omgrefer.com/XdH7f Offer 10% upto 500 off on croma.com (n/a on Smartphones) Code - CRMAOM5H Offer ..."
  ],
  [
    "iOS 16 Home/Lock Screen Customization! - What&#39;s on my iPhone 14 Pro?",
    "Stop overpaying your phone bill and save with Mint Moblie. Get 3 months free by using this link https://mintmobile.com/simplypops ..."
  ],
  [
    "iPhone 14 pro &amp; pro Max Cinematic Mode | SETTINGS, FILMING &amp; COLOR GRADING TUTORIAL",
    "iPhone 14 pro camera and 14pro Max cinematic mode. What are the best settings? How do you film, edit and color grade directly ..."
  ],
  [
    "Apple iPhone 14 Pro - A Long Term User Review",
    "The iPhone 14 Pro deserves a long term user review so I've been using it exclusively for more than 2 months now. And after that ..."
  ],
  [
    " iphone 14 pro max 1TB (gold) unboxing ✨ | cute apple accessories + ios 16 set up!",
    "you can now translate this video to your own language!"
  ],
  [
    "iPhone 14 Pro/Pro Max Full Review: ALMOST PERFECT…",
    "The Apple iPhone 14 Pro/Pro Max is now available at Beyond the Box physical stores, website, and LazMall! Products mentioned ..."
  ],
  [
    "iPhone 14 Pro Max - REAL Day in the Life Review!",
    "The new iPhone 14 Pro Max gets put through a REAL day in the life. Let's see how that battery, camera and new dynamic island ..."
  ],
  [
    "iPhone 14 - The Good, the Bad and the UGLY.",
    "iPhone 14 impressions - including camera, battery, specs, features and Pricing! Subscribe for more content (IT'S FREE) ..."
  ],
  [
    "How To install iPhone 14 Pro Max Any Android Smartphone ! Like official iPhone 😱",
    "How To install iPhone 14 Pro Max Any Android Smartphone ! Like official iPhone iphone 14 caller screen video link ..."
  ],
  [
    "iPhone 14 Pro Max vs.  Pixel 7 Pro - Which Phone is Better??",
    "This is a review of the iPhone 14 Pro Max vs. the Google Pixel 7 Pro. In this review, I compare the new iPhone 14 Pro Max and the ..."
  ],
  [
    "3 Months With The iPhone 14 Pro Max What’s On My iPhone!",
    "casetifypartner #casetifybounce #whatsonmyiphone Before the year is up I figured I would do one of these \"What's On My iPhone\" ..."
  ],
  [
    "Should YOU skip the iPhone 14 Pro Max..? (BIG PROBLEMS)",
    "Shop TORRAS UPRO Ostand matte case (for iPhone 14 pro max): http://bit.ly/3VhHvHH Shop TORRAS UPRO Ostand clear case ..."
  ],
  [
    "iPhone 14 Pro Max - Real World Review!",
    "iPhone 14 Pro Max is a great upgrade for iPhone this year. iPhone 14 pro brings with it the new A16 CPU, New 48MP camera, ..."
  ],
  [
    "iPhone 14 Pro Hidden Features!",
    "Try out Backblaze for free (no credit card required) at: https://backblaze.com/tac The iPhone 14 Pro is finally here and along with a ..."
  ],
  [
    "Please Don’t Buy iPhone 14 Pro in 2022! Honest long-term review",
    "See NordPass Business in action now with a 3-month free trial here https://nordpass.com/arthurwiner with code arthurwiner What ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; First Look 🤯 RIP 2,00,000 Rupees",
    "lokeshgamer #gyangaming #asgaming #totalgaming #DesiGamers #twosidegamers #OPLOKESHGAMER #totalgaming ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "Apple iPhone 14 Pro - A Long Term User Review",
    "The iPhone 14 Pro deserves a long term user review so I've been using it exclusively for more than 2 months now. And after that ..."
  ],
  [
    "Original vs Fake iPhone 14 Pro Max || in Telugu ||",
    "Support me :) (Everytime you buy using the below links I get a small commission which will help me make more Product Reviews ..."
  ],
  [
    "iPhone 14 Pro Max Pubg Test, Heating and Battery Test | New Gaming Beast 🔥",
    "In this video, I will do the bgmi test of iphone 14 pro max and also check out the heating and battery drain in one hour and I hope ..."
  ],
  [
    "iPhone 14 Pro Max - 72 மணி நேரத்திற்கு பிறகு... Review in Progress! (Tamil | தமிழ்)",
    "இப்போ 3-4 நாள்ளா iPhone 14 Pro Max test பண்ணிட்டு இருக்கேன், இன்னும் full review ..."
  ],
  [
    "Apple iPhone 14 Pro Max Unboxing!",
    "Here is the new flagship phone from Apple - the iPhone 14 Pro Max! A new always on display, Dynamic Island, and more!"
  ],
  [
    "Iphone 14 pro max le liya hai huzaifa na😍 | iphone 14 pro max unboxing  | iphone unboxing review 🥰",
    "iphone #iphone14promax #iphone14 #iphone14pro #iphonexr."
  ],
  [
    "iPhone 14 Pro Max - REAL Day in the Life Review!",
    "The new iPhone 14 Pro Max gets put through a REAL day in the life. Let's see how that battery, camera and new dynamic island ..."
  ],
  [
    "10 Reasons I&#39;m Switching To iPhone 14 Pro Max!",
    "10 Reasons I'm Switching To iPhone 14 Pro Max! Apple iPhone 14 Pro Max is Apple's latest and greatest iPhone Max device and ..."
  ],
  [
    "iPhone 14 Pro vs Pro Max - Don&#39;t Choose Wrong! (I did at first)",
    "Should you buy the iPhone 14 Pro or the iPhone 14 Pro Max? Is the Pro Max too big? Is the 14 Pro too small? In this video we ..."
  ],
  [
    "A Guided Tour of iPhone 14 &amp; iPhone 14 Pro | Apple",
    "Find a new iPhone 14 that's right for you. We've headed to the Big Apple to tell you all the big news about iPhone 14, iPhone 14 ..."
  ],
  [
    "How To install iPhone 14 Pro Max Any Android Smartphone ! Like official iPhone 😱",
    "How To install iPhone 14 Pro Max Any Android Smartphone ! Like official iPhone iphone 14 caller screen video link ..."
  ],
  [
    "iPhone 14 Pro Max -  Az egyik leg....abb telefon!",
    "Apollo Armor MagSafe: https://www.iphonemagyarorszag.hu — Instagram: https://www.instagram.com/joeritter Facebook: ..."
  ],
  [
    "The Good and the Bad of the iPhone 14 Pro",
    "What's new with the iPhone 14 Pro? The obvious answer is Dynamic Island but there is a lot more to it. In this clip, Marques, ..."
  ],
  [
    "iPhone 14 Pro Max Hindi Review - Don&#39;t Buy It (Mat Karo Paise Waste)",
    "iPhone 14 Pro Max Hindi Review - Don't Buy It (Mat Karo Paise Waste). If You Like this video, hit the like button, share this video, ..."
  ],
  [
    "3 Months With The iPhone 14 Pro Max What’s On My iPhone!",
    "casetifypartner #casetifybounce #whatsonmyiphone Before the year is up I figured I would do one of these \"What's On My iPhone\" ..."
  ],
  [
    "iPhone 14 Pro Max vs.  Pixel 7 Pro - Which Phone is Better??",
    "This is a review of the iPhone 14 Pro Max vs. the Google Pixel 7 Pro. In this review, I compare the new iPhone 14 Pro Max and the ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max - Ultimate Comparison!",
    "Check out the MOFT Snap Stand Power Set: https://bit.ly/3QJi3If No More iTunes, Finder and iCloud Limits, Go With This ..."
  ],
  [
    "iPhone 14 Pro Max Clone in 9,999 | Unboxing &amp; Review #iphone14promax",
    "iPhone 14 Pro Max Clone in 9999 | Unboxing & Review | iPhone 14Pro Max 1TB Under 10k *HERE IS SOCIAL MEDIA HANDLES ..."
  ],
  [
    "Shein iPhone 14 Pro Max Cases",
    "sparkle: https://tinyurl.com/jpb48ty7 the handle: https://tinyurl.com/5n8un26h wavy: https://tinyurl.com/4mb22wmj plaid: ..."
  ],
  [
    "Apple iPhone 14 Series First Look ! *Big Upgrade*",
    "Naye iPhones aa gaye hai doston ! Subscribe for Tabahi Videos INSTAGRAM ▻ http://instagram.com/techburner TWITTER ..."
  ],
  [
    "iPHONE 14 PRO MAX unboxing 😮 DUBAI se bi SASTA in Australia",
    "Dubai se bi sasta iPhone 14 pro max in AUSTRALIA! Almost 96000 INR for 128GB! iphone14promax #australia SUBSCRIBE!"
  ],
  [
    "I Blew up iPhone 14 Pro Max ( ₹1,40,000 ) - क्या ये बचेगा?",
    "I Blew up iPhone 14 Pro Max ( ₹1,40000 ) - क्या ये बचेगा? I Blasted the iPhone 14 Pro Max ! Subscribe for More."
  ],
  [
    "🧸 unboxing my iphone 14 pro! + customization &amp; aesthetic iphone tour :3",
    "hellooo friends! hope y'all are doing well & are staying warm as the year starts coming to a close...! very thankful to have the ..."
  ],
  [
    "iPhone 15 Ultra: DO NOT Buy an iPhone 14 Yet!!!",
    "Due to production issues at Apple supplier factories in China, the iPhone 14 Pro and ‌iPhone 14 Pro‌ Max are backordered and ..."
  ],
  [
    "iPhone 14 Pro vs 14 Pro Max: Real Differences after 2 weeks!",
    "Get 10% OFF TrendMicro's Premium Security Suite with code: MAX10 ➡ https://bit.ly/3CkJRia I've been using Apple's 6.1\" ..."
  ],
  [
    "iPhone 14 Pro Max Deep Purple Unboxing",
    "Unboxing The iPhone 14 Pro Max Deep Purple (128GB). Hope you enjoy! Check out my other videos: iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - NOT EVEN FAIR.",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra. A full early comparison between iPhone 14 Pro Max vs S22 Ultra including ..."
  ],
  [
    "iPhone 14Pro Detailed review after 1 Month  (Malayalam) | iPhone 14Pro vs iPhone 13Pro Comparison.",
    "iPhone 14Pro Comparison vs iPhone 13Pro MAX. This video is all about iPhone 14Pro review after one month but also includes ..."
  ],
  [
    "iPhone 14 Pro max vs iPhone 13 pro max - Full Comparison !!",
    "Hello !! Today in this video I am comparing iPhone 14 pro max with iPhone 13 pro max. (#iphone14promaxvsiphone13promax ..."
  ],
  [
    "iPhone 14 Pro VS iPhone 13 Pro, Camera King? - Irfan&#39;s View",
    "iPhone #comparison #irfansview Apple brand has announced that in iPhone 14 Pro they have brought many differences in ..."
  ],
  [
    "Please Don’t Buy iPhone 14 Pro in 2022! Honest long-term review",
    "See NordPass Business in action now with a 3-month free trial here https://nordpass.com/arthurwiner with code arthurwiner What ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Which is the Flagship King?",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Android Fanboy Uses iPhone 14 Pro for 7 Days!",
    "You can get 83% off and 3 extra months for free if you subscribe at https://surfshark.deals/TECHWISER - Enter promo code ..."
  ],
  [
    "iPhone 14 Pro Max ( deep purple ) unboxing  with MagSafe Leather Case, accessories &amp; camera test 📦",
    "iphone 14 pro max deep purple unboxing with magsafe leather case (ink), accessories and camera test Hello everyone^^, hope ..."
  ],
  [
    "WHAT&#39;S ON MY IPHONE 14 PRO MAX + Unboxing and Setup!",
    "Hi everyone! Today I am unboxing the new iPhone 14 Pro Max in Space Gray. I also show you all what's on my iphone! I show you ..."
  ],
  [
    "Samsung Galaxy S23 Ultra-5 Reasons To Dump New iPhone 14 Pro Max Instantly!",
    "Order Your Galaxy S23 Ultra Mystery Box here: https://dopetechdaily.net/preorder Wallpaper: https://bit.ly/3Ez8hpv Icons: ..."
  ],
  [
    "Should YOU skip the iPhone 14 Pro Max..? (BIG PROBLEMS)",
    "Shop TORRAS UPRO Ostand matte case (for iPhone 14 pro max): http://bit.ly/3VhHvHH Shop TORRAS UPRO Ostand clear case ..."
  ],
  [
    "iPhone 14 PRO Review | The Perfect Phone EXCEPT... (1 month later)",
    "Use code: ELLA for 20% off in the first week (10% after) RHINOSHIELD Collab designs: https://bit.ly/3y58jBo RHINOSHIELD ..."
  ],
  [
    "iPhone 14 Pro &amp; Pro Max Review: An Upgrade in Every Way",
    "We reviewed the iPhone 14 Pro and 14 Pro Max. Checkout the iPhone 14 Pro & Pro Max Here iPhone 14 Pro: ..."
  ],
  [
    "My New Iphone 14 Pro Max in Canada🇨🇦...Black friday sale🦅...",
    ""
  ],
  [
    "Introducing Dynamic Island on iPhone 14 Pro | Apple",
    "Welcome to a shape-shifting, multitasking, head-turning, game-changing iPhone experience. Dynamic Island blends fun and ..."
  ],
  [
    "Beggar Buying iPhone 14 Pro Max Prank- Rich Beggar @BobbyButt",
    "For business enquiry bobbybutt2018@gmail.com Follow on Instagram ..."
  ],
  [
    "60 Days With the iPhone 14 Pro Max HONEST Review",
    "GET PROTECTED WITH NORD VPN & SAVE BIG WITH 4 BONUS MONTHS USING MY LINK: https://www.nordvpn.com/valismind ..."
  ],
  [
    "Top 14 iPhone 14/14 Pro Cases Drop Test! Best Protective Case From 50 Feet?",
    "Which iPhone 14, 14 Pro & 14 Pro Max Case Can Survive a 50 Foot Drop? Comparing the best iPhone 14 cases from Apple, ..."
  ],
  [
    "The Best Smartphone Camera 2022!",
    "It's time to find out once with SCIENCE: What's the best smartphone camera? https://vote.MKBHD.com Thanks to Discord for ..."
  ],
  [
    "iPhone 14 eSIM Controversy Explained",
    "Apple iPhone 14 eSIM is here. Some people are angry. Exclusive NordVPN deal here ➼ https://NordVPN.com/unboxtherapy It's ..."
  ],
  [
    "iPhone 14 Plus vs 14 Pro Max - STOP! You&#39;re Making a Mistake..",
    "TORRAS iPhone 14 Guardian Cases: https://amzn.to/3Sac8NB TORRAS iPhone 14 Diamond Clear ..."
  ],
  [
    "iPhone 14 Pro Max VS. Every Other Camera?",
    "Lightroom Editing Presets + Limited Edition Prints! : https://bit.ly/3pAM2X9 My Camera Bag! : https://bit.ly/3OrFZz2 PM VND Filters ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – SURPRISE FEATURE LEAKED!",
    "A NEW SUPRISE FEATURE has been LEAKED for the iPhone 14 Pro Max and the iPhone 14 Pro that is going to CHANGE ..."
  ],
  [
    "iPhone 14 eSIM Controversy Explained",
    "Apple iPhone 14 eSIM is here. Some people are angry. Exclusive NordVPN deal here ➼ https://NordVPN.com/unboxtherapy It's ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Pubg Test, Heating and Battery Test | Shocking Results 😱",
    "In this video, I will do the pubg/bgmi test comparison between iphone 13 pro max vs iphone 14 pro max and also check out the ..."
  ],
  [
    "iQOO 11 vs Xiaomi 12T Pro vs Samsung S22 Ultra vs Pixel 7 Pro vs iPhone 14 Pro Max Benchmark Test",
    "Snapdragon 8 Gen 2 vs 8+ Gen 1 vs 8 Gen 1 vs Tensor G2 vs A16] I compare the iQOO 11 (SD8Gen2) to the Xiaomi 12T Pro ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – EARLY RELEASE of the iPhone 14!",
    "The iPhone 14 Pro Max and the other iPhone 14 Models could be set for a EARLY RELEASE instead of the predicted Delayed ..."
  ],
  [
    "iPhone 14 Review: Repackaging 101!",
    "There's something you should know about the iPhone 14 Check out the Nano 3 charger at https://ankerfast.club/Nano3MKBHD ..."
  ],
  [
    "Money🤑 I found millions of rupees and lots of iPhone 14 Pro max boxes at landfill near my city",
    "Money   I found millions of rupees and lots of iPhone 14 Pro max boxes at landfill near my city #iphone13 #restoration 1."
  ],
  [
    "iPhone 14 Pro Max VS. Every Other Camera?",
    "Lightroom Editing Presets + Limited Edition Prints! : https://bit.ly/3pAM2X9 My Camera Bag! : https://bit.ly/3OrFZz2 PM VND Filters ..."
  ],
  [
    "iPhone 14 Pro Hidden Features!",
    "Try out Backblaze for free (no credit card required) at: https://backblaze.com/tac The iPhone 14 Pro is finally here and along with a ..."
  ],
  [
    "iPhone 14/Pro Impressions: Welcome to Dynamic Island!",
    "iPhone 14 first look, and hands-on with the dynamic island AKA The Pill! Apple Watch Ultra impressions: ..."
  ],
  [
    "iPhone 14 Pro Max - First 14 Things To Do!",
    "iPhone 14 Pro Max - First 14 Things to Do! Just bought a new iPhone 14 Pro Max? Here are the first 13 things to do on your new ..."
  ],
  [
    "iPhone 14 Pro Max Review नेपालीमा: MDMS is kidney Saver 😅",
    "Hi everyone, this is my full review of the iPhone 14 Pro Max in Nepali. This phone has not launched in the Nepal market till now ..."
  ],
  [
    "iPhone 14 Pro Max: Changed My Mind After 4 Days...",
    "Apple on Friday released the new iPhone 14 models, and I picked one up on launch day. I have been using the iPhone 14 Pro ..."
  ],
  [
    "The Best Smartphone Camera 2022!",
    "It's time to find out once with SCIENCE: What's the best smartphone camera? https://vote.MKBHD.com Thanks to Discord for ..."
  ],
  [
    "Selling Our IPhone 14 Pro Max In Just 1 Rupee 😬- आज जयपुर में होगा लाखों का नुकसान 😣- 100% Real",
    "Earn money making short videos with Gotchosen! Download GotChosen App now: ..."
  ],
  [
    "I Bought a Fake #iPhone 14 Pro Max worth 10,000 Rupees!",
    "Be aware of the fake iPhone 14 pro max scam! #shorts #TechBar #Apple #iPhone14ProMax #India #Hindi == Free Music For ..."
  ],
  [
    "iPHONE 14 Buyer’s Guide 2022",
    "Products mentioned: iPhone 14 Plus - https://bit.ly/3gvrU7U iPhone 14 Pro - http://bit.ly/3V9eAVS iPhone 14 Pro Max ..."
  ],
  [
    "iPhone 14 Pro Hands-On with NEW Features!",
    "We got our hands on the new iPhone 14, iPhone 14 Plus, iPhone 14 Pro and iPhone 14 Pro Max! Not to mention the new Apple ..."
  ],
  [
    "La VERDAD del iPhone Más Caro! (iPhone 14 Pro Max)",
    "Aquí esta mi reseña completa del iPhone 14 Pro Max el mejor iPhone que vende Apple en el 2022 ▷Suscríbete al canal para ..."
  ],
  [
    " iPhone 14 Pro Max (deep purple) unboxing ✨ | ios 16 setup + camera test + accessories",
    "Hello! For today's vlog, we will welcome my new baby, the iPhone 14 Pro Max in deep Purple 256gb! I highly recommend deep ..."
  ],
  [
    "Price &amp; Features of Iphone 14",
    "USA Telugu Vlogs showing New apple Iphone-14, Iphone-14 plus, Iphone-14 Pro & Iphone-14 Pro Max features, price and ..."
  ],
  [
    "Great Day...!! Found the New Apple iPhone 14 Pro Max on the rubbish",
    "Great Day...!! Found the New Apple iPhone 14 Pro Max on the rubbish #iphone14 #restoration Welcome to the Galaxy Restore ..."
  ],
  [
    "Do You REALLY Need a Pro iPhone 14?",
    "Check out the iRobot Roomba j7+ here: https://amzn.to/3zFznYT Do you really need the pro version of the iPhone to have a good ..."
  ],
  [
    "iPhone 14 Pro Max In-Depth Camera Review | New Sensor, New Abilities!",
    "The first iPhone with a 48MP main sensor. The 14 Pro and Pro Max have easily the biggest iPhone camera upgrade in years; not ..."
  ],
  [
    "Vivo X90 Pro Plus Cameras better than iPhone 14 Pro Max? In-Depth Camera Comparison",
    "The vivo X90 Pro Plus has great cameras sure, we've seen that already in my unboxing video, but how does it stack up when ..."
  ],
  [
    "iPhone 14 Pro Max Tips and Tricks - First Things To Do!",
    "In this video, we're going to show you some of the best tips and tricks for the brand new iPhone 14 Pro Max! These tips will help ..."
  ],
  [
    "iPhone 14 Pro Review: 3 Months Later!",
    "In this review, I will be giving you guys an in depth look at the iPhone 14 Pro and showing how it holds up after 3 months of use."
  ],
  [
    "WHAT&#39;S ON MY IPHONE 14 PRO MAX + Unboxing and Setup!",
    "Hi everyone! Today I am unboxing the new iPhone 14 Pro Max in Space Gray. I also show you all what's on my iphone! I show you ..."
  ],
  [
    "7 Reasons You NEED iPhone 14 Pro!",
    "7 Reasons You NEED iPhone 14 Pro! Hello all and welcome to my update video on the Apple iPhone 14 Pro which launched ..."
  ],
  [
    "How to use iPhone 14 Pro/Max + Tips/Tricks!",
    "How to use your new iPhone 14 Pro / Pro Max! **10% off Code: ESR001US: ESR HaloLock 3-in-1 Wireless Charger with ..."
  ],
  [
    "IPHONE 14 PRO MAX 1,999 ME 🥳 DELHI REAL CHOR BAZAR 😍 #nalayakgamer #shorts #viral",
    "IPHONE 14 PRO MAX 1999 ME DELHI REAL CHOR BAZAR #nalayakgamer #shorts #viral #youtubeshorts BUSNESS ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Sparkling Water FREEZE Test! What&#39;s Gonna Happen?!",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra sparkling water freeze test! Drop these in freeze temps to test durability."
  ],
  [
    "iPhone 14 Pro Max Tips y Trucos",
    "Tips y Trucos iPhone 14 Pro Max."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - Which Should You Choose?",
    "iPhone 14 Pro Max and the S22 Ultra are the top flagship models from Apple and Samsung right now. In this video I compare ..."
  ],
  [
    "The iPhone 14 Pro Max | CINEMATIC MODE 4K",
    "I was in the black forest and took my iPhone 14 pro max with me to test the new CINEMATIC MODE. No gimbal and no extra ..."
  ],
  [
    "OMG!!Little girl found many iphone 14 pro max in Suitcase Black",
    "OMG!!Little girl found many iphone 14 pro max in Suitcase Black #foundphone#iphone14promax#restorephone ..."
  ],
  [
    "iPhone 14 First Things to do! ( Tips &amp; Tricks )",
    "If you have just bought the iPhone 14 Pro or Pro Max. Or if you have a device with iOS 16, here are 20+ Tips & Tricks and Hidden."
  ],
  [
    "iPhone 14 Pro Max: Too Big? My Experience, 2 Weeks Later",
    "Sharing my experience upgrading to the iPhone 14 Pro Max, coming from a 6.1\" smaller iPhone. is it too big? Is the 14 Pro worth ..."
  ],
  [
    "iPhone 14 Pro Max “Real Review”",
    "iPhone 14 Pro Max Wanna buy some of my gadgets - http://amzn.to/1zZ2y4P Check out my website - http://www.flossycarter.net ..."
  ],
  [
    "My New Iphone 14 Pro Max in Canada🇨🇦...Black friday sale🦅...",
    ""
  ],
  [
    "PRICE DROP SA IPHONE 14 PRO MAX, 13 PRO MAX, IPAD,APPLE WATCH GREENHILLS DECEMBER 25 2022 - JAN 2023",
    "Erratum: iPad Pro M2 11\" 256Gb 58500 po. 256Gb lang po yun. Not 512Gb. Salamat po.   Mag-ingat po sa mga scammers!"
  ],
  [
    "iPhone 14 Pro Max - Unboxing, Setup and First Look",
    "iPhone 14 Pro Max, and iPhone 14 are out and just released. In this video I unbox the iPhone 14 Pro Max in Purple. I show you ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing and Initial Impressions!",
    "Today lets unbox and get some hands on time with the brand new iPhone 14 pro max! The Best Accessories for YOUR iPhone 14 ..."
  ],
  [
    "Surprising My brother 😍 Iphone 14 Pro MAX 📱 1,85,000₹ Worth !! He was Shocked @DANJRCM",
    "MRV Electronics Location : https://maps.app.goo.gl/YBK8qK5MwbFuvCTx7?g_st=ic Whatsapp : https://wa.me/919176000088 ..."
  ],
  [
    "iPhone 14 Pro Max - ANG LAKI NG PINAGBAGO!",
    "The Iphone 14 Pro Max is not only the best iPhone ever released but also the best smartphone in the world. The iPhone 14 Pro ..."
  ],
  [
    "iPhone 14 Pro 3 Months Later!",
    "iPhone 14 Pro 3 Months Later! Hello all and welcome to this video discussion on the iPhone 14 Pro Max 3 Months later and ..."
  ],
  [
    "IPHONE 14 PRO MAX *DEEP PURPLE* UNBOXING &amp; REVIEW",
    "Liene photo printer https://amzn.to/3qTtaUy Social medias ------------------------------ https://linktr.ee/Anaissplatero ..."
  ],
  [
    "Apple iPhone 14 Pro Max Unboxing &amp; Review 💣",
    "Join Telegram Deals Channel for More Offers and Deals: https://t.me/techlogicdeal realme narzo 50i: https://amzn.to/3f9F9dR ..."
  ],
  [
    "iPhone 14 Pro Max vs $30,000 RED!!",
    "iPhone 14 Pro Max or $30000 Red Camera!?? Thanks to CASETiFY for sponsoring this video! CASETiFY's iPhone 14 Impact ..."
  ],
  [
    "PRICE DROP SA IPHONE 14 PRO MAX, 13 PRO MAX, IPAD,APPLE WATCH GREENHILLS DECEMBER 25 2022 - JAN 2023",
    "Erratum: iPad Pro M2 11\" 256Gb 58500 po. 256Gb lang po yun. Not 512Gb. Salamat po.   Mag-ingat po sa mga scammers!"
  ],
  [
    "OMG!!Little girl found many iphone 14 pro max in Suitcase Black",
    "OMG!!Little girl found many iphone 14 pro max in Suitcase Black #foundphone#iphone14promax#restorephone ..."
  ],
  [
    "iPhone 14 Pro Max - VENICE Cinematic 4K Video",
    "So I took the new iPhone 14 Pro Max in Venice with me and decided to see what I could come up with, in less than 8 hours while I ..."
  ],
  [
    "iPhone 14 Pro and Pro Max - Change These 14 Settings ASAP",
    "iPhone 14 Pro or iPhone 14 Pro Max are out. I will show you the first 14 things to do with your brand new and shiny iPhone 14 Pro ..."
  ],
  [
    "I Bought a Fake #iPhone 14 Pro Max worth 10,000 Rupees!",
    "Be aware of the fake iPhone 14 pro max scam! #shorts #TechBar #Apple #iPhone14ProMax #India #Hindi == Free Music For ..."
  ],
  [
    "Great Day...!! Found the New Apple iPhone 14 Pro Max on the rubbish",
    "Great Day...!! Found the New Apple iPhone 14 Pro Max on the rubbish #iphone14 #restoration Welcome to the Galaxy Restore ..."
  ],
  [
    "iPhone 1 vs iPhone 14 Pro Max",
    "Original iPhone 2G vs iPhone 14 Pro Max! #shorts I spend a LOT of time trying to make my videos as concise, polished and useful ..."
  ],
  [
    "Great!! i Found a Lot of New iPhone 14 Pro Max Last Model at the Garbage",
    "Great!! i Found a Lot of New iPhone 14 Pro Max Last Model at the Garbage #iphone13 #restoration 1. Great Lucky... Found a lot of ..."
  ],
  [
    "Buying iPhone 14 series on First Day !! iPhone 14 pro max Unboxing 😍🤑",
    "Hello !! Aaj hamne thoda video ko vlog style mein shoot kiya hai or is video mein hamne unboxing ki hai iPhone 14 pro max ki."
  ],
  [
    "I&#39;m disappointed with the iPhone 14 Pro.",
    "Anker C200 Webcam: https://ankerfast.club/ankerwork_MarkSpurrell Discount: Enjoy 31% OFF, valid till 25th Dec In some ways ..."
  ],
  [
    "iPhone 14 Pro - 3+ Months Later - This is The One!",
    "iPhone 14 Pro has been out for over three months and after using it I share my experience with the iPhone 14 Pro after 6 months."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 14 Plus Full Comparison in Hindi",
    "Visit Croma: https://omgrefer.com/XdH7f Offer 10% upto 500 off on croma.com (n/a on Smartphones) Code - CRMAOM5H Offer ..."
  ],
  [
    "iPhone 13 Pro Max को iPhone 14 Pro Max बनाया // real talent // real art // home made #shorts",
    "iPhone 13 Pro Max को iPhone 14 Pro Max बनाया // real talent // real art // home made #shorts. We do not own the video ..."
  ],
  [
    "WHATS ON MY IPHONE 14 PRO MAX? | *iOS 16 + App Recommendations*",
    "WHATS ON MY IPHONE 14 PRO MAX? | *iOS 16 + App Recommendations* CONNECT WITH ME ⬇️ IG ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – A BIG PRICE CHANGE For The iPhone 14!",
    "This year we could be getting A BIG PRICE CHANGE For The iPhone 14 Pro Max and the other iPhone 14 Models. How will this ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; Gameplay (PUBG, NEW STATE, APEX MOBILE)",
    "iPhone 14 Pro Max Unboxing & Gameplay (PUBG, NEW STATE, APEX MOBILE) Today we are unboxing and testing PUBG ..."
  ],
  [
    "iPhone 14 pro Max gold 🔥",
    ""
  ],
  [
    "iphone 14 pro max gold unboxing ✨ | cute apple accessories haul + ios 16 set up + customization ♡",
    "watch in hd hey there! ✿ It's good to be back! I hope you guys are doing great. in this video, I upgraded my phone from an android ..."
  ],
  [
    "☁️ iPhone 14 pro max unboxing &amp; customization | 2022",
    "hello! welcome back :) hope you enjoyed this unboxing~ there were quite a few suggestions made on the previous giveaway ..."
  ],
  [
    "IPHONE 14 PRO MAX *DEEP PURPLE* UNBOXING &amp; REVIEW",
    "Liene photo printer https://amzn.to/3qTtaUy Social medias ------------------------------ https://linktr.ee/Anaissplatero ..."
  ],
  [
    "iPhone 14 Pro Max Gameplay (Handcam) PUBG Mobile/BGMI 5 Finger Claw Full Gyroscope",
    "PUBG Mobile/BGMI HANDCAM iPhone 14 Pro Max Gameplay 5 Finger Claw Join discord - https://discord.gg/7ZwQEw9 ..."
  ],
  [
    "iPhone 14 Pro Max Vs. iPhone 13 Pro Max Vs. iPhone 12 Pro Max",
    "iPhone 14 Pro Max Vs iPhone 13 Pro Max Vs iPhone 12 Pro Max | Side by Side Comparison | What's the Difference ? ▻Please ..."
  ],
  [
    "Full iPhone 14 Lineup unboxing and review!",
    "The new iPhone 14, iPhone 14 Pro, and iPhone 14 Pro Max! ❤️➡️ PLEASE SUBSCRIBE FOR MORE VIDEOS!"
  ],
  [
    "Android Phone Ko iPhone 14 Pro Max Kaise Banaye !! How To Convert Android Into iPhone 14 Pro Max ?",
    "Welcome to Maurya ji technical. Dosto aaj ke is video me bataya gaya hai kaise aap android phone ko iphone me convert kar ..."
  ],
  [
    "iPhone 14 Pro Cinematic Footage 4K",
    "Sign up to Milanote for free with no time-limit. It's a no brainer! https://milanote.com/moment1222 The gear I used in this vid might ..."
  ],
  [
    "iPhone 14 Pro Max ስንት ይሸጥ ይሁን ??",
    "In This Channel You will get an Entertaining Content for the Habeshan GAMING Community . So Much Love Subscribe (IT'S ..."
  ],
  [
    "After 3 Months - iPhone 14 Pro Still Makes NO SENSE!",
    "I won't deny that the iPhone 14 Pro and Pro Max are really good phones. However, after having used it, I've realized that all the ..."
  ],
  [
    "HÀNG TUYỂN iPhone 11 Pro Max iOS 13.3: Không lên iOS đúng thật là chân ái!",
    "Sale đậm cuối năm - ShopDunk giảm 47% sản phẩm Apple. Săn ngay iPhone 14 Pro Max giảm đến 7.000.000đ, MacBook Air ..."
  ],
  [
    "iPhone 14 Pro Max at ₹10,999 | Unboxing &amp; Review | iPhone 14 Pro Max Clone Vs Original",
    "Testing iPhone 14 Pro Max Clone. Check the unboxing and overall review Buy Here iPhone 14 Pro Max Clone ..."
  ],
  [
    "Telefon narxlari. Yangi iPhone narxlari. iPad narxlari. iPhone 14 Pro max naxrlari. #iphone #ipad",
    "Joylashuvimiz: Toshkent shahri, Malika Savda bozori, A4 do'kon, Ultra Plus. Qo'ng'iroq uchun +998992222232 Telefon sotish ..."
  ],
  [
    "iPhone 14 Pro Max “Real Review”",
    "iPhone 14 Pro Max Wanna buy some of my gadgets - http://amzn.to/1zZ2y4P Check out my website - http://www.flossycarter.net ..."
  ],
  [
    "iPhone 14 Pro vs Pro Max! Don&#39;t Let This Happen To You!",
    "This is my iPhone 14 Pro vs iPhone 14 Pro Max decision video. Why I decided to buy the iPhone 14 Pro Max after I already got the ..."
  ],
  [
    "iPhone 14 Pro vs. S22 Ultra vs. Pixel 7 Pro: 1,000 photos later",
    "This year even the iPhone 14 Pro has a 48MP camera which is still half as many as the 108MP of the Samsung S22 Ultra but ..."
  ],
  [
    "iPhone 14 Pro Max - Real World Review!",
    "iPhone 14 Pro Max is a great upgrade for iPhone this year. iPhone 14 pro brings with it the new A16 CPU, New 48MP camera, ..."
  ],
  [
    "Apple iPhone 14 Pro Max Disassembly Teardown Repair Video Review",
    "Apple iPhone 14 Pro Max Disassembly Teardown Repair Video Review. Repairability SCORE: 6.5/10 (breakdown of score @8:09 ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing, Hands On &amp; First Impressions! (Space Black)",
    "Product Links! Casetify cases: http://casetify.com/techdailyyt Apple website: https://www.apple.com/iphone-14-pro ..."
  ],
  [
    "PICKING UP MY iPHONE 14 PRO MAX | UNBOXING AND SET UP",
    "PICKING UP MY iPHONE 14 PRO MAX | UNBOXING AND SET UP Welcome back to part 2 of my previous vlog where I pick up ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - CAMERA Comparison!",
    "Which Phone has the Best Camera? IPhone 14 Pro / Pro Max vs Samsung Galaxy S22 Ultra! ▷ Try HUEL Today!"
  ],
  [
    "We found a lot of iPhone 14 Pro Max at the dump....!!  But...🤔!!",
    "We found a lot of iPhone 14 Pro Max at the dump....!! But...  !! #iphone14 #restoration Welcome to the Galaxy Restore Official ..."
  ],
  [
    "iphone 14 pro max unboxing (1TB silver) | setup + accessories",
    "hello friends, welcome back to another video! I really enjoy watching and filming unboxing videos, so here's one on a recent ..."
  ],
  [
    "CHOOSE WISELY! iPhone 14 Pro Max Vs. Galaxy Z Fold 4 HONEST Review!",
    "Whether you're looking for the iPhone 14 Pro Max, or the Galaxy Z Fold 4, today I decided to do an HONEST look at both of these ..."
  ],
  [
    "iPhone 14 Pro Max VS iPhone 13 Pro Max! Full Compare!",
    "I compare the iPhone 13 Pro Max against the all-new 2022 iPhone 14 Pro Max including performance, display, the Dynamic ..."
  ],
  [
    "iPhone 14 Pro First Look - The Most Advanced iPhone Is Coming🔥🔥🔥",
    "Namaskaar Dosto, yeh ek bahut hi khaas video hai jaha pe maine aapse baat ki ha iPhone 14 series ke baare mein aur share ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing #shorts",
    "iPhone 14 Pro Max Unboxing #shorts iphone 14 pro max, iphone 14 pro, iphone 14 ,iphone 14 pro unboxing, iphone 14 pro max ..."
  ],
  [
    "iPhone 14 Pro Max Tips y Trucos",
    "Tips y Trucos iPhone 14 Pro Max."
  ],
  [
    "iPhone 14 Plus Review: 200 Reasons To Buy Over a 14 Pro Max",
    "The $899 iPhone 14 Plus is either a big iPhone 14 or a scaled-back iPhone 14 Pro Max. Ever since the iPhone XS Max launched ..."
  ],
  [
    "iPhone 14 PRO MAX PURCHASE IN USA 🇺🇸 || USA 🇺🇸 DONKEY ASHU ROR",
    "iPhone 14 PRO MAX PURCHASE IN USA || USA DONKEY ASHU ROR Instagrams :- ashu_ror_22 Link ..."
  ],
  [
    "Get an iPhone 14 or literally die.",
    "Get $25 off all pairs of Vessi Footwear with offer code LinusTechTips at https://www.Vessi.com/LinusTechTips Get your Cablemod ..."
  ],
  [
    "iPhone 14 Pro Max - 14 Settings You Need To Know",
    "iPhone 14 Pro Max and iPhone 14 Pro are here. With the new 2022 iPhone 14 this year Apple has added new features with the ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "USED IPHONE 14 pro ,14 PROMAX IN DUBAI | IPHONE 11,12 dubai |IPHONE PRICE IN DUBAI | BASE WIRELESS",
    "Hey Guys, i hope you enjoy the video, So today in this video i have shown you lateset in BASE WIRELESS SHOP ..."
  ],
  [
    "IPHONE 14 PRO MAX REVIEW - FANNY GAMEPLAY (WITH HAND CAM) | MLBB",
    "Hello there! Thank you for visiting my YouTube Channel. Hoping that you'd enjoy my video, don't forget to like the video and ..."
  ],
  [
    "iPhone 14 TEARDOWN! - You&#39;re not going to believe it...",
    "Finally - an iPhone that's more reparable than an Android! Check out https://www.Ridge.com/JerryRig & use code 'JerryRig' to get ..."
  ],
  [
    "Google Pixel 7 Pro vs. iPhone 14 Pro Max Battery Test",
    "Go to https://ridge.com/phonebuff and use code PHONEBUFF for 10% off! Big thanks to The Ridge Wallet for sponsoring this video ..."
  ],
  [
    "iPhone 14 Pro - Complete Beginners Guide",
    "This In-Depth iPhone 14 Pro Beginners Guide covers Everything about the iPhone 14, iPhone 14 Plus, iPhone 14 Pro & iPhone ..."
  ],
  [
    "Iphone 14 Pro Max Sale Patna Bihar || Cheapest iPhone In Patna || Second Hand Mobile Shop Bihar",
    "Iphone 14 Pro Max Sale Patna Bihar || Cheapest iPhone In Patna || Second Hand Mobile Shop Bihar . . Address - Cell World ..."
  ],
  [
    "The Downfall Of The iPhone 14",
    "Get The Cheapest iPhones Here: https://amzn.to/3JTnWAr Get The Cheapest Androids Here: https://amzn.to/3r2k1st Get ..."
  ],
  [
    "IPHONE 14 PRO MAX 1,999 ME 🥳 DELHI REAL CHOR BAZAR 😍 #nalayakgamer #shorts #viral",
    "IPHONE 14 PRO MAX 1999 ME DELHI REAL CHOR BAZAR #nalayakgamer #shorts #viral #youtubeshorts BUSNESS ..."
  ],
  [
    "10 Reasons iPhone 14 Pro Max is BETTER than Galaxy S22 Ultra!",
    "10 Reasons iPhone 14 Pro Max is BETTER than Galaxy S22 Ultra! Hello all and welcome to this video discussion on why Apple ..."
  ],
  [
    "🥳 फ्री में Iphone 14 Pro Max मंगाए ! How to get free iphone 14 pro max ! iphone giveaway !",
    "फ्री में Iphone 14 Pro Max मंगाए ! How to get free iphone 14 pro max ! iphone giveaway ! App Link ..."
  ],
  [
    "FIRST 10 THINGS TO DO ON NEW IPHONE 14 PRO | iOS 16 Setup &amp; Customization",
    "CASETiFY's iPhone 14 Impact Case Series is now available at casetify.com! Go to https://www.casetify.com/createdbyella today to ..."
  ],
  [
    "HOW TO USE CAMERA APP on iPhone 14 pro &amp; pro Max | IN DEPTH TUTORIAL",
    "iPhone 14 pro camera and 14pro Max can be quiet complicated for beginners. Here is in depth tutorial to guide you through ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – A BIG PRICE CHANGE For The iPhone 14!",
    "This year we could be getting A BIG PRICE CHANGE For The iPhone 14 Pro Max and the other iPhone 14 Models. How will this ..."
  ],
  [
    "¡Es CASI PERFECTO! iPhone 14 Pro Max REVIEW",
    "Usa el código: TOPES2022 para tener un 20% de descuento en RHINOSHIELD Fundas transparentes CLEAR: ..."
  ],
  [
    "ASMR Unboxing NEW Apple iPhone 14 Pro Max (lofi, tapping, tracing, scratching) ~SUPER TINGLY~",
    "asmr #softspoken #lofi NEW ASMR PODCAST EP 10 UP NOW https://www.youtube.com/watch?v=3sIUWNF9uV4 LISTEN TO MY ..."
  ],
  [
    "iPhone 14 Plus vs 14 Pro Max - Ultimate Camera Test!",
    "Get 15% OFF any Casetify Case! ➡ https://www.casetify.com/maxtechyt Apple's iPhone 14 Plus seems quite similar to the Pro ..."
  ],
  [
    "Get an iPhone 14 or literally die.",
    "Get $25 off all pairs of Vessi Footwear with offer code LinusTechTips at https://www.Vessi.com/LinusTechTips Get your Cablemod ..."
  ],
  [
    "Minecraft IPHONE 14 PRO MAX TNT HOUSE BUILD CHALLENGE - NOOB vs PRO vs HACKER vs GOD / Animation",
    "Minecraft NOOB vs PRO IPHONE HOUSE ➜Thumbs up^^ & Subscribe for more =) ➜Download houses from my website: ..."
  ],
  [
    "IPHONE 14 PRO MAX Review - WALA PA RIN MAKAKATALO SA IPHONE!",
    "The iphone 14 pro max is just so good! I had to make a full review for this beastly phone! The iphone 14 pro max is my favorite ..."
  ],
  [
    "i bought an Android iPhone 14 Pro Max for $98 and got what i deserved 😶",
    "this is a fake 14 Pro max I bought from ebay... let's unbox this and see what I got.."
  ],
  [
    "Top 10 Cheapest USED iPHONE 13 Pro Max, 13 Pro, iPHONE 14 PRO Max, Qatar mobile market | jenishliz",
    "Dear all welcome to my channel...   SUBSCRIBE Here https:// youtube.com/jenishliz/ Follow me on... Instagram: ..."
  ],
  [
    "FIRST GAMEPLAY with iPhone 14 PRO MAX🔥Pubg Mobile",
    "Thanks for watching Please subscribe to my channel — 4 FINGER AND GYRO Devıce: Iphone 14 PRO MAX 40KILLS MY NEW ..."
  ],
  [
    "iPhone 14 Plus vs 14 Pro Max - NOT What We Expected..!",
    "Download Magic Lasso Adblock for FREE! ➡ https://www.magiclasso.co/maxtech Is the iPhone 14 Plus Worth it? Or Spend More ..."
  ],
  [
    "How to setup Airtel ESIM on iPhone",
    "My Recommendations Best iPhone Cases: https://amzn.to/3Av0q85 Best Tempered Glass for iPhone: https://amzn.to/2SN9Bj5 ..."
  ],
  [
    "iPhone 14 Pro Max Best Features",
    "Dynamic Island, iOS 16, Deep Purple, Always on Display! - My Wallpapers ..."
  ],
  [
    "iPhone 14 pro Max... Thank you all my subscribers..",
    ""
  ],
  [
    "Molvi Sahb Ne Liya iPhone 14 Pro Max 😍 - Khizar Omer Extra",
    "Welcome In Description! Molvi Sahb Ne Liya iPhone 14 Pro Max - Khizar Omer Extra ➤ Main Channel @khizaromer ..."
  ],
  [
    "Takpo Buys Cheap iPhone 14 Pro Max",
    "Oworitakpo is heading to school and he comes across a guy that is selling iPhone 14 Pro Max for N22,000. You can't imagine ..."
  ],
  [
    "I Bought a Fake #iPhone 14 Pro Max worth 10,000 Rupees!",
    "Be aware of the fake iPhone 14 pro max scam! #shorts #TechBar #Apple #iPhone14ProMax #India #Hindi == Free Music For ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra | Comparativa de cámaras",
    "No te pierdas de ningún contenido: https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "iPhone 14  / 14 Pro / 14 Pro Max - Unboxing All The Colors and Apple Cases",
    "iPhone 14 / 14 Pro / 14 Pro Max - Unboxing All The Colors and Cases Buy them here, http://amzn.to/1zZ2y4P Wanna buy some of ..."
  ],
  [
    "Google Pixel 7 Pro vs iPhone 14 Pro Max - CLEAN SWEEP. 😳",
    "Google Pixel 7 Pro vs iPhone 14 Pro Max. Early specs-based full comparison between Pixel 7 Pro vs iPhone 14 Pro including ..."
  ],
  [
    "I Bought ₹10,000 iPhone 14 Pro Max . Apple iPhone Clone Unboxing",
    "SUBSCRIBE FOR DAILY TECH VIDEOS ▻https://bit.ly/2EPRVe0 iPhone 14 Pro Max ₹10000 Me | Biggest Scam | iPhone ..."
  ],
  [
    "HOW TO BUY IPHONE 14 PRO MAX CLONE | JUST ₹3459/- | COD AVAILABLE | 14 PRO MAX CLONE ONLINE",
    "IPhone 14 pro max clone price in india// iPhone 14 clone|How to buy Iphone 14 Pro max clone online | Just ₹ 3999/- | COD ..."
  ],
  [
    "iPhone 14 Pro issues, iPhone SE 4 cancelled?, iOS 16.2.1, iPhone 15 and more",
    "iPhone 14 Pro and iPhone 14 Pro Max have some problems and could have been better. iPhone SE 4 could be cancelled, iOS ..."
  ],
  [
    "Tengo mucho que decir sobre el iPhone 14 Pro",
    "Wondershare #Filmora12 #MadeWithFilmora ▸ Descarga gratuita de Filmora 12 → https://bit.ly/3HXpHOl ▸ Probar Filmora ..."
  ],
  [
    "✨📦 iPhone 14 Pro Max Purple | AESTHETIC unboxing + customisations 💜",
    "Hello friends, it's been a hot minute ✿ ٩(˘◡˘)۶ . Finally decided to switch back to iOS! Today will be an unboxing of the iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max CAMERA COMPARISON",
    "iPhone 14 pro max vs iPhone 13 pro max camera comparison. Get 20% Off Now: https://bit.ly/3feByLF Transfer From Android to ..."
  ],
  [
    "Camera Test - iPhone Vs Samsung Vs GoPro",
    "We do camera test of all flagship phones and gopro at the same time - Who will win in this battle - Samsung s22 ultra vs i phone ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Full Comparison - *SHOCKING*",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max aur iPhone 13 Pro Max Se Full Comparison kiya hu ,Umeed hai ..."
  ],
  [
    "IPhone 14 Pro Vs IPhone 14 Pro Max",
    "IPhone 14 Pro Vs IPhone 14 Pro Max Full Comparison Of IPhone 14 Pro Vs IPhone 14 Pro Max. Hello friends welcome to ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra | ¡QUE HUMILLACIÓN!",
    "SORTEO iPhone 14 Pro Max o Samsung S22 Ultra (INTERNACIONAL  ) Participa: SUSCRÍBETE y HAZTE MIEMBRO: ..."
  ],
  [
    "ዋጋዉን ተዉትና ||  iphone 14 pro max review in Ethiopia.",
    "iphone14promax #phonereview #ethiopia My tiktok - https://vm.tiktok.com/ZMeJB3VfY/ ​ ​Telegram channel where i put all my ..."
  ],
  [
    "57.199 TL&#39;lik iPhone 14 Pro Max kutusundan çıkıyor!",
    "Apple, geçtiğimiz haftalarda düzenlediği etkinlikte yeni işlemcisi olan A16 Bionic ile donatılmış iPhone 14 Pro ve Pro Max ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – 256GB Storage Base Model!",
    "A NEW Report has come in Claiming that we could be getting an iPhone 14 Pro Max 256GB Storage Base Model for the FIRST ..."
  ],
  [
    "Один месяц c iPhone 14 Pro Max - необычный опыт эксплуатации с неожиданным концом...",
    "Новая киллер фича Алисы — https://clck.ru/32MmQm #iphone14 #iphone14pro #iphone14promax Телеграм Wylsacom ..."
  ],
  [
    "IPhone 14 Pro Max Khareed Liya 😍",
    "Don't forget to subscribe !!! Gaming Channel▻ https://www.youtube.com/c/duckyextra instagram▻ ..."
  ],
  [
    "iPhone 14Pro Max - N18,500 😳",
    "Mama Tegwolo decides to buy iPhone 14 from a tout by the road side for N18,500. The tout doesn't know her son Tegwolo, ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison",
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison. Which is the best flagship camera setup?"
  ],
  [
    "IPHONE 14 PRO MAX UNBOXING SILVER ✨",
    "HELLO ! Bienvenu.e, je t'invite à lire la description ♡ ⬇️ ∵⋱✦♡Réseaux sociaux∵⋱✦♡ YouTube Principal ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max - Which to choose?",
    "iPhone 14 Pro vs iPhone 14 Pro Max - Which to choose? Apple iPhone 14 Pro and Apple iPhone 14 Pro Max were just released ..."
  ],
  [
    "i bought an Android iPhone 14 Pro Max for $98 and got what i deserved 😶",
    "this is a fake 14 Pro max I bought from ebay... let's unbox this and see what I got.."
  ],
  [
    "ASMR Unboxing NEW Apple iPhone 14 Pro Max (lofi, tapping, tracing, scratching) ~SUPER TINGLY~",
    "asmr #softspoken #lofi NEW ASMR PODCAST EP 10 UP NOW https://www.youtube.com/watch?v=3sIUWNF9uV4 LISTEN TO MY ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max / Samsung / Xiaomi / OPPO / OnePlus Battery Life DRAIN Test!",
    "How does the A16 Bionic powered iPhone 14 Pro Max (4323mAh) stack up against the iPhone 13 Pro Max (4352mAh), Samsung ..."
  ],
  [
    "Один месяц c iPhone 14 Pro Max - необычный опыт эксплуатации с неожиданным концом...",
    "Новая киллер фича Алисы — https://clck.ru/32MmQm #iphone14 #iphone14pro #iphone14promax Телеграм Wylsacom ..."
  ],
  [
    "iPhone 14 vs iPhone 14 Pro vs iPhone 14 Pro Max - Full comparison",
    "Today I will compare the new iPhone 14 from Apple, namely the iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max! Which of ..."
  ],
  [
    "iPhone 14 Pro Programmed To Reject Repair  - Teardown and Repair Assessment",
    "Based on my testing with the iPhone 14 Pro it doesn't seem 3rd party repair is viable on this device, despite Apples introduction of ..."
  ],
  [
    "iPhone 14 Plus vs 14 Pro Max - Ultimate Camera Test!",
    "Get 15% OFF any Casetify Case! ➡ https://www.casetify.com/maxtechyt Apple's iPhone 14 Plus seems quite similar to the Pro ..."
  ],
  [
    "iphone 14 Pro Max Do You Like This Design #Shorts",
    ""
  ],
  [
    "Tengo mucho que decir sobre el iPhone 14 Pro",
    "Wondershare #Filmora12 #MadeWithFilmora ▸ Descarga gratuita de Filmora 12 → https://bit.ly/3HXpHOl ▸ Probar Filmora ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max - Which is better? #iphone14pro #iphone14promax #shorts",
    ""
  ],
  [
    "iPhone 14 PRO MAX -la DYNAMIC ISLAND de APPLE-",
    "DESCUBRE el nuevo Apple iPhone 14 PRO MAX y todas sus NOVEDADES. Analizamos y probamos el iPhone más potente para ..."
  ],
  [
    "Redmi 200MP vs iPhone 14 Pro Max 48MP Camera Comparison",
    ""
  ],
  [
    "Google Pixel 7 Pro vs. iPhone 14 Pro Max Battery Test",
    "Go to https://ridge.com/phonebuff and use code PHONEBUFF for 10% off! Big thanks to The Ridge Wallet for sponsoring this video ..."
  ],
  [
    "1 mes con el iPhone 14 Pro Max, ¿lo recomiendo?",
    "Estás buscando un nuevo teléfono y no sabes qué comprar? Mira este vídeo para conocer mi opinión sobre el iPhone 14 Pro ..."
  ],
  [
    "How To Use iPhone 14 Pro/iPhone 14 Pro Max! (Complete Beginners Guide)",
    "Get The iPhone 14 Here: https://amzn.to/3qLgoYc Get The Cheapest iPhones Here: https://amzn.to/3JTnWAr Get The Cheapest ..."
  ],
  [
    "Apple Event — September 7",
    "Watch the special Apple Event to learn about iPhone 14, iPhone 14 Pro, Apple Fitness+, Apple Watch Ultra, Apple Watch Series 8, ..."
  ],
  [
    "iPhone 14 Pro Max LỖI MÀN HÌNH có phải do màn từ hãng Trung Quốc?",
    "Tìm nguyên nhân iPhone 14 Pro Max LỖI MÀN HÌNH: Do mua màn hình từ hãng Trung Quốc? ▻ Mua ngay iPhone 14 Pro Max ..."
  ],
  [
    "iPhone 14 Pro / 14 Pro Max | Review en español",
    "El nuevo iPhone 14 Pro ha presentado la Dynamic Island, una nueva forma de interactuar con el dispositivo diferente a como lo ..."
  ],
  [
    "iPhone 14 Pro Max vs 14 Pro Unboxing + Camera Test!",
    "Apple iPhone 14 Pro Max and 14 Pro Unboxing (Deep Purple + Space Black) Here's my initial camera test and first impressions!"
  ],
  [
    "iPhone 14 Pro Max ስንት ይሸጥ ይሁን ??",
    "In This Channel You will get an Entertaining Content for the Habeshan GAMING Community . So Much Love Subscribe (IT'S ..."
  ],
  [
    "iPhone 14 Pro: First things you MUST do! (change these settings)",
    "If you just got your new iPhone 14 pro, we have some suggestions, and tips and tricks you should check out! How you can reach ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra | Comparativa de cámaras",
    "No te pierdas de ningún contenido: https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "Pink iPhone  😍 | iPhone 14 Pro Max cases | i phone 14 Pro Max | #shorts #iphone",
    "Pink iPhone | i phone 14 Pro Max case | iphone 14 pro max | #shorts #iphone #iphone14 #iphone12 #iphone11 #iphonecase ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max - Which Should You Choose?",
    "iPhone 14 Pro Max and iPhone 14 Pro are new, but should you go with the larger iPhone 14 Pro Max or the smaller iPhone 14 ..."
  ],
  [
    "7 ДНЕЙ с iPhone 14 Pro Max и iOS 16 после Android 🔥 Честный ОТЗЫВ",
    "Лучшие аксессуары для iPhone с 10% скидкой по промокоду ANDRONEWS10: https://cutt.ly/2VhHHF1 Получи СКИДКУ ..."
  ],
  [
    "57.199 TL&#39;lik iPhone 14 Pro Max kutusundan çıkıyor!",
    "Apple, geçtiğimiz haftalarda düzenlediği etkinlikte yeni işlemcisi olan A16 Bionic ile donatılmış iPhone 14 Pro ve Pro Max ..."
  ],
  [
    "Iphone 14 Pro Max ভাইয়ের জন্য নিলাম 😬😬 PhoneX থেকে 👍",
    "Iphone 14 Pro Max ভাইয়ের জন্য নিলাম PhoneX থেকে Buying Date: 16th October, 2022 PhoneX ..."
  ],
  [
    "Amazing Back Case For iPhone 14 Pro And Pro Max 😯#shorts #iphone14pro #iphone14promax",
    "Amazing Back Case For iPhone 14 Pro And Pro Max #vinayjingar #shorts #ytshorts #youtubeshorts #techshorts #apple ..."
  ],
  [
    "I Bought ₹10,000 iPhone 14 Pro Max . Apple iPhone Clone Unboxing",
    "SUBSCRIBE FOR DAILY TECH VIDEOS ▻https://bit.ly/2EPRVe0 iPhone 14 Pro Max ₹10000 Me | Biggest Scam | iPhone ..."
  ],
  [
    "Camera Test - iPhone Vs Samsung Vs GoPro",
    "We do camera test of all flagship phones and gopro at the same time - Who will win in this battle - Samsung s22 ultra vs i phone ..."
  ],
  [
    "What&#39;s On My iPhone 14 Pro Max!",
    "MacRumors videographer Dan shares videos on the MacRumors YouTube channel on a regular basis, and this week, he thought ..."
  ],
  [
    "iPhone 14 Durability Test - APPLE FINALLY FIXED IT ?!",
    "FINALLY, we have been waiting YEARS for Apple to fix this. Grab some protection for your phone HERE: ..."
  ],
  [
    "iPhone 14 Pro Max Vs. iPhone 13 Pro Max Vs. iPhone 12 Pro Max",
    "iPhone 14 Pro Max Vs iPhone 13 Pro Max Vs iPhone 12 Pro Max | Side by Side Comparison | What's the Difference ? ▻Please ..."
  ],
  [
    "iPhone 14  / 14 Pro / 14 Pro Max - Unboxing All The Colors and Apple Cases",
    "iPhone 14 / 14 Pro / 14 Pro Max - Unboxing All The Colors and Cases Buy them here, http://amzn.to/1zZ2y4P Wanna buy some of ..."
  ],
  [
    "✨📦 iPhone 14 Pro Max Purple | AESTHETIC unboxing + customisations 💜",
    "Hello friends, it's been a hot minute ✿ ٩(˘◡˘)۶ . Finally decided to switch back to iOS! Today will be an unboxing of the iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison",
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison. Which is the best flagship camera setup?"
  ],
  [
    "iPhone 14 Pro Max unboxing",
    ""
  ],
  [
    "TEEN Caught TAKING New IPHONE 14 Pro Max from Apple before Release Date.",
    "IPHONE 14 Rip Off by Student who Tricks Apple into releasing it. He makes national news and ends the leaks and rumors."
  ],
  [
    "Распаковка iPhone 14 Pro и 14 Pro Max - Always-On экран и Dynamic Island. Почему так плохо?",
    "Забери свои 1000 рублей и выгодную кредитку MTS CASHBACK по ссылке: ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max CAMERA COMPARISON",
    "iPhone 14 pro max vs iPhone 13 pro max camera comparison. Get 20% Off Now: https://bit.ly/3feByLF Transfer From Android to ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "IPHONE 14 PRO MAX UNBOXING SILVER ✨",
    "HELLO ! Bienvenu.e, je t'invite à lire la description ♡ ⬇️ ∵⋱✦♡Réseaux sociaux∵⋱✦♡ YouTube Principal ..."
  ],
  [
    "iPhone 14 Pro Max Indian Retail Unit Unboxing &amp; Overview.",
    "I got the iPhone 14 pro max on the launch day and here is showed you an unboxing of the iPhone 14 pro max, I got it from a local ..."
  ],
  [
    "iPhone 14 Pro Max VS iPhone 13 &amp; 12 Pro Max || الأختيار مفاجأة !!",
    "المقارنة القصوى ... آيفون ١٤ برو ماكس ضد آيفون ١٣ برو ماكس ... ضد آيفون ١٢ برو ماكس مين الأفضل ؟؟ أحصل علي الشاحن الـ 100 وات من ..."
  ],
  [
    "iPhone 14 Pro Max - Le Test",
    "Acheter l'iPhone 14 Pro Max : https://geni.us/iphone14promaxgrrr Exceptionnellement pour la sortie de l'iPhone 14, profitez de ..."
  ],
  [
    "Somebody stole my new iPhone 14 pro max",
    ""
  ],
  [
    "TOP 5 IPHONE 14/14 PRO (MAX) CASES",
    "The best iphone 14 cases, also for 14 Pro and Pro Max models. The best overall case, bookcase, thin case, best value and this ..."
  ],
  [
    "iPhone 14/14 Pro Max: How to Enable/Disable Show Parked Location In Apple Maps",
    "Learn how you can enable or disable show parked location in Apple Maps on the iPhone 14/14 Pro/14 Pro Max/Plus. To Donate ..."
  ],
  [
    "JOGANDO SOLO VS SQUAD NO IPHONE 14 PRO MAX - FREE FIRE",
    ""
  ],
  [
    "Apple Event — September 7",
    "Watch the special Apple Event to learn about iPhone 14, iPhone 14 Pro, Apple Fitness+, Apple Watch Ultra, Apple Watch Series 8, ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison",
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Vs Xiaomi 12S Ultra Camera Comparison. Which is the best flagship camera setup?"
  ],
  [
    "iPhone 14 Durability Test - APPLE FINALLY FIXED IT ?!",
    "FINALLY, we have been waiting YEARS for Apple to fix this. Grab some protection for your phone HERE: ..."
  ],
  [
    "Iphone 14 Pro Max ভাইয়ের জন্য নিলাম 😬😬 PhoneX থেকে 👍",
    "Iphone 14 Pro Max ভাইয়ের জন্য নিলাম PhoneX থেকে Buying Date: 16th October, 2022 PhoneX ..."
  ],
  [
    "iPhone 14 Pro Max LỖI MÀN HÌNH có phải do màn từ hãng Trung Quốc?",
    "Tìm nguyên nhân iPhone 14 Pro Max LỖI MÀN HÌNH: Do mua màn hình từ hãng Trung Quốc? ▻ Mua ngay iPhone 14 Pro Max ..."
  ],
  [
    "iPhone 14 Pro Max, a versão maior e mais pesada do &quot;iPhone 13s Pro&quot;",
    "VOTE NO CANALTECH NO PRÊMIO IBEST: https://canalte.ch/ibest-2022 Faça parte do clube de canais do Canaltech: ..."
  ],
  [
    "iPhone 14 Pro / 14 Pro Max | Review en español",
    "El nuevo iPhone 14 Pro ha presentado la Dynamic Island, una nueva forma de interactuar con el dispositivo diferente a como lo ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max - Which Should You Choose?",
    "iPhone 14 Pro Max and iPhone 14 Pro are new, but should you go with the larger iPhone 14 Pro Max or the smaller iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max CAMERA COMPARISON",
    "iPhone 14 pro max vs iPhone 13 pro max camera comparison. Get 20% Off Now: https://bit.ly/3feByLF Transfer From Android to ..."
  ],
  [
    "Pink iPhone  😍 | iPhone 14 Pro Max cases | i phone 14 Pro Max | #shorts #iphone",
    "Pink iPhone | i phone 14 Pro Max case | iphone 14 pro max | #shorts #iphone #iphone14 #iphone12 #iphone11 #iphonecase ..."
  ],
  [
    "iPhone 14 Pro Max VS iPhone 13 &amp; 12 Pro Max || الأختيار مفاجأة !!",
    "المقارنة القصوى ... آيفون ١٤ برو ماكس ضد آيفون ١٣ برو ماكس ... ضد آيفون ١٢ برو ماكس مين الأفضل ؟؟ أحصل علي الشاحن الـ 100 وات من ..."
  ],
  [
    "iPhone 14 Pro Release Date and Price – 48MP Camera, 8K Recording",
    "The New iPhone 14 is getting a MASSIVE UPGRADE with an 48MP Camera, 8K Recording and some other great NEW Features ..."
  ],
  [
    "Amazing Back Case For iPhone 14 Pro And Pro Max 😯#shorts #iphone14pro #iphone14promax",
    "Amazing Back Case For iPhone 14 Pro And Pro Max #vinayjingar #shorts #ytshorts #youtubeshorts #techshorts #apple ..."
  ],
  [
    "Finally I Gifted Her IPhone 14 Pro Max | Aj B Prank He Smjh Rhe Thi 😂",
    "Finally I Gifted Her IPhone 14 Pro Max | Aj B Prank He Smjh Rhe Thi ZULQARNAIN : https://www.instagram.com/invites/con."
  ],
  [
    "What&#39;s On My iPhone 14 Pro Max!",
    "MacRumors videographer Dan shares videos on the MacRumors YouTube channel on a regular basis, and this week, he thought ..."
  ],
  [
    "iPhone 14 Pro Max - Le Test",
    "Acheter l'iPhone 14 Pro Max : https://geni.us/iphone14promaxgrrr Exceptionnellement pour la sortie de l'iPhone 14, profitez de ..."
  ],
  [
    "iPhone 14 Pro Max Vs. iPhone 13 Pro Max Vs. iPhone 12 Pro Max",
    "iPhone 14 Pro Max Vs iPhone 13 Pro Max Vs iPhone 12 Pro Max | Side by Side Comparison | What's the Difference ? ▻Please ..."
  ],
  [
    "Itni भारी Demand Par! Finally Maine Iphone 14 Pro Max! Le Liya 😵🥵 Mini Vlog✨ #shorts #vlog",
    ""
  ],
  [
    "TOP 5 IPHONE 14/14 PRO (MAX) CASES",
    "The best iphone 14 cases, also for 14 Pro and Pro Max models. The best overall case, bookcase, thin case, best value and this ..."
  ],
  [
    "Apple iPhone 14 Pro &amp; Pro Max First Look🔥🔥🔥",
    "Namaskar Dosto, aaj intezaar ki ghadi khatam ho chuki hai kyuki iss video mein maine share kiya hai ek first experience Apple ke ..."
  ],
  [
    "HOW TO BUY IPHONE 14 PRO MAX CLONE | JUST ₹3459/- | COD AVAILABLE | 14 PRO MAX CLONE ONLINE",
    "IPhone 14 pro max clone price in india// iPhone 14 clone|How to buy Iphone 14 Pro max clone online | Just ₹ 3999/- | COD ..."
  ],
  [
    "iPhone 14 Pro Max Fake/Clone | Unboxing and Short Review #iphone14promax #iphone14prounboxing",
    "iPhone 14 Pro Max Fake/Clone | Unboxing and Short Review #iphone14promax #iphone14prounboxing iPhone 14 Pro Max ..."
  ],
  [
    "iPhone 14 Pro Max unboxing",
    ""
  ],
  [
    "TEEN Caught TAKING New IPHONE 14 Pro Max from Apple before Release Date.",
    "IPHONE 14 Rip Off by Student who Tricks Apple into releasing it. He makes national news and ends the leaks and rumors."
  ],
  [
    "iPhone 14 Pro Max OR : Déballage &amp; prise en main ! (Unboxing)",
    "Voici le déballage et la prise en main du nouvel iPhone 14 Pro Max d'Apple, en français disponible en couleur violet intense, or, ..."
  ],
  [
    "iPhone 14, 14 Plus, 14 Pro, 14 Pro Max Price in India, Specs | iPhone 12,13 Big Billion Day Offers",
    "This video is about iPhone 14, 14 Plus, 14 Pro, 14 Pro Max Price in India/Specs. Talking about iPhone 14 Series Price - The ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – iPhone 14 Event Date LEAKED!",
    "A NEW iPhone 14 Pro Max RELEASE DATE Report has come in with the iPhone 14 Event Date LEAKED! The Great NEWS is the ..."
  ],
  [
    "Pixel 7 Pro Vs Mate 50 Pro Vs iPhone 14 Pro Camera Comparison",
    "Pixel 7 Pro Vs Mate 50 Pro Vs iPhone 14 Pro camera comparison. Side by side low light, day, portrait, ultrawide, video and audio ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – LARGER Camera Sensor &amp; Lens LEAK!",
    "A NEW iPhone 14 Camera Report has come in! For the iPhone 14 Pro Max we have been told of a LARGER Camera Sensor ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "iPhone 14 Pro Max 2 MESES DESPUÉS ¿por qué lo uso?",
    "Qué funda uso? https://amzn.to/3Phi86A Apple iPhone 14 Pro Max: https://amzn.to/3Ycfm6H Google Pixel 7 Pro: ..."
  ],
  [
    "OLD MAN PAID $900 FOR FAKE IPHONE 14 PRO MAX 😢 #shorts #fake #iphone14promax #apple #iphone #ios",
    "MONEYTALKSWIRELESS Merch : www.mtwshop.com Tik Tok : https://www.tiktok.com/@moneytalkswireless Instagram ..."
  ],
  [
    "iPhone 14 Pro Max Indian Retail Unit Unboxing &amp; Overview.",
    "I got the iPhone 14 pro max on the launch day and here is showed you an unboxing of the iPhone 14 pro max, I got it from a local ..."
  ],
  [
    "iPhone 14 Pro All Colors: Space Black, Deep Purple, Silver &amp; Gold!",
    "As a channel transition. Here are all the iPhone 14 Pro colors to help you decide on which color to go with. iPhone 14 in All ..."
  ],
  [
    "iPhone 14 Pro Space Black &amp; Deep Purple Unboxing | With MagSafe Accessories",
    "Mujjo Leather Case: http://bit.ly/3vePf1R Mujjo Leather Case With Wallet: http://bit.ly/3hX30z7 Mujjo MagSafe Wallet: ..."
  ],
  [
    "iPhone 14 Pro Max 6 हजार में ऐसे खरीदें ||🤫🤔#shorts #trending",
    "iPhone 14 Pro Max 6 हजार में ऐसे खरीदें ||    #shorts #trending #trending #technews #shorts #anujtechtok ..."
  ],
  [
    "I Phone 14 എത്തി || My thoughts about I Phone 14",
    "IPhine14 Video Credits Apple."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – NEW PURPLE &amp; BLUE COLORS LEAKED!!",
    "BIG NEWS!! The NEW iPhone 14 Pro Max and the iPhone 14 Pro NEW Purple and Blue Colors have been LEAKED! A PHYSICAL ..."
  ],
  [
    "iPhone 14/14 Pro Max: How to Enable/Disable Show Parked Location In Apple Maps",
    "Learn how you can enable or disable show parked location in Apple Maps on the iPhone 14/14 Pro/14 Pro Max/Plus. To Donate ..."
  ],
  [
    "Cover MagSafe Pitaka per iPhone 14 Pro Max - Unboxing",
    "Cover Pitaka MagEZ 3 per iPhone 14 Pro Max https://www.ipitaka.com/?ref=doctorappleitalia —————— La migliore VPN in ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – iPhone 14 Battery Life LEAKED!",
    "BIG NEWS! We have the iPhone 14 Battery Life Leaked in a NEW Report for the Models like the iPhone 14 Pro Max and other ..."
  ],
  [
    "iPhone 14 Pro VS Pro Max - Which one should you buy? | A Pro Max User&#39;s Perspective.",
    "apple #iphone #iphone13pro Make sure you watch this video before preordering any of the new iPhone 13 models. Trying to ..."
  ],
  [
    "iPhone 14 Teardown",
    "Check out our complete iPhone 14 teardown video! https://youtu.be/ZQErjW5uR0k #shorts, #iPhone14, #ifixitteardown."
  ],
  [
    "COMPREI o iPhone 14 Pro Max e confesso que GOSTEI do Dynamic Island! Unboxing e Impressões",
    "iPhone 14 Pro Max de 256GB ➽ https://tidd.ly/3BymJM8 ☆ Comprar IPHONE no Brasil com SEGURANÇA ..."
  ],
  [
    "Test iPhone 14 Pro : grosse déception ?!",
    "Avis sur l'iPhone 14 Pro, faut-il l'acheter ? ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Acheter les protections RhinoShield ..."
  ],
  [
    "First Version iPhone 14 pro max 1:1 Clone Unboxing",
    "Clone iphone 14 pro max iphone 14 pro iphone 14 plus iphone 14."
  ],
  [
    "iPhone 14 pro Max Vs Samsung Galaxy S22 Ultra || The Best Camera Phone !",
    "My Facebook ID : https://rb.gy/plksne My Facebook Page : https://rb.gy/hawzqg ＬＩＫＥ | ＣＯＭＭＥＮＴ | ＳＨＡＲＥ ..."
  ],
  [
    "iPhone 14 Pro Max Broken Front &amp; Back side! #shorts #iphone14promax",
    ""
  ],
  [
    "iPhone 14 Pro &amp; Pro Max 25+ Tips, Tricks &amp; Hidden Features | Amazing Hacks - NO ONE SHOWS YOU!! 🔥🔥🔥",
    "Namaste Doston, iPhone 14 Pro & Pro Max 25+ Tips, Tricks, Hidden Features and Amazing Hacks, and get a golden chance to ..."
  ],
  [
    "iPhone 14 Pro Release Date and Price – 14 Pro Max Design LEAK!",
    "A New iPhone 14 LEAK has shown a Massive change to the iPhone 14 Pro Max Design that I want to share with you Today."
  ],
  [
    "iPhone 14 Pro Fazit - Warum war ich so naiv? [2 Monate]",
    "iPhone 14 - https://amzn.to/3QGlSOs iPhone 14 Plus - https://amzn.to/3Bc9FLI iPhone 14 Pro - https://amzn.to/3cYIrQB iPhone 14 ..."
  ],
  [
    "Lucky...I Found a lot of iphone 14 pro max at the dump...! But it is...!!😟😟",
    "Lucky...I Found a lot of iphone 14 pro max at the dump...! But it is."
  ],
  [
    "Обзор iPhone 14 Pro / Pro Max!",
    "Пройди бесплатное обучение в Школе Бизнеса Тинькофф — https://l.tinkoff.ru/rozetkedseptemberr Вот он, первый обзор ..."
  ],
  [
    "TERLALU BAGUSSS ❤ - Review iPhone 14 Pro Indonesia!",
    "Pro sekale. Cari produk Apple banyak promo: https://tokopedia.link/gadgetin-apple09-yt ---PERHATIAN--- Buat sekarang, ..."
  ],
  [
    "iPhone 14 Pro Release Date and Price – iPhone 14 Max SUPPLY ISSUES RESOLVED!!",
    "GREAT NEWS! The iPhone 14 Max Supply Issues has been RESOLVED!! This means the all iPhones including the iPhone 14 ..."
  ],
  [
    "Speedtest Xiaomi 13 Pro vs iPhone 14 Pro Max: &quot;Max&quot; ở đây là CÁCH BIỆT",
    "Tham khảo iPhone 14 Pro Max: https://hoanghamobile.com/dien-thoai-di-dong/apple-iphone-14-pro-max-128gb-chinh-hang-vn-a ..."
  ],
  [
    "iPhone 14 Pro Max Clone Unboxing Master Clone copy HDC CLONES 14,999/-",
    "iPhone 14 PRO Max unboxing dynamic island display clone [HDC CLONE]MASTER COPY|AAA 1ST COPY| RS 14999/- ..."
  ],
  [
    "Fake iPhone 14 Police: How To Check If You Have a Real Or Fake iPhone 14 / iPhone 14 Pro",
    "Here's how to check if you have a real or fake iPhone 14. This video will also guide you in what to look for in case you want to buy ..."
  ],
  [
    "Galaxy Z Fold 4 vs iPhone 14 Pro Max",
    "iPhone 14 Pro Max https://howl.me/cifBWzJpXE1 Galaxy Z Fold 4 BUY GALAXY Z FOLD 4 ..."
  ],
  [
    "iPhone 14 Pro Max আমি কিনি মাত্র ১৮ হাজার টাকায়। 14 Pro Max Original Vs Clone.",
    "My Facebook ID : https://rb.gy/plksne My Facebook Page : https://rb.gy/hawzqg My Instagram ID :https://rb.gy/4kk3z4 My ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; First Impressions",
    "3-in-1 MagSage Charging Station - https://amzn.to/3eXzB60 See all my tech - https://difran.co/kit Watch 300+ exclusive vlogs ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max 🔥 EL MEJOR Apple iPhone DEL MUNDO!!",
    "Comparativa del iPhone 14 Pro Max vs iPhone 13 Pro Max!! El mejor Apple iPhone Pro Max está en este video. Lo mejor del ..."
  ],
  [
    "Dubai iPhone 14 Pro Max price in Indian Rupees",
    ""
  ],
  [
    "iPhone 14 Pro Max | Review en español",
    "Consigue ya tus fundas para el iPhone 14 en CASETiFY! Entra en https://www.casetify.com/isaias hoy para obtener un 15% de ..."
  ],
  [
    "ASMR | iPhone 14 Pro MAX Unboxing + First  Reaction",
    "You asked for it, you know it was coming. It's here now. Enjoy everyone! Business Inquires/Management: ..."
  ],
  [
    "Apple Iphone 14 Pro Max Features | Price in India | Hands on Review",
    "Apple Iphone 14 Pro series jo kal hi launched hui he, video me aap iphone 14 pro series ke bare me detail me dekh sakte he, ..."
  ],
  [
    "QnA 226 | iPhone 14 is waste of money, Used iPhone 13 @ Rs.20,000, iOS 16 clean install",
    "My Recommendations Best iPhone Cases: https://amzn.to/3Av0q85 Best Tempered Glass for iPhone: https://amzn.to/2SN9Bj5 ..."
  ],
  [
    "Đánh giá chi tiết iPhone 14 Pro Max sau 2 tháng sử dụng: KHEN CHÊ RÕ RÀNG",
    "Đánh giá chi tiết iPhone 14 Pro Max sau 2 tháng sử dụng: KHEN CHÊ RÕ RÀNG Tham khảo tại ..."
  ],
  [
    "10 Ways the Pixel 7 Pro is Better Than the iPhone 14 Pro",
    "Here are ten ways the Google Pixel 7 Pro is better than the iPhone 14 Pro. With the recent upgrade from the Google Pixel 6 Pro to ..."
  ],
  [
    "Unboxing de mi nuevo iPhone 14 Pro Max",
    "Nuevo video de mi nuevo iphone 14 pro max ▻ Mis directos! https://www.twitch.tv/thedanirep ▻ DANIREPSHOP!"
  ],
  [
    "iPhone 14 Pro Max, lo bueno y lo NO tanto (tras 2 meses de uso)",
    "Experiencia de uso del iPhone 14 Pro Max tras 2 meses de uso, en español, con todo lo bueno y malo que debes saber ..."
  ],
  [
    "iPhone 14/14 Pro Max: How to RESET the Apple Notes Password",
    "Learn how you can RESET the Apple Notes password on the iPhone 14/14 Pro/14 Pro Max/Plus. This video demonstration is on ..."
  ],
  [
    "iPhone 14 Pro Max dark night purple same body and the same color lens protector #shorts",
    ""
  ],
  [
    "iPhone 14 Pro Max Indian Pricing ₹189990 1Tb 😱 #shorts",
    ""
  ],
  [
    "iPhone 14 Pro Max - La Realidad",
    "Únete a este canal para acceder a sus beneficios: https://www.youtube.com/channel/UCJKL8jRgH2AVXh5V_VtSp0w/join ..."
  ],
  [
    "CAMBIÉ DE OPINIÓN - iPhone 14 Pro | 2 Meses Después",
    "Gracias a Ugreen por Patrocinar este video. ☄UGREEN Nexode 65W Charger: https://amzn.to/3sRNA19 (36% menos durante ..."
  ],
  [
    "Apple iPhone 14 Pro Max Unboxing ASMR #shorts",
    ""
  ],
  [
    "ΜΑΖΕΨΤΕ ΤΟΥΣ! Ήρθαν τα iPhone 14! 🔥(+ ΤΕΡΑΣΤΙΟΣ ΔΙΑΓΩΝΙΣΜΟΣ!)",
    "ΓΙΝΕ SUBSCRIBER ΣΤΟΥΣ UNBOXHOLICS ▻ http://bit.ly/uh_sub Η σεζόν ξεκινάει με \"καυτό\" βίντεο! Τα iPhone 14 είναι στα χέρια ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – Always on Display LEAK from Apple!",
    "A NEW Always on Display LEAK has came from Apple for the iPhone 14 Pro Max and the iPhone 14 Pro! The Report shows us ..."
  ],
  [
    "Beli iPhone 14 Pro Max atau 13 Pro Max? – Perbezaan dan Persamaan",
    "Case iPhone 13/14 https://shope.ee/8zTYTeq2ug FAIZ ZAINAL https://youtube.com/c/FAIZZAINAL​​​​ ..."
  ],
  [
    "iPhone 14 Pro Set Up eSIM &amp; Activation (2022)",
    "iphone14pro #setup #activate In this video we set up the Apple iPhone 14 Pro with eSIM card and explain the activation process ..."
  ],
  [
    "5 coisas que eu AMEI no iPhone 14 Pro Max!",
    "Crie sua conta gratuitamente em https://zip4me.com/?z=97744 e use o cupom MARINA15 para ganhar até U$15 de desconto na ..."
  ],
  [
    "Apple iPhone 14 Pro Max 🔥",
    "The iPhone 14 Pro Max has been launched and with some impressive new features like the dynamic camera island, this phone is ..."
  ],
  [
    "Finally Iphone 14 Pro Max Le Liya 🤩 Dubai Se #shorts",
    "Finally Iphone 14 Pro Max Le Liya Dubai Se #shorts #fierydev #freefire #trending #youtubeshorts #shortsviral #viralshorts ..."
  ],
  [
    "Xiaomi 12T Pro Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison",
    "Xiaomi 12T Pro Vs iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Comparison. Does 200MP make a big difference? Which is ..."
  ],
  [
    "Top oder Flop? iPhone 14 Pro (review)",
    "Top oder Flop? Eines der beiden Begriffe trifft auf das iPhone 14 Pro zu oder ist es vielleicht doch eher etwas dazwischen…"
  ],
  [
    "iPhone 14 Pro Max Review: ស្វាគមន៍មកកាន់កោះប៉ោមថ្មី!",
    "នកអាចតាមដានខ្ញុំបន្ថែមលើ​ Tamneak : @johnseytech FB: https://www.facebook.com/JohnSeyTech/​ ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – A16 Cores Power!",
    "We FINALLY know the A16 Cores Power for the iPhone 14 Pro Max and it is a MASSIVE Change to Previous iPhone Chipsets!"
  ],
  [
    "iPhone 14 pro max unboxing 💘",
    "Ahhhh I love it I love it I love it! ♡ socials: Instagram: @avanna.a Tiktok: @avanna.a Pinterest: @1Avanna ♡ business email ..."
  ],
  [
    "iPhone 14 Pro/ Pro Max. O lună mai târziu!",
    "iPhone 14 Pro/ 14 Pro Max la darwin: https://darwin.md/telefoane/smartphone/apple-iphone-14-2022 #iphone14pro ..."
  ],
  [
    "iPhone 14 Pro / Pro Max: How to Setup &amp; Transfer Phone Number (eSIM) - step by step",
    "I show you how to setup (initial setup) the iPhone 14 Pro & iPhone 14 Pro Max and at the end of setup I show you how to transfer ..."
  ],
  [
    "Apple’s iPhone 14 event in under 20 minutes",
    "Here's everything Apple announced at its iPhone 14 and Apple Watch event. Read our full story on Engadget: Get More ..."
  ],
  [
    "Is it TOO LARGE??? iPhone 14 Pro Max Unboxing",
    "I'm unboxing my first MAX sized iPhone, is the iPhone 14 Pro Max simply too massive? #iphone14promax #iphone14 ..."
  ],
  [
    "BEST Cases For The Deep Purple iPhone 14 Pro Max!",
    "If you have a Deep Purple iPhone 14 Pro Max, here are some of the best purple case options to match your phone!"
  ],
  [
    "RECENSIONE IPHONE 14 PRO MAX e APPROFONDIMENTO FOTOCAMERE",
    "PREZZO SU AMAZON https://amzn.to/3C9masW Grande, pesante e decisamente costoso. Cosa offre in cambio? Un altrettanto ..."
  ],
  [
    "iPHONE 14 PRO MAX: Я РАЗОЧАРОВАН, ЭТО ЖЕСТЬ",
    "Заработай на iPhone 14 Pro Max 1ТБ. Курс «Разработчик VR с нуля до PRO» на Skillbox со скидкой 60%: ..."
  ],
  [
    "iPhone 14 Pro : Selepas Hampir 2 Bulan",
    "Link Pembelian untuk iPhone 14 Pro: Shopee: https://invle.co/clex128 Lazada: https://invol.co/clex12s Social Media: Instagram ..."
  ],
  [
    "Apple iPhone 14 Pro Max Recenze: Opravdu jej tak nutně potřebujete?",
    "Pořiďte si Surfshark na https://surfshark.deals/huramobil ! Zadejte promo kód HURAMOBIL pro 83% slevu a další 3 měsíce ..."
  ],
  [
    "这次我没有把iPhone 14 Pro Max当作主力机",
    "iPhone 14 Pro Max长期体验之后也会有的～ 大家好，这里是木兜~ 欢迎关注、点赞~ 打开小铃铛收看我的最新视频~"
  ],
  [
    "iPhone 14 Pro Release Date and Price – 14 Pro Max Design LEAK!",
    "A New iPhone 14 LEAK has shown a Massive change to the iPhone 14 Pro Max Design that I want to share with you Today."
  ],
  [
    "Unboxing iPhone 14 Pro Max (Deep Purple) Pertama Di Malaysia!",
    "Case iPhone yang aku guna https://shope.ee/8zTYTeq2ug FAIZ ZAINAL https://youtube.com/c/FAIZZAINAL​​​​ ..."
  ],
  [
    "iPhone 14, 14 Plus and 14 Pro/Pro Max Launched - Everything under 60 Seconds😱",
    "hey, Guys, This is iPhone 14, iPhone 14 Plus, iPhone 14 Pro, and iPhone 14 Pro Max Launch, All Specs and Pricing are ..."
  ],
  [
    "Beli iPhone 14 pro Max gara gara iPhone 14 pro kekecilan",
    ""
  ],
  [
    "iPHONE 14 te LLEGÓ LA HORA!!!!!!!",
    "Unboxing y pruebas de los nuevos iPhone 14 y iPhone 14 Pro Max ¿Valen la pena? ¿es la Dinamic Island un acierto?"
  ],
  [
    "iPhone 14 Pro : Selepas Hampir 2 Bulan",
    "Link Pembelian untuk iPhone 14 Pro: Shopee: https://invle.co/clex128 Lazada: https://invol.co/clex12s Social Media: Instagram ..."
  ],
  [
    "Care pe care? iPhone 14 Pro / Pro Max - Prim Contact și Impresii",
    "APPLE #IPHONE14PRO #IPHONE14PROMAX Review-ul de camere al lui Andrei Brătucu este aici, check it out: ..."
  ],
  [
    "Best Clear Case for iPhone 14 Pro Max | Tech Tips only",
    "The case shown in this #short is The Best Clear Case for iPhone 14 Pro Max. This Clear case for the iPhone 14 Pro, iPhone 14 ..."
  ],
  [
    "iPhone 14, 14 Pro, 14 Pro Max - koji je dobar a koji nije?",
    "Umesto da testiramo odvojeno iPhone 14 i Pro modele, shvatili smo da posebna recenzija \"običnog\" iPhone 14 i nema nekog ..."
  ],
  [
    "Több, mint amire számítottunk! | iPhone 14 Pro Max teszt",
    "Egy örökkévalóságnak tűnt, de elkészültünk vele! Itt az iPhone 14 Pro Max tesztünk. Idén igyekeztünk mindent a lehető ..."
  ],
  [
    "Apple Event 2022 - iPhone 14 Pro Max | Trailer &amp; Official Introduction",
    "Apple Event 2022 - iPhone 14 Pro Max | Trailer & Official Introduction #AppleEvent2022 #iphone14 #iphone14pro #iphone14max ..."
  ],
  [
    "OLD MAN PAID $900 FOR FAKE IPHONE 14 PRO MAX 😢 #shorts #fake #iphone14promax #apple #iphone #ios",
    "MONEYTALKSWIRELESS Merch : www.mtwshop.com Tik Tok : https://www.tiktok.com/@moneytalkswireless Instagram ..."
  ],
  [
    "LLEGÓ EL IPHONE 14 PRO!!!",
    "iPhone 14 Pro ▸ TecnoStore en Instagram → https://www.instagram.com/tecnostorearg/ ▸ TecnoStore en Facebook ..."
  ],
  [
    "iPhone 14 Pro Set Up eSIM &amp; Activation (2022)",
    "iphone14pro #setup #activate In this video we set up the Apple iPhone 14 Pro with eSIM card and explain the activation process ..."
  ],
  [
    "Apple iPhone 14 Pro Max vs Google Pixel 7 Pro | upcoming phone 2022 | A16 Bionic vs Google Tensor G2",
    "In This Video we show you all specifications of both mobile phone\" Google Pixel 7 Pro vs Apple iPhone 14 Pro Max \" and the final ..."
  ],
  [
    "How To Check if iPhone 14 Pro is ORIGINAL or FAKE!",
    "Amazon Daily Deals: http://saunders.gg/amazon ❤️ If you enjoy this content, please consider a paid \"super thanks\" in the video ..."
  ],
  [
    "Apple’s iPhone 14 event in under 20 minutes",
    "Here's everything Apple announced at its iPhone 14 and Apple Watch event. Read our full story on Engadget: Get More ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – Always on Display is Coming!",
    "FINALLY an Always on Display is coming to the iPhone 14 Pro Max and the iPhone 14 with this latest Report! Apple Fans have ..."
  ],
  [
    "Los iPhone 14 Pro Max y 14 Pro traen una característica increíble 😱",
    "Los iPhone 14 Po Max y iPhone 14 Pro traen novedades relacionadas con su nuevo notch, el Dynamic Island es una ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – SURPRISE FEATURE LEAKED!",
    "A NEW SUPRISE FEATURE has been LEAKED for the iPhone 14 Pro Max and the iPhone 14 Pro that is going to CHANGE ..."
  ],
  [
    "iPhone 14 Pro Unboxing - Déballage et Premières Impressions !",
    "Tu veux rien rater de mes vidéos ? Alors abonne toi → https://www.youtube.com/channel/UCbM4SGqmsL76Iwz6Uv1ck3A Mon ..."
  ],
  [
    "iPhone 14 Pro - It just keeps getting BETTER &amp; BETTER! 🤯",
    "We've been getting a TON of fresh leaks for the iPhone 14 lineup including some brand new changes to the selfie camera, but ..."
  ],
  [
    "Месяц с iPhone 14 Pro Max | НЕ ПОВТОРЯЙ ЭТУ ОШИБКУ",
    "Удобный сервис переноса данных: Transfer WhatsApp Messages from Android to iPhone - https://bit.ly/3MG7KUF Это обзор и ..."
  ],
  [
    "iPhone 14 Pro Max - pierwsze wrażenia, Mobzilla Flesz odc. 91",
    "iPhone 14 Pro Max to maksimum profeski, które Apple chce Wam teraz dać. O iPhonie 14 opowiadam tu: https://bit.ly/FLSZ_IP14 ..."
  ],
  [
    "KUZEY IRAK&#39;TA İPHONE 14 PRO MAX VE TELEFON FİYATLARI ÇOK UCUZ !!! ARALIK 2022",
    "IRAK'TAN GÜNCEL iPhone, MacBook, Playstation Aralık 2022 FİYATLARI bugün kuzey ırak kürdistan da iphone 11 iphone 12 ..."
  ],
  [
    "iPhone 14 Pro Max Silver aesthetic unboxing✨ + Apple MagSafe accessories",
    "Hi everyone! Welcome back to my channel✨ In today's video, I will be unboxing the new iPhone 14 Pro Max in Silver with 128 ..."
  ],
  [
    "【Joeman】iPhone 14 Pro &amp; Pro Max詳細開箱！效能依舊無敵！",
    "iPhone 14 Pro& Pro Max第一手開箱影片終於來了！測了三天之後覺得今年的升級感其實還是很明顯，包含動態島、4800萬畫素 ..."
  ],
  [
    "Ich hab das neue iPhone 14 Pro ausprobiert! (Erster Eindruck)",
    "Danke an Insta360 für die Unterstützung! Hier findet ihr alle Infos zur neuen X3: https://www.insta360.com/sal/x3?insrc=INRG9R3 ..."
  ],
  [
    "รีวิวเคสใส iPhone 14 Pro Max จาก CASETiFY พร้อมโปรพิเศษแห่งปี🎊",
    "เคสใส iPhone 14 Pro Max จาก CASETiFY พร้อมโปรพิเศษรับปีใหม่   ชอบเคสใสๆ กิ๊งๆ✨แบบไม่หมอง ป้องกันเครื่องเทพๆ แต่บางเบา ..."
  ],
  [
    "Unboxing SEMUA WARNA iPhone 14 Pro Max",
    "Unboxing Apple iPhone 14 Pro Max Semua Varian Warna 2022 Bahasa Indonesia Tonton Juga: Tutorial Update iOS 16 Official ..."
  ],
  [
    "iPhone 14 Pro Max - Apple is Creating an EPIC iPhone",
    "Apple is pushing all the limits and the iPhone 14 Pro Max has been finalized, coming with Mind Blowing Design and Perfect ..."
  ],
  [
    "iPhone 14 Pro Release Date and Price – 48MP Camera, 8K Recording",
    "The New iPhone 14 is getting a MASSIVE UPGRADE with an 48MP Camera, 8K Recording and some other great NEW Features ..."
  ],
  [
    "iPhone 14 Pro Teardown - Full Disassembly",
    "Thank-you to PCBWay for sponsoring this video. They offer high quality custom circuit boards as low as $5 for 10 pieces."
  ],
  [
    "iPHONE 14 PRO MAX: Я РАЗОЧАРОВАН, ЭТО ЖЕСТЬ",
    "Заработай на iPhone 14 Pro Max 1ТБ. Курс «Разработчик VR с нуля до PRO» на Skillbox со скидкой 60%: ..."
  ],
  [
    "Is it TOO LARGE??? iPhone 14 Pro Max Unboxing",
    "I'm unboxing my first MAX sized iPhone, is the iPhone 14 Pro Max simply too massive? #iphone14promax #iphone14 ..."
  ],
  [
    "Vancouver VLOG | Unboxing  iPhone 14 pro Max (Space Black), Christmas Shopping, Aesthetic",
    "I hope everyone is enjoying a wonderful holiday season with loved ones! Thank you for watching and see you in the New Year!"
  ],
  [
    "CAMBIÉ DE OPINIÓN - iPhone 14 Pro | 2 Meses Después",
    "Gracias a Ugreen por Patrocinar este video. ☄UGREEN Nexode 65W Charger: https://amzn.to/3sRNA19 (36% menos durante ..."
  ],
  [
    "iPhone 14 Pro Max Clone Unboxing Master Clone copy HDC CLONES 14,999/-",
    "iPhone 14 PRO Max unboxing dynamic island display clone [HDC CLONE]MASTER COPY|AAA 1ST COPY| RS 14999/- ..."
  ],
  [
    "iPhone 14 Pro Max - Unboxing! #iphone14promax #iphone #apple #shorts #india #dubai",
    ""
  ],
  [
    "Itni भारी Demand Par! Finally Maine Iphone 14 Pro Max! Le Liya 😵🥵 Mini Vlog✨ #shorts #vlog",
    ""
  ],
  [
    "iPhone 14 Pro Max: Características y funciones: Unboxing en español",
    "Cuando sale, precio en México y todas las funciones de los nuevos iPhone de Apple en este video. Suscríbete para más videos ..."
  ],
  [
    "Best FAKE iPhone 14 Pro Max! #shorts",
    "shorts #youtubeshorts #shortsvideo #tech #iphone14promax #iphone #fake #apple."
  ],
  [
    "iPhone 14 Pro Release Date and Price – Camera Changes…",
    "There has been a NEW FINALISED LEAK of some BIG Camera Changes on the back of the iPhone 14 Models that is going to ..."
  ],
  [
    "COMPREI o iPhone 14 Pro Max e confesso que GOSTEI do Dynamic Island! Unboxing e Impressões",
    "iPhone 14 Pro Max de 256GB ➽ https://tidd.ly/3BymJM8 ☆ Comprar IPHONE no Brasil com SEGURANÇA ..."
  ],
  [
    "iPhone 14 Pro / Pro Max: How to Setup &amp; Transfer Phone Number (eSIM) - step by step",
    "I show you how to setup (initial setup) the iPhone 14 Pro & iPhone 14 Pro Max and at the end of setup I show you how to transfer ..."
  ],
  [
    "iPhone 14 Pro Max Action Mode TESTED #shorts",
    "The iphone 14 pro max action mode is it good? In today's youtube short, we;re comparing the iPhone 14 pro max video with the ..."
  ],
  [
    "iPhone 14 Pro Deep Purple First Look🔥🔥🔥",
    "Namaskar Dosto, aaj intezaar ki ghadi khatam ho chuki hai kyuki iss video mein maine reveal kiya hai Apple ke upcoming ..."
  ],
  [
    "iPhone 14 Teardown - Repair Tips from REWA",
    "Apple's new iPhone 14 lineup made its debut recently. Today let's disassemble the iPhone 14 to view the interior structural ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – iPhone 14 Event Date LEAKED!",
    "A NEW iPhone 14 Pro Max RELEASE DATE Report has come in with the iPhone 14 Event Date LEAKED! The Great NEWS is the ..."
  ],
  [
    "iPhone 14 Pro Max vs 14 Pro Unboxing + Camera Test!",
    "Apple iPhone 14 Pro Max and 14 Pro Unboxing (Deep Purple + Space Black) Here's my initial camera test and first impressions!"
  ],
  [
    "iPhone 14/14 Pro Max: How to Turn On/Off Apple Maps Directions Wake Device",
    "Learn how you can turn on or off Apple Maps directions wake device on the iPhone 14/14 Pro/14 Pro Max/Plus. To Donate to ..."
  ],
  [
    "Buy iPhone 14 Pro n Pro Max from Dubai || Save ₹40000/pc",
    "Buy iPhone 14 Pro n Pro Max from Dubai || #iphone14promax #iPhone14Pro #shorts."
  ],
  [
    "Apple&#39;s iPhone 14 Event: Everything Revealed in 12 Minutes",
    "At Apple's \"Far Out\" event, the company unveils new products including the iPhone 14, Apple AirPods Pro and Apple Watch ..."
  ],
  [
    "Ich hab das neue iPhone 14 Pro ausprobiert! (Erster Eindruck)",
    "Danke an Insta360 für die Unterstützung! Hier findet ihr alle Infos zur neuen X3: https://www.insta360.com/sal/x3?insrc=INRG9R3 ..."
  ],
  [
    "LLEGÓ EL IPHONE 14 PRO!!!",
    "iPhone 14 Pro ▸ TecnoStore en Instagram → https://www.instagram.com/tecnostorearg/ ▸ TecnoStore en Facebook ..."
  ],
  [
    "iPhone 14/14 Pro Max: How to Enable/Disable On My iPhone Account To Save Notes On Local Device",
    "Learn how you can enable or disable \"on my iPhone\" account to save notes on local device storage on the iPhone 14/14 Pro/14 ..."
  ],
  [
    "iPhone 14 Pro Release Date and Price – 14 Pro Max Design LEAK!",
    "A New iPhone 14 LEAK has shown a Massive change to the iPhone 14 Pro Max Design that I want to share with you Today."
  ],
  [
    "Amazing iPhone 14 Pro Max Wallpaper #shorts",
    ""
  ],
  [
    "Iphone 14 pro max price in india 2022 | shorts",
    "Iphone 14 pro max price | Image Leaks  shorts 1. iphone 14 pro max trailer official apple 2. iphone 14 camera | iphone 14 ..."
  ],
  [
    "iPhone 14/14 Pro Max: How to Enable/Disable Suggest App Link When Composing Quick Note",
    "Learn how you can enable or disable suggest app link when composing quick note on the iPhone 14/14 Pro/14 Pro Max/Plus."
  ],
  [
    "I Phone 14 എത്തി || My thoughts about I Phone 14",
    "IPhine14 Video Credits Apple."
  ],
  [
    "iPhone 14 Pro Max-ის სრული განხილვა",
    "ახალი დინამიური კუნძული, 48 მეგაპიქსელიანი კამერა ფოტონური ძრავით, ..."
  ],
  [
    "iPhone 14, 14 Pro, 14 Pro Max - koji je dobar a koji nije?",
    "Umesto da testiramo odvojeno iPhone 14 i Pro modele, shvatili smo da posebna recenzija \"običnog\" iPhone 14 i nema nekog ..."
  ],
  [
    "₹10,000 mein iPhone 14 Pro max !! #shorts",
    "Agar video acche Lage to channel subscribe jarur karna #iphone #fakeiphone #hfvunboxshorts."
  ],
  [
    "Dubai iPhone 14 Pro Max price in Indian Rupees",
    ""
  ],
  [
    "Review Pemakaian iPhone 14 Pro Max! Kelebihan dan Kekurangan",
    "iPhone 13 Pro Max Vs iPhone 14 Pro Max, Apakah Worth it Upgrade ? Berikut review Pemakaian iPhone 14 Pro Max setelah 2 ..."
  ],
  [
    "Apple iPhone 14 Keynote in 12 min: Summary of Main Announcements",
    "Here's a 12 minute recap of what Apple just announced in their iPhone 14 fall event. Footage source: Apple -- Chapters 0:00 Intro ..."
  ],
  [
    "I HATE THIS on the iPhone 14 Pro Max!",
    ""
  ],
  [
    "iPhone 14/Pro/Max - First Live Hands-On",
    "First live photos and hands-on video of the Apple iPhone 14, iPhone 14 Pro, iPhone 14 Max, and iPhone 14 Pro Max 2022 in all ..."
  ],
  [
    "Ulasan iPhone 14 Pro &amp; 14 Pro Max paling JUJUR selepas 2 minggu | smashpop",
    "Selepas 2 minggu, adakah iPhone 14 Pro dan Pro Max masih canggih dan syok seperti yang orang katakan? Patutkah anda ..."
  ],
  [
    "iPhone 14 Pro Max | Unboxing | Initial Setup | eSIM Transfer | New Features",
    "The iPhone 14 Pro Max is the latest apple product. The US version of iPhone 14 uses eSim only and has no physical sim slot."
  ],
  [
    "รีวิว iPhone 14 Pro Max หลังใช้มา 10 วัน โดยรวมดี แต่ไม่ค่อยประทับใจ",
    "ใครจะจัด iPhone 14 Pro Max บอกเลยว่าห้ามพลาด !! วางจำหน่ายพร้อมโปรโมชั่นเปิดตัวตลอดทั้งเดือน ในวันที่ 14 ก.ย. 2565 - 14 ต.ค."
  ],
  [
    "iPhone 14 Pro Max vs. 14 Pro / 13 Pro Max / 13 Pro / 14 / 13 / 12 / SE - ULTIMATE Battery Test!",
    "Testing & comparing the battery life of iPhone 14 Pro Max, 14 Pro, 14, 13 Pro Max, 13 Pro, 13, 12 and SE (2022). ~ 20% OFF!"
  ],
  [
    "Брак камеры на iPhone 14 Pro Max - белый засвет (камера 3Х)",
    "Купили новый дорогой айфон 14 про макс и у него оказался дефект камеры - она просто не могла приближать в режиме Х3 ..."
  ],
  [
    "iPhone 14 pro Max 🤑🥹",
    ""
  ],
  [
    "iPhone 14 Pro Max Unboxing et découverte 😍",
    "Il est sorti aujourd'hui, je l'ai acheté ce matin, et je vais le découvrir ici avec vous. Voici l'iPhone 14 Pro Max. Le modèle le plus ..."
  ],
  [
    "iPhone 14 Pro Max White/Silver - Unboxing &amp; First Impressions!",
    "The iPhone 14 Pro Max brings the large 6.7\" display, Dynamic Island, Always on Display, 48MP Camera and more to Apple's Pro ..."
  ],
  [
    "iPhone 14 Unboxing - Real VS Fake - Comparison",
    "iPhone 14 Unboxing - Real VS Fake - Comparison."
  ],
  [
    "iPhone 14 Pro Max: Οι Πρώτες μου Εντυπώσεις για 1.549€!",
    "Πρώτη επαφή με το iPhone 14 Pro Max και το Dynamic Island, το νέo σήμα κατατεθέν της Apple, πολλά megapixel, πολλά λεφτα, ..."
  ],
  [
    "iPhone 14 Pro Max: Características y funciones: Unboxing en español",
    "Cuando sale, precio en México y todas las funciones de los nuevos iPhone de Apple en este video. Suscríbete para más videos ..."
  ],
  [
    "iPhone 14 Pro Max Sastay Main ? 😱",
    "iphone14promax #iphone #apple ▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭▭ Vlogging Channel ( @Harmain ..."
  ],
  [
    "iPhone 14 pro max gold unboxing #shorts #iphone14promax #iphone14promaxunboxing",
    ""
  ],
  [
    "ΜΑΖΕΨΤΕ ΤΟΥΣ! Ήρθαν τα iPhone 14! 🔥(+ ΤΕΡΑΣΤΙΟΣ ΔΙΑΓΩΝΙΣΜΟΣ!)",
    "ΓΙΝΕ SUBSCRIBER ΣΤΟΥΣ UNBOXHOLICS ▻ http://bit.ly/uh_sub Η σεζόν ξεκινάει με \"καυτό\" βίντεο! Τα iPhone 14 είναι στα χέρια ..."
  ],
  [
    "iPhone 14 &amp; iPhone 14 Plus | Big and Bigger | Apple",
    "Introducing iPhone 14 and iPhone 14 Plus. Two great sizes, Big (6.1”) and Bigger (6.7”). A new front camera with autofocus."
  ],
  [
    "Unboxing de mi nuevo iPhone 14 Pro Max",
    "Nuevo video de mi nuevo iphone 14 pro max ▻ Mis directos! https://www.twitch.tv/thedanirep ▻ DANIREPSHOP!"
  ],
  [
    "SO SÁNH iPHONE 14 PRO MAX VS iPHONE 13 PRO MAX: KHÔNG ĐÁNG NÂNG CẤP???",
    "SO SÁNH iPHONE 14 PRO MAX VS iPHONE 13 PRO MAX: KHÔNG ĐÁNG NÂNG CẤP??? ▻ Chơi Game ngay - Nhận ngay ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – A16 Cores Power!",
    "We FINALLY know the A16 Cores Power for the iPhone 14 Pro Max and it is a MASSIVE Change to Previous iPhone Chipsets!"
  ],
  [
    "Több, mint amire számítottunk! | iPhone 14 Pro Max teszt",
    "Egy örökkévalóságnak tűnt, de elkészültünk vele! Itt az iPhone 14 Pro Max tesztünk. Idén igyekeztünk mindent a lehető ..."
  ],
  [
    "iPhone 14 Pro Max Release Date and Price – Always on Display LEAK from Apple!",
    "A NEW Always on Display LEAK has came from Apple for the iPhone 14 Pro Max and the iPhone 14 Pro! The Report shows us ..."
  ],
  [
    "5 coisas que eu AMEI no iPhone 14 Pro Max!",
    "Crie sua conta gratuitamente em https://zip4me.com/?z=97744 e use o cupom MARINA15 para ganhar até U$15 de desconto na ..."
  ],
  [
    "Apple iphone price Drop | iphone 14 Pro max | All iphone price in Qatar market | jenishliz",
    "Dear all welcome to my channel...   SUBSCRIBE Here https:// youtube.com/jenishliz/ Follow me on... Instagram: ..."
  ],
  [
    "iPHONE 14 PRO MAX: Я РАЗОЧАРОВАН, ЭТО ЖЕСТЬ",
    "Заработай на iPhone 14 Pro Max 1ТБ. Курс «Разработчик VR с нуля до PRO» на Skillbox со скидкой 60%: ..."
  ],
  [
    "iPhone 14 Pro MAX - RISING HIGH",
    "According to the latest news, Apple's new iPhone 14 Pro Max molds are shown: four models in two sizes. Apple iPhone 14 will ..."
  ],
  [
    "iPhone 14 pro max vs iPhone 4 2007 #iphone14 #ios16 #shotoniphone #apple #iphone14promax",
    ""
  ],
  [
    "iphone 14 pro max | iphone 14 pro max unboxing #iphone #unboxing #shorts",
    ""
  ],
  [
    "iPhone 14 Pro Max ALINIR MI? - 2 AYDA YAŞADIKLARIM!",
    "iPhone 14 Pro Max'in Dinamik Island'ı, güçlü kameraları, her zaman açık ekranı ve uzun pil ömrü, onu şu anda piyasadaki en iyi ..."
  ],
  [
    "iPhone 14 Pro - ИНОВАЦИЯ или не съвсем?",
    "Днес, след няколко дни на усилена употреба и тестове спокойно мога да споделя искреното ми мнение за iPhone 14 Pro ..."
  ],
  [
    "Top oder Flop? iPhone 14 Pro (review)",
    "Top oder Flop? Eines der beiden Begriffe trifft auf das iPhone 14 Pro zu oder ist es vielleicht doch eher etwas dazwischen…"
  ],
  [
    "Ho provato un VERO CLONE DI IPHONE 14 PRO MAX! *identico*",
    "Oggi ho fatto la follia: ho comprato un vero e proprio clone di iPhone 14 Pro Max e l'ho testato. Sarà uguale al modello originale?"
  ],
  [
    "iPhone 14 Pro vs iPhone 14 Pro Max - Vergleich | Die richtige Wahl treffen!",
    "In diesem Video vergleiche ich die neuen iPhones 14 Pro und 14 Pro Max miteinander. Ich zeige euch worin sich die beiden ..."
  ],
  [
    "iPhone 14 Pro Clone | HDC CLONE RS 15,999/-",
    "iPhone 14 PRO unboxing dynamic island display clone [HDC CLONE]MASTER COPY|AAA 1ST COPY| RS 15999/- ..."
  ]
]