[
  [
    "iPhone 13 Pro Max Real Life Review After 3 Weeks ⚡ Definitely Pro, Not So Max",
    "Friends, In today's video I am sharing my 3 Weeks experience with the all new iPhone 13 Pro Max. So do watch this video till the ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing &amp; First Look - The Ultimate iPhone!!! Surprise🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai Apple ke latest iPhone 13 family ke baare mein jaha pe hai latest ..."
  ],
  [
    "Apple iPhone 13 Pro &amp; Pro Max Unboxing and Quick Look - Big Upgrade?",
    "iPhone try kar lia jae ! Subscribe for Tabahi Videos LINKS▻ Bhul gya dalna INSTAGRAM ▻ http://instagram.com/techburner ..."
  ],
  [
    "This Phone is VERY HEAVY - iPhone 13 Pro Max Review after 15 Days! | TechBar",
    "This Phone is VERY HEAVY - iPhone 13 Pro Max Review after 15 Days! | TechBar Hey #TechBarArmy This is iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 13 Pro Max Best Unboxing * 😂😂 *",
    "iPhone 13 Pro Max Unboxing : is video mein mene iphone ke new latest phone ki unboxing ki hai aur apna first impressions dia ..."
  ],
  [
    "iPhone 13 pro max in 2022 ? why you should buy this iPhone right now | Mohit Balani",
    "iPhone 13 pro max in 2022 ? why you should buy this right now | Mohit Balani hello everyone, in this video we are going to talk ..."
  ],
  [
    "iPhone 13 Pro Max Review After a Month!",
    "Extend warranty of your Mobile - https://onsitego.co/3a7ppSP 1️⃣Cover your Mobile with Spills & Drops / Damage Protection ..."
  ],
  [
    "உலகிலேயே விலை உயர்ந்த mobile - iPhone 13 Pro Max 🔥 🔥 🔥  Unboxing &amp; Hands On | Real Max!! Tamil Tech",
    "In this Video We do the Unboxing of iPhone 13 Pro MAX with Camera Samples - This is not a Review, Watch the video fully and ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Full Comparison - *SHOCKING*",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max aur iPhone 13 Pro Max Se Full Comparison kiya hu ,Umeed hai ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing - Indian Retail Unit - 120Hz ProMotion | A15 Bionic | Cinematic Mode",
    "Hey, Guys, This is the Honest Unboxing and First Impression Overview of iPhone 13 Pro Max (256GB) Silver Color, Indian Retail ..."
  ],
  [
    "iPhone 13 Pro &amp; Pro Max Tips Tricks &amp; Hidden Features | YOU HAVE TO KNOW!!",
    "Don't forget to get your FREE wallpapers here https://www.haylsworld.com/free-downloads iPhone 13 USA ..."
  ],
  [
    "iPhone 14 Pro/Max vs iPhone 13 Pro Max - Detailed Comparison | Upgrade👍 or Downgrades👎",
    "Get Surfshark VPN at - https://surfshark.deals/Techbuffet - Enter promo code TechBuffet for 82% off and 3 extra months for free!"
  ],
  [
    "iPhone 13 Pro Max - 20+ Tips &amp; Tricks!",
    "iPhone 13 Pro Max Tips, Tricks, Hidden Features & First Things to Do! iPhone 13 Pro Max - 250 Days Later: ..."
  ],
  [
    "I Broke My iPhone 13 Pro Max | ₹53,000 ka Kharcha",
    "Would you spend ₹53000 for repair #Shorts #QuickBits #QBShorts #QBReels."
  ],
  [
    "Apple iPhone 13 Pro Max - Alpine Green Unboxing + GIVEAWAY 🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai Apple ke latest iPhone 13 Pro Max ke Alpine Green Color ke baare ..."
  ],
  [
    "iPhone 13 Pro Max Review In Hindi",
    "iPhone Skins: https://bit.ly/3Aqf8ho iPhone 13 Pro Max Current Price: https://amzn.to/3GWhLsV Best & High quality braided ..."
  ],
  [
    "iPhone 13 Pro Max Graphite Unboxing with MagSafe Clear Case and Benks Wireless Power Bank",
    "Unboxing The iPhone 13 Pro Max Graphite (128GB) with MagSafe Clear Case and Benks Magnetic Wireless Power Bank."
  ],
  [
    "iPhone 13 Pro Max Vs iPhone 14 Pro Max KYA UPGRADE KARNA CHAHIYE? Full Comparison | Mohit Balani",
    "IPhone 14 Pro Max vs iPhone 13 Pro Max hindi Comparison Hello everyone, in this video we are going to compare these two ..."
  ],
  [
    "Real iPhone 13 Pro Max *Review* After 10 Months !!",
    "Android vs iOS: https://youtu.be/V7Ga1LvSDwI Today in this video I am sharing my opinion about iPhone 13 Pro Max."
  ],
  [
    "Apple iPhone 13 Pro Review - The Best iPhone Yet !",
    "iPhone 13 Pro ki in-depth testing kar li jae! Subscribe for Tabahi Videos INSTAGRAM ▻ http://instagram.com/techburner ..."
  ],
  [
    "iPhone 13 Pro Max Gold (512GB) 🤍 Unboxing + accessories ☁️ | ASMR",
    "Hello friends! here is the link to my Lazada page ~ https://m.viralaccess.asia/rachxxlgps Click the link as a way to support me!"
  ],
  [
    "iPhone 13 Pro Max Three Months Later!  The MOST Useful Phone Ever!",
    "Today lets revisit the iPhone 13 pro max, which is easily the most useful phone ever made. I say that even though I hate the ..."
  ],
  [
    "iPhone 14 Pro max vs iPhone 13 pro max - Full Comparison !!",
    "Hello !! Today in this video I am comparing iPhone 14 pro max with iPhone 13 pro max. (#iphone14promaxvsiphone13promax ..."
  ],
  [
    "Who’s The KING? - iPhone 13 Pro Max vs Samsung S22 Ultra",
    "In this video, I compare the Samsung Galaxy S22 Ultra and the iPhone 13 Pro Max - The Best of Best Smartphones. You can also ..."
  ],
  [
    "iPHONE 13 Pro My Opinion | Malayalam",
    "https://www.instagram.com/iphonephobias/ Apple Wholesales&retailing -All Apple Products and Services -All India Courier ..."
  ],
  [
    "Buying iPhone 13 Pro Max With Coins - Prank | 1,40,000 सिक्को से ख़रीदा आईफोन😂",
    "Buying iPhone With Coins Prank."
  ],
  [
    "iPhone 13 Pro Review: Better Than You Think!",
    "iPhone 13 Pro is a big jump in 3 key areas, disguised by the same design! The first 1000 people will get a 1 month free trial of ..."
  ],
  [
    "YOU Should Buy the iPhone 13 Pro Max (not 14) in 2022, And Here&#39;s Why!",
    "SAVE 10% ON SQUARESPACE Visit: https://squarespace.com/everydaydad and use the discount code “EVERYDAYDAD\" at ..."
  ],
  [
    "iPhone 13 Pro Max - REAL Day in the Life Review!",
    "Learn to build your very own Smart Home with my new course! - https://course.uravgmedia.com/enroll/ Use code “URAVG” for ..."
  ],
  [
    "A few things Apple hasn&#39;t told you... - iPhone 13 Pro Max Durability Test!",
    "Its time to durability test the iPhone 13 Pro Max! Grab your Anker Fast Smartphone Charger HERE: https://ankerfast.club/3CaoixW ..."
  ],
  [
    "iPhone 13 Pro Max One Year Later - Better than the iPhone 14 Pro??",
    "This is a review of the iPhone 13 Pro Max. Specifically, this is a review of the iPhone 13 Pro Max one year later. In this review, I go ..."
  ],
  [
    "iPhone 13 Pro Max Long Term Review - Over 1 year later",
    "iPhone 13 Pro Max - 1 Year Later Without A Screen Protector or Case Long Term Review. After using iPhone 13 Pro Max one ..."
  ],
  [
    "iPhone 13 PRO MAX - GOD Level Performance &amp; CAMERA! |  TechBar",
    "iPhone 13 PRO MAX - GOD Level Performance & CAMERA! | TechBar Hey #TechBarArmy This is iPhone 13 Pro Max Unboxing ..."
  ],
  [
    "apple iphone 13 pro max miniature #shorts",
    "Hello dear friends... In This video I have shown Apple 13 series iphone 13 pro max miniature unboxing video..This phone is paper ..."
  ],
  [
    "iPhone 13 Pro Max - 250 Days Later",
    "iPhone 13 Pro Max After 250 Days - Still Too Big? | iPhone 13 Pro Max in 2022 (Review) Click here to get Canva Pro FREE for 45 ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing and Camera Test! - ASMR",
    "Today I will be unboxing the new iPhone 13 Pro Max from Apple. I hope you enjoy! #Apple #Unboxing #ASMR."
  ],
  [
    "Apple iPhone 13 Pro Max review",
    "Not just the best iPhone ever, but also the one with the 'biggest camera update ever' - that would be this year's iPhone 13 Pro, ..."
  ],
  [
    "iPhone 14 Plus vs iPhone 13 Pro Max",
    "iPhone 14 Plus vs iPhone 13 Pro Max - Hello all and welcome to the iPhone 14 Plus vs iPhone 14 Pro Max full comparison video ..."
  ],
  [
    "Great !! i Found a lot of New iPhone 13 Pro Max at the Landfill",
    "Great !! i Found a lot of New iPhone 13 Pro Max at the Landfill #iphone #restoration Welcome to the Galaxy Restore Official ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra In-Depth Comparison &amp; Review",
    "iPhone 13 Pro Max vs Galaxy S22 Ultra In-Depth Comparison & Review | InsideTech Review. Two of the best smartphones of ..."
  ],
  [
    "iPhone 13 pro max unboxing from customer",
    ""
  ],
  [
    "Iphone 13 Pro Max Lena Pada 🤨",
    "Follow me on Instagram- https://www.instagram.com/souravjoshivlogs/?hl=en ( For Collaboration ..."
  ],
  [
    "Why iPhone 13 Pro Max is still AMAZING",
    "Why iPhone 13 Pro Max is still AMAZING! In this episode, we revisit the Apple iPhone 13 Pro Max and discuss why this is still an ..."
  ],
  [
    "iPhone 14 Pro Max Long Term Review",
    "Get your $5 now : https://r.honeygain.com/Nabeel , code \"Nabeel\" Buy Here: iPhone 14 Pro Max: https://amzn.to/3PJnUON iPhone ..."
  ],
  [
    "iPhone 13 Most Value For Money? | iPhone 13 vs iPhone 13 Pro Max Detailed Comparison in 2022 (HINDI)",
    "iPhone 13 Most Value For Money? | iPhone 13 vs iPhone 13 Pro Max Detailed Comparison in 2022 (HINDI) This Video is ..."
  ],
  [
    "iPhone 13 Pro Max - First 13 Things To Do!",
    "iPhone 13 Pro Max - First 12 Things to Do! Just bought a new iPhone 13 Pro Max? Here are the first 13 things to do on your new ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; initial impressions || in Telugu ||",
    "ios 16 Features : https://youtu.be/guSSwYeD5ZI Support me :) (Everytime you buy using the below links I get a small commission ..."
  ],
  [
    "iPhone 13 Pro Max  - Unboxing &amp; Overview in HINDI( INDIAN RETAIL UNIT )",
    "Purchase Link - https://amzn.to/3kD4cWW iPhone 13 Mini - https://youtu.be/o3xrpUXyoW4 iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 13 Series Unboxing &amp; First Look ⚡ #TrakinTechStyleUnboxing",
    "Doston Saal Ka Wo Din Aa Gaya Hain Jab Hum Unbox Karte Hain All New iPhones Ko, Aak ke Video Me Hum Unbox Kar Rahe ..."
  ],
  [
    "S22 Ultra VS iPhone 13 Pro Max!!!",
    "Let me know in the comments section, which you think is better the Samsung Galaxy S22 Ultra VS iPhone 13 Pro Max!"
  ],
  [
    "Samsung S22 Ultra vs S21 / iPhone 13 Pro Max / Pixel 6 Pro / Xiaomi 12 Pro Battery Life Drain Test!",
    "Full battery life drain test of the new Samsung Galaxy S22 Ultra vs Samsung Galaxy S21 Ultra vs iPhone 13 Pro Max vs Google ..."
  ],
  [
    "Nothing Changed My Mind From iPhone 13 Pro Max!",
    "Nothing Changed My Mind From iPhone 13 Pro Max. Apple iPhone 13 Pro Max is heading on 1 year old and in this video, I will ..."
  ],
  [
    "iPhone 13 Pro Max vs iPhone 14 Pro Max",
    "iPhone 13 Pro Max vs iPhone 14 Pro Max - Hello all and welcome to this video comparison between last year's Apple iPhone 13 ..."
  ],
  [
    "iPhone 13 pro max le liya, Dubai Mobile Market se",
    "CATCH ME ON INSTA▽ https://www.instagram.com/teamvikrant_/ Please give your valuable feedback, do not forget to subscribe ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max - Full Comparison",
    "iPhone 14 Pro Max is new, but is it better and worth upgrading from iPhone 13 Pro Max? This is the iPhone 14 Purple Pro Max vs ..."
  ],
  [
    "iPhone 13 Pro Max vs 13 Pro / 13 / 13 Mini / 12 / 11 / SE - Battery Life DRAIN TEST",
    "Full Battery Life Drain Test of the iPhone 13 Pro Max, iPhone 13 Pro, iPhone 13, iPhone 13 Mini, iPhone 12, iPhone 11, iPhone ..."
  ],
  [
    "The iPhone 13 Pro Max has TWO Secrets inside?! - Teardown!",
    "Its time to take apart the new iPhone 13 Pro Max! Grab a Teardown skin for your phone HERE: https://dbrand.com/teardown Apple ..."
  ],
  [
    "Nice...  iPhone 13 &amp; iPhone 13 Pro Max in black bag at trash",
    "Money   I found lots of iPhone 13 & 13 Pro Max in black bag at trash near the City #iphone13 #restoration 1. Restoring Broken ..."
  ],
  [
    "iPhone 13 Most Value For Money? | iPhone 13 vs iPhone 13 Pro Max Detailed Comparison in 2022 (HINDI)",
    "iPhone 13 Most Value For Money? | iPhone 13 vs iPhone 13 Pro Max Detailed Comparison in 2022 (HINDI) This Video is ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max - Ultimate Comparison!",
    "Check out the MOFT Snap Stand Power Set: https://bit.ly/3QJi3If No More iTunes, Finder and iCloud Limits, Go With This ..."
  ],
  [
    "iPhone 13 Pro Max Honest Review after 1 Week!",
    "I've been testing Apple's new iPhone 13 Pro Max for a week now.. so let's review it from an honest point of view and focus on what ..."
  ],
  [
    "iPhone 13 Pro Max Review - 1 Month Later…",
    "After using the iPhone 13 Pro Max for over a month... is it still worth buying? ▷ Learn more about Narwal: ..."
  ],
  [
    "Introducing iPhone 13 Pro | Apple",
    "The biggest upgrade to the Pro camera system with advanced low-light performance, macro photography, Cinematic mode and ..."
  ],
  [
    "iPhone 13 Pro Max  - Unboxing &amp; Overview in HINDI( INDIAN RETAIL UNIT )",
    "Purchase Link - https://amzn.to/3kD4cWW iPhone 13 Mini - https://youtu.be/o3xrpUXyoW4 iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing - இவ்ளோ பெரிய போன்-ஆ 😲???",
    "இந்த வருஷத்தோட கடைசி iPhone - iPhone 13 pro max இதை தான் இந்த வீடியோல unbox ..."
  ],
  [
    "iPhone 14 Plus VS iPhone 13 Pro max - Which is ACTUALLY Better?",
    "iPhone 14 Review: https://youtu.be/_ktWKFdcI-A iPhone 14 Pro Max Hindi Review: https://youtu.be/O318vMn9t2E iPhone 14 Plus ..."
  ],
  [
    "iPhone 13 | Unboxing all new models!",
    "Unboxing the all new iPhone 13, iPhone 13 Mini, iPhone 13 Pro and iPhone 13 Pro Max is here! Check out my full iPhone 13 ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 13 Pro | What&#39;s the difference?",
    "Apply for IDFC First Bank Credit Card - https://cashk.app.link/YBnR1IR6itb Download Cashkaro App- ..."
  ],
  [
    "Introducing iPhone 13 Pro | Apple",
    "The biggest upgrade to the Pro camera system with advanced low-light performance, macro photography, Cinematic mode, and ..."
  ],
  [
    "S22 Ultra VS iPhone 13 Pro Max!!!",
    "Let me know in the comments section, which you think is better the Samsung Galaxy S22 Ultra VS iPhone 13 Pro Max!"
  ],
  [
    "iPhone 13 Pro Max Unboxing 😡",
    "iPhone 13 Pro Max 'Sierra Blue' Unboxing #Shorts The monstrosity that is the iPhone 13 Pro Max is not just bigger than the ..."
  ],
  [
    "iPhone 13 Pro Max Review - One Year Later",
    "With the flagship iPhone 13 Pro Max on the verge of being discontinued and replaced by the upcoming iPhone 14 Pro Max, in this ..."
  ],
  [
    "iPhone 13 - First 13 Things to do ( Tips &amp; Tricks )",
    "If you just picked up the iPhone 13, 13 Pro or Pro Max. Here are 13 tips & tricks, 13 of the first things to do. As well as hidden ..."
  ],
  [
    "Green iPhone 13 and 13 Pro Max Unboxing!",
    "GreeniPhone13 #AlpineGreeniPhone13ProMax If you're a fan of the color green, Apple just added new color options for the ..."
  ],
  [
    "iPhone 13 Pro Max Review: 1 Year Later!",
    "With the iPhone 13 Pro Max is approaching its 1 year anniversary, many of us are wondering whether or not to get it so close to ..."
  ],
  [
    "iPhone 14 Pro/Pro Max Full Review: ALMOST PERFECT…",
    "The Apple iPhone 14 Pro/Pro Max is now available at Beyond the Box physical stores, website, and LazMall! Products mentioned ..."
  ],
  [
    "iPhone 13 Pro Max One Year Later: Still a Beast!",
    "iphone13 #ios16 #apple Illusions Wallpaper Pack: https://mtgproductions.gumroad.com/l/illusions iPhone 13 Pro Max: ..."
  ],
  [
    "PRICE DROP SA IPHONE 14 PRO MAX, 13 PRO MAX, IPAD,APPLE WATCH GREENHILLS DECEMBER 25 2022 - JAN 2023",
    "Erratum: iPad Pro M2 11\" 256Gb 58500 po. 256Gb lang po yun. Not 512Gb. Salamat po.   Mag-ingat po sa mga scammers!"
  ],
  [
    "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra CAMERA TEST 🔥",
    "Camera Test comparison - iPhone 13 Pro / 13 Pro Max vs Samsung Galaxy S21 Ultra! Sign up here ..."
  ],
  [
    "Tư vấn điện thoại: iPhone 12 Pro Max cũ hay iPhone 13 sẽ tốt hơn?",
    "Tư vấn điện thoại: iPhone 12 Pro Max cũ hay iPhone 13 sẽ tốt hơn? Tham khảo tại CellphoneS ..."
  ],
  [
    "iPhone 13 Pro Max  - REVIEW After 80 Days",
    "Vlogging Channel - https://www.youtube.com/c/TNGVlogsOfficial Purchase Link - https://amzn.to/3kD4cWW iPhone 13 Mini ..."
  ],
  [
    "iPhone 13 Pro Max - A Day In The Life",
    "My iPhone 13 Pro Max day in the life with a little surprise - everything in this video including the thumbnail is shot solely with the ..."
  ],
  [
    "WHAT&#39;S ON MY IPHONE 13 PRO MAX | Nicole Laeno",
    "NEW PHONE BABY! Go to https://casetify.com/nicolelaeno today to get 15% off your new iPhone 13 case! GoodReads account: ..."
  ],
  [
    "iPhone 14 Pro Max Vs iPhone 13 Pro Max Comparison | Should You Upgrade ? | HINDI 🔥",
    "A Detailed Comparison between the latest flagship phone from Apple, IPhone 14 Pro Max and 2021 Apple Flagship, IPhone 13 ..."
  ],
  [
    "J&#39;ai acheté un Faux iPhone 13 Pro Max à 109€ ! (choqué)",
    "Faux iPhone 13 Pro Max 109€ vs iPhone 13 Pro Max 1259€ ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les 1ers Vrais Ecouteurs ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing - Best iPhone for Gaming? (Minecraft, PUBG, Call of Duty)",
    "Unboxing gameplay review of new Apple iPhone 13 Pro Max smartphones all colors: Graphite, Sierra Blue, Silver and Gold."
  ],
  [
    "iPhone 13 pro max free fire 2 finger claw handcam gameplay onetap headshot tips A15 Bionic chip",
    "iphone 13 pro max mobile free fire handcam gameplay garena free fire Please support phone player please guys keep support ..."
  ],
  [
    "iPhone 14 Pro Review: This Will Be Copied!",
    "iPhone 14 Pro and iPhone 14 Pro Max have 3 main new things. My honest thoughts! New Chevron Hoodie! http://shop."
  ],
  [
    "NO COMPRES el iPhone 14 Pro Max sin ver este video",
    "Links de compra Amazon: https://amzn.to/3TYfTGt Linio: https://bit.ly/3Ne7DA3 Claro Shop: https://bit.ly/3Df3NlC ..."
  ],
  [
    "iPhone 13 Pro Max Vs iPhone 14 Pro Max Review of Specs!",
    "Should I BUY a iPhone 14 Pro Max or stick or even get an 13 Pro Max? Well in Todays iPhone 13 Pro Max Vs iPhone 14 Pro max ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max - Is this a joke!?🏝️",
    "iPhone 14 Pro Max vs 13 - NOT what you expected! The Apple iPhone 14 Pro Max, iPhone 14 and 14 Plus have been the talk ..."
  ],
  [
    "BEGGER Buying iPhone 14 Pro Max 😱 Gone *Shocking* 🤯 Mall Se Nikal Diya",
    "partnership https://l.apna.co/ndhar - Click on link to get full-time jobs in Tata, Reliance and Amazon . . . . For Business ..."
  ],
  [
    "MacBro - iPhone 13 pro va iPhone 13 pro Max o&#39;zbek tilidagi tahlili",
    "iPhone 13 kelishini kutayotgan ashaddiy \"olmaxo'r\" larimizga iPhone 13 Pro va iPhone 13 Pro Max tahlil qilingan video ..."
  ],
  [
    "iPhone 13 Pro Max Three Months Later!  The MOST Useful Phone Ever!",
    "Today lets revisit the iPhone 13 pro max, which is easily the most useful phone ever made. I say that even though I hate the ..."
  ],
  [
    "iPhone 14 Pro Max vs. iPhone 13 Pro Max Battery Test 🔋Subscribe for more 🤙🏼",
    ""
  ],
  [
    "Why You Should Skip the iPhone 14...",
    "iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are here. Which one should you buy? iPhone 14 Latercase ..."
  ],
  [
    "IPHONE 13 PRO MAX GOLD UNBOXING | THE CAMERA IS 🔥",
    "PHONE CASE DETAILS SPIDERCASE Designed for iPhone 13 Pro Max Case, Crystal Clear Not Yellowing Military Grade Drop ..."
  ],
  [
    "iPhone 13 Pro vs 13 Pro Max Full Comparison in Hindi",
    "Buy from Amazon: https://amzn.to/3apqzJC Apple: https://apple.sjv.io/c/2478883/835052/11705 My Recommendations Best ..."
  ],
  [
    "How i Restore Destroyed iPhone 13 Pro Max, Cracked Phone Restoration",
    "How i Restore Destroyed iPhone 13 Pro Max, Cracked Phone Restoration Top 5 Restoration videos : = = = = = = = = = 1."
  ],
  [
    "IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max",
    "IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max || Full Comparison Of IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max ..."
  ],
  [
    "iPhone 13 - Complete Beginners Guide",
    "This In-Depth iPhone 13 Beginners Guide covers Everything about the iPhone 13, iPhone 13 Mini, iPhone 13 Pro & iPhone 13 ..."
  ],
  [
    "iPhone 14 Pro Max vs. iPhone 13 Pro Max Battery Test 🔋Subscribe for more 🤙🏼",
    ""
  ],
  [
    "It&#39;s a lot of iPhone 13 &amp; iPhone 13 Pro Max in the Landfill near the city",
    "It's a lot of iPhone 13 & iPhone 13 Pro Max in the Landfill near the city #iphone13 #restoration Welcome to the Galaxy Restore ..."
  ],
  [
    "iPhone 13 Pro Max Three Months Later!  The MOST Useful Phone Ever!",
    "Today lets revisit the iPhone 13 pro max, which is easily the most useful phone ever made. I say that even though I hate the ..."
  ],
  [
    "iPhone 13 Pro Max #iphone",
    "shorts #ytshorts #iphone #case iPhone Х iPhone Search term iPhone Mobile phone iPhone 14 Mobile phone iPhone Product ..."
  ],
  [
    "WHICH IS BETTER!? iPhone 14 Pro Max vs iPhone 13 Pro Max Review BRUTALLY HONEST",
    "Which is BETTER!? iPhone 14 Pro Max vs iPhone 13 Pro Max Review, Camera Comparison and more...BRUTALLY HONEST ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing and Camera Test! - ASMR",
    "Today I will be unboxing the new iPhone 13 Pro Max from Apple. I hope you enjoy! #Apple #Unboxing #ASMR."
  ],
  [
    "Why You Should Skip the iPhone 14...",
    "iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are here. Which one should you buy? iPhone 14 Latercase ..."
  ],
  [
    "iPhone 13 Pro vs 13 Pro Max Full Comparison in Hindi",
    "Buy from Amazon: https://amzn.to/3apqzJC Apple: https://apple.sjv.io/c/2478883/835052/11705 My Recommendations Best ..."
  ],
  [
    "iPhone 13 Pro Max #iphone",
    "20M_views #shorts #ytshorts #iphone #case iPhone Х iPhone Search term iPhone Mobile phone iPhone 14 Mobile phone ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max: Speed / Battery / Temperature Test",
    "[Apple A16 vs A15 Bionic] Boot, Face ID, Temps, Battery Drain, Camera, APP, Benchmark, Game Speeds and RAM between the ..."
  ],
  [
    "IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max",
    "IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max || Full Comparison Of IPhone 13 Vs IPhone 13 Pro Vs IPhone 13 Pro Max ..."
  ],
  [
    "OMG!! Lucky day!! Founded alot of IPhone 13 Pro Max on near landfill",
    "OMG!! Lucky day!! Founded alot of IPhone 13 Pro Max on near landfill, The life of a child picking up trash #JoyRestore."
  ],
  [
    "iPhone 13 Pro Max Review: 1 Year Later!",
    "With the iPhone 13 Pro Max is approaching its 1 year anniversary, many of us are wondering whether or not to get it so close to ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Which is the Flagship KING?",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "iPhone 13 Pro Max #iphone",
    "shorts #ytshorts #iphone #case iPhone Х iPhone Search term iPhone Mobile phone iPhone 14 Mobile phone iPhone Product ..."
  ],
  [
    "iPhone 13 &amp; 13 Pro HIDDEN Features! New Apple Secrets",
    "Spigen ArcField for MagSafe Charger: https://amzn.to/2ZpsBah Spigen GaN fast charger: https://amzn.to/3i2QwTG Spigen MFI ..."
  ],
  [
    "IPHONE 13 PRO MAX GOLD UNBOXING | THE CAMERA IS 🔥",
    "PHONE CASE DETAILS SPIDERCASE Designed for iPhone 13 Pro Max Case, Crystal Clear Not Yellowing Military Grade Drop ..."
  ],
  [
    "Galaxy S22 Ultra vs iPhone 13 Pro Max Camera Test: New Camera King?",
    "The Samsung Galaxy S22 Ultra review continues with the full photo and video comparison. Galaxy S22 Ultra vs iPhone 13 Pro ..."
  ],
  [
    "How i Restore Destroyed iPhone 13 Pro Max, Cracked Phone Restoration",
    "How i Restore Destroyed iPhone 13 Pro Max, Cracked Phone Restoration Top 5 Restoration videos : = = = = = = = = = 1."
  ],
  [
    "iPhone 13 pro max unboxing from customer",
    ""
  ],
  [
    "iPhone 13 Pro Vs iPhone 14 Pro in Depth Comparison | Camera | Gaming | Battery | Mohit Balani",
    "iPhone 13 Pro Vs iPhone 14 Pro in Depth Comparison | Camera | Gaming | Battery | Mohit Balani A lot of people are confused ..."
  ],
  [
    "Free iPhone 13 Pro Max Flipkart | NEW TRICK 100% SABKO MILEGA FREE ME",
    "freeiphone13promax #freeiphone #iphone13promaxfree #iphonefree #iphone13promax #freeiphone13 #howtogetfreeiphone ..."
  ],
  [
    "iPhone 13 Pro and 13 Pro Max: Everything you need to know",
    "Tim Cook describes the new iPhone 13 Pro as \"the most pro iPhone ever!\" And with a bigger battery, new cameras and a high ..."
  ],
  [
    "iPhone 14 Pro Max proved everyone wrong..",
    "iPhone 14 Pro Max Review - 95 Days Later Thanks to Mailchimp for sponsoring a portion of this video! Get started at: ..."
  ],
  [
    "Samsung S22 Ultra vs S21 / iPhone 13 Pro Max / Pixel 6 Pro / Xiaomi 12 Pro Battery Life Drain Test!",
    "Full battery life drain test of the new Samsung Galaxy S22 Ultra vs Samsung Galaxy S21 Ultra vs iPhone 13 Pro Max vs Google ..."
  ],
  [
    "Unboxing EVERY iPhone 13, iPhone 13 Pro, iPhone 13 Pro Max and iPhone 13 Mini in All Colors",
    "iPhone 13 Unboxing featuring Red, Starlight, Blue, Midnight and Pink iPhone 13 Mini Unboxing featuring Red, Starlight, Blue, ..."
  ],
  [
    "iPhone 14 Pro Max Vs. iPhone 13 Pro Max Vs. iPhone 12 Pro Max",
    "iPhone 14 Pro Max Vs iPhone 13 Pro Max Vs iPhone 12 Pro Max | Side by Side Comparison | What's the Difference ? ▻Please ..."
  ],
  [
    "iPhone 13 Pro Max vs 13 Pro / 13 / 13 Mini / 12 / 11 / SE - Battery Life DRAIN TEST",
    "Full Battery Life Drain Test of the iPhone 13 Pro Max, iPhone 13 Pro, iPhone 13, iPhone 13 Mini, iPhone 12, iPhone 11, iPhone ..."
  ],
  [
    "iPhone 13 vs iPhone 13 Pro Max Pubg Test, Heating and Battery Test | shocking Results",
    "In this video, I will do the pubg test comparison between iPhone 13 vs iPhone 13 Pro Max and also check out the heating and ..."
  ],
  [
    "YOU Should Buy the iPhone 13 Pro Max, And Here&#39;s Why!",
    "The iPhone 13 pro max is one of my favorite devices of the year, not just because its the newest iPhone, but because of how much ..."
  ],
  [
    "iPhone 13 Pro Max 6 Months Later!",
    "iPhone 13 Pro Max 6 Months Later! Apple iPhone 13 Pro Max might be the best phone on the planet and in this video, I explain ..."
  ],
  [
    "AfSomali - iPhone 13 Pro MAX Unboxing, Review and Setup",
    "Booqo Website ka Hurbad: https://hurbad.com/ Libaax ama Libaaxad hadii aad doonayso in aad kusoo biirto hurbad.com, ..."
  ],
  [
    "iPong 13 Pro Max #shorts #fyp #viral",
    "shorts #fyp #viral #comedy #foryoupage #foryourpage #china #chinalore #lore #lorememe #soccer #iphone #iphone13 ..."
  ],
  [
    "iPhone 13 Pro Max - Unboxing, Setup and First Look",
    "iPhone 13 Pro Max, and iPhone 13 are releasing soon. In this video I unbox the iPhone 13 Pro Max in Sierra Blue."
  ],
  [
    "iPHONE 13 Pro, iPHONE 14 Pro Max Price in DUBAI, Price DROP LATEST IPHONE PRICE, SEVEN WONDERS ,",
    "LATEST IPHONE 14 PRICE Update in DUBAI Cheapest iPHONE 14, 14 PRO,iPHONE 14 PRO MAX, LATEST IPHONE 14 PRICE ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; initial impressions || in Telugu ||",
    "ios 16 Features : https://youtu.be/guSSwYeD5ZI Support me :) (Everytime you buy using the below links I get a small commission ..."
  ],
  [
    "Iphone13 Pro Unboxing and Initial Impressions | I Bought My First ever Iphone Vlog | TFV Lifestyle",
    "Follow me on instagram for outfit inspirations : https://www.instagram.com/b.v.s.ganesh/?hl=en let's video call and interact instantly ..."
  ],
  [
    "iPhone 13 Pro Max Sirf Rs 15000 Mein - Sher Shah Godam Karachi",
    "iPhone 13 Pro Max Sirf Rs 15000 Mein - Sher Shah Godam Karachi Hello Friends in this video I am showing you Sher Shah ..."
  ],
  [
    "Apple iPhone 13 Pro Max Water Test",
    "new Apple iPhone 13 Pro Max water test | IP68 water and dust resistant Iphone 13 pro max via https://amzn.to/3rcDHek."
  ],
  [
    "iPhone 13 Pro Max Review: My Honest Thoughts After 1 Month",
    "It's been about a month since I got my hands on the iPhone 13 Pro Max, and I think it's about time to give you my honest thoughts ..."
  ],
  [
    "My New Apple Iphone 13 Pro Max and Airpods Pro | Telugu Traveller",
    "iPhone 13 pro max 256gb price in India https://amzn.to/3uy0ce3 AirPods Pro pice in India https://amzn.to/35kPVcM Follow me on ..."
  ],
  [
    "iPhone 13 Pro Max vs. Galaxy S21 Ultra Battery Test",
    "Battery test between the Apple iPhone 13 Pro Max and Samsung Galaxy S21 Ultra to see how big the difference is between them."
  ],
  [
    "₹500,000 Camera vs iPhone 14 Pro Max | Spot the Difference",
    "I compared the iPhone 14 Pro Max with Canon R5 camera, photos and video samples included in this video. Learn Photography ..."
  ],
  [
    "iPhone 13 Pro Max Vs DSLR Camera Test | iPhone 13 Pro Max Vs Sony Alpha A7iii Mirrorless Camera",
    "Hi Guys, in this video, we have done a detailed camera comparison between the iPhone 13 Pro Max and the $2000 Professional ..."
  ],
  [
    "iPhone 13 Unboxing - Are they ACTUALLY Good!?",
    "Unboxing iPhone 13, iPhone 13 mini, iPhone 13 Pro, iPhone 13 Pro Max, including camera test, battery, specs etc! Enter the ..."
  ],
  [
    "iPhone 14 Pro Max vs 14 Pro / 14 / 13 / 13 mini / 12 / SE Battery Test!",
    "Battery Life Drain test of the iPhone 14 Pro Max, plus the iPhone 14 Pro, vs iPhone 14, iPhone 13, iPhone 13 Mini, iPhone 12, ..."
  ],
  [
    "I Bought an iPhone 13 Pro Max before 2023!",
    "I switched to an iPhone 13 Pro Max before 2023, after spending almost 6 months with an iPhone 13 Pro. ExoGuard ..."
  ],
  [
    "iPhone 13 pro max free fire 2 finger claw handcam gameplay onetap headshot tips A15 Bionic chip",
    "iphone 13 pro max mobile free fire handcam gameplay garena free fire Please support phone player please guys keep support ..."
  ],
  [
    "iPhone 13 pro max unboxing and gaming test m1887 onetap headshot 3 finger handcam free fire max",
    "iPhone 13 Pro Max unboxing and gaming review This phone is most powerful This iPhone 13 Pro Max handcam garena free fire ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max | SPEED TEST",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Speed Test Comparison...."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Which is the Flagship KING?",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Test game iPhone 13 Pro Max: Apple A15 Bionic quá đỉnh, nhưng gặp vấn đề cố hữu này!",
    "Test game iPhone 13 Pro Max: Apple A15 Bionic quá đỉnh, nhưng gặp vấn đề cố hữu này! Báo giá iPhone 13 Pro Max: ..."
  ],
  [
    "iPhone 14 Pro Max VS iPhone 13 Pro Max! Full Compare!",
    "I compare the iPhone 13 Pro Max against the all-new 2022 iPhone 14 Pro Max including performance, display, the Dynamic ..."
  ],
  [
    "Apple iPhone 13 Pro Max Water Test",
    "new Apple iPhone 13 Pro Max water test | IP68 water and dust resistant Iphone 13 pro max via https://amzn.to/3rcDHek."
  ],
  [
    "Beggar Buying iPhone 13 Pro Max Prank- Rich Beggar @BobbyButt",
    "For business enquiry bobbybutt2018@gmail.com Follow on Instagram ..."
  ],
  [
    "iPhone 13 PRO MAX Vs iPhone 12 PRO MAX Vs iPhone 11 PRO MAX",
    "APPLE iPhone 11 PRO MAX vs 12 PRO MAX vs 13 PRO MAX | Animated Slideshow | Full Specs Comparison #iPhone13ProMax ..."
  ],
  [
    "SOLD my GOLD Chain &amp; Ring to BUY Brand New Apple iPhone 13 Pro",
    "Hey everyone! It's a super exciting day for Chennai as Apple is launching iPhone 13 Pro. I am looking forward to upgrading my ..."
  ],
  [
    "Beggar Buying IPHONE 13 PRO MAX Prank - Rich Beggar @MastiPrankTvOfficial",
    "Rich Beggar Buying IPHONE 13 PRO MAX With Real Money Got Some EPIC Reactions! Watch."
  ],
  [
    "Apple iPhone 13 Pro Max 1 TB, Graphite Unboxing 4k 60fps Telugu #Apple",
    "FOLLOW ME ON TWITCH: https://www.twitch.tv/unqgamer FOLLOW ME ON INSTAGRAM ..."
  ],
  [
    "BOUGHT IPHONE 13 PRO MAX WITHOUT PAYING MONEY 😍 (FINALLY)",
    "Hey waddup my lovely amvian's... Kasa kai? I HOPE YOU ENJOYED WATCHING THIS VIDEO..APKE BHAI NE BOHOT MEHNAT ..."
  ],
  [
    "iPhone 13 Pro Max 6 Months Later!",
    "iPhone 13 Pro Max 6 Months Later! Apple iPhone 13 Pro Max might be the best phone on the planet and in this video, I explain ..."
  ],
  [
    "AfSomali - iPhone 13 Pro MAX Unboxing, Review and Setup",
    "Booqo Website ka Hurbad: https://hurbad.com/ Libaax ama Libaaxad hadii aad doonayso in aad kusoo biirto hurbad.com, ..."
  ],
  [
    "Buy the iPhone 13 in 2023!",
    "Go to our sponsor Aura for a 14 day free trial. You can sign up here: https://aura.com/gregsgadgets The iPhone 14 Pro was a big ..."
  ],
  [
    "Bandhiga iphone 13 Pro and iphone 13 Pro Max,,,,  maxaa ka cusub Iphone 13 #iphone13, #elmitech",
    "Bandhiga iphone 13 Pro and iphone 13 Pro Max maxaa ka cusub Iphone 13 phone #iphone13, #elmitech."
  ],
  [
    "iPhone 13 Pro Max - Unboxing, Setup and First Look",
    "iPhone 13 Pro Max, and iPhone 13 are releasing soon. In this video I unbox the iPhone 13 Pro Max in Sierra Blue."
  ],
  [
    "Photographer Uses iPhone 13 Pro Max For The First Time",
    "Photographer Uses iPhone 13 Pro Max For The First Time Support my Friends: Khush: ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Unboxing and Camera Test: 48MP!",
    "This is what you have been waiting for! The iPhone 13 Pro Max vs iPhone 14 Pro Max Camera Test Comparison! I also compared ..."
  ],
  [
    "iPhone 13 Pro Max Vs iPhone 12 Pro Max Full Detailed Comparison | Mohit Balani",
    "iPhone 13 Pro Max Vs iPhone 12 Pro Max Full Detailed Comparison | Mohit Balani In this video we will compare these two ..."
  ],
  [
    "Samsung S22 Ultra vs iPhone 13 Pro Max Pubg Test, Heating and Battery Test | Shocking Results 😱",
    "In this video, I will do the Pubg/bgmi test comparison between iphone 13 pro max vs samsung s22 ultra and also check out the ..."
  ],
  [
    "iPhone 14 Pro Max vs 14 Pro / 14 / 13 / 13 mini / 12 / SE Battery Test!",
    "Battery Life Drain test of the iPhone 14 Pro Max, plus the iPhone 14 Pro, vs iPhone 14, iPhone 13, iPhone 13 Mini, iPhone 12, ..."
  ],
  [
    "Unboxing EVERY iPhone 13, iPhone 13 Pro, iPhone 13 Pro Max and iPhone 13 Mini in All Colors",
    "iPhone 13 Unboxing featuring Red, Starlight, Blue, Midnight and Pink iPhone 13 Mini Unboxing featuring Red, Starlight, Blue, ..."
  ],
  [
    "Xiaomi Redmi Note 11 Pro vs iPhone 13 Pro max | SpeedTest and Camera comparison",
    "comparemobile #redminote11pro #iphone13promax Samsung Galaxy A03s https://amzn.to/3qiglCO Samsung Galaxy S21 FE ..."
  ],
  [
    "Farqi nimada? iPhone 13 Pro va iPhone 13 Pro Max to&#39;liq obzor!",
    "apple #iphone13 Ijtimoiy tarmoqlardagi sahifalarim: Instagram - https://bit.ly/3cdoaCF TikTok - https://bit.ly/3FgMobQ Murojaat ..."
  ],
  [
    "iPhone 13 Pro Max Tips And Tricks 🔥 | Hidden Features | In Hindi | TechSK |",
    "Hello guys This video about to iphone 13 pro max tips,tricks and some hidden features. What you need to know. Giveaway ..."
  ],
  [
    "i Found Many New iPhone 13 Pro Max Box on The Road - How to restore Cracked Phone",
    "i Found Many New iPhone 13 Pro Max Box on The Road - How to restore Cracked Phone Welcome to the \"​​JaiPhone \" Official ..."
  ],
  [
    "ROG Phone 6 Pro VS iPhone 13 Pro Max - Speed Test",
    ""
  ],
  [
    "iPhone 13 Pro Vs iPhone 14 Pro in Depth Comparison | Camera | Gaming | Battery | Mohit Balani",
    "iPhone 13 Pro Vs iPhone 14 Pro in Depth Comparison | Camera | Gaming | Battery | Mohit Balani A lot of people are confused ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra : le Gros Comparatif !",
    "Lequel choisir ? Galaxy S22 Ultra vs iPhone 13 Pro Max. ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les protections RhinoShield ..."
  ],
  [
    "I Bought an iPhone 13 Pro Max before 2023!",
    "I switched to an iPhone 13 Pro Max before 2023, after spending almost 6 months with an iPhone 13 Pro. ExoGuard ..."
  ],
  [
    "iPhone 13 Pro Max vs 12 Pro Max - Ultimate Comparison!",
    "We JUST got Apple's new iPhone 13 Pro Max, so let's compare literally EVERYTHING to the previous iPhone 12 Pro Max in this ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Sparkling Water FREEZE Test! What&#39;s Gonna Happen?!",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra sparkling water freeze test! Drop these in freeze temps to test durability."
  ],
  [
    "iPhone 13 Pro Max Review: 6 Months Later!",
    "The iPhone 13 Pro Max is the best iPhone of 2022, 6 months later The iPhone 13 Pro Max still has power, speed, a great display, ..."
  ],
  [
    "iPhone 13 Pro Max India Unboxing",
    "https://instagram.com/cellbuddyistore.sss?utm_medium=copy_link iPhone 13, iPhone 13 Pro & Pro Max Available at Cellbuddy ..."
  ],
  [
    "&quot;GOLD&quot; iPhone 13 PRO MAX வாங்கியாச்சு..🔥 | Cybertamizha",
    "My Instagram: https://instagram.com/cybertamizhann Instagram ID: @cybertamizhann Use this link for purchase AMAZON: ..."
  ],
  [
    "J&#39;ai acheté les iPhone 13, 13 Pro, Max et mini ! (Apple je te pardonne)",
    "Unboxing iPhone 13, mini, 13 pro et pro max en français ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les protections RhinoShield ..."
  ],
  [
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store",
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store #apple #iphone #applestore Business Inquiries: ..."
  ],
  [
    "iPhone 14 vs iPhone 13 – Full Comparison",
    "In this video, I will do a full comparison of two iPhones, namely iPhone 13 and iPhone 14! Which of these Apple smartphones ..."
  ],
  [
    "iOS 16.2 is Out! - What&#39;s New? - 35+ New Features",
    "iOS 16.2 Released to the Public and iOS 16.2 is out to everyone around the world at the same time. iOS 16.2 brings well over 35 ..."
  ],
  [
    "iPhone 13 pro max unboxing &amp; set up ☁️ sierra blue ❄️ 128 gb (philippines)",
    "good day, guys! welcome to my channel. I received this phone as a gift so I decided to film an unboxing video. I jumped from ..."
  ],
  [
    "iPhone 13 Pro VS iPhone 14 Pro I #shorts I #ytshorts I #iphone",
    "Visit our website for more information- http://anuragaggarwal.com Contact us- E-MAIL: info@anuragaggarwal.com Contact no."
  ],
  [
    "iPhone 13 Unboxing - Are they ACTUALLY Good!?",
    "Unboxing iPhone 13, iPhone 13 mini, iPhone 13 Pro, iPhone 13 Pro Max, including camera test, battery, specs etc! Enter the ..."
  ],
  [
    "iPhone 13 Pro Max - The Real VS. Fake - They Have Changed A Lot!",
    "Please subscribe for more! Today in this video we are comparing the fake iPhone 13 Pro Max with the real one. They have ..."
  ],
  [
    "OnePlus 10 Pro VS iPhone 13 Pro Max Comparison!",
    "OnePlus 10 Pro VS iPhone 13 Pro Max | Full Comparison SnapDragon 8 Gen1 Vs Apple A15 Bionic What's the Difference ?"
  ],
  [
    "iPhone 13 Pro and 13 Pro Max: Everything you need to know",
    "Tim Cook describes the new iPhone 13 Pro as \"the most pro iPhone ever!\" And with a bigger battery, new cameras and a high ..."
  ],
  [
    "YOU Should Buy the iPhone 13 Pro Max, And Here&#39;s Why!",
    "The iPhone 13 pro max is one of my favorite devices of the year, not just because its the newest iPhone, but because of how much ..."
  ],
  [
    "iPhone 13 Pro Max Price in Pakistan | PTA Approve iPhone 13 Pro Max Price | iPhone 13 Pro Max Review",
    "Make sure to subscribe ReviewsMasterPK. Apple iPhone 13 iPhone 13 Release Date iPhone 13 Pro Hands On Review Apple ..."
  ],
  [
    "All accessories for iPhone 13 Pro Max | Unboxing and Changing tempered glass screen protector..",
    "Copyright Disclaimer under Section 107 of the copyright act 1976, allowance is made for fair use for purposes such as criticism, ..."
  ],
  [
    "vivo X80 Pro vs Samsung S22 ultra vs iPhone 13 pro max - Best camera Phone 2022 !!",
    "Hello!! Today in this video I am sharing my opinion about vivo x80 pro vs iPhone 13 pro max vs Samsung S22 ultra camera."
  ],
  [
    "Apple iPhone 13 Pro Max Unboxing in Malayalam | ഐഫോൺ 13 പ്രൊ മാക്സ്  | Shameer&#39;s Tech",
    "Apple's latest iPhone 13 Pro Max Unboxing in Malayalam, Shameer's Tech Channel, Unboxing Dude, iPhone 13 Pro Max ..."
  ],
  [
    "J&#39;ai acheté les iPhone 13, 13 Pro, Max et mini ! (Apple je te pardonne)",
    "Unboxing iPhone 13, mini, 13 pro et pro max en français ! ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les protections RhinoShield ..."
  ],
  [
    "iPhone 13 Pro CINEMATIC MODE review… THIS IS INSANE!",
    "BUY MY CINEMATIC MODE PRESETS HERE NOW: Yosemite Series - https://bryanadamc.gumroad.com/l/yosemite Light ..."
  ],
  [
    "iPhone 13 pro max #shorts #short #viral #shortvideo",
    ""
  ],
  [
    "iPhone 14 Pro vs. iPhone 13 Pro // Worth Upgrading? Nah",
    "To join our new $27 Starter Course: https://www.fulltimefilmmaker.com/startercourse27kaj?sl=ytdescription To Join Full Time ..."
  ],
  [
    "iPhone 13 &amp; 13 Pro HIDDEN Features, Tips and Tricks!",
    "Learn to build your very own Smart Home with my new course! - https://course.uravgmedia.com/enroll/ Here are some must know ..."
  ],
  [
    "Android vs iPhone - Which is ACTUALLY Better? (ft MKBHD)",
    "Android vs iPhone in 2022 - Who's doing it better? Obviously a controversial topic, but hope you find this useful! Hats off to ..."
  ],
  [
    "iPhone 13 - 22 Tips &amp; Tricks for 2022- Secret settings &amp; Hidden Features 🤫",
    "If you're looking for list of the best iPhone 13 tips and tricks for 2022. This video is a compilations some of the best secret settings ..."
  ],
  [
    "Xiaomi Redmi Note 11 Pro vs iPhone 13 Pro max | SpeedTest and Camera comparison",
    "comparemobile #redminote11pro #iphone13promax Samsung Galaxy A03s https://amzn.to/3qiglCO Samsung Galaxy S21 FE ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max vs 12 Pro Max vs 11 Pro Max vs 13 Pro vs 13 Battery Life DRAIN Test🪫",
    "iPhone 14 Pro Max vs 13 Pro Max vs 12 Pro Max vs 11 Pro Max vs 13 Pro vs 13 Battery Life DRAIN Test After iOS 16.1.1 today we ..."
  ],
  [
    "iPong 13 Pro Max #shorts #fyp #viral",
    "shorts #fyp #viral #comedy #foryoupage #foryourpage #china #chinalore #lore #lorememe #soccer #iphone #iphone13 ..."
  ],
  [
    "iPhone 13 or iPhone 12 Pro Max - Which is Better",
    "iPhone 13 or iPhone 12 Pro Max? Apple iPhone 13 and Apple iPhone 12 Pro Max are very close in the current marketplace in ..."
  ],
  [
    "iPhone 14 pro vs iPhone 13 pro : qui choisir ?",
    "Duel de champions avec l'iPhone 13 pro vs l'iPhone 14 pro ! ▭▭▭▭▭▭▭▭▭▭▭ ACHETER ▭▭▭▭▭▭▭▭▭▭▭ iPhone ..."
  ],
  [
    "iPhone 13 Ultimate Guide + Hidden Features and Top Tips! (2022)",
    "iPhone 13 Midnight (US) - https://amzn.to/3dYnKRw iPhone 13 Midnight (UK) - https://amzn.to/3E4nhIb iPhone 13 Ultimate Guide ..."
  ],
  [
    "เพิ่มความจุ iPhone 13 Pro Max 128GB - 1TB งานนี้ใช้ยาวๆ #houkandbank #reels #shots #ซ่อมiphone",
    ""
  ],
  [
    "Beggar Buying IPHONE 13 PRO MAX Prank - Rich Beggar @MastiPrankTvOfficial",
    "Rich Beggar Buying IPHONE 13 PRO MAX With Real Money Got Some EPIC Reactions! Watch."
  ],
  [
    "iPhone 14 Pro Max vs 13 &amp; 12 Pro Max - Ultimate Camera Comparison",
    "Want Microsoft Office for Mac? Check out SoftwareKeep ➡ https://geni.us/SoftwareKeep Don't forget to use the promo code ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 13 Pro - Full comparison",
    "Get 50% off the regular Setapp pricing as a studient or teacher! https://setapp.sjv.io/c/3468461/389689/5114 Today I will compare ..."
  ],
  [
    "iPhone 14 Pro Max vs.  Pixel 7 Pro - Which Phone is Better??",
    "This is a review of the iPhone 14 Pro Max vs. the Google Pixel 7 Pro. In this review, I compare the new iPhone 14 Pro Max and the ..."
  ],
  [
    "iPhone 13 Pro Max Silver - Unboxing and Impressions",
    "Today I'm unboxing an iPhone 13 Pro Max Silver (White) 256GB in a London Apple Store. Apple Watch SE specs and features ..."
  ],
  [
    "vivo X80 Pro vs Samsung S22 ultra vs iPhone 13 pro max - Best camera Phone 2022 !!",
    "Hello!! Today in this video I am sharing my opinion about vivo x80 pro vs iPhone 13 pro max vs Samsung S22 ultra camera."
  ],
  [
    "सिर्फ़ 999/- Iphone 14 pro max 89990/- 14 pro 79900/- Cash O Phone | Second hand iphone",
    "shop name CASH O PHONE 10 steps from gate no. 3 tilak nagar metro station , 58/27, ashok nagar, Tilak Nagar ,new delhi ..."
  ],
  [
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch &amp; AirPods Jama Masjid Market",
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch & AirPods Jama Masjid Market Timing : Sunday Early Morning 6:00 AM TO 11 ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing",
    "iPhone 13 Pro Max Unboxing:- https://youtu.be/TdG91tMAKh0."
  ],
  [
    "Apple iPhone 14 Pro Max in ₹10,000🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai iPhone 14 Pro Max ke baare mein jaha pe maine isi ke ek clone ki ..."
  ],
  [
    "IPHONE 13 PRO MAX - NAINLOVE AKO DITO!",
    "The Iphone 13 Pro Max is the best Iphone you can buy today. The Iphone 13 Pro Max has 50% more performance, Has better ..."
  ],
  [
    "I gift iPhone 13 pro max to @Zalmigaming",
    "Do follow me on insta https://www.instagram.com/little_zalmi/ And Don't forget 1v3 Zalmi Gaming ..."
  ],
  [
    "A Guided Tour of iPhone 14 &amp; iPhone 14 Pro | Apple",
    "Find a new iPhone 14 that's right for you. We've headed to the Big Apple to tell you all the big news about iPhone 14, iPhone 14 ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max SPEED TEST in 2023 - iOS 16.2 UPDATED!",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Speed Test in 2023 - Which Should i Buy in 2023 ? today we are about to iPhone 14 ..."
  ],
  [
    "iPhone 13 Pro Max Graphite (128GB)  📦 aesthetic unboxing + accessories &amp; camera test | ASMR ☁️",
    "iPhone 13 Pro Max Graphite (128GB) aesthetic unboxing + accessories & camera test | ASMR ☁️ ♡ ☽˚, ✧ * ･ ⁺ ﾟ ✧ á ..."
  ],
  [
    "Photographer Uses iPhone 13 Pro Max For The First Time",
    "Photographer Uses iPhone 13 Pro Max For The First Time Support my Friends: Khush: ..."
  ],
  [
    "Used Iphone 14 Pro Prices In Dubai | Iphone 14&#39;13&#39;12&#39;12 all model Latest prices Drop update",
    "Used Iphone 14 Pro Prices In Dubai | Iphone 14'13'12'12 all model Latest prices Drop update ..."
  ],
  [
    "iPhone 13 Pro Max Tips And Tricks 🔥 | Hidden Features | In Hindi | TechSK |",
    "Hello guys This video about to iphone 13 pro max tips,tricks and some hidden features. What you need to know. Giveaway ..."
  ],
  [
    "iPhone 13 Pro vs S22 Ultra #shorts #MostTechy",
    "Main Channel: https://www.youtube.com/MostTechy Follow me across social media platforms for behind the scenes: Instagram: ..."
  ],
  [
    "Apple iPhone 13 PRO MAX -¿el REY DESTRONADO?-",
    "UNBOXING y TODAS las NOVEDADEs del Apple iPhone 13 PRO MAX. Aquí te contamos de primera mano qué trae de nuevo el ..."
  ],
  [
    "I invented a candy dispensing iPhone Case (iPhone 13 Pro Max!)",
    "Subscribe | http://bit.ly/UnnecessarySubscribe Candy Catapult Case™️ Feed your sweet tooth on your next call. NEW for the ..."
  ],
  [
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store",
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store #apple #iphone #applestore Business Inquiries: ..."
  ],
  [
    "Cool...!! Looking Brand New Apple iPhone 13 Pro Max at the rubbish",
    "Cool...!! Looking Brand New Apple iPhone 13 Pro Max at the rubbish #restore #restoration_phone 1. Restoring Broken Phone ..."
  ],
  [
    "iPhone 13 PRO MAX - Acel REVIEW. După un an!",
    "IPHONE #13PROMAX #DUPĂUNAN Am lansat https://gb.ro/! Aici găsești gadget-urile noastre preferate și pentru prima dată, ..."
  ],
  [
    "IPHONE 13 PRO MAX|TAMIL|IPLANET|   #iphone #iphone13promax",
    "Iphone 14 pro max video: https://youtube.com/shorts/kJSjZ0BI7Ac?feature=share Instagram ..."
  ],
  [
    "Beggar Buying iPhone 13 Pro Max Prank- Rich Beggar @BobbyButt",
    "For business enquiry bobbybutt2018@gmail.com Follow on Instagram ..."
  ],
  [
    "iPhone 14 Pro Max: Changed My Mind After 4 Days...",
    "Apple on Friday released the new iPhone 14 models, and I picked one up on launch day. I have been using the iPhone 14 Pro ..."
  ],
  [
    "iPhone 13 Pro Max | Review en español",
    "https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ https://facebook.com/isaias.marcial ..."
  ],
  [
    "iPhone 13 Pro Max Review: 6 Months Later!",
    "The iPhone 13 Pro Max is the best iPhone of 2022, 6 months later The iPhone 13 Pro Max still has power, speed, a great display, ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Sparkling Water FREEZE Test! What&#39;s Gonna Happen?!",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra sparkling water freeze test! Drop these in freeze temps to test durability."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max vs iPhone 12 Pro Max vs iPhone 11 Pro Max SPEED TEST🔥| OMG 😱",
    "iPhone 14 Pro Max vs 13 Pro Max vs 12 Pro Max vs 11 Pro Max SPEED TEST, PUBG TEST, FREE FIRE TEST & 4K Video ..."
  ],
  [
    "iPhone 13 Pro Max - The Real VS. Fake - They Have Changed A Lot!",
    "Please subscribe for more! Today in this video we are comparing the fake iPhone 13 Pro Max with the real one. They have ..."
  ],
  [
    "Oops...! Found a lots of Apple iPhone 13 in the rubbish",
    "Oops...! Found a lots of Apple iPhone 13 in the rubbish #iphone_13 #restoration Welcome to the Galaxy Restore Official Channel."
  ],
  [
    "iPhone 13 Pro Max vs XS Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW XS Max (amazon) https://amzn.to/3lC58eK Let's Connect: ..."
  ],
  [
    "Xiaomi 12 Pro vs iPhone 13 Pro Max vs Mi 11 Ultra CAMERA TEST",
    "Here's my Xiaomi 12 Pro vs iPhone 13 Pro Max vs Mi 11 Ultra CAMERA TEST! Will Xiaomi's new 12 Pro compete next to the ..."
  ],
  [
    "Best Camera for Portrait/Cinematic | Vivo X80 Pro | iPhone 13 pro Max | Samsung S22 Ultra",
    "Best Portrait video mode camera test Samsung S22 Ultra | Vivo x80 pro | iPhone13 Pro Max ka Review aa chuka hai . Zoom Battle ..."
  ],
  [
    "Oops...! Found a lots of Apple iPhone 13 in the rubbish",
    "Oops...! Found a lots of Apple iPhone 13 in the rubbish #iphone_13 #restoration Welcome to the Galaxy Restore Official Channel."
  ],
  [
    "iPhone 13 Pro Max vs. Xiaomi 12 Pro Charging Test 🔌 Subscribe for more 🫡",
    ""
  ],
  [
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch &amp; AirPods Jama Masjid Market",
    "Chor Bazaar Dehli IPhone 14 Pro Max Apple Watch & AirPods Jama Masjid Market Timing : Sunday Early Morning 6:00 AM TO 11 ..."
  ],
  [
    "iPhone 13 Pro Max vs XS Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW XS Max (amazon) https://amzn.to/3lC58eK Let's Connect: ..."
  ],
  [
    "iPhone 13 Pro First Impression",
    ""
  ],
  [
    "QnA 181 | iPhone 13 Pro Max vs Samsung S22 Ultra, iPhone 12 vs S21 FE",
    "Win New Samsung S22 or iPhone 13! Hurry up to Join Smartphone Giveaway: https://bit.ly/3oGZj0P Do you have any other videos ..."
  ],
  [
    "Beggar Buying IPHONE 13 PRO MAX Prank - Rich Beggar @MastiPrankTvOfficial",
    "Rich Beggar Buying IPHONE 13 PRO MAX With Real Money Got Some EPIC Reactions! Watch."
  ],
  [
    "38 KILLS!!😱 iPhone 13 Pro Max EXPERT | BGMI (4K Ultra HDR Graphics)🔥👋🏻 | Handcam Gameplay #5",
    "38 KILLS!!   iPhone 13 Pro Max PUBG MOBILE/BGMI Hit that like button and Subscribe if you liked the video! Played on: Iphone ..."
  ],
  [
    "iPhone 14 Plus vs 13 Pro Max - SPEED TEST",
    "iPhone 13 Pro Max (amazon) https://amzn.to/3gOb0lx iPhone 14 Plus (amazon) https://amzn.to/3uaV5Rp Let's Connect: ..."
  ],
  [
    "May iPhone pero walang IPON! | Unboxing My iPhone 13 pro max! | Sai Datinguinoo",
    "Hii BeYOUtifuls! Hope y'all are doing great!   THANK YOU FOR ALL THE LOVE!   Here's the link of ISSEL Gadgets Cash and ..."
  ],
  [
    "iPhone 14 Pro Max vs.  Pixel 7 Pro - Which Phone is Better??",
    "This is a review of the iPhone 14 Pro Max vs. the Google Pixel 7 Pro. In this review, I compare the new iPhone 14 Pro Max and the ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Unboxing and Camera Test: 48MP!",
    "This is what you have been waiting for! The iPhone 13 Pro Max vs iPhone 14 Pro Max Camera Test Comparison! I also compared ..."
  ],
  [
    "A Real Day In The Life With iPhone 13 Pro Max (Battery Life Test Review)",
    "New Spline Wallpapers: https://shevonsalmon.gumroad.com/l/splinepack Today we will be putting the iPhone 13 Pro max through ..."
  ],
  [
    "Buying iPhone 13 PRO MAX With Coins Prank @ThatWasCrazy",
    "I CAN'T BELIEVE THEY ACCEPTED THE COINS !!! Got Some EPIC Reactions! Watch... :) Hope you enjoyed the video, if yes?"
  ],
  [
    "iPhone 14 Plus vs iPhone 13 Pro Max - Not So Simple.",
    "Tech enthusiasts tend to believe that the iPhone 14 Plus is a horrible deal, and that the iPhone 13 Pro Max is clearly the better ..."
  ],
  [
    "Please buy THIS instead of iPhone 14 in 2022...",
    "In this video, I will tell you which iPhone to buy in 2022 after the release of a new smartphone from Apple, the iPhone 14! Many are ..."
  ],
  [
    "IPHONE 13 PRO MAX 120 HZ ( 4K ) HDR Extreme Montage | Lost Boy",
    "iphone13pro #bgmi #lostboy INSTAGRAM LINK: https://opener.one/instagram/wurm40 Controls & Sensitivity uploaded on ..."
  ],
  [
    "iPhone 14, iPhone 14 Pro Max Unboxing &amp; First Impressions⚡Dynamic Island Madness 🏝️",
    "Doston Saal Ka Wo Din Aa Gaya Hain Jab Hum Unbox Karte Hain All New iPhones Ko, Aaj ke Video Me Hum Unbox Kar Rahe ..."
  ],
  [
    "iPHONE 13 PRO MAX VS $5000 CAMERA #shorts #iphone13 #photography",
    ""
  ],
  [
    "iPhone 13 Unboxing &amp; First Look - The Fresh iPhone Experience - Surprise🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai Apple ke latest iPhone 13 family ke baare mein jaha pe hai latest ..."
  ],
  [
    "iPhone 14 Pro Review: This Will Be Copied!",
    "iPhone 14 Pro and iPhone 14 Pro Max have 3 main new things. My honest thoughts! New Chevron Hoodie! http://shop."
  ],
  [
    "iPhone 14 Pro Max: Changed My Mind After 4 Days...",
    "Apple on Friday released the new iPhone 14 models, and I picked one up on launch day. I have been using the iPhone 14 Pro ..."
  ],
  [
    "SHE PAID $700 FOR FAKE IPHONE 13 PRO MAX 😢 #shorts #fake #iphone13promax #apple #iphone #ios",
    "MONEYTALKSWIRELESS Tik Tok : https://www.tiktok.com/@moneytalkswireless Instagram ..."
  ],
  [
    "iPhone 13 (Pro) The 20 Most Useful Hidden Features &amp; Tricks",
    "Here are the 20 most useful but little known features & tricks for the iPhone 13 & iPhone 13 Pro & Pro MAX. MUSIC IN THIS ..."
  ],
  [
    "FAKE iPhone 13 PRO MAX.... Weird Wallpapers On Here😳",
    "I bought a fake iPhone 13 Pro Max to compare it to a real one... let's just say I am not impressed. Thank you for watching! Second ..."
  ],
  [
    "₹89,500/- iPhone 13 pro max 256GB Silver condition :- 100% battery:- 98% full kit BiLL 📞6353987869",
    ""
  ],
  [
    "iPhone 13 Pro Max Tips And Tricks 🔥 | Hidden Features | In Hindi | TechSK |",
    "Hello guys This video about to iphone 13 pro max tips,tricks and some hidden features. What you need to know. Giveaway ..."
  ],
  [
    "Apple iPhone 13 PRO MAX -¿el REY DESTRONADO?-",
    "UNBOXING y TODAS las NOVEDADEs del Apple iPhone 13 PRO MAX. Aquí te contamos de primera mano qué trae de nuevo el ..."
  ],
  [
    "Fake iPhone 13 Pro Max! Can You Spot The Difference?",
    "I bought a fake iPhone 13 Pro Max for the sole purpose of comparing it along side a real iPhone 13 Pro Max. Can you tell the ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Speed Test🔥A15 vs A16 Bionic⚡️SHOCKING!😨 (HINDI)",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Speed Test   SHOCKING!   (HINDI) This is Speed Test, Multitasking and Video ..."
  ],
  [
    "How To Use Your iPhone 13 Pro / 13 Pro Max! (Complete Beginners Guide)",
    "GET SUPER CHEAP PHONES HERE: https://cheapphones.co GET AWESOME WALLPAPERS HERE: ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 &amp; 12 Pro Max - Ultimate Camera Comparison",
    "Want Microsoft Office for Mac? Check out SoftwareKeep ➡ https://geni.us/SoftwareKeep Don't forget to use the promo code ..."
  ],
  [
    "Cool...!! Looking Brand New Apple iPhone 13 Pro Max at the rubbish",
    "Cool...!! Looking Brand New Apple iPhone 13 Pro Max at the rubbish #restore #restoration_phone 1. Restoring Broken Phone ..."
  ],
  [
    "የ105ሺ ብር ስልክ ...|| iphone 13 pro max review/unboxing.",
    "iphone13 #iphone13promax #ethiopia This is my full Review of the Iphone 13 pro max. My tiktok ..."
  ],
  [
    "Why Apple is ending the iPhone in 2023",
    "Shop TORRAS Guardian case: https://bit.ly/3G0hPuh Shop TORRAS Diamond case: https://amzn.to/3j3eDEN Shop TORRAS ..."
  ],
  [
    " IPhone 13 Pro 256 Gb Second Hand Price",
    ""
  ],
  [
    "iPhone 13 Pro Max Review: 6 Months Later!",
    "The iPhone 13 Pro Max is the best iPhone of 2022, 6 months later The iPhone 13 Pro Max still has power, speed, a great display, ..."
  ],
  [
    "iPhone 13 Pro Max - The Real VS. Fake - They Have Changed A Lot!",
    "Please subscribe for more! Today in this video we are comparing the fake iPhone 13 Pro Max with the real one. They have ..."
  ],
  [
    "Shredding Apple Iphone Pro Max 13 And Toys ASMR Satisfying",
    "Today we are add to the test in our big shredding machine the brand new Apple product iphone pro max 13. Also we drop in the ..."
  ],
  [
    "Galaxy S22 Ultra vs. iPhone 13 Pro Max Speed Test",
    "Speed test between the Samsung Galaxy S22 Ultra and the Apple iPhone 13 Pro Max to see how the performance compares on ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing: Sierra Blue!",
    "iPhone 13 Pro Max new sierra blue unboxing & review. My 2nd Channel - https://goo.gl/vJCYna Sister's Channel ..."
  ],
  [
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store",
    "iPhone is SHATTERED! New iPhone UPGRADE Shopping at the Apple Store #apple #iphone #applestore Business Inquiries: ..."
  ],
  [
    "How To Setup The iPhone 13 Pro Max Tutorial - How To Setup A New iPhone",
    "This is the how to setup the iPhone 13 Pro Max tutorial. You will learn how to setup a new iPhone as a new iPhone user or by ..."
  ],
  [
    "Best Camera for Portrait/Cinematic | Vivo X80 Pro | iPhone 13 pro Max | Samsung S22 Ultra",
    "Best Portrait video mode camera test Samsung S22 Ultra | Vivo x80 pro | iPhone13 Pro Max ka Review aa chuka hai . Zoom Battle ..."
  ],
  [
    "Asus ROG Phone 6 Pro Vs Samsung Galaxy S22 Ultra 5G Vs Apple iPhone 13 Pro Max",
    "ROG Phone 6 Pro vs iPhone 13 Pro Max vs Galaxy S22 Ultra | Full Comparison Could iPhone and Samsung beat Asus ROG ..."
  ],
  [
    "Iphone Sale सिर्फ़ 999/- 14 Pro On Emi X 13499/- Xr 14999/- 12 pro max 40499/-Second hand iphone",
    "Shop name The iPhone booth Address Lakshmi bajar near petrol pump Madan puri shop no 5 Call : 9971591519 Sameer Ahuja ..."
  ],
  [
    "iPhone 14 Pro vs 13 Pro: Real-World Differences After 1 Week!",
    "Was it REALLY Worth Upgrading to the iPhone 14 Pro? 20% OFF!!! (10% off Code ESR001US & extra 10% coupon) ESR ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; First Look - The Dynamic Island Magic🔥🔥🔥",
    "Namaskar Dosto, aaj intezaar ki ghadi khatam ho chuki hai kyuki iss video mein maine share kiya hai unboxing aur ek first ..."
  ],
  [
    "IPhone 13 Pro Max bigg price drop #iphone13pro #iphone13promax#iphone13#iphone13mini#offer#pricedrop",
    ""
  ],
  [
    "Tips and Tricks Of iPhone 13 Pro Max In Hindi| Hidden Features | #Short 🔥Part-2 |TechSK",
    "Hello guys This video about to iphone 13 pro max tips,tricks and some hidden features. What you need to know. Giveaway ..."
  ],
  [
    "iPong 13 Pro Max #shorts #fyp #viral",
    "shorts #fyp #viral #comedy #foryoupage #foryourpage #china #chinalore #lore #lorememe #soccer #iphone #iphone13 ..."
  ],
  [
    "I invented a candy dispensing iPhone Case (iPhone 13 Pro Max!)",
    "Subscribe | http://bit.ly/UnnecessarySubscribe Candy Catapult Case™️ Feed your sweet tooth on your next call. NEW for the ..."
  ],
  [
    "iPhone 13দাম কমলো পানির দামে কিনতে পারবেন  iPhone 13 Pro Max high super master copy KK concept",
    "Low Budget iPhone 13 Pro Max high super master copy KK concept Bangla unboxing and review. Callnow:01309-951925."
  ],
  [
    "เพิ่มความจุ iPhone 13 Pro Max 128GB - 1TB งานนี้ใช้ยาวๆ #houkandbank #reels #shots #ซ่อมiphone",
    ""
  ],
  [
    "iPhone 13 Pro Max Sierra Blue (256GB) ☁️ Unboxing + accessories ☁️ | ASMR",
    "For better quality, watch in HD :) Join me as I unbox my iPhone 13 Pro Max in Sierra Blue (256GB) + accessories. Enjoy!"
  ],
  [
    "FAKE iPhone 13 PRO MAX.... Weird Wallpapers On Here😳",
    "I bought a fake iPhone 13 Pro Max to compare it to a real one... let's just say I am not impressed. Thank you for watching! Second ..."
  ],
  [
    "iPhone 14 pro vs iPhone 13 pro #shorts #iphone #iphone14pro #iphone13pro #comparison #apple",
    ""
  ],
  [
    "Apple iphone 13 Series Unboxing &amp; initial Impressions || in Telugu",
    "Support me :) (Everytime you buy using the below links I get a small commission which will help me make more Product Reviews ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing &amp; Review (Malayalam)",
    "Hi there! New to Tech Geekz ? If so, here's what you need to know -- I like Unboxing & Reviews a LOT, so I use this channel to ..."
  ],
  [
    "iPhone 13 Pro Max vs 12 Pro Max vs 11 Pro Max Battery Life DRAIN Test",
    "Twitter: https://twitter.com/UltimateiDevice Instagram: https://www.instagram.com/ultimateidevicevids/ Facebook: ..."
  ],
  [
    "iPhone 13 Unboxing - Real VS Fake - Comparison",
    "iPhone 13 Unboxing - Real VS Fake - Comparison."
  ],
  [
    "Buying Most Expensive Gift for Papa NEW IPHONE 13 PRO Shopping 1.5 Lakh Rupees Alone | Bindass Kavya",
    "Aaj akele 1.5 lakhs Rs ki shopping ki Papa Ke liye New Iphone Buy kiya kya papa ko gift pasand ayega ya papa Gussa honge?"
  ],
  [
    "iPhone 13 (Pro) The 20 Most Useful Hidden Features &amp; Tricks",
    "Here are the 20 most useful but little known features & tricks for the iPhone 13 & iPhone 13 Pro & Pro MAX. MUSIC IN THIS ..."
  ],
  [
    "IPHONE 13 PRO MAX|TAMIL|IPLANET|   #iphone #iphone13promax",
    "Iphone 14 pro max video: https://youtube.com/shorts/kJSjZ0BI7Ac?feature=share Instagram ..."
  ],
  [
    "Beggar With IPhone 13 Pro Max &amp; MacBook Pro @ThatWasCrazy",
    "Rich Beggar With IPHONE 13 Pro Max & MacBook Pro 16\" Got Some EPIC Reactions! Watch... :) Hope you enjoyed the video, ..."
  ],
  [
    "iPhone 13 Pro &amp; Pro Max: Top Features &amp; Changes!",
    "This video covers the top features of the new iPhone 13 Pro and Pro Max! iPhone 13 Pro: https://amzn.to/3zIHGQE iPhone 13 Pro ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing",
    "iPhone 13 Pro Max Unboxing:- https://youtu.be/TdG91tMAKh0."
  ],
  [
    "iPhone 13 Pro vs S22 Ultra #shorts #MostTechy",
    "Main Channel: https://www.youtube.com/MostTechy Follow me across social media platforms for behind the scenes: Instagram: ..."
  ],
  [
    "iPhone 13 vs iPhone 13 Pro - Which Should You Choose?",
    "iPhone 13 Pro and iPhone have some differences, but also have a lot more similarities than anything else. I go over what is ..."
  ],
  [
    "iPhone 12 Pro Max vs 13 Pro Max in Sri Lanka - සිංහලෙන්",
    "iPhone 12 pro max and 13 pro max are almost identical and we can those 2 are twins for sure. Unless if you choose the hero ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max vs Galaxy S22 Ultra! Camera Comparison Test! | VERSUS",
    "Sony is back once again, looking to leave a mark with the Xperia 1 IV - with better point-and-click opportunities for casual users."
  ],
  [
    "Iphone13 Pro Unboxing and Initial Impressions | I Bought My First ever Iphone Vlog | TFV Lifestyle",
    "Follow me on instagram for outfit inspirations : https://www.instagram.com/b.v.s.ganesh/?hl=en let's video call and interact instantly ..."
  ],
  [
    "Beggar Buying IPHONE 13 PRO MAX Prank - Rich Beggar @ThatWasCrazy",
    "Rich Beggar Buying IPHONE 13 PRO MAX With Real Money Got Some EPIC Reactions! Watch... :) Download Uplive-Live App: ..."
  ],
  [
    "iPhone 13 Pro Max, Mas Better sa iPhone 14 Pro series?",
    "Worth it ba mag-upgrade from iPhone 13 Pro Max to any iPhone 14 Pro series? Sa tingin ko hindi. Bakit? Pag-usapan natin sa ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "iPhone 13 Unboxing &amp; First Look - The Fresh iPhone Experience - Surprise🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai Apple ke latest iPhone 13 family ke baare mein jaha pe hai latest ..."
  ],
  [
    "Iphone Sale सिर्फ़ 999/- 14 Pro On Emi X 13499/- Xr 14999/- 12 pro max 40499/-Second hand iphone",
    "Shop name The iPhone booth Address Lakshmi bajar near petrol pump Madan puri shop no 5 Call : 9971591519 Sameer Ahuja ..."
  ],
  [
    "This iPhone got MUCH better after iPhone 14 release...",
    "Get 50% off the regular Setapp pricing as a studient or teacher! https://setapp.sjv.io/c/3468461/389689/5114 Should I buy a new ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max Speed Test, Speakers, Battery &amp; Camera Test!",
    "Sony Xperia 1 IV (1 Mark 4) vs iPhone 13 Pro Max Speed Test, Speakers Test, Battery Life & Camera Test! Xperia 1 IV Amazon ..."
  ],
  [
    "iPhone 13 Pro Max - How to Insert and Set Up Dual SIM cards | Howtechs",
    "This video shows how to insert, remove and set up the DUAL PHYSICAL SIM cards on an iPhone 13 Pro Max (same as iPhone 13 ..."
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max - Is this a joke!?🏝️",
    "iPhone 14 Pro Max vs 13 - NOT what you expected! The Apple iPhone 14 Pro Max, iPhone 14 and 14 Plus have been the talk ..."
  ],
  [
    "iPhone 13 Pro Max - La MEJOR COMPRA que Puedes HACER ✅ Review COMPLETO",
    "Esta es mi experiencia con el iPhone 13 Pro Max, analizando si después de la salida del iPhone 14, sigue valiendo la pena ..."
  ],
  [
    "TELEFON NARXLARI 2022-YIL ( IPHONE 13 PRO MAX ) SAMSUNG NARXLARI /",
    "HouseMobile instagram kanali https://instagram.com/housemobile.uz?utm_medium=copy_link HouseMobile telegram kanalda ..."
  ],
  [
    "100X killer Zoom Phone😍  - iPhone 13 Pro Max vs Galaxy S22 Ultra Zoom Test",
    "Detailed Comparison: https://youtu.be/j_maGRIAzLE Hey, Guys, This is the Zoom Test between Samsung Galaxy S22 Ultra and ..."
  ],
  [
    "PRO TIKTOKER CHALLENGED ME | IPHONE 13 PRO MAX VS IPHONE 13 PRO MAX 1 VS 1 PUBG HANDCAM",
    "mythic fashion tiktoker vs pubg mobile partner youtuber friendly 1 vs 1 tdm challenge. Thanks for watching this video and don't ..."
  ],
  [
    "iPhone 13 PRO MAX &amp; 13 PRO Alpine Green Colour in DUBAI | UNBOXING",
    "Hello friends aaj ke iss video mein hum dikhayenge aap ko latest IPHONE 13 PRO MAX & 13 PRO Alpine Green colour in DUBAI ..."
  ],
  [
    "تغير باغه iPhone 13 pro max #طبيب_المحمول",
    ""
  ],
  [
    "Galaxy S22 Ultra vs. iPhone 13 Pro Max Speed Test",
    "Speed test between the Samsung Galaxy S22 Ultra and the Apple iPhone 13 Pro Max to see how the performance compares on ..."
  ],
  [
    "My Great Lucky🤤...!! i found New Apple iPhone 14 Pro Max and a lot of iPhone in the landfill",
    "My Great Lucky  ...!! i found New Apple iPhone 14 Pro Max and a lot of iPhone in the landfill #iphone14 #restoration 1."
  ],
  [
    "10 MUST HAVE iPhone 13 Accessories!",
    "Learn to build your very own Smart Home with my new course! - https://course.uravgmedia.com/enroll/ Looking for the best iPhone ..."
  ],
  [
    "Why iPhone 13 Pro Max Is Not Available | In Indian Market 🇮🇳...?",
    "Helle guys in this video discuss about why not available iphone 13 pro max stock, when be in stock, why sierra blue colour is not ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA TEST!",
    "Camera Test comparison of Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - including microphone, night mode, ..."
  ],
  [
    "✨✨ Unboxing iPhone 13 Pro Max + accessories | Philippines  | 2022 ✨✨",
    "Unboxing iPhone 13 pro max in sierra blue from powermac store."
  ],
  [
    "iPhone Price Update 2022, iPhone 13 Pro Max, 13 Pro, 13 mini, 11, iPad Pro, iPad mini, Macbook Pro",
    "diskartengpinoytayo #iphone #ipadmini5 #iphone13promax #iphone13mini MacBook Air Price: 54990 - 256gb Price: 68990 ..."
  ],
  [
    "iPhone 13 Pro Max Alpine Green Shopping Vlog (Apple Store)",
    "iPhone 13 Pro Max Alpine Green Shopping Vlog (Apple Store) #apple #iPhone #iphone13promax WATCH HER NOSE ..."
  ],
  [
    "Unboxing iPhone 13 Pro Max #Shorts",
    "Unboxing iPhone 13 Pro Max #iphone13promax #unboxing #Shorts."
  ],
  [
    "7 SURPRISING Hidden iPhone Features 2022 in hindi ⚡️YOU MUST TRY!! ⚡️",
    "Latest iPhone Hidden Features for iPhone 13, iPhone 12, iPhone 11, iPhone X, iPhone SE with iOS 15.4 UPDATE 1. Text Shortcut ..."
  ],
  [
    "iPhone 13 vs iPhone 13 Pro Max Hindi",
    "Kya Aap ko iPhone 13 Buy Karna Chahiye in India ? | why I'm buying iPhone 13 in India Hi guys in this video I'm gonna tell you ..."
  ],
  [
    "March 2022, New Update iCloud Unlock with Passcode iPhone 13 Pro Max || any iOS Support✅",
    "March 2022, New Update iCloud Unlock with Passcode iPhone 13 Pro Max || any iOS Support Without Apple ID Works All Models ..."
  ],
  [
    "iPhone 13 Ultimate Guide + Hidden Features and Top Tips! (2022)",
    "iPhone 13 Midnight (US) - https://amzn.to/3dYnKRw iPhone 13 Midnight (UK) - https://amzn.to/3E4nhIb iPhone 13 Ultimate Guide ..."
  ],
  [
    "iPhone 13 Pro » iPhone 14 Pro Max",
    "waow island — Links Twitter ~ https://twitter.com/aznguymp4/ Instagram ~ https://instagram.com/aznguymp4/ Second Channel ..."
  ],
  [
    "¡NO TE EQUIVOQUES! Galaxy S22 Ultra vs iPhone 13 Pro Max",
    "Recuerda usar el código Rhinoshield de 20% \"TOPES22\" : https://bit.ly/TOPES22 ✔️✔️Compra los terminales desde aquí: ..."
  ],
  [
    "iphone 6 convert iphone 13 pro max mini - wrapping cell phone in foil - wrapping paper",
    "iphone 6 convert iphone 13 pro max mini - wrapping cell phone in foil - wrapping paper."
  ],
  [
    "what’s on my iphone 13 pro max",
    "here is one of my highly requested videos to film... WHATS ON MY IPHONE 13 PRO MAX   hope u enjoy! lmk what other videos u ..."
  ],
  [
    "iPhone 14 Plus vs 14 Pro Max - NOT What We Expected..!",
    "Download Magic Lasso Adblock for FREE! ➡ https://www.magiclasso.co/maxtech Is the iPhone 14 Plus Worth it? Or Spend More ..."
  ],
  [
    "iPhone 14 vs iPhone 13 - Every Single Difference REVEALED!",
    "Download the must-have App PDFelement for free: https://apps.apple.com/app/apple-store/id1516765045 **Download ..."
  ],
  [
    "Apple&#39;s iPhone 14 Pro and 14 Pro Max in under 6 minutes",
    "Apple unveiled the iPhone 14 Pro at its 'Far Out' event on September 7, 2022. The flagship handset ditches the notch, and in its ..."
  ],
  [
    "CHEGOU! iPhone 13 Pro Max de 1TB, o SMARTPHONE MAIS CARO DO BRASIL! Unboxing e Impressões",
    "Finalmente chegou aqui no canal o iPhone 13 Pro Max de 1TB de armazenamento! Eu acho que dessa vez eu exagerei um ..."
  ],
  [
    "TOANG THẬT RỒI: đến lượt iPhone 14 Pro Max lỗi màn hình y hệt như iPhone 13 Pro Max",
    "TOANG THẬT RỒI: đến lượt iPhone 14 Pro Max lỗi màn hình y hệt như iPhone 13 Pro Max ▻ Mua ngay iPhone 14 Pro Max hàng ..."
  ],
  [
    "iPhone 13 vs iPhone 13 Pro Max Hindi",
    "Kya Aap ko iPhone 13 Buy Karna Chahiye in India ? | why I'm buying iPhone 13 in India Hi guys in this video I'm gonna tell you ..."
  ],
  [
    "Free iPhone 13 Pro Max Flipkart 2022 | Order Free iPhone From Flipkart | iPhone Free Me Kaise le",
    "freeiphone #freeiphone13promax #iphonefree #offertableofficial #theshoppingtable Title ::- Free iPhone 13 Pro Max Flipkart 2022 ..."
  ],
  [
    "Apple iPhone 13 Pro Max Unboxing in Malayalam | ഐഫോൺ 13 പ്രൊ മാക്സ്  | Shameer&#39;s Tech",
    "Apple's latest iPhone 13 Pro Max Unboxing in Malayalam, Shameer's Tech Channel, Unboxing Dude, iPhone 13 Pro Max ..."
  ],
  [
    "iPhone 13 Pro y Pro Max | Review en Español",
    "Los nuevos iPhone 13 Pro y Pro Max tienen un sistema de cámaras avanzado, más batería y una mejor pantalla. Te lo cuento en ..."
  ],
  [
    "iPhone 13 Pro Max Alpine Green Unboxing🌵 aesthetic setup | Magsafe accessories | genshin",
    "Hello my friend~   In this video I am going to unbox iPhone 13 pro max and lots of accessories Hope you enjoy this video I ..."
  ],
  [
    "iPhone 13 Pro Max Indian Retail Unit - Unboxing in 4K 🔥🔥🔥",
    "techiebeez --~-- iPhone 13 Pro Max Unboxing In this video I will unbox the iPhone 13 Pro Max in Gold My Youtube Gear List ..."
  ],
  [
    "How To Restore and Upgrade iPhone XS Max into a Brand New iPhone 13 Pro Max",
    "How To Restore and Upgrade iPhone XS Max into a Brand New iPhone 13 Pro Max DIY Housing: https://bit.ly/3nDs4uA Top 5 ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max vs Galaxy S22 Ultra! Camera Comparison Test! | VERSUS",
    "Sony is back once again, looking to leave a mark with the Xperia 1 IV - with better point-and-click opportunities for casual users."
  ],
  [
    "iPhone 13/13 Pro/13 mini/13 Pro Max: How to Turn Off, Force Restart, Recovery Mode, DFU Mode",
    "In this video I will show you how to force restart your iPhone 13, how to get iPhone 13 into recovery mode, and how to get iPhone ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max Speed Test, Speakers, Battery &amp; Camera Test!",
    "Sony Xperia 1 IV (1 Mark 4) vs iPhone 13 Pro Max Speed Test, Speakers Test, Battery Life & Camera Test! Xperia 1 IV Amazon ..."
  ],
  [
    "iPhone 13 Pro - ProRes vs STANDARD vs CINEMATIC MODE",
    "Video Color Graded with https://denisbarbas.gumroad.com/l/XewYR Is the new iPhone 13 Pro - ProRes format just a hype or a ..."
  ],
  [
    "Beli iPhone 14 Pro Max atau 13 Pro Max? – Perbezaan dan Persamaan",
    "Case iPhone 13/14 https://shope.ee/8zTYTeq2ug FAIZ ZAINAL https://youtube.com/c/FAIZZAINAL​​​​ ..."
  ],
  [
    "Speedtest Xiaomi 13 Pro vs iPhone 14 Pro Max: &quot;Max&quot; ở đây là CÁCH BIỆT",
    "Tham khảo iPhone 14 Pro Max: https://hoanghamobile.com/dien-thoai-di-dong/apple-iphone-14-pro-max-128gb-chinh-hang-vn-a ..."
  ],
  [
    "Isprobali smo: iPhone 13 Pro Max",
    "Pogledajte naš fanpage: http://www.facebook.com/usporedi.hr Pratite nas na Twitteru: http://twitter.com/usporedi Pogledajte site: ..."
  ],
  [
    "iPHONE 13 PRO MAX VS $5000 CAMERA #shorts #iphone13 #photography",
    ""
  ],
  [
    "iPhone 13 vs iPhone 13 Pro - Which Should You Choose?",
    "iPhone 13 Pro and iPhone have some differences, but also have a lot more similarities than anything else. I go over what is ..."
  ],
  [
    "iPhone 14 Pro Vs iPhone 13 Pro Max! (Comparison) (Review)",
    "Get The iPhone 14 Here: https://amzn.to/3qLgoYc Get The iPhone 13 Here: https://amzn.to/39ERRv3 Get The Cheapest iPhones ..."
  ],
  [
    "The Green iPhone 13 in 59 seconds!",
    "Unboxing and first look at the Green iPhone 13 and Alpine Green 13 Pro. Shorts channel: ..."
  ],
  [
    "50 Best Tips &amp; Tricks for Apple iPhone 13 Pro Max",
    "In this video I show you the best 50 tips and tricks that you must review for your Apple iPhone 13 Pro Max. We go over all the latest ..."
  ],
  [
    "iPhone 13 Pro VS iPhone 14 Pro",
    "Quelles sont les différences entre l'iPhone 13 Pro et l'iPhone 14 Pro ? Mon Instagram : https://www.instagram.com/jbaptisten/ ..."
  ],
  [
    "Apple Event — September 7",
    "Watch the special Apple Event to learn about iPhone 14, iPhone 14 Pro, Apple Fitness+, Apple Watch Ultra, Apple Watch Series 8, ..."
  ],
  [
    "iPhone 13 Pro Max Camera 📷 test #shorts #short #iphone #iphone13promax #iphone13promaxcamera",
    "iPhone13promax #iPhone13promaxcamera #yourtechguidedk iPhoneXr vs iPhone13 Pro Max Speed test ..."
  ],
  [
    "የ105ሺ ብር ስልክ ...|| iphone 13 pro max review/unboxing.",
    "iphone13 #iphone13promax #ethiopia This is my full Review of the Iphone 13 pro max. My tiktok ..."
  ],
  [
    "Blind Girl with iPhone 13 Pro Max Prank@crazycomedy9838",
    "This Video is Just For Entertainment Permission Has Been Taken From All Peoples Shown In This Video Got Some EPIC ..."
  ],
  [
    "VLOG | getting the new iPhone 13 Pro Max | unboxing &amp; set up with me",
    "OMG the day has come for ya girl to upgrade her life! The NEW iPhone 13 Pro Max is LIT!       Phone 13 Max Pro Sierra Blue: ..."
  ],
  [
    "How to Force Turn OFF/Restart iPhone 13 Pro Max - Frozen Screen Fix",
    "Get the iPhone 13 Pro Max - https://amzn.to/3rm5nxB This is a video on how to force turn off and restart your iPhone 13 Pro Max."
  ],
  [
    "Apple iPhone 13 Pro Max price in Kuwait",
    "Here is video on Apple iPhone 13 Pro Max price in Kuwait along with specs as updated on July 2022. In Kuwait, available variants ..."
  ],
  [
    "iPhone 13 Pro Max Cinematic Stability Test",
    ""
  ],
  [
    "iPhone 13 Pro &amp; 13 Pro Max Unboxing नेपालिमा",
    "Hey everyone, this is our unboxing and impressions of the all-new iPhones for this year, the iPhone 13 Pro and iPhone 13 Pro ..."
  ],
  [
    "Samsung Galaxy S22 Ultra VS iPhone 13 Pro Max - Can Samsung Win This Battle?",
    "Samsung Galaxy S22 Ultra VS iPhone 13 Pro Max - Can Samsung Win This Battle? Thumbnail Credit: ..."
  ],
  [
    "iPhone 13 pro ₹38000 CHEAPER than Indian iPhone - E Max, Dubai - Irfan&#39;s View",
    "iphone13 #Apple #irfansview Bought the new iPhone 13 pro in Emax in dubai,i bought one for me and 12pro for my sister and my ..."
  ],
  [
    "iPhone 14 Pro VS iPhone 13 Pro, Camera King? - Irfan&#39;s View",
    "iPhone #comparison #irfansview Apple brand has announced that in iPhone 14 Pro they have brought many differences in ..."
  ],
  [
    "Iphone 13 Pro Max Durability Test #shorts #iphone14 #iphone",
    "Iphone 13 Pro Max Durability Test #shorts #iphone14 #iphone #shorts #iphone14 #iphone13 #iphone13promax #shortsfeed."
  ],
  [
    "Gifting Real iPhone 14 To Everyone in My Team 🔥 | Best Surprise Worth ₹750000",
    "Hello guys, is video me maine meri team me sab logon ko iphone 14 gift kiya hai. Our Unboxing Channel- ..."
  ],
  [
    "10 MUST HAVE iPhone 13 Accessories!",
    "Learn to build your very own Smart Home with my new course! - https://course.uravgmedia.com/enroll/ Looking for the best iPhone ..."
  ],
  [
    "Silver iPhone 13 Pro Max Unboxing! #Shorts #Apple #iphone13promax #silver",
    "Apple #iPhone13ProMax #Unboxing #Shorts #drewlipps."
  ],
  [
    "iPhone 13 &amp; 13 Pro (Max): 15 AMAZING Camera Tricks!",
    "I will show you 15 hidden but very useful Camera Tips & Tricks for the iPhone 13 & 13 Pro (Max & Mini) iPhone 13 & 13 Pro (Max) ..."
  ],
  [
    "Introducing iPhone 14 Pro | Apple",
    "What lies beyond a traditional smartphone? Let's find out. This is iPhone 14 Pro. It starts with the Dynamic Island, an interactive ..."
  ],
  [
    "King Of Premium Phones | iphone 13 Pro Max #shorts",
    ""
  ],
  [
    "Apple iPhone 13 Pro Max: Finální verdikt! - [recenze]",
    "Odebírej nás i na IG https://instagram.com/huramobil/ Sleduj nás na FB https://www.facebook.com/huramobil.cz/ Sleduj ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra | Comparativa de cámaras",
    "No te pierdas de ningún contenido: https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "Iphone 13 Pro Max #Unboxing | Nigeria",
    ""
  ],
  [
    "My Most Expensive Gold iPhone 13 Pro Max 🤯 || 30 Lakhs 🤯 Rupees || Giveaway For You",
    "LokeshGamer #gyangaming #asgaming #TotalGaming #DesiGamers #twosidegamers #OPLOKESHGAMER #totalgaming ..."
  ],
  [
    "iPhone 14 Pro vs iPhone 13 Pro - Which To Choose?",
    "iPhone 14 Pro vs iPhone 13 Pro - Which To Choose? Apple iPhone 14 Pro is Apple's latest iPhone and the iPhone 13 Pro is ..."
  ],
  [
    "History of the iPhone",
    "Watch the iPhone evolve through 14 years of development. Starting with the original iPhone in 2007, which revolutionized the ..."
  ],
  [
    "Iphone13 Pro Unboxing and Initial Impressions | I Bought My First ever Iphone Vlog | TFV Lifestyle",
    "Follow me on instagram for outfit inspirations : https://www.instagram.com/b.v.s.ganesh/?hl=en let's video call and interact instantly ..."
  ],
  [
    "how I make my iphone 13 pro max cute &amp; aesthetic 🌷✨ | iOS 15, custom phone theme &amp; accessories 💗",
    "SHOP MY sleepydaze X CASETiFY COLLECTION!! https://www.casetify.com/artist/sleepydaze Hi friends! I'm back with a new ..."
  ],
  [
    "iPhone 14 Pro Max Unboxing &amp; First Look - The Dynamic Island Magic🔥🔥🔥",
    "Namaskar Dosto, aaj intezaar ki ghadi khatam ho chuki hai kyuki iss video mein maine share kiya hai unboxing aur ek first ..."
  ],
  [
    "How to Master the Camera App on iPhone 13 Pro &amp; iPhone 13 Pro Max!",
    "The iPhone 13 Pro and iPhone 13 Pro Max is the most capable iPhone to date. Here is how you can get the most from the native ..."
  ],
  [
    "🔥Iphone 13 Pro Max सबको फ्री मिलेगा ! How To Get Free Iphone ! Free Iphone From Flipkart ! Flipkart",
    "Iphone 13 Pro Max सबको फ्री मिलेगा ! How To Get Free Iphone ! Free Iphone From Flipkart ! Flipkart App Link ..."
  ],
  [
    "TOANG THẬT RỒI: đến lượt iPhone 14 Pro Max lỗi màn hình y hệt như iPhone 13 Pro Max",
    "TOANG THẬT RỒI: đến lượt iPhone 14 Pro Max lỗi màn hình y hệt như iPhone 13 Pro Max ▻ Mua ngay iPhone 14 Pro Max hàng ..."
  ],
  [
    "SAMSUNG S22 Ultra vs 13 Pro Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW S22 Ultra 5G (amazon) https://amzn.to/36FJUrf Let's Connect: ..."
  ],
  [
    "3 BEST New iPhone 13 Pro Features!",
    "These are the best features on the new iPhone 13 Pro! The all-new Super Retina XDR display with ProMotion (adaptive variable ..."
  ],
  [
    "My Great Lucky🤤...!! i found New Apple iPhone 14 Pro Max and a lot of iPhone in the landfill",
    "My Great Lucky  ...!! i found New Apple iPhone 14 Pro Max and a lot of iPhone in the landfill #iphone14 #restoration 1."
  ],
  [
    "iPhone 13 Pro y Pro Max | Review en Español",
    "Los nuevos iPhone 13 Pro y Pro Max tienen un sistema de cámaras avanzado, más batería y una mejor pantalla. Te lo cuento en ..."
  ],
  [
    "SHE PAID $700 FOR FAKE IPHONE 13 PRO MAX 😢 #shorts #fake #iphone13promax #apple #iphone #ios",
    "MONEYTALKSWIRELESS Tik Tok : https://www.tiktok.com/@moneytalkswireless Instagram ..."
  ],
  [
    "YOU WON’T BELIEVE HOW MUCH I BOUGHT IPHONE 13 PRO MAX IN THIS STORE || Sharon Jacobs",
    "Hey loves new video up here on me shopping for a new iphone in one of the most affordable stores in Nairobi.Be sure to learn a ..."
  ],
  [
    "iPhone 13 Pro Max || iPhone 13 Pro Max price in Bangladesh 2022 || iPhone 13 Pro Max 1st impression",
    "iPhone 13 Pro Max || iPhone 13 Pro Max price in Bangladesh 2022 || iPhone 13 Pro Max 1st impression."
  ],
  [
    "Pixel 6 Pro vs iPhone 13 Pro Max vs Galaxy S21 Ultra: Camera Comparison",
    "Buy Google Pixel 6 Pro: https://bestbuy.7tiv.net/b32xbP Buy iPhone 13 Pro Max: https://amzn.to/3GN0pzE Buy Galaxy S21 Ultra: ..."
  ],
  [
    " IPhone 13 Pro 256 Gb Second Hand Price",
    ""
  ],
  [
    "iPhone 13 Pro Max en 2022/2023: El mejor momento para comprarlo",
    "El iPhone 13 Pro Max era el mejor equipo que Apple tenía para ofrecer el año pasado, sin embargo a día de hoy es el mejor ..."
  ],
  [
    "This iPhone got MUCH better after iPhone 14 release...",
    "Get 50% off the regular Setapp pricing as a studient or teacher! https://setapp.sjv.io/c/3468461/389689/5114 Should I buy a new ..."
  ],
  [
    "El iPhone 13 Pro Max ¿Valdrá la pena en 2023?",
    "iphone #apple #iphone13promax #applereview #experience #experiencias #tecnología #tecnologia #ios16 #ios #appleiphone ..."
  ],
  [
    "Минусы iPhone 13 Pro Max",
    "Спустя время использования в устройствах ты находишь минусы, и iPhone 13 Pro Max не исключение. Плюсы 13 Pro Max."
  ],
  [
    "The Green iPhone 13 in 59 seconds!",
    "Unboxing and first look at the Green iPhone 13 and Alpine Green 13 Pro. Shorts channel: ..."
  ],
  [
    "Iphone 13 promax | 13 pro max unboxing is here! #shorts",
    "Subscribe my channel: https://www.youtube.com/channel/UCPi6KG1dyhFivF6DMFfFBjQ ..."
  ],
  [
    "iPhone 13 Pro Max vs iPhone 12 Pro Max - Which Should You Choose?",
    "iPhone 13 Pro Max and iPhone 12 Pro Max have some differences, but also have a lot more similarities than anything else."
  ],
  [
    "iPhone 13 Pro Max - This Is Epic!",
    "The iPhone 13 is going to be even better than we thought thanks to these epic new features! #iPhone13 #iPhone13ProMax ..."
  ],
  [
    "iPhone 13 Pro Max Hidden Trick",
    "Follw Me On Insta https://instagram.com/smartstuff_insta?utm_medium=copy_link."
  ],
  [
    "Apple&#39;s iPhone 14 Pro and 14 Pro Max in under 6 minutes",
    "Apple unveiled the iPhone 14 Pro at its 'Far Out' event on September 7, 2022. The flagship handset ditches the notch, and in its ..."
  ],
  [
    "iPhone 13 Pro Max / 12 Pro Max / 11 Pro Max / 13 / 11 / XR / X / 8 Plus / 8 iOS 16.2 BATTERY TEST!",
    "iOS 16.2 BATTERY Life Drain TEST - iPhone 8 vs 8 Plus vs X vs XR vs 11 vs 13 vs 11 Pro Max vs 12 Pro max vs 13 Pro Max iOS ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max | ¿Cuál será mejor?",
    "Samsung Galaxy S22 Ultra vs #iPhone 13 Pro Max, review comparativa en español. ¿Cuál será mejor comprar? Ambos son dos ..."
  ],
  [
    "iPhone 13 Pro i iPhone 13 Pro Max recenzija",
    "Najbolje što Apple može da ponudi u svetu mobilnih telefona svakako su Pro modeli: predstavljamo vam recenziju iPhone 13 Pro ..."
  ],
  [
    "iPhone 13 Pro Max Cinematic &amp; Video Test - Unedited 4k Video #shotoniphone #iPhone13ProMax",
    "Subtitles On for Camera Settings! Completely blown away by this phone - it changes the game. I always thought I had to ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "iPhone 13 Pro Max в реальной жизни",
    "Ворвитесь в интернет-маркетинг вместе с SkillFactory: https://clc.to/HUDAKOV Получите скидку 45% на обучение по ..."
  ],
  [
    "Iphone 14 Pro Max Vs Iphone 13 Pro Max Camera Comparison | Iphone Camera Test",
    "Dosto Aaj Ki Is Video Me Hum Karenge Camera Comparison Iphone 13 Pro Max Or Iphone 14 Pro Max Me Or Dekhenge Is ..."
  ],
  [
    "รีวิว iPhone 14 Pro Max VS iPhone 13 Pro Max แบบคดีพลิก",
    "ติดตามพวกเราต่อได้ที่ แฟนเพจ : https://www.facebook.com/GuzapPage/ Website : http://www.guzap.com ติดต่องาน ..."
  ],
  [
    "IPHONE 13 PRO MAX",
    ""
  ],
  [
    "Oppo Reno 8 Pro Vs iPhone 13 Pro Max Camera - And the Winner is...",
    "The Oppo Reno 8 Pro is a powerful smartphone. Let's see how its camera hardware combined with the MariSilicon AI stands up to ..."
  ],
  [
    "iPhone 13 Pro VS iPhone 13 Pro MAX ¿Cuál te conviene más?",
    "Unboxings de cada uno: iPhone 13 PRO: https://youtu.be/qX2ApemGY6o iPhone 13 PRO MAX: https://youtu.be/ZggYDe93e7Y ..."
  ],
  [
    "Apple iPhone Price in Pakistan | iPhone 13 PRO Max Price | iPhone 12 PRO Max Price | Rafaqat Kayani",
    "Apple iPhone Price in Pakistan | iPhone 13 PRO Max Price | iPhone 12 PRO Max Price | Rafaqat Kayani ..."
  ],
  [
    "Poco X4 GT vs iPhone 13 Pro Max 🔥 Speed Test",
    "Speed Test of Poco X4 GT vs iPhone 13 Pro Max. ▷ Avatar Maker: https://avatarmaker.net/ Dimensity 8100 vs A15 Bionic Speed ..."
  ],
  [
    "QnA 181 | iPhone 13 Pro Max vs Samsung S22 Ultra, iPhone 12 vs S21 FE",
    "Win New Samsung S22 or iPhone 13! Hurry up to Join Smartphone Giveaway: https://bit.ly/3oGZj0P Do you have any other videos ..."
  ],
  [
    "iPhone 13 Pro va iPhone 13 Pro Max farqi nimada? 🤔 #shorts",
    ""
  ],
  [
    "iPhone 13 pro max back glass replacement #shorts",
    ""
  ],
  [
    "Iphone 13 pro max después de 1 año, no he cambiado de opinion",
    "Iphone 13P Max. #el campeón de la bateria."
  ],
  [
    "March 2022, New Update iCloud Unlock with Passcode iPhone 13 Pro Max || any iOS Support✅",
    "March 2022, New Update iCloud Unlock with Passcode iPhone 13 Pro Max || any iOS Support Without Apple ID Works All Models ..."
  ],
  [
    "iPhone 13 Pro Max Alpine Green Unboxing🌵 aesthetic setup | Magsafe accessories | genshin",
    "Hello my friend~   In this video I am going to unbox iPhone 13 pro max and lots of accessories Hope you enjoy this video I ..."
  ],
  [
    "ĐÁNH GIÁ CHI TIẾT iPHONE 13 PRO MAX: AI CŨNG CHÊ NHƯNG...",
    "ĐÁNH GIÁ CHI TIẾT iPHONE 13 PRO MAX: AI CŨNG CHÊ NHƯNG... Em gửi nhé: ➤ Lên đời iPhone 13 chính hãng VN/A tại ..."
  ],
  [
    "How To Reset &amp; Restore your Apple iPhone 13 Pro Max - Factory Reset",
    "Did you forget your iPhone 13 Pro Max password? Or, is your iPhone 13 Pro Max Disabled? Here is the solution! This is a video ..."
  ],
  [
    "iPhone Kaise Chalaye | How to use iPhone 11 in Hindi | How to use iPhone 12 Pro Max",
    "iPhone Kaise Chalaye How to use iPhone 11 in Hindi How to use iPhone 12 Pro Max Our Amazon Affiliate Page: ..."
  ],
  [
    "Вся правда об iPhone 13 Pro / Max после 2 месяцев использования",
    "Подключай новый тариф билайна «Твое решение»: https://clck.ru/YikCL *При смене пакета ГБ и минут начинается новый ..."
  ],
  [
    "I phone 13 Pro Max Unboxing | I phone 13 | Unboxing | Apple | #iphone13 #apple",
    ""
  ],
  [
    "Finally i got iphone 13 Pro Max✅#shorts",
    "Finally i got iphone 13 Pro Max✓#shorts. Dream 1k Subscribers  . Please Support guys. Thanks For watching This Video  "
  ],
  [
    "iPhone 13 &amp; 13 Pro The Ultimate Camera &amp; Photo Settings Tutorial | IOS 15",
    "This a tutorial on the Camera and the Photo Settings of the iPhone. It was made for the iPhone 13 (Pro, Max, Mini) but it also refers ..."
  ],
  [
    "IPHONE 13 PRO MAX - NAINLOVE AKO DITO!",
    "The Iphone 13 Pro Max is the best Iphone you can buy today. The Iphone 13 Pro Max has 50% more performance, Has better ..."
  ],
  [
    "iPhone 13 pro max free fire 3 finger claw handcam gameplay onetap headshot tips A15 Bionic chip",
    "iPhone 13 pro max 3finger handcam Gameplay garena free fire iphone 13 pro max garena free fire full map ranked gameplay 20 ..."
  ],
  [
    "iPhone 13&#39;s: How to Turn Off or Restart (4 Ways)",
    "I show you 4 ways to turn off (power down, shut off) or restart the iPhone 13 (same as iPhone 13 Pro, 13 Pro Max & 13 Mini)."
  ],
  [
    "How To RESET IPhone 13 Pro Max To FACTORY SETTINGS",
    "How To RESET IPhone 13 Pro Max To FACTORY SETTINGS Please Comment/Like/Share/Subscribe. Thank you! Stuff For Sale: ..."
  ],
  [
    "Bây giờ bạn có dám mua iPhone 13 Pro Max không?",
    "Bây giờ bạn có DÁM MUA iPhone 13 Pro Max không? Nếu có thì ghé qua #xoăn_store mua cho rẻ: ..."
  ],
  [
    "How to Get Full-Screen Pictures for iPhone Calls (13 pro Max, 12 Pro Max) -iOS 15",
    "Video on how to a get full-screen picture in iphone phone calls ios 14. how to enable full screen photo for incoming calls on ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra | Comparativa de cámaras",
    "No te pierdas de ningún contenido: https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ ..."
  ],
  [
    "iPhone 13 Pro : Selepas 3 Bulan",
    "Link Pembelian: Apple Authorised Reseller Shopee : https://invol.co/cl8okxk Lazada : https://invol.co/cl8oky9 #iPhone13Pro ..."
  ],
  [
    "iPhone 13 Pro Max Bleu Alpin : Déballage &amp; prise en main ! (Unboxing)",
    "Voici le déballage et la prise en main du nouvel iPhone 13 Pro Max d'Apple, en français ! ▻ Abonnez-vous, c'est gratuit ..."
  ],
  [
    "iPhone 13 Pro Max Full Review in Bangla | In Bangladesh | GOD Level Performance &amp; CAMERA! |",
    "This Is iPhone 13 Pro Max Full Details review after 4 days. This iPhone Price 6-128 GB variant is $1099. Bangladesh Price iPhone ..."
  ],
  [
    "iPhone 13 Pro Max Camera 📷 Test #shorts #short #iphone13 #iphone13promax #iphone13promaxcamera",
    "iPhone13promax #iPhone13promaxcamera #deepakyati Thanks for watching. You can follow me on : Instagram ..."
  ],
  [
    "iPhone 13 Pro: How to Force Restart / Reset",
    "iphone13pro #forcereset #restart In this video tutorial we show you how to properly force restart or reset your Apple iPhone 13 ..."
  ],
  [
    "Introducing Dynamic Island on iPhone 14 Pro | Apple",
    "Welcome to a shape-shifting, multitasking, head-turning, game-changing iPhone experience. Dynamic Island blends fun and ..."
  ],
  [
    "Mini iPhone 13 Pro Max..💯l #shorts #youtubeshorts #trending @MRINDIANHACKER @CrazyXYZ",
    "Welcome To Sunny K Videos I Uploaded Daily Shorts Video if You like My Content So Please Like My Video And Subscribe To ..."
  ],
  [
    "Suddenly My Frd Buy 😱iPhone 13 Pro Max it cost 1.5lakhs 🙄#shorts",
    "funny #funnyvideo #funnyshorts #tamilshorts #tamil #entertainment #comedyvideo #videogames #trendingshorts #shortfeed ..."
  ],
  [
    "iPhone 13 Pro i 13 Pro Max - RECENZIJA | Digitalni nomad testira",
    "Pogledajte prvu regionalnu recenziju iPhonea 13 Pro i 13 Pro Max s primjerima snimljenih videa i fotografija."
  ],
  [
    "iPhone 13 Pro Max : ကောင်းမြဲကောင်းဆဲ",
    "iPhone 13 Pro Max က အရမ်းတိုးတက်လာလား ? သုံးရတာ ဘယ်လိုနေလဲ ? This video is brought to ..."
  ],
  [
    "Por que COMPREI um IPHONE 13 PRO MAX em OUTUBRO 2022! // não vou mudar pro 14!",
    "onde comprar a iPhone 14 Pro Max: https://tidd.ly/3UifONY Não Pague mais Caro!! Utilize o COMPARADOR ..."
  ],
  [
    "How to Turn Off iPhone 13, Pro, Pro Max",
    "How to turn off iPhone 13 and power on. Works for iPhone 13 Pro, Pro Max and iPhone 13 mini. Please subscribe for more ..."
  ],
  [
    "Fix iPhone 13/13Pro/13Pro Max keeps restarting after 2-3 minutes fixed.",
    "How to fix iPhone 13 pro max keeps restarting randomly on every 3 minutes and the exact solution for that issue. Auto restart in 3 ..."
  ],
  [
    "iPhone 13 Pro Max - почему это лучший смартфон Apple?",
    "Найди лучший кэшбэк для товара вместе с LetyShops: https://letyshops.onelink.me/zrnH/4cfdac18 Ютюб ссылки ..."
  ],
  [
    "Test In Under Water Iphone 13 Pro Max And Samsung S22 Ultra #short #ytshorts #technology",
    ""
  ],
  [
    "Минусы iPhone 13 Pro Max",
    "Спустя время использования в устройствах ты находишь минусы, и iPhone 13 Pro Max не исключение. Плюсы 13 Pro Max."
  ],
  [
    "iPhone 13 Pro Max/11/X Quick Tip: Screen Frozen? Try This Quick Fix!",
    "iPhone keeps freezing? Read this guide to fix iPhone screen frozen effectively!"
  ],
  [
    "First 13 Pro Max repair, definitely not the last 🤠 #shorts #apple #13promax #backglass #laser",
    ""
  ],
  [
    "QnA 226 | iPhone 14 is waste of money, Used iPhone 13 @ Rs.20,000, iOS 16 clean install",
    "My Recommendations Best iPhone Cases: https://amzn.to/3Av0q85 Best Tempered Glass for iPhone: https://amzn.to/2SN9Bj5 ..."
  ],
  [
    "CHEGOU! iPhone 13 Pro Max de 1TB, o SMARTPHONE MAIS CARO DO BRASIL! Unboxing e Impressões",
    "Finalmente chegou aqui no canal o iPhone 13 Pro Max de 1TB de armazenamento! Eu acho que dessa vez eu exagerei um ..."
  ],
  [
    "iPhone 13 Pro y Pro Max | Review en Español",
    "Los nuevos iPhone 13 Pro y Pro Max tienen un sistema de cámaras avanzado, más batería y una mejor pantalla. Te lo cuento en ..."
  ],
  [
    "Iphone 13 pro max después de 1 año, no he cambiado de opinion",
    "Iphone 13P Max. #el campeón de la bateria."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Battery Test | iOS 16 Battery Drain Test",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Battery Drain Test...iOS 16 Battery Drain Test In this video we are doing battery drain ..."
  ],
  [
    "iphone 13 pro Max #shorts",
    "iphone 13 pro Max #shorts #iphone13promax #iphone13pro."
  ],
  [
    "Tips and Tricks Of iPhone 13 Pro Max In Hindi| Hidden Features | #Short 🔥Part-2 |TechSK",
    "Hello guys This video about to iphone 13 pro max tips,tricks and some hidden features. What you need to know. Giveaway ..."
  ],
  [
    "iphone 13 Pro max Side View 🍎🍎#shorts",
    ""
  ],
  [
    "Самый дорогой iPhone 13 Pro Max - 160 000₽",
    "Индекс айфона 2021 https://www.picodi.com/ru/mozhno-deshevle/indeks-iphone-2021 Приложение Wylsacom для Apple ..."
  ],
  [
    "IPhone 12 Deal | IPhone 13 Pro Max, Iphone 12 Pro Max, Iphone 11! Republic day Sale on phones!",
    "Deals ke liye join kare telegram page https://telegram.me/delhitelakshaymobiles Instagram Pe Follow Karle Updates ke liye ..."
  ],
  [
    "Used iphone 13 Pro Max✔Used iphone Price in BD 2021 Today✔Used Phone Price✔Second Hand Mobile✔Dordam",
    "Used iphone 13 Pro Max✓Used iphone Price in BD 2021 Today✓Used Phone Price✓Second Hand Mobile✓Dordam ."
  ],
  [
    "iPhone 14 Plus vs 13 Pro Max vs 12 Pro Max vs 11 Pro Max vs S22 Ultra vs S22 Plus BATTERY DRAIN TEST",
    "MagFone iPhone Unlocker : https://bit.ly/3T1Tubm is a powerful iOS unlocker to remove screen lock, unlock Apple ID, bypass ..."
  ],
  [
    "iPhone 13 Pro Max Unboxing, Silver 256gb + Accessories + Set up ✨📱",
    "Welcome to my channel Hey guys, here's my unboxing video for the new iPhone 13 pro max the “big boy”. Its finally here!"
  ],
  [
    "iPhone 14 Pro Max vs 13 Pro Max | Should I Upgrade? #iphone14promax #shorts #iphone #Apple #14promax",
    ""
  ],
  [
    "iPhone 13 Pro Max Langzeit-review nach einem Jahr",
    "Lohnt sich das iPhone 13 pro max noch ?"
  ],
  [
    "iPhone 13 pro max back glass replacement #shorts",
    ""
  ],
  [
    "iOS 16.1 Battery DRAIN TEST - iPhone 11 Pro Max vs 12 Pro vs 12 Pro Max vs 13 vs 13 Pro / 13 Pro Max",
    "100 To 0% iOS 16.1 Battery Life DRAIN Test Between 11 Pro Max vs 12 Pro vs 12 Pro max vs 13 vs 13 Pro vs 13 Pro Max Battery ..."
  ],
  [
    "HOW to HARD RESET or RESTART iPhone 13 PRO MAX",
    ""
  ],
  [
    "iPhone 13 Pro CINEMATIC MODE review… THIS IS INSANE!",
    "BUY MY CINEMATIC MODE PRESETS HERE NOW: Yosemite Series - https://bryanadamc.gumroad.com/l/yosemite Light ..."
  ],
  [
    "buying  iPhone 13 pro max from first YouTube income 😐#iphone#vlog #shorts#youtubeshorts #viral#fact",
    "buying iPhone 13 pro max from first YouTube income #iphone#vlog #shorts#youtubeshorts #viral#fact #iphone #vlog #shorts ..."
  ],
  [
    "iPhone 13 Pro: How to Force Restart / Reset",
    "iphone13pro #forcereset #restart In this video tutorial we show you how to properly force restart or reset your Apple iPhone 13 ..."
  ],
  [
    "I Bought An iPhone 13 Pro Max For $400! Big Fat Profits With Phone Flipping!",
    ""
  ],
  [
    "iPhone 14 Pro Max VS iPhone 13 &amp; 12 Pro Max || الأختيار مفاجأة !!",
    "المقارنة القصوى ... آيفون ١٤ برو ماكس ضد آيفون ١٣ برو ماكس ... ضد آيفون ١٢ برو ماكس مين الأفضل ؟؟ أحصل علي الشاحن الـ 100 وات من ..."
  ],
  [
    "Минусы iPhone 13 Pro Max",
    "Спустя время использования в устройствах ты находишь минусы, и iPhone 13 Pro Max не исключение. Плюсы 13 Pro Max."
  ],
  [
    "Fix iPhone 13/13Pro/13Pro Max keeps restarting after 2-3 minutes fixed.",
    "How to fix iPhone 13 pro max keeps restarting randomly on every 3 minutes and the exact solution for that issue. Auto restart in 3 ..."
  ],
  [
    "iPhone 13 Pro vs 12 Pro Max vs 11 Pro: Camera Comparison Test!",
    "A detailed camera comparison test of the iPhone 13 Pro vs iPhone 12 Pro Max vs iPhone 11 Pro. Let's compare photos, video, ..."
  ],
  [
    "How to put camera lens protector in iphone 13 pro max || camera lens review",
    ""
  ],
  [
    "NEW ! iPhone 13 Pro Max Alpine Green (1 Terabyte) UNBOXING + Accessories / ASMR",
    "NEW ! iPhone 13 Pro Max Alpine Green (1 Terabyte) UNBOXING + Accessories / ASMR PLEASE STAY SAFE!!!!! THANKS SO ..."
  ],
  [
    "IPhone 13 pro max | Apple 13 pro max unboxing",
    "Apple 13 pro max IPhone 13 pro max unboxing Subscribe my channel: ..."
  ],
  [
    "Why I bought the iPhone 13 Pro...",
    "The iPhone 13 and iPhone 13 Pro are officially available to preorder on Apple's website and you can pick one up this Friday."
  ],
  [
    "iphone 13 pro Max #shorts",
    "iphone 13 pro Max #shorts #iphone13promax #iphone13pro."
  ],
  [
    "3 BEST New iPhone 13 Pro Features!",
    "These are the best features on the new iPhone 13 Pro! The all-new Super Retina XDR display with ProMotion (adaptive variable ..."
  ],
  [
    "Used iphone 13 Pro Max✔Used iphone Price in BD 2021 Today✔Used Phone Price✔Second Hand Mobile✔Dordam",
    "Used iphone 13 Pro Max✓Used iphone Price in BD 2021 Today✓Used Phone Price✓Second Hand Mobile✓Dordam ."
  ],
  [
    "iPhone 13 Pro Max Full Review in Bangla | In Bangladesh | GOD Level Performance &amp; CAMERA! |",
    "This Is iPhone 13 Pro Max Full Details review after 4 days. This iPhone Price 6-128 GB variant is $1099. Bangladesh Price iPhone ..."
  ],
  [
    "iPhone 13, iPhone 13 mini, iPhone 13 Pro, iPhone 13 Pro Max",
    "iphone,new iphone 2021,iphone 13,iphone 13 release date and price,iphone 13 price,iphone 13 release date,iphone 13 launch ..."
  ],
  [
    "Beggar Buying IPHONE 13 Pro Max Prank - Rich Beggar | Adil Anwar",
    "Prank shoot in   Al Noor mobile. Deals in reparing and all king of parts.. Shop 8'9 first floor arif centre hall road. Lahore. Mobile…"
  ],
  [
    "First 13 Pro Max repair, definitely not the last 🤠 #shorts #apple #13promax #backglass #laser",
    ""
  ],
  [
    "How To RESET IPhone 13 Pro Max To FACTORY SETTINGS",
    "How To RESET IPhone 13 Pro Max To FACTORY SETTINGS Please Comment/Like/Share/Subscribe. Thank you! Stuff For Sale: ..."
  ],
  [
    "Самый дорогой iPhone 13 Pro Max - 160 000₽",
    "Индекс айфона 2021 https://www.picodi.com/ru/mozhno-deshevle/indeks-iphone-2021 Приложение Wylsacom для Apple ..."
  ],
  [
    "Cases for iPhone 13 pro max #case  #iphone13promax #shorts",
    ""
  ],
  [
    "Why I’m the Best?❤️ IPhone 13 Pro Max",
    "Register, Download & Play 1x and get your exclusive welcome bonus up to 20000 INR on first Deposit *Referral Link* ..."
  ],
  [
    "buying  iPhone 13 pro max from first YouTube income 😐#iphone#vlog #shorts#youtubeshorts #viral#fact",
    "buying iPhone 13 pro max from first YouTube income #iphone#vlog #shorts#youtubeshorts #viral#fact #iphone #vlog #shorts ..."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Battery Test | iOS 16 Battery Drain Test",
    "iPhone 14 Pro Max vs iPhone 13 Pro Max Battery Drain Test...iOS 16 Battery Drain Test In this video we are doing battery drain ..."
  ],
  [
    "iPhone 13 Pro Max - почему это лучший смартфон Apple?",
    "Найди лучший кэшбэк для товара вместе с LetyShops: https://letyshops.onelink.me/zrnH/4cfdac18 Ютюб ссылки ..."
  ],
  [
    "Iphone 13 pro max in 99,990Rs | Flipkart Big Billion Days",
    ""
  ],
  [
    "PRICEDROP SA IPHONE 14 PRO MAX, IPHONE 13 PRO MAX, IPHONE 11, IPHONE XR, GREENHILLS DECEMBER 9, 2022",
    "God bless us all!   Matik discount at Sky's the freebies sa #BobGianShow subscribers! Kaya San ka pa??? BAGSAK PRESYO ..."
  ],
  [
    "iOS 16.1 Battery DRAIN TEST - iPhone 11 Pro Max vs 12 Pro vs 12 Pro Max vs 13 vs 13 Pro / 13 Pro Max",
    "100 To 0% iOS 16.1 Battery Life DRAIN Test Between 11 Pro Max vs 12 Pro vs 12 Pro max vs 13 vs 13 Pro vs 13 Pro Max Battery ..."
  ],
  [
    "Wow ! iPhone 13 Pro Max #shorts",
    ""
  ],
  [
    "IPHONE 14 PLUS vs IPHONE 13 PRO MAX ¿Tiene sentido APPLE ?",
    "Pasar WhatsApp de Android/iPhone a iPhone/Android estable sin pérdida de datos y sin volver a la configuración de fábrica ..."
  ],
  [
    "IPhone 13 Pro Max l Presents for the Birthday Celebrator &amp; the Non-Celebrator",
    "Got a phone for the birthday girl, out of the blue, I got a phone for Mr V as well and a line for Uncle Ben's stepson. Generosity is ..."
  ],
  [
    "HOW to HARD RESET or RESTART iPhone 13 PRO MAX",
    ""
  ],
  [
    "Samsung All Folding phone VS iphone 13 Pro max",
    ""
  ],
  [
    "ĐÁNH GIÁ CHI TIẾT iPHONE 13 PRO MAX: AI CŨNG CHÊ NHƯNG...",
    "ĐÁNH GIÁ CHI TIẾT iPHONE 13 PRO MAX: AI CŨNG CHÊ NHƯNG... Em gửi nhé: ➤ Lên đời iPhone 13 chính hãng VN/A tại ..."
  ],
  [
    "iPhone 13 Pro Vs iPhone 13 Pro Max! Jangan Salah Pilih",
    "iPhone 13 Pro Vs iPhone 13 Pro Max untuk perbedaan harga kurang lebihnya sekitar 2 juta dengan kapasitas yang sama 128 ..."
  ],
  [
    "THỬ THÁCH ĐI MUA IPHONE 13 PRO 256GB TẠI CLICKBUY!!!",
    "Clickbuy #iphone13pro Tham khảo sản phẩm tại: https://clickbuy.com.vn/apple-iphone-13-pro-256gb-cu-99/ TOP ĐT CẤU HÌNH ..."
  ],
  [
    "DESILUSÃO ou INOVAÇÃO ? Troquei para iPhone 13 Pro Max !!",
    "Aqui estão os novos smartphones apple! iPhone 13 pro e iPhone 13 pro max em review / analise. Será que vale a pena comprar?"
  ],
  [
    "iPhone 13 Pro Max Langzeit-review nach einem Jahr",
    "Lohnt sich das iPhone 13 pro max noch ?"
  ],
  [
    "Samsung S23 Ultra vs iPhone 13 Pro Max Camera Test Comparison |  Samsung S23 Ultra Camera Review",
    "Samsung S23 Ultra vs iPhone 13 Pro Max Camera Test Comparison | Samsung S23 Ultra Camera Review and Comparison ..."
  ],
  [
    "Free iPhone 13 Pro Max | 100% सबको फ्री में मिलेगा (NO CLICKBAIT) | The Shopping Table",
    "freeiphone13promax #freeiphone #iphone13promax #freeiphone13 #iphone13promaxfree #iphonefree #theshoppingtable Title ..."
  ],
  [
    "3 Sebab Aku Upgrade Ke iPhone 13 Pro Max!",
    "Dalam video kali ni aku kongsikan antara 3 sebab kenapa aku upgrade dari iPhone 12 Pro ke iPhone 13 Pro Max. Enjoy! Casing ..."
  ],
  [
    "Год без стекла и чехла iPhone 13 Pro Max",
    "Телеграм - https://t.me/Romancev768 Инстаграм - https://www.instagram.com/romancev768/ YouTube ..."
  ],
  [
    "₹650  mini iPhone 13 pro Max #shorts",
    ""
  ],
  [
    "How to Restart an iPhone 13?",
    "Simply and very #Shorts video how to Restart an iPhone 13! Press the Volume Up button and release it, then press the Volume ..."
  ],
  [
    "Review iPhone 13 Pro Max | 10 COSAS QUE DEBES SABER",
    "Marcas de tiempo: 00:00 0. Inicio 00:52 1. Unboxing 02:15 2. Calidad del Producto 03:48 3. Pantalla & Sonido 05:52 4. Bateria ..."
  ],
  [
    "I made a USB-C iPhone 13",
    "Thank-you to PCBWay for sponsoring this video. They offer high quality custom circuit boards as low as $5 for 10 pieces."
  ],
  [
    "iPhone 14 Pro Max vs iPhone 13 Pro Max",
    "A comparison video of apple iPhone 14 Pro max vs Apple iPhone 13 Pro Max."
  ],
  [
    "what’s on my iphone *13 pro max* + ios 16 + widgets ✰|| AriyanaNakole",
    "thank you so much for watching besties  ! stay tuned for the next video and make sure to follow all of my social medias to stay ..."
  ],
  [
    "Unboxing - iPhone 13 Pro Max Sierra Blue สีใหม่สวยจริงไหม? | ZANOOK",
    "Hello everyone, today I'll be unboxing an iPhone 13 Pro max Sierra blue 256gb which I just bought a day ago! I hope this video ..."
  ],
  [
    "Iphone 13 pro max",
    "https://smrturl.co/o/147296/53230038?s1."
  ],
  [
    "Какой iPhone купить в 2023? Только не этот!",
    "Купить любые iPhone в Big Geek: https://biggeek.ru/s/buy Недавно релизнулся iPhone 14 и теперь вопрос как никогда ..."
  ]
]