[
  [
    "Samsung Galaxy S22 Ultra Quick Look! *Ultra Flagship*",
    "Samsung ka naya Flagship dekh liya jaye! #Samsung #SamsungUnpacked #GalaxyS22 #GalaxyS22Ultra Subscribe for ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Indian Unit Unboxing &amp; First Impressions⚡The Noteworthy Flagship Of 2022",
    "Friends, Today we are unboxing the all new Samsung Galaxy S22 Ultra, which now comes with S Pen, Snapdragon 8 Gen 1 And ..."
  ],
  [
    "Galaxy S22 Ultra: Official Introduction Film | Samsung",
    "Introducing the new Samsung Galaxy S22 Ultra. The epic standard. Learn more: http://smsng.co/S22U_Intro_yt Break the rules of ..."
  ],
  [
    "Samsung Galaxy S22 Ultra First Look | Epic S-Pen Magic!!!🔥🔥🔥",
    "Namaskaar Dosto, is video mein maine aapse baat ki hai Samsung Galaxy S22 Ultra ke baare mein aur share kiya hai isi Super ..."
  ],
  [
    "Galaxy S22 Ultra Review: Separating from the Pack!",
    "Samsung's Galaxy S22 Ultra separates itself from the rest of the lineup with more than just specs dbrand Atomic Grip case: ..."
  ],
  [
    "Samsung S22 Ultra My Opinion | Malayalam",
    "CashKaro Download CashKaro App - https://cashk.app.link/cJljG3yehob Download CashKaro from the link above and get ₹25 ..."
  ],
  [
    "Smartphone Awards 2022!",
    "The Best Smartphones of 2022! MKBHD Merch: http://shop.MKBHD.com Affiliate Links: Samsung S22 Ultra at ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | My Review - എന്റെ Favourite Phone!",
    "Here is my experience with Samsung Galaxy S22 Ultra Case Link - https://amzn.to/3If6Jkd MY RECOMMENDATIONS ..."
  ],
  [
    "ANDROID King is Here!- Samsung Galaxy S22 ULTRA *Unboxing* | TechBar",
    "In this video, I talk about the Samsung Galaxy S22 Ultra - Samsung's latest flagship. Suggest Me Gadgets ..."
  ],
  [
    "The Real KING Phone? - iPhone 14 Pro Max vs Samsung S22 Ultra",
    "In this video, I compare the Samsung Galaxy S22 Ultra and the iPhone 14 Pro Max - The Best of Best Smartphones. You can also ..."
  ],
  [
    "The Samsung S22 Ultra is secretly AMAZING.",
    "Hands on with the Samsung Galaxy S22 Ultra, including a quick Camera Test, specs, features, price and more. Battery Test and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra is Here - Finally Back !",
    "This is Samsung Galaxy S22 Ultra 5G and Galaxy S22 Ultra in India comes with Snapdragon 8 Gen 1 Processor with S pen ..."
  ],
  [
    "Samsung S22 Ultra Unboxing &amp; Quick Review !!!!",
    "Samsung S22 Ultra unboxing & Quick Review : is video mein mene samsung ke new flagship phone #S22Ultra ki unboxing & ek ..."
  ],
  [
    "I Tried the BEST Smartphone in India Ft. Samsung Galaxy S22 Ultra",
    "Samsung Galaxy S22 Ultra comes with SD 8Gen1, curved AMOLED display 5000 mAh battery and S-Pen. S22 Ultra: ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA TEST!",
    "Camera Test comparison of Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - including microphone, night mode, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing - ASMR",
    "Today I will be unboxing the new Samsung Galaxy S22 Ultra. I hope you enjoy! #S22Ultra #Unboxing #ASMR."
  ],
  [
    "Samsung Galaxy S22 Ultra | The Best !!!! | Pixel 7 pro ( Blah )",
    "https://www.instagram.com/5g_store_thrissur/ 5g store thrissur Mobile Phone Shop 9048 111 669   7012 161 910   Main branch ..."
  ],
  [
    "Samsung Galaxy S22 Ultra⚡ Malayalam Unboxing &amp; First Impressions⚡The Real Flgship",
    "Samsung #SamsungUnpacked #GalaxyUnpacked #GalaxyS22 https://www.samsung.com/in/smartphones/galaxy-s22-ultra/ ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs. Z Fold 4, Motorola Edge 30 Ultra, Xiaomi 12 Pro - Camera test!",
    "Cine are camera mai buna dintre Samsung Galaxy S22 Ultra, Galaxy Z Fold 4, Motorola Edge 30 Ultra si Xiaomi 12 Pro aflam in ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing &amp; initial impressions || in Telugu ||",
    "Samsung #SamsungUnpacked #GalaxyUnpacked #GalaxyS22 Buy Link : S22 Ultra : https://bit.ly/3puVVGI S22& S22 Plus ..."
  ],
  [
    "GALAXY S22 ULTRA: First 10 Things to Do!",
    "Buy Galaxy S22 Ultra: https://shop-links.co/cgDFffAV5BP The Samsung Galaxy S22 and Galaxy S22 Ultra have once again taken ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Review - ஒரே ஒரு பெரிய  பிரச்னை மட்டும் தான் , மத்தபடி இது தான் BEST!",
    "சந்தேகமே இல்லாம கெடைக்குறதுலையே பெஸ்டான Android Flagship Samsung Galaxy S22 Ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Unboxing &amp; First Impression",
    "https://www.instagram.com/japansquareonline/"
  ],
  [
    "Samsung S22 Ultra Long Term Review - Better Than iPhone 14 Pro!",
    "Samsung Galaxy S22 Ultra Review After 8 Months - This is the Best Android Smartphone of 2022. Subscribe for more such ..."
  ],
  [
    "Dropping Samsung Galaxy S22 Ultra From 1000 Feet - Will It Survive?",
    "\"Download the OctaFX Copytrading App at https://bit.ly/Hacker_OctaFX_Copy and get an exclusive 50% bonus! Start learning ..."
  ],
  [
    "The 2022 KING ? - iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro",
    "In this video, I compare the Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max vs Google Pixel 7 Pro. You can also watch, Moto ..."
  ],
  [
    "Samsung galaxy s22 ultra 100X 🌚 moon zoom test #shorts",
    "Samsung galaxy s22 ultra moon zoom test, S22 ultra 100x zoom, moon zoom test S22 ultra,"
  ],
  [
    "Samsung Galaxy S22, S22+, S22 Ultra Unboxing Every Color + Every Accessory",
    "Samsung Galaxy S22, Samsung Galaxy S22+ and Samsung Galaxy S22 Ultra unboxing and hands on. Sponsored by ZEN ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing &amp; Quick Review - Mota Bhai Is HERE !",
    "Hello Dosto is video me maine aap logo ko Samsung Galaxy S22 Ultra ki Unboxing aur Full Details diya hu...Umeed hai aapko ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Which is the Flagship King?",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra full review",
    "The Galaxy S22 Ultra may be Samsung's best phone yet but it also has some pretty big boots to fill. Consumer expectations are at ..."
  ],
  [
    "5 Reasons Galaxy S22 Ultra DESTROYS the iPhone 14 Pro Max",
    "In this video, I will give you 5 reasons why the Samsung Galaxy S22 Ultra destroys the iPhone 14 Pro Max. Both the Galaxy S22 ..."
  ],
  [
    "Final Offer to Buy Samsung Flagship Phone in 2022 !",
    "In this video i talked Samsung flagship smartphones offer pricing in December 2022 Check all Samsung Galaxy Offer and details ..."
  ],
  [
    "Galaxy S22 Ultra long-term review: 5 months later",
    "Want to sponsor the next Android Police video? Get in touch: videosponsor@androidpolice.com. This is the Samsung Galaxy S22 ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra CAMERA COMPARISON (in Hindi)",
    "iPhone 14 Pro Max vs Samsung S22 Ultra camera comparison of photos and videos. CONNECT ON INSTAGRAM: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra  In-Depth Review in Telugu || Best Flagship Phone ||",
    "Samsung #SamsungUnpacked #GalaxyUnpacked #GalaxyS22 Buy Link : S22 Ultra : https://bit.ly/3puVVGI S22& S22 Plus ..."
  ],
  [
    "Galaxy S22 ULTRA - The 10 Most UNIQUE &amp; INTERESTING Features!",
    "Here are the 10 most unique features on the Samsung Galaxy S22 Ultra! This phone is definitely a pretty interesting phone and I ..."
  ],
  [
    "THIS PHONE IS 🔥 | Samsung Galaxy S22 Ultra 3 unique features",
    "Here are the unique features that are only available in the Samsung galaxy s22 ultra. ------------------------- Guiding Tech (GT) Social ..."
  ],
  [
    "My Favourite Smartphone Review is Here !",
    "Samsung Galaxy S22 Ultra is true android flagship comes with many features. Here is my Samsung Galaxy S22 Ultra Review after ..."
  ],
  [
    "Galaxy S22 Ultra Review: The Switch Up",
    "Try Surfshark: https://Surfshark.deals/thao Code 'THAO' for 83% off & 3 months FREE! With the Galaxy S22 Ultra, Samsung has ..."
  ],
  [
    "Live Samsung Unpacked S22 Reveal Event: CNET Watch Party",
    "Tune in at 6:30am PT/ 9:30am ET on Wed. Feb. 9 when Samsung reveals its all-new, flagship Galaxy S22 series. Samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Review | Three Months Later...",
    "Reviewing the Samsung Galaxy S22 Ultra three months after it hit the UK, boasting one of the most powerful camera offerings of ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Full Review After 40 Days of Usage - Best Android Yet 👑",
    "Hey, Guys, Full Detailed Review of the Samsung Galaxy S22 Ultra, this Phone Comes with Snapdragon 8Gen1 Chipset and 2k ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - TIPS, TRICKS &amp; HIDDEN FEATURES!!!",
    "Let me know which was your favourite Tip, Trick or Hidden feature in the comments and also don't forget to check out the ..."
  ],
  [
    "I Never Used a CAMERA PHONE Like This!",
    "This is an in-depth review of the Samsung Galaxy S22 Ultra in Hindi. In this video, I am talking about Samsung's successor to the ..."
  ],
  [
    "உலகின் மிக சிறந்த Android மொபைல் 📱 👑 Samsung Galaxy S22 Ultra⚡⚡ Unboxing &amp; First Impression",
    "In this Video we share our experience about this smartphone Samsung Galaxy S22 Ultra .Watch the video fully and share your ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Review After 2 Months!",
    "This video is sponsored by Glazedinc. Check out their awesome range of phone covers and tempered Glasses here: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 🔥 THE BEST ANDROID 🔥",
    "Thanks so much for watching guys, let me know in the comments what you think of the new Samsung Galaxy S22 Ultra, and if you ..."
  ],
  [
    "realme 10 India Launch,Samsung S22 FE Coming,OnePlus 11R Specs,realme GT Neo5 240W Charging-#TTN1427",
    "Hello, Friends Welcome to Tech News No.1427. Today There Are Lots Of Amazing Tech News Lined Up For You. So Let's Get ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Day In The Life Review | From Apple Fan Boy (Battery &amp; Camera Test)",
    "Today I will be putting the Samsung Galaxy S22 Ultra through a day in my life to see how well it performs. Music by: PRE$i - UK ..."
  ],
  [
    "உலகின் மிக சிறந்த Android மொபைல் 📱 👑 Samsung Galaxy S22 Ultra⚡⚡ Unboxing &amp; First Impression",
    "In this Video we share our experience about this smartphone Samsung Galaxy S22 Ultra .Watch the video fully and share your ..."
  ],
  [
    "Samsung S22 Ultra vs iPhone 13 Pro Max Camera Test",
    "Full Camera test comparison between Samsung Galaxy S22 Ultra and iPhone 13 Pro Max, including Zoom, Macro, 4K video, Mic ..."
  ],
  [
    "Samsung Galaxy S22 &amp; S22+ Indian Unit Unboxing &amp; First Impressions⚡I Am Surprised!",
    "Friends, Today we are unboxing the all new Samsung Galaxy S22 & S22+, which now comes with 50MP Triple cameras, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing in Telugu...",
    "Samsung Galaxy S22 Ultra Unboxing & Overview in Telugu | This Video was made in #collab with Samsung. Galaxy S22 Ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Real Review - “The Snyder Cut”",
    "Samsung Galaxy S22 Ultra Buy it here, https://amzn.to/3igTKTa Check out the Ghostek Cases, https://ghostek.com/ Wanna buy ..."
  ],
  [
    "Apple Fan Boy Switches To Samsung Galaxy S22 Ultra - Goodbye iPhone",
    "CASETiFY has released new cases for the S22, Z Flip and Pixel! Go to http://www.casetify.com/shevonsalmonyt today to get 15% ..."
  ],
  [
    "Galaxy S22 Ultra - Change These Settings Immediately",
    "Exclusive Samsung Flip4 & Fold4 Bundle Offers: Galaxy Z Fold4: https://howl.me/chP1Cl2BsQo Galaxy Z Flip4: ..."
  ],
  [
    "Galaxy S22 Ultra HONEST Long Term Review (S22 Ultra 5 Months Later)",
    "This is my official LONG term review of the Samsung Galaxy S22 Ultra. In my opinion, the S22 Ultra is one of, if not the BEST ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Day In The Life Review | From Apple Fan Boy (Battery &amp; Camera Test)",
    "Today I will be putting the Samsung Galaxy S22 Ultra through a day in my life to see how well it performs. Music by: PRE$i - UK ..."
  ],
  [
    "1,00,000 க்கு worth ஆ?? 🔥😲  Vera Level CAMERA",
    "Samaung Galaxy S22 Ultra Full Review with Pros and Cons / with Camera Samples - Best Android Flagship Mobile? - Tamil Tech ..."
  ],
  [
    "Samsung Galaxy S22, S22+, S22 Ultra Unboxing Every Color + Every Accessory",
    "Samsung Galaxy S22, Samsung Galaxy S22+ and Samsung Galaxy S22 Ultra unboxing and hands on. Sponsored by ZEN ..."
  ],
  [
    "Samsung S22 Ultra Review From iPhone User",
    "We Are Hiring! APPLY HERE: https://techwiser.com/we-are-hiring Please leave a LIKE ❤️ and SUBSCRIBE For More Videos ..."
  ],
  [
    "iPhone 14 Pro Max vs. Galaxy S22 Ultra Drop Test!",
    "CASETiFY's iPhone 14 Cases are now available at casetify.com! Go to https://www.casetify.com/phonebuff today to get 15% off ..."
  ],
  [
    "I used Samsung Galaxy S22 Ultra for 6 Months - Long Term Review!",
    "Samsung Galaxy S22 Ultra review. Samsung Galaxy S22 Ultra is one of the best Flagship Phones of 2022. Samsung Galaxy S22 ..."
  ],
  [
    "BEST PHONE ON THE PLANET!! S22 Ultra vs iPhone 14 Pro Max",
    "Should you buy the iPhone 14 Pro Max or the S22 Ultra? The Camera comparison was surprising... ✓ GET your iPhone 14 cases ..."
  ],
  [
    "Switching to Galaxy S22 Ultra From iPhone 13 Pro - The BEST &amp; WORST Parts",
    "Buy UGREEN Nexode 200W Charger here(US): https://amzn.to/3tOD4IU Buy UGREEN Nexode 200W Charger here(CA): ..."
  ],
  [
    "Samsung Galaxy S23 Ultra - HERE IT IS",
    "Latest leaks expose the Samsung Galaxy S23 Ultra and it's potentially powerful upgrades. Samsung Galaxy S23 Ultra is about to ..."
  ],
  [
    "Galaxy S22 ULTRA Review | The Best Phone EXCEPT... (1 month later)",
    "Go to https://www.casetify.com/createdbyella today to get 15% off on your new favorite phone case! ❀ description ❀ Here is my ..."
  ],
  [
    "🍇 samsung galaxy S22 Ultra unboxing aesthetic | LAMY S pen | accessories",
    "Hello everyone~   In this video I am going to unbox Samsung galaxy S22 ultra that many people is looking forward to! Hope you ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Camera Test Review in Hindi || samsung s22 ultra camera test || S22 Camera",
    "Samsung Galaxy S22 Ultra Camera Test Review in Hindi || samsung s22 ultra camera test || S22 Camera Samsung s22 price ..."
  ],
  [
    "Samsung S22 Ultra📱 in GREEN Unboxing 🤑 #Shorts #Samsung #S22ultra",
    "Media Partner : Adada Creators Email : techboss@adadacreators.com Subscribe   : http://bit.ly/2JmvIXb It would make my day ..."
  ],
  [
    "You&#39;re missing out BIG TIME - Top 30 Unknown S22 Ultra Features!",
    "Save up to $925 on the Galaxy S22 Ultra!* https://howl.me/citTZOm7Vk9 S22 Ultra Deals on Amazon: https://amzn.to/3CC1mt3 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - 9 Months Later (HARD TRUTH!)",
    "Samsung Galaxy S22 Ultra 9 Months later review. Last phone to have a Samsung chip. Never again. Still Worth it? Galaxy S23 ..."
  ],
  [
    "iPhone 14 Pro vs Samsung S22 Ultra - Max Brightness Test 🤯 #shorts",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Maximum Display Brightness Test Subscribe ..."
  ],
  [
    "iPhone 14 Pro/Max vs Samsung S22 Ultra Detailed Comparison - BEST Flagship for you☝🏼",
    "Hey, Guys, This is the Detailed Comparison between iPhone 14 Pro Max and Galaxy S22 Ultra, Both Phone Cost Upwards of ..."
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra - BIGGEST CAMERA COMPARISON !",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra Ka Biggest Comparison Kiya ..."
  ],
  [
    "The Honeymoon Is Over - S22 Ultra and S22+ Unboxing",
    "Get the dbrand atomic edition grip case for the S22 Ultra at https://dbrand.com/atomic-edition Samsung's latest Galaxy phone is ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Pixel 7 Pro Camera Test - Best 🔥",
    "Samsung Galaxy S22 Ultra vs Google Pixel 7 Pro camera comparison with features, Photo and video Test 00:00 - Pixel 7 Pro vs ..."
  ],
  [
    "Galaxy S22 Ultra Review नेपालीमा: My New Favorite Android Flagship!",
    "Hello, and namaste everyone, in this video, I have talked about all my experiences with the Samsung Galaxy S22 Ultra after using ..."
  ],
  [
    "Galaxy S22 Ultra: Unveiling | Samsung",
    "Introducing Galaxy S22 Ultra - the most boundary-breaking innovation in the mobile industry. It sets a new standard for ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Green Unboxing",
    "Unboxing The Samsung Galaxy S22 Ultra Green (256GB). Hope you enjoy! Check out my other videos: iPhone SE Unboxing: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max: Camera Shootout",
    "Samsung Galaxy S22 Ultra and iPhone 13 Pro Max: The best phones Android and iOS users can buy today. Both are packed with ..."
  ],
  [
    "GALAXY S22 ULTRA: BIG PROBLEMS! (3 MONTHS LATER REVIEW)",
    "Today we review the S22 ULTRA 3 MONTHS LATER! In what might be my LAST video covering the s22 ULTRA I'll focus on some ..."
  ],
  [
    "Samsung Galaxy S22 Ultra: 1 Year Later Review",
    "Samsung #S22Ultra #Review This is my review on the Samsung Galaxy S22 Ultra Exynos 2200 12GB/256GB version after almost ..."
  ],
  [
    "Galaxy S22 Ultra Impressions: Hii ni HYBRID",
    "Galaxy #SamsungS22Ultra #Snashtz Galaxy S22 Ultra Impressions: Hii ni HYBRID Galaxy S22 Impressions: Battery ..."
  ],
  [
    "Samsung S22 Ultra Unboxing &amp; First Impression || SD 8 Gen 1, 45W Charging, S Pen Magic",
    "Samsung S22 Ultra Unboxing 108MP, 45W Charging, S Pen Magic S22 ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing - a Flagship Smartphone (Roblox, Fortnite, Minecraft)",
    "Unboxing gameplay impressions of new Samsung Galaxy S22 Ultra 5G Android smartphone (Exynos 2200 chip variant). Roblox ..."
  ],
  [
    "New Phone 😍 Samsung S22 Ultra 🔥",
    "New Phone Samsung S22 Ultra Follow me on Instagram :- https://openinapp.co/instagram/manojdey23 Thanks for watching."
  ],
  [
    "Galaxy S22 Ultra - First 20 Things You Should Do",
    "This video shows you how to set up a brand new Samsung Galaxy S22 Ultra, by making some useful and important tweaks to the ..."
  ],
  [
    "Day In The Life: iPhone 14 Pro Max vs Samsung S22 Ultra",
    "Giveaway | https://spigen.co/3ee6CuW Cases and Accessories in this video | https://spigen.co/3CzsLft iPhone 14 Pro Max vs ..."
  ],
  [
    "The Best Smartphone Camera 2022!",
    "It's time to find out once with SCIENCE: What's the best smartphone camera? https://vote.MKBHD.com Thanks to Discord for ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Space Moon Zoom Test | 100X Live Hands On Zoom Test",
    "Samsung Galaxy S22 Ultra Space Moon Zoom Test | 100X Live Hands On Zoom Test Don't Forget to Subscribe My Channel For ..."
  ],
  [
    "S22 Ultra India Unboxing by iPhone 13 Pro Max User | Hindi",
    "Download the filo app https://filoapp.sng.link/D3brb/d381/9zml and use my referral code NAB001 to avail 10% discount on all ..."
  ],
  [
    "Samsung S22 Ultra : Top 10 Unique Features With One UI 4.1 Features",
    "Samsung S22 Ultra : Top 10 Unique Features With One UI 4.1 Features Features 1,3,5,6,7,8 Can be added with One UI 4.1 ..."
  ],
  [
    "Top 5 features of S22 Ultra that iPhone does not have! #shorts #MostTechy",
    "Main Channel: https://www.youtube.com/MostTechy Follow me across social media platforms for behind the scenes: Instagram: ..."
  ],
  [
    "iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Test | Hindi",
    "Hello Guys, In this video we have an In-depth camera comparison between the latest flagship phone from Apple, IPhone 14 Pro ..."
  ],
  [
    "GALAXY S22 ULTRA: First 10 Things to Do!",
    "Buy Galaxy S22 Ultra: https://shop-links.co/cgDFffAV5BP The Samsung Galaxy S22 and Galaxy S22 Ultra have once again taken ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA! Note o&#39;ldimi? O&#39;zbek tilida tahlil.",
    "Samsung Galaxy S22 Ultra aslida Note nomlansa bo'ladi :) Bizning ijtimoiy tarmoqlarimiz: Instagram: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Unboxing &amp; Quick Review in HINDI ( Indian Retail Unit)",
    "Samsung Galaxy S22 - https://youtu.be/1Kxwkr9yL60 Follow me Facebook- https://www.facebook.com/thenutrigurl Twitter- ..."
  ],
  [
    "vivo X80 Pro vs Samsung S22 ultra vs iPhone 13 pro max - Best camera Phone 2022 !!",
    "Hello!! Today in this video I am sharing my opinion about vivo x80 pro vs iPhone 13 pro max vs Samsung S22 ultra camera."
  ],
  [
    "Samsung galaxy s22 ultra 100X 🌚 moon zoom test #shorts",
    "Samsung galaxy s22 ultra moon zoom test, S22 ultra 100x zoom, moon zoom test S22 ultra,"
  ],
  [
    "Samsung Galaxy S22 Ultra OFFICIAL ONE UI 5.0 Android 13 REVIEW!",
    "Samsung Galaxy S22 Ultra Android 13 One UI 5.0 Review. Full update look at the top best One UI 5.0 features! One UI 5.0 vs One ..."
  ],
  [
    "You&#39;re Using It Wrong... Best Galaxy S22 Ultra S Pen Features!",
    "Save up to $925 on the S22 Ultra!* https://howl.me/citTZOm7Vk9 S22 Ultra Deals on Amazon: https://amzn.to/3CC1mt3 Top 25 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - ZOOM TEST",
    "Samsung Galaxy S22 Ultra 1X to 100X Camera Zoom Test, The Ultra Optical Zoom of Day and Night Epic. the worthy flagship s22 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs. Z Fold 4, Motorola Edge 30 Ultra, Xiaomi 12 Pro - Camera test!",
    "Cine are camera mai buna dintre Samsung Galaxy S22 Ultra, Galaxy Z Fold 4, Motorola Edge 30 Ultra si Xiaomi 12 Pro aflam in ..."
  ],
  [
    "Samsung Galaxy S22 Ultra unboxing First in Malayalam.  Samsung S22 Ultra unboxing.",
    "Samsung Galaxy S22 Ultra Indian Unit unboxing Malayalam Exclusive. Samsung S22 Ultra unboxing Malayalam. Brightest ..."
  ],
  [
    "Samsung S22 Ultra vs S21 / iPhone 13 Pro Max / Pixel 6 Pro / Xiaomi 12 Pro Battery Life Drain Test!",
    "Full battery life drain test of the new Samsung Galaxy S22 Ultra vs Samsung Galaxy S21 Ultra vs iPhone 13 Pro Max vs Google ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing In Pakistan | Samsung Made In Pakistan Flagship Phone",
    "Samsung Galaxy S22 Ultra Unboxing In Pakistan - QHD+ Dynamic AMOLED 2X 120Hz Display - Snapdragon 8 Gen 1 - 108MP ..."
  ],
  [
    "Samsung galaxy s22 ultra zoom test | samsung s22 ultra vs s21 ultra | 100x zoom test |",
    "Samsung galaxy s22 ultra zoom test | samsung s22 ultra vs s21 ultra | 100x zoom test | Buy Here, https://amzn.to/3MCbjLo ..."
  ],
  [
    "Best Samsung Galaxy S22 Ultra Accessories - 2022 Edition",
    "In this video, we're taking a look at the best Samsung Galaxy S22 Ultra accessories - 2022 edition. We have a lot to cover in this ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Camera Test Comparison",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Detailed Camera Comparison #SuperSafStyle ▻▻▻SUBSCRIBE for ..."
  ],
  [
    "Reason to buy Samsung Galaxy S22 ultra Malayalam. Samsung S22 ultra used review Malayalam",
    "Reason to buy Samsung Galaxy S22 ultra. Advantages of galaxy S22 ultra. Why Galaxy S22 Ultra is best. Galaxy S22 Ultra Price ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Exynos vs Snapdragon!",
    "Comparing the (US) Snapdragon 8 Gen 1 & (UK) Exynos 2200 Samsung Galaxy S22 Ultra smartphones - which is faster, lasts ..."
  ],
  [
    "Galaxy S22 Ultra Long Term Review! Hail to the King!?",
    "The Samsung Galaxy S22 Ultra is almost a year old now, and still the best phone of 2022! BUY S22 ULTRA HERE!"
  ],
  [
    "iPhone 14 pro Max vs Vivo X80 Pro vs Samsung S22 Ultra Camera Test |",
    "Jaldi aur videos bhi aayege Thank you Amlli , Rahul , Aditya . My Vlog Channel - @SauravAnurajVlogs My social media link ..."
  ],
  [
    "A Day In The Life with Samsung Galaxy S22 Ultra | From Apple Fan Boy (Battery &amp; Camera Test)",
    "Need a new job? Connect with recruiters at top startups and slide into their DMs ..."
  ],
  [
    "SAMSUNG S22 ULTRA || أهلاً الكنج الجديد",
    "اشترك في قناتي الجديدة DizerX https://www.youtube.com/channel/UC0DcQFiH1KzA63TtozKhk1w لا تنسى الاشتراك ..."
  ],
  [
    "GALAXY S22 ULTRA: 5 PROBLEMS! (5 MONTHS LATER REVIEW!)",
    "Go to my sponsor https://aura.com/chilledfossil to try 14 days for free and protect yourself from America's fastest-growing crime."
  ],
  [
    "GOOD AND BAD! S22 Ultra - 6 Month Review",
    "After using the S22 Ultra for 6 months, I wanted to update you about the good things, the bad things and also a few tips to help you ..."
  ],
  [
    "My Galaxy S22 Ultra 7 Months Later - S23 ULTRA Bie Bie !",
    "Buy here - https://amzn.to/3AaRIxi My Galaxy S22 Ultra 7 Months Later - S23 vs S22 Ultra WAIT ! SUBSCRIBE FOR DAILY TECH ..."
  ],
  [
    "Galaxy S22 Ultra: Top 5 S Pen Features For Daily Use!",
    "Reserve Galaxy Z Fold 4 and get $200 credit: https://howl.me/chG72w6rSpb PREORDER GALAXY S22 ULTRA HERE ($50 ..."
  ],
  [
    "iPhone 14 Pro vs Samsung S22 Ultra - Max Brightness Test 🤯 #shorts",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Maximum Display Brightness Test Subscribe ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Water Test | IP68 Water and Dust Resistant",
    "Water test of Samsung Galaxy S22 Ultra it comes with IP68 Water and Dust Resistant #SamsungGalaxyS22Ultra #GalaxyS22Ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Top 5 Reasons to Buy One Now Late in 2022!",
    "Go to our partner Mint Mobile: https://mintmobile.com/aaronkim to get premium wireless for as low as $15/mo Now through 1/15/23 ..."
  ],
  [
    "iPhone 13 Pro vs Galaxy S22 Ultra: Who Wins the Camera Shootout?",
    "Samsung S22 Ultra VS iPhone 13 Pro - What do you think? Honestly, Samsung holds it down pretty well. Moment Spring Sale ..."
  ],
  [
    "Samsung S22 Ultra 12/256GB Narxlar",
    "samsung #uzbvideo #Redmiuz Assalamu Alekum Hurmatli Mobileshop Uz kanalmiz obunachilar sizlarga ushbu Videoda ..."
  ],
  [
    "Samsung Galaxy S23 Ultra - HERE IT IS",
    "Latest leaks expose the Samsung Galaxy S23 Ultra and it's potentially powerful upgrades. Samsung Galaxy S23 Ultra is about to ..."
  ],
  [
    "THIS PHONE IS 🔥 | Samsung Galaxy S22 Ultra 3 unique features",
    "Here are the unique features that are only available in the Samsung galaxy s22 ultra. ------------------------- Guiding Tech (GT) Social ..."
  ],
  [
    "Samsung S22 Ultra Review After 6 Months | One UI 5.0 | Worth Buying or Wait for S23 Ultra?",
    "In this video, I will do a full detailed review of the Samsung S22 Ultra After using it for more than 6 months, and how it is performing ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Showcase",
    "S22 Ultra ကို သုံးပြီး ၅ ရက်အကြာ... မြန်မာနိုင်ငံမှာ မတ်လ ၄ ..."
  ],
  [
    "ഇതിൽ ആരാണ് രാജാവ് iPhone 14 pro vs Samsung S22 Ultra detailed Camera comparison Malayalam",
    "Samsung galaxy S22 ultra vs iPhone 14Pro Camera comparison Malayalam. This video includes Samsung Super steady vs ..."
  ],
  [
    "10 Ways Galaxy S22 Ultra is Better than iPhone 14 Pro Max",
    "Get Samsung S22 Ultra: https://geni.us/bJrtDQ05cwg-1 Get iPhone 14 Pro Max: https://geni.us/bJrtDQ05cwg-2 I'm a lifelong ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max - Which is the Flagship KING?",
    "Samsung Galaxy S22 Ultra vs Apple iPhone 13 Pro Max Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "GALAXY S22 ULTRA: First 10 Things to Do!",
    "Buy Galaxy S22 Ultra: https://shop-links.co/cgDFffAV5BP The Samsung Galaxy S22 and Galaxy S22 Ultra have once again taken ..."
  ],
  [
    "Galaxy S22 Review: The iPhone of Android!",
    "The Samsung Galaxy S22 has cemented itself as the Android default even more than the Pixel That shirt: http://shop."
  ],
  [
    "100ሺ ብር አዉጥታችሁ እንደማትገዙት አዉቃለሁ ። Galaxy s22 Ultra",
    "habesha #s22ultra #techreview My tiktok - https://vm.tiktok.com/ZMeJB3VfY/ ​ ​Telegram channel where i put all my resources ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - 20 Tips &amp; Features YOU SHOULD BE USING!",
    "Use this link or code \"aaronkim\" to get a 25% discount off your Ekster wallet: https://shop.ekster.com/aaronkim Samsung Galaxy ..."
  ],
  [
    "10 Reasons Galaxy S22 Ultra is BETTER than iPhone 14 Pro Max!",
    "10 Reasons Galaxy S22 Ultra is BETTER than iPhone 14 Pro Max! Hello all and welcome to this video discussion on why ..."
  ],
  [
    "Galaxy S22 Ultra Impressions: It&#39;s a Note!",
    "Samsung's new flagship is here starting at $1200 Galaxy S22 Impressions: https://youtu.be/vax8FCuQUsE MKBHD Merch: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing in ಕನ್ನಡ⚡Best Flagship Smartphone? | Kannada",
    "Samsung Galaxy S22 Ultra Unboxing in ಕನ್ನಡ⚡Best Flagship Smartphone? | Kannada video(ಕನ್ನಡದಲ್ಲಿ) ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Unboxing en español",
    "Link de pre-registro: https://bit.ly/3Bi75TR https://isamarcial.com.mx https://instagram.com/isa_marcial ..."
  ],
  [
    "Is iPhone 14 Pro Max BETTER Than Galaxy S22 Ultra? | Phone of the Year",
    "Is the new iPhone 14 Pro Max better than the Galaxy S22 Ultra? We'll take a look at the hardware, software, performance (and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra + KONKURS | Texnoplov",
    "Bosh homiy: «O'zsanoatqurilishbank” ATB Ipoteka haqida ma'lumot - https://sqb.uz/individuals/credits/ ..."
  ],
  [
    "Samsung Galaxy S22 Ultra December Update - Rock Solid!",
    "s22ultra #galaxys22ultra #samsung Samsung released the 2nd stable BVL1 update for the Exynos 2200 Galaxy S22 Ultra series ..."
  ],
  [
    "Samsung Galaxy S22 vs S22 Plus vs S22 Ultra - Which should you Buy?",
    "Samsung Galaxy S22 vs S22 Plus vs S22 Ultra 5G Hands-On First Look & Impressions ▻BUY Samsung Galaxy S22 Ultra ..."
  ],
  [
    "realme 10 India Launch,Samsung S22 FE Coming,OnePlus 11R Specs,realme GT Neo5 240W Charging-#TTN1427",
    "Hello, Friends Welcome to Tech News No.1427. Today There Are Lots Of Amazing Tech News Lined Up For You. So Let's Get ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Review - 1 Month Later!",
    "Get $200 Samsung Credit towards Samsung's upcoming devices when you reserve here https://shop-links.co/chG7S6FsQbK So ..."
  ],
  [
    "Samsung Galaxy S22 Ultra hands-on &amp; key features",
    "The Galaxy S22 Ultra was just announced today and we got some hands-on time with it. Check out our video to learn ALL YOU ..."
  ],
  [
    "КУПИЛ ТОПОВЫЙ SAMSUNG GALAXY S22 ULTRA!",
    "Обзор смартфона Samsung Galaxy S22 Ultra - отзыв, плюсы и минусы телефона Купить Samsung Galaxy ..."
  ],
  [
    "Samsung Galaxy S23 Ultra - 5G,200MP Camera,Snapdragon 898,16GB RAM/Samsung Galaxy S23 Ultra",
    "Samsung Galaxy S23 Ultra - 5G,200MP Camera,Snapdragon 898,16GB RAM/Samsung Galaxy S23 Ultra Samsung Galaxy Z ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - 72 Hours Later!",
    "Mini Review of the Samsung Galaxy S22 Ultra after using it for a few days! Regardless of whether you call it a Galaxy Note 22 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs S21 Ultra - Should you Upgrade?",
    "Samsung Galaxy S22 Ultra 5G vs Samsung Galaxy S21 Ultra Full Comparison including Display, Hands-on, Size, Design, ..."
  ],
  [
    "S22 Ultra vs S21 Ultra vs Note 20 Ultra - We were Shocked!",
    "We compared EVERYTHING between the Note 20 Ultra, the S21 Ultra AND the S22 Ultra, including the design, performance, ..."
  ],
  [
    "iPhone 14 Pro Max Is the Right Choice for You? or Samsung S22 Ultra?",
    "In this video, we are going to compare the iPhone 14 Pro Max vs the Samsung S22 Ultra. We are going to look at the different ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Water Test | IP68 Water and Dust Resistant",
    "Water test of Samsung Galaxy S22 Ultra it comes with IP68 Water and Dust Resistant #SamsungGalaxyS22Ultra #GalaxyS22Ultra ..."
  ],
  [
    "DLACZEGO wybrałem Galaxy S22 Ultra? Czy jest najlepszy ... i lepszy od iPhone 14 Pro Max?",
    "s22ultra #android13 #samsung #tech #review #oneui5."
  ],
  [
    "Galaxy S22 Ultra | Epic in Green",
    "The epic standard just got more stylish. #GalaxyS22 Ultra now available in an epic green colour. Buy now: http://spr.ly/6053zH4Qc ..."
  ],
  [
    "Galaxy S22 Ultra Unboxing and Fastest Setup Method (Transfer All Data)!",
    "Save up to $925 on the Galaxy S22 Ultra!* https://howl.me/citTZOm7Vk9 Top 25 S22 Ultra Accessories: ..."
  ],
  [
    "Samsung Galaxy Z Fold 4 vs Galaxy S22 Ultra - Which One Is Better?",
    "Buy Fold 4 at LOWEST pricing: https://bit.ly/3A5VlUv (free exclusive instant $200 Samsung Credit + other benefits) $1000 Trade-in ..."
  ],
  [
    "iPhone 14 pro Max vs Vivo X80 Pro vs Samsung S22 Ultra Camera Test |",
    "Jaldi aur videos bhi aayege Thank you Amlli , Rahul , Aditya . My Vlog Channel - @SauravAnurajVlogs My social media link ..."
  ],
  [
    "A Day In The Life with Samsung Galaxy S22 Ultra | From Apple Fan Boy (Battery &amp; Camera Test)",
    "Need a new job? Connect with recruiters at top startups and slide into their DMs ..."
  ],
  [
    "Unboxing | Samsung S22 Ultra, Design, Camera + Smart LED View Cover (Aesthetic)",
    "Hello hello welcome to this video On today's vlog we unboxed the Samsung S22 Ultra in Phantom Black. I shared my first ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra Camera Video Test: Did NOT expect this!",
    "First part of the Apple iPhone 14 Pro Camera Review is the Samsung Galaxy S22 Ultra vs iPhone 14 Pro Max camera test! Before ..."
  ],
  [
    "Samsung S22 Ultra vs Pixel 7 Pro vs iPhone 14 Pro/Max | Detailed Comparison (Malayalam)",
    "Sharing detailed comparison of these three popular phones. Time stamp Build and Design 00:00 Multimeda 01:39 Performance ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - NOT EVEN FAIR.",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra. A full early comparison between iPhone 14 Pro Max vs S22 Ultra including ..."
  ],
  [
    "The Best Smartphone Camera 2022!",
    "It's time to find out once with SCIENCE: What's the best smartphone camera? https://vote.MKBHD.com Thanks to Discord for ..."
  ],
  [
    "Galaxy S22 Ultra - Samsung&#39;s FINALLY doing it.",
    "The Galaxy S22 Ultra is coming soon in 2022 - these are the apparent specs, features, release date, and most importantly...they're ..."
  ],
  [
    "Samsung S22 Ultra 12/256GB Narxlar",
    "samsung #uzbvideo #Redmiuz Assalamu Alekum Hurmatli Mobileshop Uz kanalmiz obunachilar sizlarga ushbu Videoda ..."
  ],
  [
    "Google Pixel 7 Pro vs Samsung S22 Ultra - Max Brightness Test 😳 #shorts",
    "Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra Maximum Display Brightness Test Subscribe ..."
  ],
  [
    "Camera Test - iPhone Vs Samsung Vs GoPro",
    "We do camera test of all flagship phones and gopro at the same time - Who will win in this battle - Samsung s22 ultra vs i phone ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing in ಕನ್ನಡ⚡Best Flagship Smartphone? | Kannada",
    "Samsung Galaxy S22 Ultra Unboxing in ಕನ್ನಡ⚡Best Flagship Smartphone? | Kannada video(ಕನ್ನಡದಲ್ಲಿ) ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 😍 #samsunggalaxy #galaxys22ultra #s22ultra",
    ""
  ],
  [
    "Samsung Price List in Philippines 2022",
    "We updated our Samsung price list 2022 in the Philippines that includes the new models, price-drop / cut and newly released ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Long Term Review - Tons of Photo &amp; Video Examples",
    "A long-term review of the Samsung Galaxy S22 Ultra. Is it still worth it? Samsung Galaxy S22 Ultra: https://jerad.link/galaxys22ultra ..."
  ],
  [
    "Galaxy S22 Ultra vs. S21 Ultra spec comparison",
    "The Galaxy S22 Ultra has landed and if you're following the Galaxy lineup, you might be wondering what's different between it ..."
  ],
  [
    "WHICH IS BETTER!? Galaxy S22 Ultra vs Pixel 7 Pro Review BRUTALLY HONEST",
    "WHICH IS BETTER!? Galaxy S22 Ultra vs Pixel 7 Pro Review, Camera Comparison and more...BRUTALLY HONEST Pixel 7 Pro: ..."
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra - BIGGEST CAMERA COMPARISON !",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra Ka Biggest Comparison Kiya ..."
  ],
  [
    "Samsung Galaxy Unpacked February 2022: Official Replay",
    "It's the epic standard we've all been waiting for. #SamsungUnpacked was LIVE on February 9, 2022. 00:00:00 Galaxy Unpacked ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Vs. Note 20 Ultra Vs. S21 Ultra",
    "S22 Ultra Vs S21 Ultra Vs Note 20 Ultra ▻Full Comparison | Side-By-Side Comparison ▻Please Comment Which Phone is Better ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing In Pakistan | Samsung Made In Pakistan Flagship Phone",
    "Samsung Galaxy S22 Ultra Unboxing In Pakistan - QHD+ Dynamic AMOLED 2X 120Hz Display - Snapdragon 8 Gen 1 - 108MP ..."
  ],
  [
    "Samsung Galaxy S23 Ultra - 5G,200MP Camera,Snapdragon 898,16GB RAM/Samsung Galaxy S23 Ultra",
    "Samsung Galaxy S23 Ultra - 5G,200MP Camera,Snapdragon 898,16GB RAM/Samsung Galaxy S23 Ultra Samsung Galaxy Z ..."
  ],
  [
    "i Tested Samsung Galaxy S22 Ultra Before S23 Ultra Launch...!!",
    "Dosto, here is the reality of world's best camera smartphone in Android, the Samsung Galaxy S22 Ultra. is it a video king? actually ..."
  ],
  [
    "Galaxy S22 Series Official Film: Epic City Nights #withGalaxy | Samsung",
    "Filmed entirely with Galaxy S22 Series. Learn more: http://smsng.co/GalaxyS22 What do you love the most about your city at night ..."
  ],
  [
    "iPhone 13 Pro vs Galaxy S22 Ultra: Who Wins the Camera Shootout?",
    "Samsung S22 Ultra VS iPhone 13 Pro - What do you think? Honestly, Samsung holds it down pretty well. Moment Spring Sale ..."
  ],
  [
    "iPhone 14 Pro Max vs. Samsung Galaxy S22 Ultra Charging Test🔌Subscribe for more 🤙🏼",
    "Full video: https://youtu.be/dTQA9sjIIpA."
  ],
  [
    "iQOO 11 vs Xiaomi 12T Pro vs Samsung S22 Ultra vs Pixel 7 Pro vs iPhone 14 Pro Max Benchmark Test",
    "Snapdragon 8 Gen 2 vs 8+ Gen 1 vs 8 Gen 1 vs Tensor G2 vs A16] I compare the iQOO 11 (SD8Gen2) to the Xiaomi 12T Pro ..."
  ],
  [
    "La MEJOR PANTALLA DEL MUNDO!! Samsung Galaxy S22 Ultra REVIEW",
    "Cómpralo desde aquí: https://amzn.to/3LEF4KQ Encuentra el mejor precio para comprar el Samsung Galaxy S22 Ultra aquí: ..."
  ],
  [
    "Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra - DENT IN THE MATRIX 🔥",
    "Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra. A full early comparison between Galaxy S22 Ultra vs Pixel 7 Pro including ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Note 20 Ultra - Which is the REAL Note?",
    "Try Canva Pro free for 45 days by going to https://canva.me/e/supersaf Samsung Galaxy S22 Ultra 5G vs Samsung Galaxy Note ..."
  ],
  [
    "Samsung S22 Ultra Review - The Phone, The Myth, The Legend 🙂",
    "The legend is here, which has had some minor scandal. But till now this is one of the best android device ever build by Samsung ..."
  ],
  [
    "The Best. - Review Samsung Galaxy S22 ULTRA Indonesia!!!",
    "Mirip Sony = keunggulan. Nikmati Mantapnya Kapal Api Signature Strong Black Coffee Gula Aren disini: ..."
  ],
  [
    "100X killer Zoom Phone😍  - iPhone 13 Pro Max vs Galaxy S22 Ultra Zoom Test",
    "Detailed Comparison: https://youtu.be/j_maGRIAzLE Hey, Guys, This is the Zoom Test between Samsung Galaxy S22 Ultra and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G:Price in Philippines Quick review | Official Look and Design",
    "Samsung Galaxy S22 Ultra 5G:Price in Philippines Quick review | Official Look and Design #GalaxyS22Ultra5GPriceinPhilippines ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs OPPO Find X5 Pro - REVIEW!",
    "I'm testing the Samsung Galaxy S22 Ultra vs OPPO Find X5 Pro to find out which is the best Android flagship phone of 2022!"
  ],
  [
    "The BEST Night Camera! Pixel 7 Pro vs iPhone 14 Pro vs Galaxy S22 Ultra vs Xiaomi 12s Ultra | VERSUS",
    "Head to https://squarespace.com/versus to save 10% off your first purchase of a website or domain using code “versus” Well, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Homescreen Setup Tutorial",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra is the latest and greatest smartphone from any Android maker. A great thing ..."
  ],
  [
    "50 AWESOME Galaxy S22 Ultra Camera Features You MUST Know",
    "The Samsung Galaxy S22 Ultra has an amazing camera, here are 50 camera features plus some tips and tricks you will ..."
  ],
  [
    "Samsung Galaxy S22 Ultra: 1 Year Later Review",
    "Samsung #S22Ultra #Review This is my review on the Samsung Galaxy S22 Ultra Exynos 2200 12GB/256GB version after almost ..."
  ],
  [
    "Redmi 200MP vs Galaxy S22 Ultra 108MP Camera Comparison",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra - Verdictul final (română)",
    "Tot ce trebuie să știi despre noul Samsung Galaxy S22 Ultra ⤵️ S22 Ultra la darwin: ..."
  ],
  [
    "Galaxy S22 Ultra: Expert Review Highlights | Samsung",
    "The reviews are in. Discover why tech experts are calling the new Samsung Galaxy S22 Ultra “the one to beat for the rest of the ..."
  ],
  [
    "Galaxy S22 Ultra Vs Pro Camera - Portrait Mode!",
    "The Samsung Galaxy S22 Ultra was just released and I decided to pick one up because I wanted to test the best portrait mode in a ..."
  ],
  [
    "iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra - BIGGEST CAMERA COMPARISON !",
    "Hello Dosto is video me maine aap logo ko iPhone 14 Pro Max vs Pixel 7 Pro vs Samsung S22 Ultra Ka Biggest Comparison Kiya ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Verdictul final (română)",
    "Tot ce trebuie să știi despre noul Samsung Galaxy S22 Ultra ⤵️ S22 Ultra la darwin: ..."
  ],
  [
    "samsung galaxy s22 ultra camera review &amp; features",
    "OPEN FOR LINKS* ↴ ❏ thanks to samsung for providing me with an early unit to review *all opinions are my own* buy the s22 ..."
  ],
  [
    "10 Reasons To Buy The Galaxy S22 Plus Over The S22 Ultra",
    "The Galaxy S22 Plus is an excellent phone but I've always been a fan of the Ultra line up, especially the Galaxy S22 Ultra."
  ],
  [
    "Samsung Galaxy S22 Ultra is built like a tank! #Shorts",
    "The Samsung Galaxy S22 Ultra has a really sturdy build quality and design! A lot of you guys asked us to test the durability and ..."
  ],
  [
    "🌍World&#39;s Best Android Phone!!!📱Really..? 🤷‍♂️",
    "SamsungS22Ultra #TechBoss #Samsung Samsung S22 Ultra Best Buy Link: https://amzn.to/3cZ6XAM BGM Credits:- ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Review || مراجعة الملك 👑 !!",
    "مراجعة ملك الموبايلات ... السامسونج جالكسي آس ٢٢ الترا ... ومقارنته مع منافسة المباشر ... الآيفون ١٣ برو ماكس Samsung Galaxy S22 ..."
  ],
  [
    "Galaxy S22 Ultra vs iPhone 13 Pro Max - Which Phone Should You Buy?",
    "In this video, we are comparing my custom blue Galaxy S22 Ultra vs iPhone 13 Pro Max Alpine Green and discussing which ..."
  ],
  [
    "Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra - Full Comparison",
    "Buy Pixel 7 Pro here: https://bit.ly/3EFsk5Z (get $200 free best buy gift card) Buy Galaxy S22 Ultra here: https://bit.ly/3SW8XcU ..."
  ],
  [
    "Samsung S22 Ultra Review ចុងម៉ោង S23 Ultra Soon",
    "មុនចេញ samsung S23​​Ultra ឆ្លាតមើល Galaxy S22Ultra ..."
  ],
  [
    "Samsung Galaxy S23 Ultra Vs Samsung Galaxy S22 Ultra | Samsung Galaxy S23 Leaked Specs and Design!",
    "Samsung Galaxy S23 Ultra vs S22 Ultra | Full Comparison | Samsung Galaxy S23 Ultra with 200 MP camera and SD 8Gen2 ..."
  ],
  [
    "¡NO TE EQUIVOQUES! Galaxy S22 Ultra vs iPhone 13 Pro Max",
    "Recuerda usar el código Rhinoshield de 20% \"TOPES22\" : https://bit.ly/TOPES22 ✔️✔️Compra los terminales desde aquí: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Official ONE UI 5.0 Review - TOP 10 FEATURES! (with/ Android 13)",
    "Samsung One UI 5.0 with Android 13 is now officially available on the Samsung Galaxy S22 Ultra. Let's dive in and see the top 10 ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra : le Gros Comparatif !",
    "Lequel choisir ? Galaxy S22 Ultra vs iPhone 13 Pro Max. ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Les protections RhinoShield ..."
  ],
  [
    "iPhone 14 Pro vs. S22 Ultra vs. Pixel 7 Pro: 1,000 photos later",
    "This year even the iPhone 14 Pro has a 48MP camera which is still half as many as the 108MP of the Samsung S22 Ultra but ..."
  ],
  [
    "Galaxy S22 Ultra Burgundy | aesthetic asmr unboxing + Silicone case with Strap 🌸",
    "Hello guys! My friend let me unbox her brand new Samsung Galaxy S22 Ultra in the color Burgundy, with the 512gb storage ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Unboxing in Telugu...",
    "Samsung Galaxy S22 Ultra Unboxing & Overview in Telugu | This Video was made in #collab with Samsung. Galaxy S22 Ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs. Huawei P50 Pro Vs. iPhone 13 Pro Max",
    "S22 Ultra 5G Vs P50 Pro Vs 13 Pro Max | Which is Best ? Side by Side Comparison | Animated Slideshow ▻Subscribe! And Ring ..."
  ],
  [
    "Pixel 7 Pro vs iPhone 14 Pro Max vs Galaxy S22 Ultra Camera Video Test",
    "Here is the Video only test of the Google Pixel 7 Pro vs iPhone 14 Pro Max vs Galaxy S22 Ultra Camera Test Comparison."
  ],
  [
    "Samsung S23 Ultra Vs Samsung S22 Ultra - Real-World Comparison",
    "s23ultra Today we take a real side-by-side look at the S23 Ultra Vs the S22 Ultra and squash some more rumours. If you would ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra 🥵 #shorts",
    "Apple iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Quick Comparison with Camera Samples #Shorts #Samsung #iphone."
  ],
  [
    "0506468741 Samsung S22 Ultra good Condition good working is available",
    "GOD BLESS YOU. Our Store Location link. https://goo.gl/maps/3xKBVxh8f1VSpKcE9 Follow us on Facebook, Tiktok and ..."
  ],
  [
    "Galaxy S22 Ultra vs Galaxy Note20 Ultra #Shorts #S22Ultra #Note20Ultra #GalaxyS22Ultra #teamgalaxy",
    "Galaxy S22 Ultra vs Galaxy Note20 Ultra #Shorts #S22Ultra #Note20Ultra #GalaxyS22Ultra #teamgalaxy . SAVE & SHARE to ..."
  ],
  [
    "iPhone 13 Pro VS Samsung S22 Ultra Drop Test | Durability Test | #iPhone #samsung I #droptest",
    "Download Anurag Aggarwal's App. for FREE https://play.google.com/store/apps/details?id=co.arya.yqadl Website: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Hands On - இதுதான் புது NOTE!!!",
    "Innikku Samsung oda pudhu Galaxy S22 Ultra pathi detaileda paapom! Telegram - https://t.me/c4etech_tamil Discord ..."
  ],
  [
    "Best Samsung S22/S22 Ultra Accessories - 2022",
    "These are the best Samsung S22 Ultra accessories for gaming, productivity, and even photography too! Whether you picked up ..."
  ],
  [
    "Pixel 7 Pro vs Galaxy S22 Ultra vs iPhone 14 Pro Max Camera Test: DIFFERENT!",
    "I know you didn't get the iPhone 14 Pro Max vs S22 Ultra camera comparison on time but I thought I would do a triple camera ..."
  ],
  [
    "$300 Galaxy S22 Ultra Restoration",
    "The galaxy S22 Ultra screen is cracked, and the body with heavy scratches is getting a complete restoration with a new screen ..."
  ],
  [
    "Don&#39;t Buy The S22 Ultra... Wait!",
    "The Samsung Galaxy S22 Ultra is an amazing phone, but the Samsung Galaxy S23 Ultra is about to be here and it will be a better ..."
  ],
  [
    "Galaxy S22 Ultra: Všestranná královna smartphonů | Recenze",
    "Nabíječku VoltPlug Mini 30W si můžete koupit zde⚠️ ..."
  ],
  [
    "Galaxy S22 vs S22+ (vs S22 Ultra) In-Depth Review | Better than the Ultra?",
    "Samsung Galaxy S22 vs S22+ | InsideTech Review. This video will explore everything that's changed from last year's S21 series, ..."
  ],
  [
    "vivo X90 Pro+ Vs. Samsung Galaxy S22 Ultra 5G Vs. iPhone 14 Pro Max",
    "vivo X90 Pro+ Vs S22 Ultra 5G Vs iPhone 14 Pro Max | Full Comparison vivo X90 Pro Plus vs iPhone 14 Pro Max : Which is better ..."
  ],
  [
    "Samsung Galaxy Z Fold 4 vs Galaxy S22 Ultra - Which One Is Better?",
    "Buy Fold 4 at LOWEST pricing: https://bit.ly/3A5VlUv (free exclusive instant $200 Samsung Credit + other benefits) $1000 Trade-in ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA -unboxing- con lo MEJOR y PEOR-",
    "PROBAMOS el Samsung Galaxy S22 ULTRA y te contamos todo lo BUENO y MALO que tiene. ¿Podemos creernos las promesas ..."
  ],
  [
    "Samsung Galaxy S22 Ultra recenzija",
    "Nakon nedelju dana druženja sa @Samsung Galaxy S22 Ultra telefonom, došao je trenutak da sumiramo utiske: da li je \"novi ..."
  ],
  [
    "Galaxy S22 Ultra | Samsung",
    "Low light? No problem. Capture the highlights of your night life with crystal-clear pics and videos no matter the lighting. Pre-order ..."
  ],
  [
    "This Is My New Ultimate Super Smartphone!!!🔥🔥🔥",
    "Namaskaar Dosto, yeh ek bahut hi interesting video hai jaha pe maine aapse baat ki hai mere naye Super Smartphone ke baare ..."
  ],
  [
    "1,00,000 க்கு worth ஆ?? 🔥😲  Vera Level CAMERA",
    "Samaung Galaxy S22 Ultra Full Review with Pros and Cons / with Camera Samples - Best Android Flagship Mobile? - Tamil Tech ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Space Moon Zoom Test | 100X Live Hands On Zoom Test",
    "Samsung Galaxy S22 Ultra Space Moon Zoom Test | 100X Live Hands On Zoom Test Don't Forget to Subscribe My Channel For ..."
  ],
  [
    "I Bought a FAKE S22 ULTRA...... #Shorts",
    "Thank you for watching! Buy My BLUE Mat :https://a.co/d/h3iPG3i Website( Mail-ins & Contact) : https://www.phonerepairguru.com/ ..."
  ],
  [
    "Galaxy S22 Ultra",
    "Galaxy S22 Ultra – welcome to innovation. Buy now and claim a pair of Galaxy Buds Pro and enjoy 12 months of Disney+ ..."
  ],
  [
    "Galaxy S22 Ultra Teardown - Can the S-Pen hole Leak?!",
    "Time to take apart the S22 Ultra! Go to http://www.siriusxm.com/JerryRigOffer to get your first 3 months free to listen on the SXM ..."
  ],
  [
    "How to Insert SIM Card Samsung Galaxy S22 / S22+ / S22 Ultra 5G (No MicroSD)",
    "Samsung Galaxy S22, S22+ & S22 Ultra 5G how to insert a SIM card. MicroSD cards will not work on these phones."
  ],
  [
    "Samsung Galaxy S22 Ultra #shortvideo",
    ""
  ],
  [
    "Samsung S22 Ultra Explained in 3 Minutes | WIRED",
    "Julian Chokkattu, Reviews Editor for WIRED, walks us through a few of the Samsung S22 Ultra's new features. Still haven't ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - CAMERA Comparison!",
    "Which Phone has the Best Camera? IPhone 14 Pro / Pro Max vs Samsung Galaxy S22 Ultra! ▷ Try HUEL Today!"
  ],
  [
    "Samsung Price Update July 2022, Samsung Galaxy S22 Ultra, S21 FE 5G, A73 5G, A53 5G, A33 5G, A13",
    "diskartengpinoytayo #samsung #samsunggalaxya535g #samsunggalaxya735g #samsunggalaxys22ultra ..."
  ],
  [
    "ANDROID JE NAPOKON POPRAVLJEN! Samsung Galaxy S22 Ultra Recenzija",
    "Kupite Windows i Office po najpovoljnijim cijenama na linku - https://bit.ly/3Bw71jD Hardverske nadogradnje su lijepe, ali još ..."
  ],
  [
    "Galaxy S22 Ultra vs iPhone 13 Pro Max - Which Phone Should You Buy?",
    "In this video, we are comparing my custom blue Galaxy S22 Ultra vs iPhone 13 Pro Max Alpine Green and discussing which ..."
  ],
  [
    "Galaxy S22: Astrophotography with Expert RAW | Samsung",
    "Landscape photographer Michael Shainblum (@shainblumphotography) shows how to use the Astrophoto mode feature in the ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs. Huawei P50 Pro Vs. iPhone 13 Pro Max",
    "S22 Ultra 5G Vs P50 Pro Vs 13 Pro Max | Which is Best ? Side by Side Comparison | Animated Slideshow ▻Subscribe! And Ring ..."
  ],
  [
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile",
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile Samsung S22 Utra Spectification OS Android 12, One UI 4.1 Chipset ..."
  ],
  [
    "Samsung Galaxy S22 Ultra PUBG Gaming test | Snapdragon 8 Gen 1, 120Hz Display",
    "Samsung Galaxy S22 Ultra PUBG Gaming test | Snapdragon 8 Gen 1, 120Hz Display Please Subcribe My Channel here: ..."
  ],
  [
    "100X killer Zoom Phone😍  - iPhone 13 Pro Max vs Galaxy S22 Ultra Zoom Test",
    "Detailed Comparison: https://youtu.be/j_maGRIAzLE Hey, Guys, This is the Zoom Test between Samsung Galaxy S22 Ultra and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Samsung Galaxy Note 20 Ultra 5G Vs Samsung Galaxy Note10+ 5G",
    "Samsung Galaxy S22 Ultra Vs. Note20 Ultra Vs. Note10+ | Animated Slideshow ▻Subscribe! And Ring the Bell ✓ To Get More ..."
  ],
  [
    "vivo X90 Pro+ Vs. Samsung Galaxy S22 Ultra 5G Vs. iPhone 14 Pro Max",
    "vivo X90 Pro+ Vs S22 Ultra 5G Vs iPhone 14 Pro Max | Full Comparison vivo X90 Pro Plus vs iPhone 14 Pro Max : Which is better ..."
  ],
  [
    "You&#39;re only using 10%... (Top 30 Unknown Galaxy S22 Ultra Camera Features!)",
    "Save up to $925 on the S22 Ultra!* https://howl.me/citTZOm7Vk9 S22 Ultra Deals on Amazon: https://amzn.to/3CC1mt3 Top 25 ..."
  ],
  [
    "Xiaomi 12T Pro vs Samsung Galaxy S22 Ultra vs Google Pixel 7 Pro Camera Comparison",
    "Amazfit GTR 4 Review: https://bit.ly/AmazfitGTR4Review Apple Watch Alternatives: https://bit.ly/AppleWatchAlternatives iPhone 14 ..."
  ],
  [
    "Samsung S22 Ultra Review Lepas Sebulan ! 🔥 Flagship Yang Diagungkan",
    "Samsung Galaxy S22 Ultra | Samsung Galaxy S22 Guna Samsung Galaxy S22 Ultra dh lama Beli Samsung Galaxy S22 Series ..."
  ],
  [
    "Sony Xperia 1 IV vs iPhone 13 Pro Max vs Galaxy S22 Ultra! Camera Comparison Test! | VERSUS",
    "Sony is back once again, looking to leave a mark with the Xperia 1 IV - with better point-and-click opportunities for casual users."
  ],
  [
    "Samsung S22 Ultra নিয়ে নিলাম 😬 পুরান oneplus দিয়ে Exchange করলাম PhoneX থেকে 👍 আলহামদুলিল্লাহ্",
    "২ বছর পুরানো Oneplus 8 Pro দিয়ে নতুন Samsung S22 Ultra নিয়ে আসলাম PHONEX থেকে ..."
  ],
  [
    "Finally I Bought 😍 - Samsung Galaxy S22 Ultra - ₹109999 | Samsung Galaxy Watch 4 - ₹29999 | Unboxing",
    "Finally I Bought - Samsung Galaxy S22 Ultra - ₹109999 | Samsung Galaxy Watch 4 - ₹29999 | Unboxing ..."
  ],
  [
    "Galaxy S22 Series Official Film: Epic City Nights #withGalaxy | Samsung",
    "Filmed entirely with Galaxy S22 Series. Learn more: http://smsng.co/GalaxyS22 What do you love the most about your city at night ..."
  ],
  [
    "Galaxy S22 Ultra - 7 Essential Apps to Have!",
    "Get these #apps on your #GalaxyS22Ultra and make the most of it! Buy them here: Galaxy S22 : https://geni.us/s22-international ..."
  ],
  [
    "Ngehakimin 22 fitur MAHAL di kamera Samsung Galaxy S22 Ultra",
    "Tentu saja ini penilaian subjektif. Link pembelian S22 Ultra: https://tokopedia.link/VlAABRSujob S22 Plus: ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA -unboxing- con lo MEJOR y PEOR-",
    "PROBAMOS el Samsung Galaxy S22 ULTRA y te contamos todo lo BUENO y MALO que tiene. ¿Podemos creernos las promesas ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Official smart view cases",
    "Check out this video were we will be reviewing the new Official Samsung Galaxy S22 Ultra smart view cases. (00:00) ..."
  ],
  [
    "realme 10 pro Plus Vs Samsung S22 Ultra Speed Test &amp; Camera Comparison",
    "Speed Test of realme 10 pro Plus Vs Samsung S22 Ultra Testing Application List 01-Setting 02-Camera 03-YouTube ..."
  ],
  [
    "Galaxy s22 ultra vs iphone 14Pro Max under water working #shorts #iphone14promax #s22ultra #display",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Samsung Galaxy S21 Ultra 5G Vs Samsung Galaxy S20 Ultra 5G",
    "S20 Ultra Vs S21 Ultra Vs S22 Ultra | Animated Slideshow | Specs Comparison #S22Ultra #S21Ultra #S20Ultra ..."
  ],
  [
    "Samsung Galaxy S23 Ultra Vs Samsung Galaxy S22 Ultra Vs Samsung S21 Ultra Vs Samsung S20 Ultra |2023",
    "Samsung Galaxy S23 Ultra Vs Samsung Galaxy S22 Ultra Vs Samsung S21 Ultra Vs Samsung S20 Ultra |2023 Subscribe For ..."
  ],
  [
    "Sony Xperia 1 IV vs Galaxy S22 Ultra Speed Test, Speakers, Battery &amp; Camera Test!",
    "Sony Xperia 1 IV vs Samsung Galaxy S22 Ultra 5G Speed Test, Speakers, Battery Life & Camera Test! Xperia 1 IV Amazon US ..."
  ],
  [
    "Samsung S23 Ultra Vs Samsung S22 Ultra - Real-World Comparison",
    "s23ultra Today we take a real side-by-side look at the S23 Ultra Vs the S22 Ultra and squash some more rumours. If you would ..."
  ],
  [
    "Galaxy S22 Ultra 6 Bulan Kemudian.. Final Review",
    "Apa rasanya menggunakan samsung galaxy s22 ultra selama 6 bulan belakangan ?? Simak long term review kami, sekaligus ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "I Phone Vs Samsung S22 Ultra 🥵 #shorts #moniezgaming",
    ""
  ],
  [
    "SAMSUNG S22 Ultra vs S20 Ultra | SPEED TEST",
    "S20 Ultra (amazon) https://amzn.to/3sEbiic S22 Ultra (amazon) https://amzn.to/36FJUrf Let's Connect: Facebook.com/techwisely ..."
  ],
  [
    "Samsung S22 Ultra 让我有点醉了... Part1",
    "三星S22Ultra #隐藏问题#想退单了最新！New Model ！#POCOX4Pro 5G 和#POCOM4Pro ！03/03/2022 早鸟价折扣高达RM250 !"
  ],
  [
    "Galaxy S22 Ultra vs Galaxy S22 Plus Camera Test: Skip the ULTRA?",
    "Another addition to the Samsung Galaxy S22 Ultra Camera review playlist. This time the the Galaxy S22 Ultra vs Galaxy S22 Plus ..."
  ],
  [
    "Galaxy S22 vs S22+ (vs S22 Ultra) In-Depth Review | Better than the Ultra?",
    "Samsung Galaxy S22 vs S22+ | InsideTech Review. This video will explore everything that's changed from last year's S21 series, ..."
  ],
  [
    "GALAXY S22 ULTRA // 🔥 6 MESES DEPOIS",
    "Não Pague mais Caro!! Utilize o COMPARADOR ESCOLHASEGURA! - APP ANDROID: http://bit.ly/esappco | PC: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Recenzija",
    "Najbolja ponuda mobitela: https://bit.ly/3GV1O7s Galaxy S22 Ultra koristim nešto više od tjedan dana kroz koje se dokazao ..."
  ],
  [
    "Samsung S22 Ultra Explained in 3 Minutes | WIRED",
    "Julian Chokkattu, Reviews Editor for WIRED, walks us through a few of the Samsung S22 Ultra's new features. Still haven't ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max | ¿Cuál será mejor?",
    "Samsung Galaxy S22 Ultra vs #iPhone 13 Pro Max, review comparativa en español. ¿Cuál será mejor comprar? Ambos son dos ..."
  ],
  [
    "Top 25 MUST HAVE Accessories for Samsung Smartphones! (S22 Ultra, Fold 4, Flip 4)",
    "Here are the Top 25 Best Accessories for the Galaxy S22, S22+, S22 Ultra, Fold 4, and Flip 4! We'll be taking a look at the best ..."
  ],
  [
    "El Galaxy definitivo.",
    "Samsung ▸ Galaxy S22 Ultra → https://www.samsung.com/ar/smartphones/galaxy-s/ ▸ Sorteo ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - UI and Impressions",
    "Take a look at the Samsung Galaxy S22 Ultra with Exynos 2200 and integrated S Pen."
  ],
  [
    "Samsung Galaxy S22 Ultra is built like a tank! #Shorts",
    "The Samsung Galaxy S22 Ultra has a really sturdy build quality and design! A lot of you guys asked us to test the durability and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra in Sri Lanka",
    "Samsung Galaxy S22 Ultra Price in Sri Lanka - විස්තරාත්මක වීඩියෝ ඒක ඉක්මනින් එනවා."
  ],
  [
    "GALAXY S22 PLUS: 5 PROBLEMS! (6 MONTHS LATER REVIEW!)",
    "Today we're reviewing the GALAXY S22 PLUS 6 MONTHS LATER! It's finally time to PART with this gorgeous device after the ..."
  ],
  [
    "Pixel 7 Pro vs iPhone 14 Pro Max vs Galaxy S22 Ultra Camera Video Test",
    "Here is the Video only test of the Google Pixel 7 Pro vs iPhone 14 Pro Max vs Galaxy S22 Ultra Camera Test Comparison."
  ],
  [
    "Galaxy S22 Ultra vs. iPhone 13 Pro Max Speed Test",
    "Speed test between the Samsung Galaxy S22 Ultra and the Apple iPhone 13 Pro Max to see how the performance compares on ..."
  ],
  [
    "Best And Worst Screen Protectors For Samsung Galaxy S22 Ultra",
    "Buy on Amazon 00:00 Intro 1. 1:44 - Whitestone Dome Premium film - https://amzn.to/3BUOvl7 1. 9:08 - Spigen NeoFlex optical ..."
  ],
  [
    "Review SAMSUNG GALAXY S22 ULTRA tras 50 DÍAS | DEBES saber ESTO",
    "Análisis del Samsung Galaxy S22 Ultra versión europea con Exynos 2200 tras más de un mes diario de uso. Te cuento mi ..."
  ],
  [
    "ΠΟΣΟ πιο ΓΡΗΓΟΡΟ είναι? Galaxy S22 Ultra vs Galaxy A53",
    "Το Galaxy S22 Ultra είναι έστω και για λίγο καιρό ακόμα, το καλύτερο συνολικά Smartphone της Samsung. Το Galaxy A53 είναι το ..."
  ],
  [
    "$300 Galaxy S22 Ultra Restoration",
    "The galaxy S22 Ultra screen is cracked, and the body with heavy scratches is getting a complete restoration with a new screen ..."
  ],
  [
    "World&#39;s Fastest Phone😱 - iPhone or Galaxy S22 Ultra | Which one is Faster🏎💨??",
    "Detailed Speed Test: https://youtu.be/M1MkiqPTyjo Hey, Guys, This is the Speed Test Comparison between iPhone 13 Pro Max vs ..."
  ],
  [
    "I Bought a FAKE S22 ULTRA...... #Shorts",
    "Thank you for watching! Buy My BLUE Mat :https://a.co/d/h3iPG3i Website( Mail-ins & Contact) : https://www.phonerepairguru.com/ ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA | TODO LO QUE PUEDE HACER 😱",
    "Checa el Unboxing: https://youtu.be/oi0R7TQ-7I4 Y las diferencias con el S22 y el S22 Plus: https://youtu.be/Iy7qF87gYY4 Aquí te ..."
  ],
  [
    "Galaxy S22 Ultra Review: នៅតែលើស 2 ស្តេចស្មាតហ្វូនប៊ិក !​",
    "អ្នកអាចតាមដានខ្ញុំបន្ថែមលើ​ Tamneak : @johnseytech FB: ..."
  ],
  [
    "How to Insert SIM Card Samsung Galaxy S22 / S22+ / S22 Ultra 5G (No MicroSD)",
    "Samsung Galaxy S22, S22+ & S22 Ultra 5G how to insert a SIM card. MicroSD cards will not work on these phones."
  ],
  [
    "Finally I Bought 😍 - Samsung Galaxy S22 Ultra - ₹109999 | Samsung Galaxy Watch 4 - ₹29999 | Unboxing",
    "Finally I Bought - Samsung Galaxy S22 Ultra - ₹109999 | Samsung Galaxy Watch 4 - ₹29999 | Unboxing ..."
  ],
  [
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile",
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile Samsung S22 Utra Spectification OS Android 12, One UI 4.1 Chipset ..."
  ],
  [
    "Samsung S22 Ultra Explained in 3 Minutes | WIRED",
    "Julian Chokkattu, Reviews Editor for WIRED, walks us through a few of the Samsung S22 Ultra's new features. Still haven't ..."
  ],
  [
    "Galaxy S22 Ultra 6 Bulan Kemudian.. Final Review",
    "Apa rasanya menggunakan samsung galaxy s22 ultra selama 6 bulan belakangan ?? Simak long term review kami, sekaligus ..."
  ],
  [
    "Ngehakimin 22 fitur MAHAL di kamera Samsung Galaxy S22 Ultra",
    "Tentu saja ini penilaian subjektif. Link pembelian S22 Ultra: https://tokopedia.link/VlAABRSujob S22 Plus: ..."
  ],
  [
    "How To Use Samsung Galaxy S22! (Complete Beginners Guide)",
    "Get The Samsung Galaxy S22 Here: https://amzn.to/3LXjAJB Get The Cheapest iPhones Here: https://amzn.to/3JTnWAr Get The ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Speed Test",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra Speed Test including Gaming, camera process test, rendering, apps opening ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Xiaomi 12S Ultra Charging Test 🔌 Subscribe for more 👍🏼",
    "Samsung Galaxy S22 Ultra vs Xiaomi 12S Ultra Charging Test Subscribe for more ⭐Special Offers ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Samsung Galaxy Note 20 Ultra 5G Vs Samsung Galaxy Note10+ 5G",
    "Samsung Galaxy S22 Ultra Vs. Note20 Ultra Vs. Note10+ | Animated Slideshow ▻Subscribe! And Ring the Bell ✓ To Get More ..."
  ],
  [
    "Sony Xperia 1 IV vs Galaxy S22 Ultra Speed Test, Speakers, Battery &amp; Camera Test!",
    "Sony Xperia 1 IV vs Samsung Galaxy S22 Ultra 5G Speed Test, Speakers, Battery Life & Camera Test! Xperia 1 IV Amazon US ..."
  ],
  [
    "Samsung S22 Ultra vs OPPO / OnePlus / iQOO / Xiaomi / Pixel / iPhone Battery Life DRAIN Test!",
    "How does the Snapdragon 8 Gen 1 Galaxy S22 Ultra (5000mAh) stack up against the OPPO Find X5 Pro (5000mAh), OnePlus 10 ..."
  ],
  [
    "Redmi 200MP vs Galaxy S22 Ultra 108MP Camera Comparison",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra - Up to $1000 OFF (Best Time To Buy)",
    "S22 Ultra as low as $200 here: https://bit.ly/3KaHf6V (plus get additional $100 instant credit) Samsung Galaxy S22 Ultra can be ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Raw First Opinions 🤔 - an India Perspective | @TrakinTech",
    "Arun is slightly disappointed with something about the Samsung Galaxy S22 Ultra. And, it is not what you think. Watch the video to ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra - SPEED TEST",
    "iPhone 14 Pro Max (amazon) https://amzn.to/3Bq4isd S22 Ultra (amazon) https://amzn.to/3McLsK6 Let's Connect: ..."
  ],
  [
    "Samsung S22 Ultra 让我有点醉了... Part1",
    "三星S22Ultra #隐藏问题#想退单了最新！New Model ！#POCOX4Pro 5G 和#POCOM4Pro ！03/03/2022 早鸟价折扣高达RM250 !"
  ],
  [
    "The True KING... Galaxy S22 Ultra Unboxing &amp; Impressions! 🔥",
    "Samsung Galaxy S22 Ultra India Unboxing 2022 | This video was made in #collab with Samsung | Galaxy S22 Burgundy ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Samsung Galaxy S21 Ultra 5G Vs Samsung Galaxy S20 Ultra 5G",
    "S20 Ultra Vs S21 Ultra Vs S22 Ultra | Animated Slideshow | Specs Comparison #S22Ultra #S21Ultra #S20Ultra ..."
  ],
  [
    "Что выбрать: iPhone 14 Pro Max против Galaxy S22 Ultra",
    "Сравнение камер iPhone 14 Pro Max и Galaxy S22 Ultra у нас уже вышло https://youtu.be/Ums7xJJNiiM , сегодня сравним ..."
  ],
  [
    "Samsung S22 violet &amp; Galaxy Buds Pro Unboxing 💜 || 256 gb || accessories || (calm &amp; aesthetic) 📦",
    "Hi and welcome to my new video Details about the phone: Samsung Galaxy S22 256gb/8gb in violet (online exclusive) Phone ..."
  ],
  [
    "SAMSUNG S22 Ultra vs 13 Pro Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW S22 Ultra 5G (amazon) https://amzn.to/36FJUrf Let's Connect: ..."
  ],
  [
    "Galaxy S22 Ultra - SAMSUNG IS SORRY.",
    "Samsung Galaxy S22 Ultra GOS Update finally arrives. Samsung responds to the whole situation & apologize. Samsung Trolls ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Review en español",
    "https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ https://facebook.com/isaias.marcial ..."
  ],
  [
    "Samsung Galaxy S22 Plus VS S22 Ultra - NO BS!",
    "samsung #s22plus #s22ultra #GalaxyS22 #GalaxyS22Plus #GalaxyS22Ultra #S22 #drewlipps."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "Galaxy S22 Ultra - TOP 21 Trucos de CÁMARA!",
    "Te compraste un nuevo Galaxy S22 Ultra? En este video te daremos varios trucos y tips para que puedas hacer más con la ..."
  ],
  [
    "REVIEW Samsung Galaxy S22 Ultra: O Galaxy Note em sua melhor forma!",
    "Link de compra confiável: https://bit.ly/3CL4bYA A #Samsung lançou o #GalaxyS22Ultra como o seu novo celular top de linha, ..."
  ],
  [
    "Samsung S22 Ultra Review Lepas Sebulan ! 🔥 Flagship Yang Diagungkan",
    "Samsung Galaxy S22 Ultra | Samsung Galaxy S22 Guna Samsung Galaxy S22 Ultra dh lama Beli Samsung Galaxy S22 Series ..."
  ],
  [
    "Best Samsung Galaxy S22 Ultra Cases! // Mous, Samsung, Otterbox, Latercase",
    "The best Samsung Galaxy S22 Ultra cases! Protective cases, slim, and multifunction cases for the S22 Ultra. Links and minute ..."
  ],
  [
    "Samsung Galaxy S22 Ultra is nice, but these phones are GREAT too!",
    "GalaxyS22Ultra #GalaxyS22. #GalaxyS22Plus Get your Galaxy S22 here: Exclusive https://shop-links.co/cgDcWtewhxS My ..."
  ],
  [
    "Recensione GALAXY S22 ULTRA di SAMSUNG",
    "Sconto esclusivo NordVPN: https://nordvpn.com/andreagaleazzi Provalo senza rischi grazie ai 30 giorni di prova! PREZZO ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Gets Massive Update To Become Perfect",
    "Samsung Galaxy S22 Ultra finally gets a massive update to fix an issue that was a concern for some people. Now, without any ..."
  ],
  [
    "Samsung Galaxy S23 Ultra Vs Samsung Galaxy S22 Ultra Vs Samsung S21 Ultra Vs Samsung S20 Ultra |2023",
    "Samsung Galaxy S23 Ultra Vs Samsung Galaxy S22 Ultra Vs Samsung S21 Ultra Vs Samsung S20 Ultra |2023 Subscribe For ..."
  ],
  [
    "Incoming Call on All Samsung Galaxy S to Galaxy S22 Ultra - Over the Horizon",
    "See and listen to all the incoming call on the Samsung Galaxy S to Galaxy S22 Ultra. Now every year Samsung release the new ..."
  ],
  [
    "iPhone 14 Pro Max vs S22 Ultra | ¡QUE HUMILLACIÓN!",
    "SORTEO iPhone 14 Pro Max o Samsung S22 Ultra (INTERNACIONAL  ) Participa: SUSCRÍBETE y HAZTE MIEMBRO: ..."
  ],
  [
    "جاء وقت الوحش || SAMSUNG S23 ULTRA",
    "اشترك في قناتي الجديدة DizerX https://www.youtube.com/channel/UC0DcQFiH1KzA63TtozKhk1w لا تنسى الاشتراك ..."
  ],
  [
    "1920 DE DPI GALAXY S22 ULTRA",
    "INSTAGRAM ❤: https://www.instagram.com/techcellsmart/?hl=pt-br LINK ONDE COMPRAR   POCO X4 GT  : ..."
  ],
  [
    "GALAXY S22 PLUS: 5 PROBLEMS! (6 MONTHS LATER REVIEW!)",
    "Today we're reviewing the GALAXY S22 PLUS 6 MONTHS LATER! It's finally time to PART with this gorgeous device after the ..."
  ],
  [
    "Ez a Note 22, csak nem az - Samsung Galaxy S22 Ultra",
    "További információ: https://www.samsung.com/hu/smartphones/galaxy-s22-ultra/ ➤Csatlakozz a csatornához!"
  ],
  [
    "GALAXY S22 ULTRA e IPHONE 14 PRO MAX vs EDGE 30 ULTRA e XIAOMI 12S ULTRA | Comparativo de CÂMERAS",
    "O Galaxy S22 Ultra é capaz de derrotar o iPhone 14 Pro Max ou os sensores avançados do Edge 30 Ultra e o Xiaomi 12S Ultra?"
  ],
  [
    "Samsung Galaxy S22 vs S21 FE:  Did Samsung just kill its own phone?",
    "The Galaxy S22 series is here - but so is the S21 FE, which only launched just weeks ago. With only a £70/$100 price gap ..."
  ],
  [
    "Samsung S22 Ultra Pubg Test With FPS Meter, Heating and Battery Test | SD 8 Gen 1 😱",
    "In this video, I will do the Pubg/bgmi test of samsung s22 ultra with fps meter and also check out the heating and battery drain in ..."
  ],
  [
    "realme 10 pro Plus Vs Samsung S22 Ultra Speed Test &amp; Camera Comparison",
    "Speed Test of realme 10 pro Plus Vs Samsung S22 Ultra Testing Application List 01-Setting 02-Camera 03-YouTube ..."
  ],
  [
    "S22 Ultra vs S21 Ultra vs Note 20 Ultra - We were Shocked!",
    "We compared EVERYTHING between the Note 20 Ultra, the S21 Ultra AND the S22 Ultra, including the design, performance, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra UV Tempered Glass | Best Screen Protector | How to apply",
    "SamsungS22UltraUvGlass #WhitestoneDomeGlass https://amzn.to/3CBmDmt https://amzn.to/3CBnbJ0 Track: OBLYVN x RIELL ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Xiaomi 13 Pro Vs iPhone 14 Pro Max",
    "Xiaomi 13 Pro Vs S22 Ultra Vs 14 Pro Max | Full Comparison | Which one is best for you ? ▻Please Comment Which Phone is ..."
  ],
  [
    "Samsung Galaxy S22 Ultra (recenzia)",
    "Najlepšie foťáky, silná batéria, veľký a jemný displej, a k tomu dotykové pero S Pen. Skrátka, to najlepšie na trhu. To však ..."
  ],
  [
    "Samsung S22 violet &amp; Galaxy Buds Pro Unboxing 💜 || 256 gb || accessories || (calm &amp; aesthetic) 📦",
    "Hi and welcome to my new video Details about the phone: Samsung Galaxy S22 256gb/8gb in violet (online exclusive) Phone ..."
  ],
  [
    "How to use Split Screen Multitask on Galaxy S22 or Galaxy S22 Ultra",
    "Video on how to use Split screen multitask on Samsung Galaxy S22 or S22 Ultra. Our Official Website: www.tech2touch.com, ..."
  ],
  [
    "iPhone 14 Pro vs Samsung S22 Ultra 4K @60FPS Zoom Comparison",
    "iPhone 14 Pro Vs Samsung S22 Ultra Video Zoom Comparison #Shorts Shooting in 4K @60FPS on both. Samsung maxes out at ..."
  ],
  [
    "Recensione GALAXY S22 ULTRA di SAMSUNG",
    "Sconto esclusivo NordVPN: https://nordvpn.com/andreagaleazzi Provalo senza rischi grazie ai 30 giorni di prova! PREZZO ..."
  ],
  [
    "Galaxy S22 Ultra 6 Bulan Kemudian.. Final Review",
    "Apa rasanya menggunakan samsung galaxy s22 ultra selama 6 bulan belakangan ?? Simak long term review kami, sekaligus ..."
  ],
  [
    "Samsung S22 Ultra vs OPPO / OnePlus / iQOO / Xiaomi / Pixel / iPhone Battery Life DRAIN Test!",
    "How does the Snapdragon 8 Gen 1 Galaxy S22 Ultra (5000mAh) stack up against the OPPO Find X5 Pro (5000mAh), OnePlus 10 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G Vs Xiaomi 13 Pro Vs iPhone 14 Pro Max",
    "Xiaomi 13 Pro Vs S22 Ultra Vs 14 Pro Max | Full Comparison | Which one is best for you ? ▻Please Comment Which Phone is ..."
  ],
  [
    "اسبوع والالترا طلع على حقيقته !!! Samsung S22 Ultra",
    "هذا الفيديو رأيي بعد استخدام لاسبوع كامل مع جهاز سامسونغ الترا ٢٢ آن شاء الله يعجبكم By: Hussein Al-Jazairi iMAD Tech Channel ..."
  ],
  [
    "Samsung S22 Ultra vs Xiaomi 12T Pro Speed Test",
    "Samsung S22 Ultra vs Xiaomi 12T Pro Speed Test #shorts Both rendering a 1-minute 4K at 60FPS video on VN app. Snapdragon ..."
  ],
  [
    "مراجعة Galaxy S22 Ultra : أفضل هاتف أندرويد لعام 2022 ؟",
    "مراجعة Galaxy S22 Ultra مميزات و عيوب جالكسي S22 ألترا واستعراض أهم الايجابيات والسلبيات في جالكسي اس ٢٢ ألترا بعد الإستخدام ..."
  ],
  [
    "SAMSUNG S22 Ultra vs 13 Pro Max | SPEED TEST",
    "13 Pro Max (amazon) https://amzn.to/3o8jchW S22 Ultra 5G (amazon) https://amzn.to/36FJUrf Let's Connect: ..."
  ],
  [
    "s22 ultra zoom | s22 ultra | samsung galaxy s22 ultra | samsung s22 ultra | #shorts",
    "s22 ultra zoom | s22 ultra | samsung galaxy s22 ultra | samsung s22 ultra | #shorts s22 ultra moon zoom."
  ],
  [
    "Best Samsung Galaxy S22 Ultra Cases! // Mous, Samsung, Otterbox, Latercase",
    "The best Samsung Galaxy S22 Ultra cases! Protective cases, slim, and multifunction cases for the S22 Ultra. Links and minute ..."
  ],
  [
    "1920 DE DPI GALAXY S22 ULTRA",
    "INSTAGRAM ❤: https://www.instagram.com/techcellsmart/?hl=pt-br LINK ONDE COMPRAR   POCO X4 GT  : ..."
  ],
  [
    "Samsung Galaxy S22 Ultra UV Tempered Glass | Best Screen Protector | How to apply",
    "SamsungS22UltraUvGlass #WhitestoneDomeGlass https://amzn.to/3CBmDmt https://amzn.to/3CBnbJ0 Track: OBLYVN x RIELL ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra - Total DOMINATION",
    "iPhone 14 Pro Max will be made official today and the Samsung Galaxy S22 Ultra will be a direct competitor to Apple's latest ..."
  ],
  [
    "iPhone 13 Pro vs galaxy s22 ultra zoom test 😳 #iphone13pro #s22ultra #zoomtest",
    ""
  ],
  [
    "Samsung Galaxy S23 Ultra Vs Samsung Note 22 Ultra Vs Samsung S22 Ultra Vs Samsung S21 Ultra | Leak&#39;s",
    "Samsung Galaxy S23 Ultra Vs Samsung Note 22 Ultra Vs Samsung S22 Ultra Vs Samsung S21 Ultra | Leak's Subscribe Now ..."
  ],
  [
    "Cuanto tarda en cargar el Galaxy S22 Ultra con 45w!? 🔥😏",
    ""
  ],
  [
    "Samsung S22 Ultra Pubg Test With FPS Meter, Heating and Battery Test | SD 8 Gen 1 😱",
    "In this video, I will do the Pubg/bgmi test of samsung s22 ultra with fps meter and also check out the heating and battery drain in ..."
  ],
  [
    "UNBOXING SAMSUNG GALAXY S22 ULTRA 512GB",
    ""
  ],
  [
    "ПОЛГОДА с Galaxy S22 Ultra: ЛЮБОВЬ, СМЕРТЬ и КАМЕРА",
    "Подавайте заявку в онлайн-магистратуру \"Инженерия машинного обучения\": https://go.skillfactory.ru/e9ju0w Наши видео в ..."
  ],
  [
    "Galaxy S22 Ultra White Silicone Case #shorts",
    ""
  ],
  [
    "100X Zoom Test Westin Tower Samsung S22 ULTRA #shorts",
    "Testing the new 100X zoom of the S22 ultra. The S22 ultra Zoom (100x) is fantastic."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra HOT WATER TEST! 💥💧",
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra hot water torture durability test! This video was also filmed using an iPhone 14 ..."
  ],
  [
    "SAMSUNG S22 Ultra vs S20 Ultra | SPEED TEST",
    "S20 Ultra (amazon) https://amzn.to/3sEbiic S22 Ultra (amazon) https://amzn.to/36FJUrf Let's Connect: Facebook.com/techwisely ..."
  ],
  [
    "Что выбрать: iPhone 14 Pro Max против Galaxy S22 Ultra",
    "Сравнение камер iPhone 14 Pro Max и Galaxy S22 Ultra у нас уже вышло https://youtu.be/Ums7xJJNiiM , сегодня сравним ..."
  ],
  [
    "Xiaomi 12T Pro Vs iPhone 14 Pro Vs Galaxy S22 Ultra Camera Comparison",
    "Xiaomi 12T Pro Vs iPhone 14 Pro Max Vs Galaxy S22 Ultra Camera Comparison. Does 200MP make a big difference? Which is ..."
  ],
  [
    "Dojmy z dlouhodobého používání Samsung Galaxy S22 Ultra! (JAK NA TO # 1667)",
    "Je Samsung Galaxy S22 Ultra zcela dokonalý? Petr a Matouš se sešli, aby probrali svoje mnohaměsíční zkušenosti s vlajkovou ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - THIS IS INSANE",
    "So the Galaxy S22 lineup is one of the first phones to feature the new Snapdragon 8 Gen 1 processor. This chipset has been ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra: Spec Comparison",
    "The brand-new flagship iPhone 14 Pro Max is here. Check out the two phones here  : iPhone 14 Pro Max: ..."
  ],
  [
    "realme 10 pro Plus Vs Samsung S22 Ultra Speed Test &amp; Camera Comparison",
    "Speed Test of realme 10 pro Plus Vs Samsung S22 Ultra Testing Application List 01-Setting 02-Camera 03-YouTube ..."
  ],
  [
    "مقارنة iPhone 14 Pro Max و Samsung Galaxy S22 Ultra - افضل موبايل فى العالم 2022",
    "00:00 المقدمة 00:25 طريقة التقييم 01:00 التصميم 02:30 الشاشة 04:45 الاداء 05:50 البطارية 06:50 سرعات الشحن 08:25 السوفتوير ..."
  ],
  [
    "Ez a Note 22, csak nem az - Samsung Galaxy S22 Ultra",
    "További információ: https://www.samsung.com/hu/smartphones/galaxy-s22-ultra/ ➤Csatlakozz a csatornához!"
  ],
  [
    "O S22 ultra é útil até bloqueado! 🤣",
    "Recomendações ⬇️ ✓ IPHONES iPhone 11: https://amzn.to/3Bis3E6 iPhone 13: https://amzn.to/3OrFxjL iPhone 13 Pro: ..."
  ],
  [
    "Вот почему Samsung Galaxy S22 круче Ultra. Неделю спустя все изменилось",
    "Сделать предзаказ новых Galaxy S22 Ultra, S22, S22+, Tab S8, до 10 марта 2022 можно по ссылке - https://bit.ly/3uFatH3 При ..."
  ],
  [
    "Samsung Galaxy S23 Ultra vs Galaxy S22 Ultra",
    "Samsung Galaxy S23 Ultra vs Samsung Galaxy S22 Ultra Subscribe for more content (IT'S FREE) INSTAGRAM ..."
  ],
  [
    "El Galaxy definitivo.",
    "Samsung ▸ Galaxy S22 Ultra → https://www.samsung.com/ar/smartphones/galaxy-s/ ▸ Sorteo ..."
  ],
  [
    "Extreme Camera Test | Samsung S22 Ultra VS iPhone 13 Pro Max !",
    "Timestamp 00:00 Intro 00:27 - Iphone 13 Pro Max VS Samsung S22 Ultra 01:20 - Pemanasan 01:42 - Zoom 03:21 - Potrait ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - BREAKING RECORDS",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra is already up for pre-order and Samsung says the smartphone is already ..."
  ],
  [
    "iPhone 13 ProMax vs Samsung S22 Ultra Outgoing Calls to the Same Number: WhatsApp, Telegram, Viber",
    "Apple iPhone 13 Pro Max vs Samsung Galaxy S22 Ultra outgoing call to the same phone number at the same time via WhatsApp, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Yes, About Time!",
    "Samsung Galaxy S22 lineup will feature crazy fast charging technology. It's likely the Galaxy S22 Ultra could be the only phone in ..."
  ],
  [
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile",
    "Samsung Galaxy S22 Ultra test game Free Fire Mobile Samsung S22 Utra Spectification OS Android 12, One UI 4.1 Chipset ..."
  ],
  [
    "Samsung Galaxy S22 Ultra 5G vs Samsung Galaxy S23 Ultra 5G || first look || price || release date ||",
    "samsunggalaxys23ultra #samsunggalaxys22ultra #samsung #snapdragon8gen2 Samsung Galaxy S22 Ultra 5G vs Samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Infinix ZERO Ultra | 9 Pro Tech | #mobilephonecomparisons #techvideos",
    "INSTAGRAM ********** Follow Me On Insta: Technos.24 ********** HASHTAGS ********** #s22ultra #galaxys22ultra ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Review en español",
    "https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ https://facebook.com/isaias.marcial ..."
  ],
  [
    "Вся правда о Galaxy S22 Ultra. Как так, Samsung?",
    "Спасибо за просмотр. А вы как думаете? Пишите в комментариях! Приложение Wylsacom для Apple ..."
  ],
  [
    "เต็มข้อ รีวิว iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra เลือกยังไงดี!?",
    "เต็มข้อ รีวิว iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra เลือกยังไงดี!? ช่องใหม่ ที่นี่เลยจ้า ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Samsung Galaxy S7",
    "Buy S22 Ultra, https://amzn.to/36A0w4h."
  ],
  [
    "¡Esto es MUY DURO! iPhone 14 Pro Max vs Galaxy S22 Ultra",
    "Cómpralos desde aquí: iPhone: https://bit.ly/3DoIlwb Galaxy: https://amzn.to/3dUQmid Descubre nuestra web Compra ..."
  ],
  [
    "Simplement le meilleur smartphone - Samsung Galaxy S22 Ultra",
    "Le Galaxy S22 Ultra est le nouveau fleuron de Samsung. Véritable condensé de technologie, il apporte quelque chose en plus ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA, mi EXPERIENCIA. [2 mes de USO] ✅ Casi PERFECTO",
    "De VERDAD merece la pena el S22 ULTRA? Si estás estás buscando un teléfono MUY TOP y que tenga absolutamente de todo, ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Raw First Opinions 🤔 - an India Perspective | @TrakinTech",
    "Arun is slightly disappointed with something about the Samsung Galaxy S22 Ultra. And, it is not what you think. Watch the video to ..."
  ],
  [
    "Samsung Galaxy S22 Ultra, S22+,S22 early look from Unbox Therapy",
    "Samsung Galaxy s22 ultra, s22 plus, s22 early look. this video was removed from unbox therapy they don't want you to see it for ..."
  ],
  [
    "МОЙ ОТЗЫВ О SAMSUNG GALAXY S22 ULTRA - ПЛЮСЫ И МИНУСЫ",
    "Впечатления от флагманского Samsung Galaxy S22 Ultra, что понравилось а что нет Купить Poco M5-https://alii.pub/6ickl1 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | عيوب قاتلة فى افضل موبايل فى العالم !!",
    "مراجعة مطولة بعد 100 يوم من استعمال Samsung Galaxy S22 Ultra !! هل التجربة اختلفت بعد اكتر من 3 شهور من تاريخ الشراء ؟"
  ],
  [
    "Samsung Galaxy S22 Ultra - YES, IT&#39;S ALL HERE",
    "Samsung Galaxy S22 Ultra has been fully revealed in our very first official render galore. Samsung will offer the Galaxy S22 Ultra ..."
  ],
  [
    "How to Turn On/Off Autorotation on Samsung Galaxy S22 Ultra - Manage Screen Auto Rotate",
    "Gain more details: https://www.hardreset.info/devices/samsung/samsung-galaxy-s22-ultra-5g/ We're going to explain the steps so ..."
  ],
  [
    "Galaxy S22 Ultra Review: 1 Month Later!",
    "The Galaxy S22 Ultra is one of the best flagship phones of 2022, 1 Month later the Galaxy S22 Ultra has a wide range of things ..."
  ],
  [
    "TUDO o que querias ESTÁ AQUI, e sem RIVAL | Samsung Galaxy S22 Ultra, Galaxy S22+ &amp; S22 [UNBOXING]",
    "Os smartphones mais esperados da Samsung de 2022! A nova linha Galaxy S22 da marca coreana. Hoje é um unboxing com o ..."
  ],
  [
    "SAMSUNG S23 ULTRA VS S22 ULTRA ¿REVOLUCIÓN?",
    "Samsung Galaxy S23 Ultra vs Samsung Galaxy S22 Ultra ¿Comprar ahora o esperar al nuevo? Merece la pena comprar el ..."
  ],
  [
    "The True KING... Galaxy S22 Ultra Unboxing &amp; Impressions! 🔥",
    "Samsung Galaxy S22 Ultra India Unboxing 2022 | This video was made in #collab with Samsung | Galaxy S22 Burgundy ..."
  ],
  [
    "Tecno Phantom X2 Pro Vs Samsung Galaxy S22 Ultra",
    "Tecno Phantom X2 Pro Vs Samsung Galaxy S22 Ultra Specification Comparison ✓ For Business inquiry ..."
  ],
  [
    "Samsung S22 Ultra 😍😍 Green Colour ⚡Unboxing 📱 | பச்சை நிறமே💚 பச்சை நிறமே💚",
    "Samsung S22 Ultra இப்படி ஒரு கலர்லயா? #GalaxyS22 Ultra #Samsung #S22UltraGreen @samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra waterproof 💧 #shorts",
    "Samsung Galaxy S22 Ultra First Look | Epic S-Pen Magic!!!       #shorts mein 6.8\" WQHD+ Infinity-O Dynamic AMOLED 2x ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - This Is NUTS",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra has been revealed by Samsung and it's already the top contender to be the ..."
  ],
  [
    "SAMSUNG GALAXY S22 ULTRA ANÁLISIS - POR ESTO NO TE LO RECOMIENDO",
    "Suscríbete a nuestro canal https://bit.ly/3iFHitH ¡El Samsung Galaxy S22 Ultra es uno de los teléfonos del año!"
  ],
  [
    "Samsung Galaxy S22 Ultra vs Mi 11 Ultra Speed Test and Camera Comparison",
    "Galaxy S22 Ultra comes with 108MP OIS 12MP Ultrawide Super Steady video and 10MP OIS Periscope telephoto 10x optical ..."
  ],
  [
    "Вот почему Samsung Galaxy S22 круче Ultra. Неделю спустя все изменилось",
    "Сделать предзаказ новых Galaxy S22 Ultra, S22, S22+, Tab S8, до 10 марта 2022 можно по ссылке - https://bit.ly/3uFatH3 При ..."
  ],
  [
    "Samsung S22 Ultra Unboxing",
    "Samsung Galaxy S22 Ultra 5G 'Phantom Black' Unboxing #Shorts The S22 Ultra is the most powerful of the S22 series line up ..."
  ],
  [
    "How to Set Up Alarm Clock on SAMSUNG Galaxy S22 Ultra | Edit &amp; Turn On / Off Alarms",
    "SAMSUNG Galaxy S22 Ultra Tutorials: https://www.hardreset.info/devices/samsung/samsung-galaxy-s22-ultra-5g/ Find the way to ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - GOOD NEWS",
    "Samsung Galaxy S22 Ultra will have a low radius of curvature and it doesn't mean what you actually think. I have explained that in ..."
  ],
  [
    "Speedtest Xiaomi 13 Pro vs Galaxy S22 Ultra: CÓ PHẢI NÂNG CẤP LỚN?",
    "Tham khảo Galaxy S22 Ultra: https://hoanghamobile.com/dien-thoai-di-dong/samsung-galaxy-s22-Ultra-12gb-512gb-chinh-hang ..."
  ],
  [
    "Samsung Galaxy S22 Ultra unboxing",
    ""
  ],
  [
    "HARGA GALAXY S22 ULTRA TERJUN BEBAS!!! MAKIN WORTH IT!? REVIEW SAMSUNG GALAXY S22 ULTRA (AFTER HYPE)",
    "LINK PEMBELIAN TERMURAH : https://tokopedia.link/4WG1nVMuItb LINK PEMBELIAN ALTERNATIF: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra -  IT WAS TRUE",
    "Samsung Galaxy S22 Ultra has been revealed in first hands-on images that show the handset in all of its glory. We also have ..."
  ],
  [
    "SAMSUNG GALAXY S22+ Review: THE SWEET SPOT!",
    "Follow me here! Instagram: https://www.instagram.com/marybautistayt/ Facebook Page: http://www.facebook.com/marybautistayt/ ..."
  ],
  [
    "Samsung Galaxy S22 ultra Vs Câmera Profissional ( Zoom Test )",
    "TUDO QUE MOSTRO NESSE E OUTROS - AQUI   https://fans.link/geekloko e Aqui https://t.me/magazinegeek Melhor ..."
  ],
  [
    "iPhone 14 Pro MAX vs 100X Super Zoom Samsung S22 Ultra Zoom Test",
    "100X Super Zoom - iPhone 14 Pro Max vs Samsung S22 Ultra Zoom Test iPhone 14 Pro MAX Review ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Whitestone Dome Premium Film Screen Protector",
    "GalaxyS22Ultra #SkyBlue #Samsung Get your Galaxy S22 here: Exclusive https://shop-links.co/cgDcWtewhxS My Current Gear ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - TRUCOS, FUNCIONES SECRETAS &amp; AVANZADAS!!",
    "El Samsung Galaxy S22 Ultra es el teléfono más aclamado del año de los teléfonos Android y hoy conoceremos las funciones ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - The Evolution",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra is the latest flagship smartphone from Samsung that offers the best of both ..."
  ],
  [
    "Samsung s22 ultra 📱 Outdoor Photoshoot 😱 #shorts #samsungs22ultra",
    ""
  ],
  [
    "Обзор Samsung Galaxy S22 Ultra - главный Android флагман!",
    "Samsung Galaxy S22 Ultra эот новый Galaxy Note. Просто и скромно лучший Android флагман на сегодня. Хочешь ..."
  ],
  [
    "samsung s22 ultra #shorts",
    "samsung s22 ultra #shorts #samsung #s22ultra Offer link: INDIA: https://amzn.to/3xNWWOk USA: https://amzn.to/3xP3iwH."
  ],
  [
    "Samsung Galaxy S22 Ultra #shortvideo",
    ""
  ],
  [
    "SAMSUNG S22 Ultra vs Note 10+ | SPEED TEST",
    "Note 10+ (amazon) https://amzn.to/3s3xGzV S22 Ultra (amazon) https://amzn.to/36FJUrf Let's Connect: Facebook.com/techwisely ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro vs Xiaomi 12S Ultra Camera Test Comparison",
    "Camera Test comparison between the iPhone 14 Pro Max, Samsung Galaxy S22 Ultra, Google Pixel 7 Pro and Xiaomi 12S Ultra ..."
  ],
  [
    "iPhone 13 Pro Max vs Samsung S22 Ultra Video Zoom Comparison - 4K @30FPS",
    "iPhone 13 Pro Max Vs Samsung S22 Ultra 4K @30FPS Video Zoom Comparison using default settings #Shorts If you think they ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - This Is A RELIEF",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra will be launched in about a week at an Unpacked event along with the ..."
  ],
  [
    "Android Auto &quot;CoolWalk&quot; No Need Register Tester With Samsung S22 Ultra Android 13",
    "Android Auto \"CoolWalk\" No Need Register Tester With Samsung S22 Ultra Android 13 - Hello everyone, in today's video I would ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - THE SUPER CLEAR",
    "Introducing the new Super Clear Lens for the new Samsung Galaxy S22 Ultra Note 5G 2022. According to the latest news and ..."
  ],
  [
    "FANTASTIC Samsung Update For Galaxy S22 Ultra, Z Fold 4, etc",
    "This video is brought to you by our partner Mint Mobile: https://mintmobile.com/springer Sign up for Mint's premium wireless plans ..."
  ],
  [
    "How to apply a Samsung Galaxy S22 Ultra skin | XtremeSkins",
    "Thank you for purchasing one of our Samsung Galaxy S22 Ultra, we've created this video to help with applying your new S22 ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Absolutely DESTROYING The Competition!",
    "Samsung Galaxy S22 Ultra will feature Qualcomm's latest Snapdragon 8 Gen 1 chipset and according to the latest benchmarks, ..."
  ],
  [
    "Vivo x90 Pro Plus Vs Samsung Galaxy s22 Ultra Camera Test | Zoom &amp; Cinematic Video &amp; Super moon Test",
    "hii guys vivo x90 pro plus vs Samsung galaxy s22 ultra camera test kiya he samsung s22 ultra vs vivo x90 pro + camera zoom test ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra - BIGGEST Comparison #shorts",
    "iphone14promax #Samsungs22ultra #comparison We Will Bring More Video Like This SUBSCRIBE TO OUR CHANNEL For More ..."
  ],
  [
    "GALAXY S22 ULTRA - Insane Power!",
    "The Galaxy S22 Ultra is packing incredible power and already smashing records! #GalaxyS22ULTRA #SamsungS22Ultra ..."
  ],
  [
    "Galaxy S22 Ultra - This Is Epic!",
    "The Galaxy S22 Ultra design has been revealed along with more key specs and its epic! #GalaxyS22Ultra #SamsungS22Ultra ..."
  ],
  [
    "Test Galaxy S22 Ultra - 1 mois après toujours au top ?",
    "Voici mon retour d'expérience, test, du Samsung Galaxy S22 Ultra. Mon Instagram : https://www.instagram.com/jbaptisten/ ..."
  ],
  [
    "Samsung S22 violet &amp; Galaxy Buds Pro Unboxing 💜 || 256 gb || accessories || (calm &amp; aesthetic) 📦",
    "Hi and welcome to my new video Details about the phone: Samsung Galaxy S22 256gb/8gb in violet (online exclusive) Phone ..."
  ],
  [
    "Vivo x90 Pro Plus Vs Samsung Galaxy s22 Ultra Camera Test | Zoom &amp; Cinematic Video &amp; Super moon Test",
    "hii guys vivo x90 pro plus vs Samsung galaxy s22 ultra camera test kiya he samsung s22 ultra vs vivo x90 pro + camera zoom test ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs Mi 11 Ultra Speed Test and Camera Comparison",
    "Galaxy S22 Ultra comes with 108MP OIS 12MP Ultrawide Super Steady video and 10MP OIS Periscope telephoto 10x optical ..."
  ],
  [
    "⚠️ *ATTENTION* ✅ BEST Time to Buy SAMSUNG Phones 😍",
    "SamsungBigHolidaySale #Techboss Best Buy Link: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Finally, AWESOME",
    "According to the latest news leaks report, the most futuristic Samsung Galaxy S22 Ultra coming with both Qualcomm Snapdragon ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Una REVIEW con buena NOTA",
    "Desde que Samsung dejó de lanzar sus modelos Note, la idea de que el Galaxy fuera algo más que un teléfono y se convirtiera ..."
  ],
  [
    "Amazing...🥳! It&#39;s a lot of New Samsung Galaxy S22 Ultra / S22 Ultra Plus in the Rubbish near city",
    "Amazing...  ! It's a lot of New Samsung Galaxy S22 Ultra / S22 Ultra Plus in the Rubbish near city #iphone13 #restoration 1."
  ],
  [
    "Samsung S22, S22+ &amp; S22 Ultra Specification &amp; Price | Samsung S22 Series Specifications | S22 Series",
    "This video is about Samsung S22 series. In Samsung Unpack 3 phones got launched. Samsung S22, Samsung S22+ and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra | Każdy orze, jak może | RECENZJA",
    "Pomoc Ukrainie : https://pck.pl/na-pomoc-ukrainie/ https://www.siepomaga.pl/ukraina https://pomagam.pl/solidarnizukraina ..."
  ],
  [
    "Обзор Samsung Galaxy S22 Ultra - главный Android флагман!",
    "Samsung Galaxy S22 Ultra эот новый Galaxy Note. Просто и скромно лучший Android флагман на сегодня. Хочешь ..."
  ],
  [
    "SAMSUNG A13 : Unboxing &amp; Review (Looks like Samsung S22 Ultra?)",
    "Hello, Techies :) Check nyo na ang bagong unboxing ko na Samsung Galaxy A Series.. Ang Samsung A13 sobrang ganda ng ..."
  ],
  [
    "SAMSUNG S22 ULTRA দাম শুনে অবাক😱samsung s22 ultra price in bangladesh|samsung s22 ultra bangla",
    "SAMSUNG S22 ULTRA দাম শুনে অবাক  samsung s22 ultra price in bangladesh|samsung s22 ultra bangla review ..."
  ],
  [
    "وصلني أقوى هاتف من سامسونج | الكل ينتظره 😱 Samsung Galaxy S22 Ultra",
    "Samsung Galaxy S22 Ultra Review and First Impressions. جربت أقوى هواتف من سامسونج لسنة 2022 [Du 9 février au 11 mars ..."
  ],
  [
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro: Cameras",
    "Samsung Galaxy S22 Ultra vs iPhone 13 Pro é a \"luta\" de smartphones de 2022! Qual achas que sai vencedor na fotografia e ..."
  ],
  [
    "Apple iPhone 14 Pro Max vs. Samsung Galaxy S22 Ultra (Deutsch) | SwagTab",
    "Wer holt sich den Smartphone-Thron? Apple oder Samsung? In diesem Video seht ihr einen ausführlichen Vergleich zwischen ..."
  ],
  [
    "Unboxing Galaxy S22 Ultra! #SHORTS",
    "Super quick unboxing of the Samsung Galaxy S22 Ultra! Stay tuned for more videos."
  ],
  [
    "Samsung Galaxy S22 Ultra, S22+,S22 early look from Unbox Therapy",
    "Samsung Galaxy s22 ultra, s22 plus, s22 early look. this video was removed from unbox therapy they don't want you to see it for ..."
  ],
  [
    "SAMSUNG S22 Ultra vs Note 10+ | SPEED TEST",
    "Note 10+ (amazon) https://amzn.to/3s3xGzV S22 Ultra (amazon) https://amzn.to/36FJUrf Let's Connect: Facebook.com/techwisely ..."
  ],
  [
    "รีวิวจัดเต็ม ตอบทุกข้อสงสัย กับ Samsung Galaxy S22 Ultra l Ceemeagain",
    "รีวิว Samsung Galaxy S22 Ultra แบบจัดเต็ม หลังจากทดลองใช้งานจริงมาแล้ว! ตอบทุกข้อสงสัยจากคลิปพรีวิวที่ทุกคนถามเข้ามา ."
  ],
  [
    "iPhone 14 Pro Max vs Samsung S22 Ultra vs Pixel 7 Pro vs Xiaomi 12S Ultra Camera Test Comparison",
    "Camera Test comparison between the iPhone 14 Pro Max, Samsung Galaxy S22 Ultra, Google Pixel 7 Pro and Xiaomi 12S Ultra ..."
  ],
  [
    "How to apply a Samsung Galaxy S22 Ultra skin | XtremeSkins",
    "Thank you for purchasing one of our Samsung Galaxy S22 Ultra, we've created this video to help with applying your new S22 ..."
  ],
  [
    "Samsung Galaxy S23 Ultra - OFFICIAL LOOK",
    "Samsung Galaxy S23 Ultra official marketing material has been revealed which shows the handset in all of its glory. And not just ..."
  ],
  [
    "HARGA GALAXY S22 ULTRA TERJUN BEBAS!!! MAKIN WORTH IT!? REVIEW SAMSUNG GALAXY S22 ULTRA (AFTER HYPE)",
    "LINK PEMBELIAN TERMURAH : https://tokopedia.link/4WG1nVMuItb LINK PEMBELIAN ALTERNATIF: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Finally, IT&#39;s BEAUTIFUL",
    "Finally, it's so beautiful. The green color is the new black of the new Samsung Galaxy S22 Ultra Note 5G 2022. ▻Get Samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Here&#39;s Some Good News",
    "Samsung Galaxy S22 Ultra will be one of the most powerful handsets around when it officially launches in a month. With great ..."
  ],
  [
    "[spin9] รีวิว Samsung Galaxy S22 Ultra — เรือธงที่ลงตัว",
    "รีวิวใหม่วันนี้ พบกับ Samsung Galaxy S22 Ultra เรือธงต้อนรับต้นปี 2022 จากทางซัมซุง ที่เป็นการผสานอย่างลงตัวระหว่าง S Series และ Note ..."
  ],
  [
    "Android Auto &quot;CoolWalk&quot; No Need Register Tester With Samsung S22 Ultra Android 13",
    "Android Auto \"CoolWalk\" No Need Register Tester With Samsung S22 Ultra Android 13 - Hello everyone, in today's video I would ..."
  ],
  [
    "Fotos en 3D con Galaxy S22 Ultra y Thami",
    "Con la tecnología de Galaxy S22 Ultra, haz fotos con efectos 3D. Sigue todos los consejos de Thami y haz que tu contenido salte ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - 108MP, Night Mode Video | CAMERA BEAST!",
    "Samsung Galaxy S22 Ultra - 108MP, Night Mode Video | CAMERA BEAST! Samsung Galaxy 22 Ultra official teaser from ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy S22 Ultra : le gros comparatif !",
    "Lequel choisir ? Galaxy S22 Ultra vs iPhone 14 Pro Max. ▻ Abonne-toi | http://bit.ly/jojol67 ✓ ▻ Acheter les protections ..."
  ],
  [
    "ใส่เดี่ยวได้เลย รีวิว Samsung Galaxy S22 Ultra กล้องคือแบบไปคนละโลกมือถือแล้ว",
    "ใส่เดี่ยวได้เลย รีวิว Samsung Galaxy S22 Ultra กล้องคือแบบไปคนละโลกมือถือแล้ว ช่องใหม่ ที่นี่เลยจ้า ..."
  ],
  [
    "SAMSUNG GALAXY S22+ Review: THE SWEET SPOT!",
    "Follow me here! Instagram: https://www.instagram.com/marybautistayt/ Facebook Page: http://www.facebook.com/marybautistayt/ ..."
  ],
  [
    "SAMSUNG GALAXY S22 ULTRA NON FATEVI PRENDERE PER IL CUL*",
    "Regalati per natale NordVPN: https://nordvpn.com/gesualdolomonaco Sicuramente è lo smartphone più completo del 2022 ma è ..."
  ],
  [
    "iPhone 14 Pro Max vs Samsung Galaxy S22 Ultra! Care e mai bun?",
    "Care telefon e mai bun dintre iPhone 14 Pro Max si Samsung Galaxy S22 Ultra? Acceseaza WebWave: https://bit.ly/3Bd8600 ..."
  ],
  [
    "Samsung Note 20 Ultra vs Galaxy S22 Ultra | ¿Hay tanta diferencia?",
    "Samsung Galaxy S22 Ultra vs Galaxy Note 20 ultra, review comparativa en español. ¿Estás pensando en cambiar tu teléfono ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - THIS CHANGES EVERYTHING...",
    "Samsung Hack, GOS OFF Galaxy S22 Ultra Exynos vs Snapdragon, Samsung to take big decisions & more! Samsung Galaxy S22 ..."
  ],
  [
    "Cuanto tarda en cargar el Galaxy S22 Ultra con 45w!? 🔥😏",
    ""
  ],
  [
    "Review Completa Samsung S22 Ultra con Android 13 y ONE UI 5.0",
    "s22ultra #samsung - Puedes comprarlo aquí: https://www.cosladafon.com/ - Mi link de afiliados de Amazon por si queréis ..."
  ],
  [
    "FANTASTIC Samsung Update For Galaxy S22 Ultra, Z Fold 4, etc",
    "This video is brought to you by our partner Mint Mobile: https://mintmobile.com/springer Sign up for Mint's premium wireless plans ..."
  ],
  [
    "This phone has next level features | Samsung Galaxy S22 Ultra | Best Android Smartphone.",
    "In this video we are unboxing Samsung Galaxy S22 Ultra and exploring its features. Samsung Galaxy S22ultra ..."
  ],
  [
    "Galaxy S22 ULTRA sau NOTE 22 ULTRA? - Prim Contact!",
    "GALAXYS22ULTRA #NOTE22ULTRA #GALAXYS22 Hai pe Canalul Nostru de Telegram: https://t.me/s/buhnici Stochează-ți ..."
  ],
  [
    "Samsung Galaxy S22 ULTRA - iPhone-ът на АНДРОИДИТЕ!",
    "Най-накрая мога да ви представя ревюто ми на Samsung Galaxy S22 Ultra. Дали този телефон надминава очаканията или ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Camera Test 😲🔥#shorts",
    "shorts."
  ],
  [
    "LIVE: Samsung Galaxy S22 Ultra LIVE DEMO",
    "This is a live demo of Samsung Galaxy S22 Ultra with Ameer Dagha of ReviewsPK. ~ https://instagram.com/ameer.dagha​ ..."
  ],
  [
    "SAMSUNG Galaxy S22 Ultra | ТОП-фишки, особенности, трюки функции SAMSUNG Galaxy S22 Ultra",
    "Хотите узнать о вашем SAMSUNG Galaxy S22 Ultra больше информации? Переходите на наш сайт: ..."
  ],
  [
    "Samsung S22 Ultra jest NIESAMOWITY?",
    "Sprawdź Samsung S22 Ultra w Plusie na abonament ▻ https://www.plus.pl/galaxy-s22 Telefon, zegarek i słuchawki - czy warto?"
  ],
  [
    "Samsung A33 vs A52s vs A53 vs A73, M52, M53, S20 FE 5G, S21 FE 5G, S22, S22 Ultra Battery Drain Test",
    "Hey guys in this video I will do the biggest Samsung battery drain test between Samsung a33 vs Samsung a52s 5g vs Samsung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra REVIEW! Are o PROBLEMA!",
    "Samsung Galaxy S22 Ultra are o PROBLEMA pe care o veti afla in acest REVIEW! Samsung Galaxy S22 Ultra eMAG: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - The Evolution",
    "Samsung Galaxy S22 Ultra aka Galaxy Note 22 Ultra is the latest flagship smartphone from Samsung that offers the best of both ..."
  ],
  [
    "Pixel 7 Pro против Galaxy S22 Ultra - ДАЖЕ НЕ НАДЕЙСЯ",
    "Таймкоды: 0:00 Вступление 0:26 Фишки Pixel 7 Pro и Galaxy S22 Ultra 01:57 Дизайн, кто удобнее? 03:37 Экраны 04:43 ..."
  ],
  [
    "ใส่เดี่ยวได้เลย รีวิว Samsung Galaxy S22 Ultra กล้องคือแบบไปคนละโลกมือถือแล้ว",
    "ใส่เดี่ยวได้เลย รีวิว Samsung Galaxy S22 Ultra กล้องคือแบบไปคนละโลกมือถือแล้ว ช่องใหม่ ที่นี่เลยจ้า ..."
  ],
  [
    "Samsung Note 20 Ultra vs Galaxy S22 Ultra | ¿Hay tanta diferencia?",
    "Samsung Galaxy S22 Ultra vs Galaxy Note 20 ultra, review comparativa en español. ¿Estás pensando en cambiar tu teléfono ..."
  ],
  [
    "HARGA GALAXY S22 ULTRA TERJUN BEBAS!!! MAKIN WORTH IT!? REVIEW SAMSUNG GALAXY S22 ULTRA (AFTER HYPE)",
    "LINK PEMBELIAN TERMURAH : https://tokopedia.link/4WG1nVMuItb LINK PEMBELIAN ALTERNATIF: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - I&#39;VE GOT BAD NEWS",
    "Use this exclusive link to get $250 instant credit: https://bit.ly/35UQ9qN (when ordering the S22 series, everyone else is getting ..."
  ],
  [
    "Galaxy S22 Ultra ⎪ 8 mois PLUS TARD, la vérité sur le MEILLEUR des Samsung !",
    "J'ai passé plusieurs mois avec le Samsung Galaxy S22 Ultra pour vous raconter mon expérience au quotidien avec ce ..."
  ],
  [
    "Плюсы и минусы Samsung Galaxy S22 Ultra. Подробный обзор",
    "Ваша поддержка позволит продолжить выпускать обзоры: Tinkoff - https://www.tinkoff.ru/sl/1nsbODYJgau Подписка Boosty ..."
  ],
  [
    "can you spot the Samsung s22 ultra under water",
    "All of my videos are created by me primarily using the editing programs wondershare filmora, vn editor and adobe after effects."
  ],
  [
    "ഇതാണ് S22 Ultra",
    ""
  ],
  [
    "Samsung Galaxy S22 Ultra REVIEW! Are o PROBLEMA!",
    "Samsung Galaxy S22 Ultra are o PROBLEMA pe care o veti afla in acest REVIEW! Samsung Galaxy S22 Ultra eMAG: ..."
  ],
  [
    "ESTE ES EL SAMSUNG GALAXY S23!!!!!!! Son unos ‘sinvergüenzas’…",
    "Duras Pruebas del Galaxy S22 Ultra → https://youtu.be/gdmTinzC8DY . Baterías que se hinchan de los Samsung ..."
  ],
  [
    "FANTASTIC Samsung Update For Galaxy S22 Ultra, Z Fold 4, etc",
    "This video is brought to you by our partner Mint Mobile: https://mintmobile.com/springer Sign up for Mint's premium wireless plans ..."
  ],
  [
    "Nhìn lại Galaxy S22 Ultra: Chiếc Galaxy S đỉnh nhất Samsung từng tạo ra !!",
    "Nhìn lại Galaxy S22 Ultra: Chiếc Galaxy S đỉnh nhất Samsung từng tạo ra !! Chiếc Galaxy S này cũng đang có giá cực tốt tại ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Final Design!",
    "Samsung Galaxy S22 Ultra - Final Design! Enjoy Watching...!! Make Sure To Share This Video With Your Friends...IT'S FREE!"
  ],
  [
    "SAMSUNG Galaxy S22 Ultra | ТОП-фишки, особенности, трюки функции SAMSUNG Galaxy S22 Ultra",
    "Хотите узнать о вашем SAMSUNG Galaxy S22 Ultra больше информации? Переходите на наш сайт: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - New RECORD!",
    "Making new record the new Samsung Galaxy S22 Ultra Note 5G 2022. Release date confirmed of Samsung Galaxy S21 FE and ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - EXYNOS 2200 IS TERRIBLE?",
    "Samsung Galaxy S22 Ultra - EXYNOS 2200 IS TERRIBLE? Samsung Galaxy 22 Ultra vs S21 Ultra Samsung Exynos 2200 vs ..."
  ],
  [
    "GALAXY S22 ULTRA - Insane Power!",
    "The Galaxy S22 Ultra is packing incredible power and already smashing records! #GalaxyS22ULTRA #SamsungS22Ultra ..."
  ],
  [
    "Galaxy S22 ULTRA sau NOTE 22 ULTRA? - Prim Contact!",
    "GALAXYS22ULTRA #NOTE22ULTRA #GALAXYS22 Hai pe Canalul Nostru de Telegram: https://t.me/s/buhnici Stochează-ți ..."
  ],
  [
    "Galaxy S22 Ultra - Samsung is Going All Out",
    "Samsung is going all out with the Galaxy S22 Ultra, not only they're joining hands with AMD for Exynos 2200, but also they're ..."
  ],
  [
    "Androidien ykkönen - Samsung Galaxy S22 Ultra arvostelu",
    "Samsung Galaxy S22 Ultra on tällä hetkellä parasta mitä Android-puolella on tarjottavana. Katsotaan tällä videolla minkälainen ..."
  ],
  [
    "Samsung Galaxy S22 Vs S22 Ultra Zoom Test | 30X Vs 100X Zoom Test",
    "Hi Guys, in this video we have compared the 100x space zoom of Samsung Galaxy S22 Ultra with 30x space zoom of Galaxy S22."
  ],
  [
    "SAMSUNG S22 ULTRA দাম শুনে অবাক😱samsung s22 ultra price in bangladesh|samsung s22 ultra bangla",
    "SAMSUNG S22 ULTRA দাম শুনে অবাক  samsung s22 ultra price in bangladesh|samsung s22 ultra bangla review ..."
  ],
  [
    "Samsung Galaxy S22 Ultra Mejores TIPS y TRUCOS",
    "Ya tienes tu Galaxy S22 Ultra o estás por comprarlo? Aquí te comparto algunos de los tips y trucos que utilizo a diario. Muchos de ..."
  ],
  [
    "Apple iPhone 14 Pro vs. Samsung Galaxy S22 Ultra - Welches Smartphone kaufen?",
    "Wir vergleichen: Apple vs. Samsung - das iPhone 14 Pro tritt gegen das Galaxy S22 Ultra an. Beide Flaggschiffe kämpfen erbittert ..."
  ],
  [
    "Samsung S22, S22+ &amp; S22 Ultra Specification &amp; Price | Samsung S22 Series Specifications | S22 Series",
    "This video is about Samsung S22 series. In Samsung Unpack 3 phones got launched. Samsung S22, Samsung S22+ and ..."
  ],
  [
    "Samsung Galaxy S22, S22 Plus i S22 Ultra - pierwsze wrażenia",
    "Po długich miesiącach zapowiedzi czas na konkrety. Samsung Galaxy S22, Galaxy S22+ i galaxy S22 Ultra właśnie miały swoją ..."
  ],
  [
    "Đánh giá chi tiết Galaxy S22 Ultra sau 1 tháng: KHEN CHÊ RÕ RÀNG",
    "Dương Dê - Đánh giá các sản phẩm điện thoại và đồ công nghệ Galaxy S22 Ultra ..."
  ],
  [
    "LIVE: Samsung Galaxy S22 Ultra LIVE DEMO",
    "This is a live demo of Samsung Galaxy S22 Ultra with Ameer Dagha of ReviewsPK. ~ https://instagram.com/ameer.dagha​ ..."
  ],
  [
    "iPhone 14 Pro vs Pixel 7 Pro vs Galaxy S22 Ultra: Camera Test Comparison!",
    "A detailed camera comparison test of the iPhone 14 Pro vs Google Pixel 7 Pro vs Samsung Galaxy S22 Ultra! Let's compare photo ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - This Got Officially WEIRD!",
    "Samsung Galaxy S22 Ultra is the most anticipated handset of recent times. Samsung is merging the Galaxy Note and S series into ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - World&#39;s Most SuperPower",
    "The upcoming futuristic Samsung Galaxy S22 Ultra Note 5G 2022 will receive the world's most powerful Corning Gorilla Glass ..."
  ],
  [
    "SAMSUNG GALAXY S22+ Review: THE SWEET SPOT!",
    "Follow me here! Instagram: https://www.instagram.com/marybautistayt/ Facebook Page: http://www.facebook.com/marybautistayt/ ..."
  ],
  [
    "SAMSUNG GALAXY S22 YA LO TENEMOS AQUÍ!!!!!!! ¿Cuál elegir?",
    "Unboxing del Samsung Galaxy S22 + y del Galaxy S22 Ultra ¿Cúal es mejor? • SUSCRÍBETE GRATIS aquí → http://bit.ly/1jnUItt ..."
  ],
  [
    "iPhone 13 Pro Max vs Galaxy S22 Ultra | La Batalla",
    "https://isamarcial.com.mx https://instagram.com/isa_marcial https://twitter.com/isa_marcial/ https://facebook.com/isaias.marcial ..."
  ],
  [
    "ความรู้สึกหลังใช้ S22 Ultra มา 2 เดือนเต็มๆ",
    "IG ส่วนตัว : tump_witthawat https://www.instagram.com/tump_witthawat . แฟนเพจ FB : Tump Yung ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - REAL FIRST &quot;Live&quot;",
    "Here is the real first live look of the most futuristic Samsung Galaxy S22 Ultra 5G 2022 the alternative of Note 22 Ultra. You've ..."
  ],
  [
    "Aturan dibuat untuk dilanggar - Kesan pertama Samsung Galaxy S22 Series!",
    "Snapdragon 8 Gen 1 pertama. Pre Order di Indonesia akan dibuka tanggal 10 Februari hingga 3 Maret 2022 di ..."
  ],
  [
    "SAMSUNG GALAXY S22 ULTRA recensione il RE adesso è maturo",
    "Acquista Galaxy S22 Ultra 5G https://amzn.to/3Yf661K Le migliori Offerte Tech su Telegram https://bit.ly/30nsJmV​​ Offerte Smart ..."
  ],
  [
    "Samsung Galaxy S22 Ultra - Finally, it CONFIRMED!",
    "So finally confirmed new detailed camera features of the Samsung Galaxy S22 Ultra 5G 2022 flagship smartphone."
  ],
  [
    "Плюнул на Xiaomi и iPhone и Взял Смартфон на Snapdragon 8 GEN 1! 🔥Камерофон SAMSUNG GALAXY S22 ULTRA",
    "Плюнул на Xiaomi и iPhone и Взял Смартфон на Snapdragon 8 GEN 1! Камерофон SAMSUNG GALAXY S22 ULTRA ..."
  ],
  [
    "Samsung A33 vs A52s vs A53 vs A73, M52, M53, S20 FE 5G, S21 FE 5G, S22, S22 Ultra Battery Drain Test",
    "Hey guys in this video I will do the biggest Samsung battery drain test between Samsung a33 vs Samsung a52s 5g vs Samsung ..."
  ],
  [
    "Galaxy S22 Ultra White to Green #shorts",
    "S22 Ultra White transformation to Green."
  ],
  [
    "Bu telefondan uzak dur! Samsung Galaxy S22 Ultra",
    "Bu videoda sizlere neden, Samsung Galaxy S22 Ultra'yı almamanız gerektiğini anlatıyorum! Lütfen düşüncelerinizi yorumlarda ..."
  ],
  [
    "Что выбрать? Samsung Galaxy S22 Ultra или iPhone 13 Pro Max? Что по ценам?",
    "А что же выбрать? Свежее яблоко или новый Самсунг? Айос или Андроид? Стилус или Палец?"
  ],
  [
    "iPhone 14 Pro Max против Galaxy S22 Ultra: КАМЕРЫ",
    "Лучшие аксессуары для iPhone с 10% скидкой по промокоду LUCHKOV: https://ilounge.ua/onelounge Все модели iPhone тут: ..."
  ],
  [
    "Samsung Galaxy S22 Ultra-ს ვიდეო განხილვა: S და Note სერიის იდეალური შერწყმა!",
    "გაიგე ახალი ამბავი? Galaxy S და Note სერია ერთ სმარტფონში გაერთიანდა!"
  ],
  [
    "تجربتي المطولة للجالاكسي S22 الترا والـ S22 بلس ! Samsung Galaxy S22 Ultra &amp; S22+",
    "في هذا الفيديو اشارككم تجربتي المطولة لهواتف الجالاكسي S22 الترا والبلس بعد استخدام قرابة الـ 3 اشهر... مشاهدة ممتعة إذا كان الوصف ..."
  ],
  [
    "iPhone 14 Pro Max vs Galaxy s22 ULTRA!! LOS MEJORES del 2022 🚀",
    "Comparativa del iPhone 14 Pro Max vs Galaxy S22 Ultra!! Apple vs Samsung, iPhone vs Galaxy y iOS vs Android. Los mejores ..."
  ],
  [
    "Samsung Galaxy S22 ultra Vs Câmera Profissional ( Zoom Test )",
    "TUDO QUE MOSTRO NESSE E OUTROS - AQUI   https://fans.link/geekloko e Aqui https://t.me/magazinegeek Melhor ..."
  ],
  [
    "Samsung Galaxy S23 - Catching Up To Ultra",
    "Samsung Galaxy S23 will match the Samsung Galaxy S23 Ultra in a key display aspect. And unlike the S23 Ultra the Galaxy S23 ..."
  ]
]